{
    "deliberation_results": {
        "CampaignConsultingUsGubernatorialCampaignStrategy": {
            "time_to_resolution": "Approximately 3 weeks (until July 1, 2025).",
            "perspective_relevance": "As a campaign consultant specializing in US gubernatorial races, I have a strong sense of the timing, signaling, and strategic calculations that high-profile potential candidates weigh before entering a race. My expertise is especially relevant for understanding the practical campaign-building steps and media strategies used by wealthy, non-traditional entrants like John Morgan, as well as the signal value of pre-announcement activities. This context allows me to parse whether public noise represents real intent or effective delay tactics.",
            "status_quo": "To date, John Morgan has not announced his candidacy for Florida governor. He continues to speak publicly about considering a run and is in the process of forming a new, centrist third party, but has repeatedly stated he is waiting to see how other candidates fare and has signaled uncertainty about actually entering the race.",
            "perspective_derived_factors": [
                {
                    "factor": "Very little time left until the July 1, 2025 deadline",
                    "effect": "Strongly decreases probability; major campaigns require significant setup, and even a late-stage, surprise entrant like Morgan would need to begin before the deadline to have meaningful impact. No media reports suggest imminent activity."
                },
                {
                    "factor": "Clear intention to launch a new party, not simply run as an independent or major-party candidate",
                    "effect": "Decreases probability; party creation is a complex process and, as all recent reporting notes, is Morgan’s current focus. This logistical work is distinct from formally announcing a run, and Morgan’s language is more consistent with party-birth than candidate launch."
                },
                {
                    "factor": "Public ambiguity, 'wait and see' approach, and history of flirtation without follow-through",
                    "effect": "Decreases probability; Morgan has a pattern of floating his name, using it as leverage for advocacy, and then bowing out once fields solidify. Multiple statements note he wants to see who else enters before making a decision."
                },
                {
                    "factor": "The field is crystallizing: David Jolly and Jason Pizzo have entered prominently, and major media are focused on them instead",
                    "effect": "Further decreases probability; Jolly, a high-profile and nationally-known ex-congressman, has declared as a Democrat and is being treated as the primary major ‘outsider’ or third-party threat by political observers. Media coverage treats Morgan as a prospective, unlikely wild card, not as an imminent candidate."
                },
                {
                    "factor": "Morgan's public messaging is about the idea of a middle path, not an actual campaign announcement",
                    "effect": "Decreases probability; almost universal in coverage, Morgan is spending money on consultants to form the new party, is seeking names for it, and pitching the concept broadly. No imminent campaign infrastructure, fundraising, or rhetoric about entering the governor’s race. Moreover, one outlet (SunSentinel) quoted him as stating he will NOT run for governor in 2026."
                },
                {
                    "factor": "Personal brand and business interests may be better served by influence than actual candidacy",
                    "effect": "Decreases probability; Morgan is a skilled campaigner for causes, but direct candidacy—even if self-funded—would bring sharp scrutiny and business risk with minimal potential upside given Florida’s partisan lean. This calculation may underlie much of the continued waffling."
                }
            ],
            "no_scenario": "John Morgan continues to float the idea of running but does not make a formal announcement before July 1, 2025. He spends the next month focused on building out his third-party infrastructure, perhaps launching the new party and raising its profile, but delays or ultimately decides not to enter the governor’s race directly. All coverage after July 1 continues to talk about the possibility of a future run, or about his role as a kingmaker or influencer in Florida politics.",
            "yes_scenario": "Against expectations, Morgan makes a rapid, headline-grabbing announcement before July 1, 2025 – possibly in response to a dramatic shift, such as a major stumble or scandal by another candidate, or a surge in demand from the nascent third-party coalition he is building. He launches an unconventional, short sprint campaign and leverages his wealth and notoriety to gather necessary ballot access and campaign structures rapidly.",
            "final_reasoning": "The news and observable campaign environment point heavily toward a NO outcome. Morgan remains publicly undecided, the process of launching a new third party is still just beginning, and there are no visible signs of a campaign-in-waiting (e.g., campaign staff, foundational donor moves, or pre-announcement tour). The clearest statements in coverage emphasize his uncertainty and a ‘wait and see’ posture, with some outlets even quoting him as having ruled out a run. With the deadline less than a month away, it is difficult to envision a scenario where Morgan dramatically shifts course, especially given his stream of 'flirtations' in previous cycles. The base rate for this sort of late-campaign entry, especially from wealthy non-incumbents, is extremely low. Given current signals, the probability that John Morgan will announce as a candidate for Florida governor before July 1, 2025 is exceedingly slim.",
            "final_probability": 5
        },
        "PoliticalJournalismElectionCycleReportingStandards": {
            "time_to_resolution": "Approximately 24 days (June 6 to June 30, 2025).",
            "perspective_relevance": "As an expert in Political Journalism and Election Cycle Reporting Standards, my knowledge of reporting best practices, candidacy definitions, Florida's political landscape, and newsworthiness criteria allows me to accurately assess whether a clear, public announcement by John Morgan constitutes a genuine and recognized candidacy. I am also able to contextualize media speculation, weigh the significance of statements and party filings, and apply historical patterns of last-minute candidate entries, especially as they pertain to wealthy or outsider figures.",
            "status_quo": "John Morgan has not announced his candidacy for Florida governor as of June 6, 2025. He is focused on launching a new party but has explicitly not yet declared himself a candidate for governor.",
            "perspective_derived_factors": [
                {
                    "factor": "Repeated media reports of Morgan's hesitation and conditionality",
                    "effect": "Decreases probability. Multiple major outlets quote Morgan as explicitly undecided and taking a wait-and-see approach, emphasizing he wants to observe the candidate field before making his own decision."
                },
                {
                    "factor": "Explicit statements of starting a new party, but not announcing a candidacy",
                    "effect": "Decreases probability. Numerous sources confirm Morgan is currently invested in forming a new party and has said he is not yet running for governor, while some even suggest he has stated he will not run. Filing paperwork for a party is distinct from declaring a gubernatorial run."
                },
                {
                    "factor": "Recent and high-profile entry of Democratic front-runner (David Jolly) and emergence of other candidates",
                    "effect": "Decreases probability. Jolly's official entry as the leading Democratic candidate, the presence of an independent (Pizzo), and a robust Republican field create high competition and make a last-minute Morgan candidacy less likely, given his stated desire to see the field crystallize."
                },
                {
                    "factor": "Morgan's historical pattern of political flirtation without follow-through",
                    "effect": "Decreases probability. Previous cycles have seen Morgan hint at runs, only to pull back (e.g., 2018, 2022 cycles), often after forming ballot campaigns or movements."
                },
                {
                    "factor": "Base rate of last-month third-party or independent candidate announcements in Florida gubernatorial history",
                    "effect": "Decreases probability. Late entrant third-party bids—particularly from high-profile individuals—are rare in recent Florida political history, especially after major party contenders have already jumped in. Most nominations and candidacies are announced well ahead of time to build infrastructure."
                },
                {
                    "factor": "Morgan's resources, name ID, and ability to mount a rapid campaign",
                    "effect": "Marginally increases probability. As a billionaire with extensive campaign experience, Morgan could theoretically announce and self-fund a campaign quickly and gain attention, but this is offset by strategic disadvantages and stated reluctance."
                },
                {
                    "factor": "Media ambiguity and the technicality of what constitutes an 'announcement'",
                    "effect": "Ambiguous effect but overall decreases probability. Despite media speculation, all reporting consistently indicates that Morgan has not made such a declaration, and news organizations are unlikely to conflate starting a party or musing about a run with a formal candidacy announcement under standard reporting practices."
                }
            ],
            "no_scenario": "Morgan continues focusing on building his new party, recruiting candidates, and criticizing the two-party system. As more major-party and independent candidates officially declare their campaigns and attract media attention, Morgan maintains his role as a power broker or influencer without personally declaring for governor. He may tease a run or leave the door open, but does not make a public, unequivocal candidacy announcement before July 1, 2025.",
            "yes_scenario": "Within the next three weeks, Morgan evaluates the candidate field and determines that there is a clear political opening for a centrist party. He publicly declares, via press conference or a widely reported statement, that he is running for governor as the candidate of his new party. Morgan immediately files paperwork, launches a campaign website, and becomes the face of the nascent party. The media widely reports this as an official candidacy declaration before July 1, 2025.",
            "final_reasoning": "Reviewing the news coverage, John Morgan is highly visible and vocal about dissatisfaction with Florida's political choices, and is moving to launch a new political party. However, both in his explicit statements and in the press reporting, he has not made any formal announcement of a gubernatorial run. He references a desire to 'wait and see' how the field shapes up and mentions the possibility of supporting or recruiting other candidates for his new party. The current, detailed focus on party-building (not candidacy-building), coupled with the fresh entry of David Jolly as Democratic front-runner, surface reporting that Morgan has 'not ruled out' but is not running, and the lack of precedent for late high-profile third-party entries strongly suggest he is unlikely to announce a run before the end of June. While his wealth and media profile give him theoretical capacity for a rapid campaign launch, nothing in his behavior or reporting indicates a move toward official candidacy within the next three weeks. Based on base rates for last-minute Florida entries, the substance of recent journalism, and Morgan's own on-the-record comments, the probability of an affirmative, public announcement before July 1 is low—though not quite zero, given his personal unpredictability and resources. I assign a final probability of 7%.",
            "final_probability": 7
        },
        "PoliticalScienceRationalChoiceTheory": {
            "time_to_resolution": "Approximately 25 days (forecast date is June 6, 2025; question closes July 1, 2025)",
            "perspective_relevance": "Political Science—Rational Choice Theory provides a framework for understanding candidate decision-making as a function of strategic calculation, utility maximization, and the alignment of incentives. From this perspective, the probability of John Morgan announcing a gubernatorial candidacy depends on his perceived expected utility given the evolving field, party dynamics, and optimal timing. I focus on Morgan's cost-benefit assessment, strategic waiting, and signaling to various voter blocs.",
            "status_quo": "John Morgan has NOT announced his candidacy for Florida governor as of June 6, 2025. He is openly considering running, forming a new party, and is a prominent political actor in the state, but remains in a holding pattern pending further developments in the candidate field.",
            "perspective_derived_factors": [
                {
                    "factor": "Opportunity Structure and Timing",
                    "effect": "Decreases probability. With David Jolly (a high-profile Democrat) officially declared and at least one independent (Jason Pizzo) emerging, Morgan’s strategic calculations likely lead him to wait and see. He openly states he is watching how the field develops before committing, and several sources report his reticence to declare before this is clear."
                },
                {
                    "factor": "Third-Party Viability and Organizational Challenges",
                    "effect": "Decreases probability. Morgan is not only considering a run, but contemplating a run as a third-party or new-party candidate. Starting a viable party and launching a gubernatorial campaign are massive, distinct undertakings. He has prioritized party formation for now and has invested time and money on that front, but he’s repeatedly quoted as unsure if he’ll actually run."
                },
                {
                    "factor": "Pragmatic Candidate Calculus—Wait for Field to Settle",
                    "effect": "Decreases probability. Decision timing is crucial: Strategic actors maximize odds by choosing optimal entry, often late but not too late to build a campaign. With Jolly’s high-profile entry just days ago, the Democratic space is very much in flux. Morgan has explicitly said he wants to 'wait to see who else will run before making a decision.'"
                },
                {
                    "factor": "Media Incentives and Personal Branding",
                    "effect": "Increases probability slightly. Morgan’s public teasing sustains media attention and keeps options open. The news cycle could pressure a declarative move if he sees an opening. Nevertheless, this is weak compared to his explicit preference for patience."
                },
                {
                    "factor": "Funder and Donor Calculus",
                    "effect": "Neutral to slightly decreasing. As a billionaire, Morgan is less sensitive to donor incentives and can wait longer than most. This removes external pressure to announce prematurely, which would increase odds of a last-minute announcement, but his own statements suggest no urgency."
                }
            ],
            "no_scenario": "Morgan continues to build his new party and observes the Democratic/Republican/Independent field. With Jolly now a clear Democratic frontrunner and Pizzo in for independents, Morgan ultimately judges the risk and workload of a third-party run too high or concludes the opportunity cost isn’t justified. He does not announce before July 1, 2025, keeping his options open for later or abandoning the run entirely.",
            "yes_scenario": "A sudden, destabilizing event occurs—such as Jolly withdrawing, a major polling or fundraising windfall for Morgan’s nascent party, or surge of public momentum comparable to past ballot initiatives. Seeing an opening and believing early entry as a third party will maximize credibility, Morgan accelerates his decision and publicly announces for governor before July 1, 2025.",
            "final_reasoning": "The overwhelming evidence from Morgan’s statements and reporting is that he is deliberately holding off on a candidacy announcement, using classic wait-and-see tactics typical of rational, high-resource actors assessing entry in a crowded field. All recent quotes emphasize his lack of finality and a desire to first observe the competitive environment. Importantly, Jolly’s just-declared candidacy positions him as the leading Democrat, drastically reducing Morgan’s incentives to jump in within a 25-day window. Morgan is simultaneously working on establishing a new party, and his attention is divided between party-building and candidate decision, further diluting the odds. There is no sign of crisis or window forcing an earlier entry. The base rate for late-breaking, billionaire, third-party, or new-party gubernatorial announcements within such a short window (3+ weeks) is extremely low. While not impossible—given media and personal considerations, plus Morgan’s resources—none of the current dynamics suggest imminent declaration. Therefore, while there is some nontrivial chance (he is not fully ruled out and could pivot), the probability is quite low but not zero.",
            "final_probability": 10
        },
        "PoliticalSciencePoliticalOpportunityStructure": {
            "time_to_resolution": "Just over 3 weeks (until July 1, 2025) — approximately 25 days.",
            "perspective_relevance": "As an expert in Political Opportunity Structure, I focus on how changing institutional, political, and social factors open or close pathways (\"opportunities\") for political actors to enter the electoral arena. This lens is crucial in evaluating the likelihood of John Morgan announcing a run, as it involves not just personal ambition, but the interplay of party competition, candidate field, resource availability, and perceived electoral opportunity. Florida’s unique institutional context (party registration, ballot access laws), the timing of other announcements, and the emergence of new or third parties are key structural variables here.",
            "status_quo": "To date, John Morgan has not announced his candidacy for Florida governor, but he has repeatedly signaled interest, teased the creation of a new centrist/third party, and is investing resources into this vehicle. However, as of the latest news coverage (May/June 2025), he is in a holding pattern—waiting to see how other candidates and party fields develop before making a final decision.",
            "perspective_derived_factors": [
                {
                    "factor": "Filed Candidacies in Main Parties (Democrats and GOP)",
                    "effect": "Decreases probability. With David Jolly now declared and consolidating Democratic attention, and credible GOP competition also underway, the window for Morgan to enter as a high-profile alternative within a major party has closed."
                },
                {
                    "factor": "Third Party Formation Logistics/Timing",
                    "effect": "Decreases probability. Morgan is actively organizing a new party, but as of mid-May, he’s not committed to being its gubernatorial nominee. The time left (just 3-4 weeks) makes both filing and effective campaign launch logistically improbable for a viable statewide candidacy, especially in Florida’s regulated political environment. Party registration, ballot access requirements, and coordination with election officials are non-trivial hurdles."
                },
                {
                    "factor": "Personal Public Stance & Decision Path",
                    "effect": "Decreases probability. Morgan has consistently emphasized his indecision and desire to 'wait and see' — both in recent interviews and formal statements. He openly describes the possibility that he’ll end up being an organizer/party founder, but not a candidate himself. There are no hints of impending campaign events, staff hiring, or splashy roll-out plans."
                },
                {
                    "factor": "Political Timing and Strategy",
                    "effect": "Decreases probability. Morgan’s stated plan is to run a 'brief, three-month campaign' if he enters. He’s telegraphed that an official entry might happen quite late, after the field is settled, and certainly not in June 2025 when key entrant (Jolly) just declared. His actions are more consistent with positioning for leverage and influence, not a last-minute June splash."
                },
                {
                    "factor": "Media Environment & Opportunity Structure",
                    "effect": "Decreases probability. The burst of recent announcements (by Jolly and others) has saturated the news cycle, meaning a Morgan 2025-June announcement would be less impactful. Furthermore, there’s no sign of a political 'window' opening up—no candidate collapse, withdrawal, or party crisis that would incentivize or compel a high-profile, third-party entry."
                },
                {
                    "factor": "Base Rate for Late Entrant/Nontraditional Candidate Announcements",
                    "effect": "Decreases probability. Empirically, most credible gubernatorial candidates announce well before mid-summer, especially those seeking to build an independent vehicle. Late 'tease' campaigns rarely convert to official runs in the absence of specific triggering events. Historically, public teases sans concrete action or staff hiring by this stage almost always fizzle."
                }
            ],
            "no_scenario": "John Morgan, after seeing David Jolly consolidate the Democratic lane and as he focuses on organizing his new party, continues to talk up systemic reform and center-outside politics but refrains from announcing a campaign before July 1. He may leave open the possibility of running in the future or back another candidate. No official declaration is issued within the relevant timeframe.",
            "yes_scenario": "Surprised by a perceived opportunity (e.g., sudden weakness in the major party fields or an unexpected groundswell of support), John Morgan makes a rapid decision and formally announces his candidacy before July 1, 2025, either as the nominee of his newly filed \"centrist\" party or as a dramatic independent, leveraging the news cycle for maximal impact.",
            "final_reasoning": "From the Political Opportunity Structure lens, all meaningful incentives and windows for a June 2025 announcement have now closed. David Jolly’s entry effectively seals the major-party path, while Morgan’s own stated preference for a delayed or possibly non-existent campaign, coupled with logistical hurdles of third-party state ballot access and the lack of last-minute organizational mobilization, compound against a late June entry. The base rate for late announcements, especially in the form of new party candidacies, is extremely low. He’s also signaled ambivalence and arguably has more to gain by remaining an influential outsider, leveraging his resources for issue advocacy or kingmaking rather than exposing himself to the risk of a rushed, logistically fraught campaign.",
            "final_probability": 3
        },
        "PoliticalScienceCandidateEmergenceLiterature": {
            "time_to_resolution": "About 24 days (until July 1, 2025)",
            "perspective_relevance": "As an expert on Candidate Emergence in Political Science, I analyze the motivations, timing, and barriers to candidacy announcements — especially the interplay between political opportunity structures, resource mobilization, and candidate strategic calculation. I am attuned to base rates of late outsider entries, the role of third-party bids, cues from elite endorsements, and the real-world constraints that affect wealthy self-funders like Morgan. I also account for how crowded fields, party dynamics, media signaling, and recent public messaging either accelerate or retard emergence.",
            "status_quo": "John Morgan remains a prominent public figure who is openly starting a new political party and expressing strong dissatisfaction with both major parties, but he has repeatedly and publicly stated that he is 'considering' a run, 'has not made up his mind', and wants to 'see how the field develops.' He is investing resources in party-building, not campaign launch.",
            "perspective_derived_factors": [
                {
                    "factor": "Strategic Wait-and-See Posture",
                    "effect": "Decreases probability. Morgan has repeatedly communicated his intention to delay a candidacy announcement until he sees how other candidates fare. This stance is classic in candidate emergence theory: wealthy possible candidates with ambiguous partisan alignment often assess the field for months, frequently deciding not to run if credible, high-profile candidates jump in."
                },
                {
                    "factor": "Field Consolidation: Jolly's Entry",
                    "effect": "Decreases probability. The Democratic field was open but is now substantially shaped by the high-profile entry of David Jolly, a moderate ex-Republican. With Jolly already challenging for centrist/independent-leaning votes and framing himself as an anti-extremist Democrat, Morgan faces immediate strategic overlap making his entry less likely and less opportune—unless Jolly falters very quickly."
                },
                {
                    "factor": "Timing Constraints and Practical Logistics",
                    "effect": "Decreases probability. Bringing a viable third-party candidacy to statewide relevance within the traditional electoral cycle requires more than a short lead time. Morgan's professed desire for a 'brief campaign' conflicts with the time needed to organize ballot access, especially with Florida's rules. Political science literature shows late entries, especially to mount a new party, are rare and high-risk."
                },
                {
                    "factor": "Public Messaging and Commitment Level",
                    "effect": "Decreases probability. Across all recent press coverage, Morgan is at best highly equivocal ('wait-and-see', 'may turn around and find no one marching behind me', 'taking a wait-and-see approach'). There are no signs of staff hiring for a campaign, polling, or travel, only limited legal/accounting activity tied to party formation."
                },
                {
                    "factor": "Resource Endowment and Past Behavior",
                    "effect": "Increases probability, though modestly. Morgan is independently wealthy, nationally famous, and has previously funded successful, issue-driven ballot initiatives. This profile sometimes correlates with unexpected late entries, particularly for high-ego or cause-driven candidates."
                }
            ],
            "no_scenario": "John Morgan continues to build his new third party infrastructure and participates in media commentary about state politics throughout June 2025. He reiterates his wait-and-see message, perhaps flirting with an announcement, but ultimately does not declare for governor by July 1, 2025. The crowded field (Jolly for Democrats, Pizzo for independents, GOP candidates) and the logistical/cost hurdles of a third-party run make Morgan sit out; his focus remains on party-building or kingmaking, not candidacy.",
            "yes_scenario": "Sensing a groundswell of populist, centrist interest—and perhaps a sudden faltering of Jolly or Pizzo, with a perceived window for a shock-entrant candidacy—Morgan reverses course, formally announces for governor as the standard-bearer of his new third party. This requires either rapid, unexpected consolidation of support or a major game-changing event (scandal, polling earthquake, etc.) that makes him believe only he can lead a viable alternative. He leverages his wealth for a media blitz in late June.",
            "final_reasoning": "The overwhelming bulk of recent public evidence indicates that Morgan is deliberately and publicly not running at this time, focusing instead on party-building. Political science base rates for ultra-late, first-time outsider entries are extremely low—especially for statewide executive office and particularly when the prospective candidate says he will wait out the field, and the field is actively closing (with Jolly's recent entrance and Pizzo's independent bid). The practical logistics of launching a meaningful gubernatorial campaign and a new party in under a month compound the improbability. While Morgan has the resources and Florida's ballot access (for filing, but not functional campaign-building) is less onerous than elsewhere, the timing and strategic logic point to a 'No' barring a black-swan event. I have to balance the tiny chance of a surprise billionaire-driven announcement against the clear trend: the base rate for this move is under 5%. Therefore, my final probability is very low, but not zero, given Morgan's idiosyncratic style and resources.",
            "final_probability": 3
        },
        "CommunicationStudiesAgendaSettingTheory": {
            "time_to_resolution": "Approx. 24 days (until July 1, 2025)",
            "perspective_relevance": "As an expert in Agenda Setting Theory, I analyze the interplay between media narratives, public discourse, and elite signaling when forecasting political announcements. This lens is critical for evaluating whether John Morgan will move from media speculation and rhetorical positioning to actually announcing a gubernatorial run. Understanding how Morgan manages the public agenda, responds to openings in the media environment, and times his announcement in relation to rivals' moves can yield a more nuanced probability estimate.",
            "status_quo": "As of now, John Morgan is publicly considering a run, has announced the formation of a new third party, but has stated repeatedly he will 'wait and see' how other candidates fare before making a decision. He has criticized both parties but has not announced his candidacy for governor.",
            "perspective_derived_factors": [
                {
                    "factor": "Salience of 'Third Way' Narrative in Media",
                    "effect": "Increases probability if Morgan perceives momentum and coverage of a centrist alternative; decreases if media fixation remains on established party candidates."
                },
                {
                    "factor": "Timing Relative to Other Announcements",
                    "effect": "Decreases probability: With David Jolly now officially announced as a Democrat, the Democratic field is no longer empty. This may reduce Morgan's perceived unique value proposition or delay his own calculus."
                },
                {
                    "factor": "Morgan's Own Public Statements and Strategic Teasing",
                    "effect": "Decreases probability: He consistently states that his own decision depends on how the existing candidates \"fare,\" hinting at a strategy of late entry, if at all."
                },
                {
                    "factor": "Media Coverage of Morgan's New Party Efforts",
                    "effect": "Slightly decreases probability: Coverage has shifted to Morgan's party-building focus rather than imminent candidacy, diluting urgency or necessity of a near-term announcement."
                },
                {
                    "factor": "Recent Precedent/Base Rate of High-Profile Late Entrants",
                    "effect": "Decreases probability: Few high-profile late entrants in large-state gubernatorial races announce this close to the deadline; announcements typically occur early enough to build campaign infrastructure and media narratives."
                },
                {
                    "factor": "Evolving Competitive Landscape",
                    "effect": "Decreases probability: With Jolly running, and notable independents and Republicans declared or in speculation, the higher-profile, anti-GOP lane is more crowded, reducing Morgan's disruptive or agenda-setting power."
                },
                {
                    "factor": "Morgan's History of Agenda Control via Ballot Initiatives, not Candidacy",
                    "effect": "Decreases probability: His record shows a preference for indirect political influence (ballot measures, media campaigns) over direct candidacy, fitting his third-party, system-disruptor persona."
                }
            ],
            "no_scenario": "John Morgan continues to publicly promote his new party and remains critiquing both major parties. He signals ongoing evaluation of the race but ultimately does not make a formal campaign announcement before July 1, 2025, instead focusing on party-building and possible kingmaker/issue advocacy roles.",
            "yes_scenario": "Sensing an opportunity—perhaps due to major stumbles by Jolly or Republicans, or an unexpected surge of media attention and grassroots demand for his candidacy—Morgan reverses course and makes a public, explicit announcement of his governor candidacy (as a candidate of his new party) before July 1, 2025. This announcement would be widely reported and unequivocal (e.g., a press conference or formal campaign launch).",
            "final_reasoning": "Applying Agenda Setting Theory, the current media landscape positions Morgan more as a system critic and party builder than as a last-minute candidate. The Democratic and Republican fields are becoming defined, with Jolly securing the moderate/anti-GOP-with-credibility lane Morgan might otherwise fill. All available, recent Morgan statements emphasize waiting, seeing, and party creation over imminent candidacy, with multiple articles stressing he could well decide not to run or delay until there's a clearer vacuum. The window for agenda-setting shock value is closing, and the base rates of such late, high-profile independents/third-party candidacies are low. The structure of coverage and his own agenda control tendencies point to Morgan preferring a longer decision runway or different form of political influence. Therefore, the probability of him formally announcing his gubernatorial candidacy before July 1, 2025, is low, but not zero given his unpredictability and potential for opportunistic moves.",
            "final_probability": 8
        },
        "CommunicationStudiesFramingTheory": {
            "time_to_resolution": "About 3 weeks (question resolves July 1, 2025; today is June 6, 2025)",
            "perspective_relevance": "As an expert in Communication Studies with a focus on Framing Theory, I approach this question by analyzing how the communication strategies, public statements, and media narratives surrounding John Morgan’s possible candidacy influence both perception and likelihood of announcement. Framing Theory elucidates how political actors signal intent, delay, or buildup candidacies, and how the broader media environment primes audiences (including political elites, potential voters, and Morgan himself) for such announcements. I consider not just what is said, but how it is said, what is omitted, and the context into which Morgan is situating his public communication.",
            "status_quo": "John Morgan has not yet announced a run for Florida governor. He is forming a new party but communicates ambivalence about entering the race, preferring a 'wait-and-see' approach contingent on who else enters. The Democratic and Republican fields are already forming, with prominent and well-publicized candidates declared.",
            "perspective_derived_factors": [
                {
                    "factor": "Explicit Communication Signals",
                    "effect": "Decreases Probability. Numerous direct quotes from Morgan and close observers reinforce that he will 'wait and see,' is not keen to jump into a crowded field, and that building a new party (not launching a personal campaign) is his focus for now."
                },
                {
                    "factor": "Media Framing and Agenda Setting",
                    "effect": "Decreases Probability. While there is some speculative media attention, most major coverage frames Morgan as 'considering' or 'teasing' a run but increasingly emphasizes that he is building a party—not a candidacy—while other candidates take the spotlight."
                },
                {
                    "factor": "Strategic Timing and Announcement Buildup",
                    "effect": "Modest decrease. Typically, high-viability contenders (especially wealthy, outsider candidates) announce early enough to build infrastructure, qualify for ballots, and attempt to seize momentum. Given Morgan's repeated references to a brief 3-month campaign and his avoidance of a commitment to run, it is likely his announcement—if it comes—would be much later, possibly missing the July 1 deadline."
                },
                {
                    "factor": "Entry of Other Candidates",
                    "effect": "Decreases Probability. Media notes that Jolly (a moderate Democrat) and Pizzo (independent) have already declared, potentially crowding the 'centrist' lane that Morgan would also target, reducing the strategic rationale for Morgan to declare quickly, or at all."
                },
                {
                    "factor": "Framing of Personal Intent and Party-building Efforts",
                    "effect": "Significantly decreases probability. His statements and third-party framing place the narrative emphasis on system reform and representation for centrists, rather than personal ambition. He highlights being content simply starting the party—even if few join—which downplays a personal gubernatorial run."
                },
                {
                    "factor": "Historical Precedent/Base Rates",
                    "effect": "Decreases Probability. Florida has seen business leaders and political outsiders tease runs but not announce within short windows, especially in third-party contexts. Creating a new party is rarely paired with a rapid personal campaign announcement."
                }
            ],
            "no_scenario": "Morgan continues organizing and promoting his new party, opts to serve as its chief architect and public face rather than its gubernatorial candidate, and with the field already set with high-profile Democrats/Independents, chooses not to announce before July 1. He may even publicly state his intent not to run, clarifying his focus is elsewhere.",
            "yes_scenario": "A dramatic shift occurs: poor reception for the declared candidates, a high-profile event or polling surge demonstrating demand for a true centrist candidate, or Morgan is convinced (perhaps by insider lobbying or polling) that there is a unique, time-sensitive opportunity and—abandoning his 'wait-and-see' posture—rapidly announces for governor before July 1, championing his new party.",
            "final_reasoning": "Combining macro/political base rates, Morgan’s deliberate signaling (in words and media framing), and the strategic logic highlighted by Communication Studies, the probability he will announce his candidacy before July 1 is very low. The overwhelming weight in recent news and his own statements is on cautious party-building, not imminent personal candidacy. The agenda-setting in major Florida and national outlets, and Morgan’s own framing—emphasizing new structures for the 'middle' and a lack of personal urgency—further suggest that an announcement is highly unlikely during this period. Framing Theory highlights that even teases or 'flirtations' are sociopolitical signals, and the signals here consistently downplay immediate entry. While last-minute reversals do happen, they do so at much lower base rates, especially given the short timeframe and crowded field.",
            "final_probability": 7
        },
        "RegionalStudiesFloridaPoliticalCulture": {
            "time_to_resolution": "Approximately 25 days (forecast date: 2025-06-06; resolution date: 2025-07-01)",
            "perspective_relevance": "As an expert in Florida political culture, I understand the state's unique political dynamics: candidate timing calculations, third-party viability, the typical behaviors of high-profile donors and non-traditional candidates, and the interplay of party machinery with the electorate's deep polarization and recent GOP dominance. This perspective allows for a nuanced read on signals from public statements, media coverage, and past patterns in Florida's gubernatorial pre-campaign periods.",
            "status_quo": "John Morgan has persistently teased a run for governor, publicly forming a new centrist party and keeping a possible candidacy in play, but has not officially announced he is running as of June 6, 2025.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent and High-Profile Announcements by Other Candidates",
                    "effect": "Decreases probability: David Jolly, a well-known former Republican turned Democrat, has just formally entered the governor's race, garnering substantial statewide and national attention. This likely closes any remaining opening for Morgan to run with significant impact or media dominance, especially as Jolly fills the high-profile outsider niche in the Democratic-aligned space."
                },
                {
                    "factor": "Morgan's Repeated Public Hesitancy and Strategy of Delay",
                    "effect": "Decreases probability: Multiple articles (POLITICO, Orlando Sentinel, WUSF, SunSentinel) affirm Morgan is intentionally waiting to see how the field develops. His statements are ambivalent (\"flirting with a run,\" \"goes back and forth,\" \"may turn around and find nobody marching behind him\") and stress an uncommitted position, hinting more at reluctance than imminent action."
                },
                {
                    "factor": "Formation and Focus on New Political Party",
                    "effect": "Decreases probability: Morgan's political activity has shifted toward formally setting up a new \"centrist\" or \"Capitalist\" third party, recruiting candidates, and offering a contest to name the party, with no timeline or urgency for launching a personal candidacy. Launching a party is a major task and Morgan is signaling leadership-building over self-nomination, at least for the time being."
                },
                {
                    "factor": "Typical Florida Candidate Announcement Timing and Strategic Calculations",
                    "effect": "Decreases probability: Florida gubernatorial cycles usually see credible and well-resourced candidates announce 12-18 months out from the general, well before primary season to maximize campaign runway. With established competitors now in the field and Morgan's claim that his campaign, if it happens, would be \"brief, lasting only three months,\" the window for an announcement (especially one meant to be viable) is arguably closing, and pre-primary jockeying reduces any value for a delayed surprise."
                },
                {
                    "factor": "Morgan's Own Media Strategy and Pattern of Teasing Runs",
                    "effect": "Decreases probability: Morgan has a clear pattern (2018, 2020, now) of publicly weighing a run, getting media attention, and ultimately not entering the race. His \"wait and see\" approach often functions to keep him relevant without committing, consistent with a reluctance to actually run."
                },
                {
                    "factor": "Base Rate of Candidacy Announcements After Public Party Launch and in Response to Field Consolidation",
                    "effect": "Decreases probability: Historically, major party candidates or serious independents in Florida rarely enter after new competitors officially announce. With Jolly, Pizzo, and on the GOP side Donalds (and possibly Casey DeSantis), the field is firming up; late entries are uncommon and structurally disadvantaged."
                }
            ],
            "no_scenario": "John Morgan continues to focus on organizing his new party, holding off on a personal candidacy announcement at least through the July 1 deadline. He uses the coming months to gauge public and donor interest, and ultimately either demurs or delays a decision until later in 2025 or 2026, consistent with his history. Media interest remains high, but he leverages it for party-building rather than a run.",
            "yes_scenario": "Morgan perceives a lackluster response to the existing field (Jolly, Pizzo, Donalds) or detects a centrist opportunity (e.g., weak polling or donor enthusiasm for others). He abruptly accelerates his timeline, makes a high-profile, late-breaking announcement before July 1, framing himself as the only viable alternative for the \"politically homeless.\" Alternatively, external political shocks or a surge of interest in his party spur him to jump in quickly.",
            "final_reasoning": "The overwhelming weight of evidence, both from public statements and Florida's political context, points to a classic \"trial balloon\" scenario for John Morgan: extensive media speculation, an emphasis on alternative party-building, and a persistent refusal to commit. With Jolly now firmly announced, Pizzo in as an independent, and the Republican field active, Morgan's self-imposed delay means any entry now would lack first-mover or even effective second-mover advantage, and would undermine his own narrative of party-building. The historical base rate for political figures who tease, but do not early-announce, is very low. Morgan's own prior behavior and Florida's strategic environment further reduce the likelihood. The only plausible \"yes\" scenario requires an abrupt change in current signals within a very short window. Therefore, the probability of John Morgan officially announcing for governor before July 1, 2025, is very low—close to, but not absolutely, zero.",
            "final_probability": 3
        },
        "RegionalStudiesSouthernPoliticsTradition": {
            "time_to_resolution": "Approximately 24 days until July 1, 2025.",
            "perspective_relevance": "As an expert in Regional Studies with a specialization in Southern Politics Tradition, I understand the unique historical, cultural, and political forces that shape candidate emergence, party structures, third-party efforts, and elite behavior in high-profile Southern state races like Florida's gubernatorial contest. I bring insight into how outsider business figures, party establishment dynamics, and third-party challenges have fared in the South, as well as John Morgan's prior political actions and visibility.",
            "status_quo": "John Morgan has not yet announced a candidacy for governor. He continues to float the idea publicly, is actively launching a new third party, and is watching other candidates' moves, but as of June 6, 2025, no direct candidacy announcement has been made.",
            "perspective_derived_factors": [
                {
                    "factor": "Third-Party Organizing Complexity and Legal Hurdles in Florida",
                    "effect": "Decreases the probability. Florida is a two-party dominant state with high procedural barriers to ballot access. Third-party campaigns typically require substantial groundwork before a viable gubernatorial run can be launched. Morgan is investing energy in building the party infrastructure and recruiting candidates—suggesting a strategic, stepwise approach, not a rapid self-announcement."
                },
                {
                    "factor": "Temporal Proximity to Filing Deadline and Election",
                    "effect": "Decreases probability. The election is in 2026 and the primary is over a year away (August 2026). Morgan has repeatedly stated he is \"waiting to see the field\" and intends a short campaign if he runs at all, indicating he feels no urgency to announce immediately."
                },
                {
                    "factor": "Recent High-Profile Democratic Entrant (David Jolly)",
                    "effect": "Decreases probability. Jolly's entry into the race as a moderate Democrat occupies a similar 'outsider' and centrist-lane voter base, possibly delaying Morgan to reassess his prospects, coalition space, and value-add."
                },
                {
                    "factor": "Morgan's Repeated Public Hesitancy and Strategic Waiting",
                    "effect": "Decreases probability. Morgan is publicly non-committal and self-aware of the difficulties (e.g., 'I go back and forth' about running). He wants to see how other candidates perform and may not wish to siphon votes or face a split field."
                },
                {
                    "factor": "Historical Base Rate of Last-Minute Candidate Announcements in Florida Gubernatorial Races",
                    "effect": "Decreases probability: Major non-incumbent candidates almost always announce several months or more before the primary, especially those without prior elected office experience. Sudden high-profile self-nominations in June for a cycle resolving more than a year out are rare."
                },
                {
                    "factor": "Morgan's Financial and Media Savvy",
                    "effect": "Slightly increases probability. If he did decide to run, his resources allow for rapid campaign launches. However, even well-funded outsider runs in the South require signals to donors and supporters, which would typically precede an actual candidacy announcement."
                },
                {
                    "factor": "Intensity of Media Speculation and Pressure to Decide",
                    "effect": "Modestly increases probability. Morgan faces consistent public/media urging to clarify intentions, and a 'teasing' campaign can sometimes flip abruptly to an announcement for publicity or strategic reasons. But so far, the tone remains cautious."
                }
            ],
            "no_scenario": "Morgan remains publicly undecided through the end of June, focuses on setting up his new party, and continues to watch other candidates (such as David Jolly and Jason Pizzo) enter the gubernatorial field. He prioritizes recruiting and building infrastructure for his party, keeps his options open, and cites the need to see how the race shapes up before making a personal decision. He ultimately does not announce a gubernatorial run before July 1, 2025.",
            "yes_scenario": "Morgan, reacting either to strong pressure from supporters, a perceived 'opening' after Jolly's entry, or a burst of enthusiasm for his party launch, determines that an early announcement will help his new party's relevance, fundraising, or media momentum. In a surprise move or major press event, he declares his candidacy and files the necessary paperwork before July 1, 2025.",
            "final_reasoning": "The overwhelming weight of evidence and Southern gubernatorial precedent points to a 'No' outcome. Morgan is highly visible and well-resourced, but has made it clear he prefers a wait-and-see approach, intends a short campaign if he runs at all, and is devoting energy to launching a new party and recruiting others. The recent announcement by David Jolly as a moderate Democrat also occupies part of the center lane that Morgan would need, while the Republican field is consolidating its own base. In the Southern Politics Tradition, wealthy outsiders contemplating party-building and self-funding often test the waters extensively before announcing, and almost never leap in at the tail end of June for a race over a year out. While a rapid, surprise announcement is possible given Morgan's personality and resources, the base rate for such late entries is very low and all his recent signals are of cautious deliberation, not imminent candidacy. My judgment—factoring in procedural, cultural, and strategic realities in Florida and the South, news coverage, base rates, and Morgan's own language—is the probability of John Morgan announcing for governor before July 1, 2025 is extremely low, but not absolutely impossible.",
            "final_probability": 6
        }
    },
    "deliberation_probability": [
        5,
        7,
        10,
        3,
        3,
        8,
        7,
        3,
        6
    ],
    "deliberation_mean_probability": 5.777777777777778,
    "deliberation_sd": 2.4888640871780128,
    "deliberation_probability_result": 6,
    "group_results": {
        "CampaignConsultingUsGubernatorialCampaignStrategy": {
            "forecaster_to_engage": "PoliticalScienceRationalChoiceTheory",
            "response_type": "critique",
            "response": "Rational Choice Theory stumbles here by ascribing far too much autonomy to Morgan as a 'rational high-resource actor' and giving undue weight to the hypothetical: yes, Morgan COULD pivot, and yes, he COULD self-fund some break-the-mold candidacy — but nearly all late billionaire campaign launches so far in U.S. history, even by less noncommittal figures, have fizzled or failed to materialize on such compressed timelines. You're missing the consultant/campaign infrastructure reality: if he wanted the third-party/campaign-in-one blitz, he'd need even more pre-deadline groundwork to avoid ballot and organizational disaster, and there's NO public trace of this happening. Jolly's timing, as you mention, didn't just 'reduce incentives,' it essentially shut Morgan out of a viable centrist lane. The odds you're giving (10%) are needlessly high for a field this cold — Morgan's idiosyncratic media flirtations have never, in the Florida context, come close to match actual late declarations. Base rates in comparable statewide races are well below your number. Your 10% rewards unpredictability for its own sake, but ignores the consistently unbroken pattern of non-announcement in similar cases."
        },
        "PoliticalJournalismElectionCycleReportingStandards": {
            "forecaster_to_engage": "CommunicationStudiesFramingTheory",
            "response_type": "defense",
            "response": "Framing Theory nails what's actually happening in the news cycle: Morgan isn't simply on the fence, he's actively curating a 'not yet, maybe never' narrative, which journalists echo in every story. The focus of the messaging isn't the typical 'warming up a launch,' it's more about branding the party-building process and cultivating a profile as the anti-candidate—the champion of a disaffected middle, not an office-seeker. Even the dissenting language about unpredictability is framed as a character tic rather than a real campaign indicator. Your emphasis on how these signals reduce newsrooms' willingness to report a declaration as imminent matches current election cycle reporting standards. That's spot-on. A surprise is always possible with a billionaire maverick, but the framing and meta-framing at work here gives the public—and, crucially, the press gatekeepers—every reason to keep the campaign probability very low. Your forecast aligns well with both the journalism and the wider political theatre."
        },
        "PoliticalScienceRationalChoiceTheory": {
            "forecaster_to_engage": "CampaignConsultingUsGubernatorialCampaignStrategy",
            "response_type": "critique",
            "response": "You’re mistaking tactical parsimony for reality in your lowball (5%) estimate—classic consultant blinkers! If anything, you let the absence of ground-level campaign mechanics (staff, infrastructure, traditional soft launches) oversell how 'impossible' late entries are for high-resource outliers like Morgan. You’re right the base rate is minuscule for regular politicians, but billionaire outsiders are known for springing announcements with minimal advance signals. Morgan has already proven he can bankroll ballot initiatives statewide—he doesn’t need traditional consultant choreography to inject himself into the race at the eleventh hour (especially as a vanity/statement candidate). The fixation on the 'party-building, not candidacy-building' dichotomy is also overhyped: the two can remain intentionally blurry until the declaration moment, especially when press coverage is already primed for spectacle. Sure, odds are low, but your certainty veers too close to assuming Morgan plays by institutional rules—he demonstrably does not. Omitting this non-zero, maverick-driven risk undercuts your consulting realism. 5% undersells how fast a wealthy, media-savvy actor could upend your supposed closure."
        },
        "PoliticalSciencePoliticalOpportunityStructure": {
            "forecaster_to_engage": "RegionalStudiesSouthernPoliticsTradition",
            "response_type": "defense",
            "response": "Spot on—your use of Southern political precedent and the realities of elite outsider behavior in gubernatorial races adds a crucial dimension to this question. Too many forecasts get seduced by Morgan’s wealth and media profile without grounding their probabilities in the Southern tradition of strategic field-testing and the glacial pace of genuine party-building versus personal campaign launches. You correctly note that in the modern South, especially Florida, real outsider candidacies do not spring up in a vacuum: they require extensive groundwork, validation from the political class, and a stronger sense of timing than any last-minute 'blitz' would allow. Your skepticism about Morgan’s willingness to tank his own carefully constructed 'middle-class champion' narrative with a rushed declaration—when the public and elite signals all stress deliberation and party creation—is exemplary. In short, you wisely anchor your estimate not in wild-card billionaire lore, but in the proven, slow-burn style of Southern candidate emergence. Well argued."
        },
        "PoliticalScienceCandidateEmergenceLiterature": {
            "forecaster_to_engage": "RegionalStudiesFloridaPoliticalCulture",
            "response_type": "defense",
            "response": "Absolutely nailed it. Unlike those seduced by the 'billionaire wildcard' myth, you ground your forecast in regional candidate emergence realities. Florida's political culture is awash in media-savvy trial balloons, ego-driven teasers, and would-be disruptors who never quite pull the trigger when practical obstacles and new candidacies appear. You astutely recognize that Morgan has more leverage—and less reputational risk—in brand-building, kingmaking, and party experimentation than in a rushed, likely losing gubernatorial run. Your skeptical reading of the 'self-imposed delay' is perfect: once Jolly declared and Pizzo firmed up, Morgan's window slammed shut. The last-minute 'yes' scenario now depends on a totally unforeseeable shock, and you don't let his cash or prior bluster distract from long odds. Your case is a clinic in not overrating Miami machismo or media noise versus actual structural dynamics. A gold-standard regionalist analysis."
        },
        "CommunicationStudiesAgendaSettingTheory": {
            "forecaster_to_engage": "PoliticalScienceRationalChoiceTheory",
            "response_type": "critique",
            "response": "Your 'rational, high-resource actor' framing massively overshoots what agenda-setting and media logic reveal about this situation. You treat Morgan as a potential black swan, glossing over the real lessons of political agenda-setting: a late, billionaire candidate needs sustained media momentum and a narrative vacuum, neither of which exist. With Jolly now crowding the centrist lane and Morgan's own coverage emphasizing party-building, not candidacy, there's no agenda window to exploit. The notion that resources can substitute for time and narrative groundwork is a pipe dream at this scale, especially in Florida. In fact, the whole possibility of a last-minute shock campaign flouts every observable trend in both Morgan's public messaging and statewide political choreography—you give unpredictability too much credit. Your 10% probability is a hedge against being surprised, not a rational reading of how elite actors successfully set the agenda. It's not rational if it fails to factor in how the news cycle, field closure, and Morgan's own signal management make a rapid campaign launch even less plausible than your baseline suggests."
        },
        "CommunicationStudiesFramingTheory": {
            "forecaster_to_engage": "PoliticalScienceRationalChoiceTheory",
            "response_type": "critique",
            "response": "Rational Choice Theory, you let theoretical possibility warp your risk calculus: you posit that because Morgan can self-fund and act independently, the mere physical *possibility* of a snap, billionaire-driven campaign means we must assign a meaningful probability—even in the face of structural, communicative, and agenda-setting reality that makes such a move almost fantastical in context. Your approach treats Morgan as an undriven utility-maximizer, ignoring the media and elite cues—deliberate public emphasis on new party over personal campaign, the loss of narrative momentum to Jolly, and the repeated downplaying of imminent candidacy by Morgan himself. These are not just noise; they're strong anti-announcement frames. The 'he COULD pivot' loophole is a lazy hedge, not a substantiated risk. In the language of Framing Theory, you've overemphasized the 'potential actor' frame and ignored both how Morgan himself frames his role (architect, not office seeker) and how the field/press structured the race's storyline. Your 10% overstates a dying possibility clinging only to Morgan's notoriety and resources, not to empirical or communicative plausibility."
        },
        "RegionalStudiesFloridaPoliticalCulture": {
            "forecaster_to_engage": "RegionalStudiesSouthernPoliticsTradition",
            "response_type": "defense",
            "response": "Finally, someone who doesn't let 'billionaire maverick with a checkbook' override actual Southern and Floridian political culture. Southern outsider candidates love to float trial balloons and launch media teases, but when it comes down to disruptive, party-blind candidacies, the tradition is cautious, not cavalier. You rightly highlight that Morgan's public personality is more Joel Chandler Harris than Huey Long—a guy who checks the wind and tries to preserve his kingmaker status. Your analysis that he has more to gain by shaping the party environment and remaining above the fray is dead-on. You also inject vital realism regarding the inertia and gatekeeping in Florida's political machinery: no matter the money or ego, late entrants almost never materialize for state executive races on this short a timeline. Morgan's 'maybe I'll run, maybe I won't' schtick is classic Southern performance, not a prelude. Your probability aligns with a deep reading of culture, not just horse-race hypotheticals. Well defended."
        },
        "RegionalStudiesSouthernPoliticsTradition": {
            "forecaster_to_engage": "PoliticalScienceRationalChoiceTheory",
            "response_type": "critique",
            "response": "Rational Choice Theory, your model overestimates the real-world agency of a wealthy Southern actor like Morgan by relying too much on abstract possibility and insufficiently on actual, regionally embedded constraints. You're constructing a 10% probability mostly from the premise that money and self-starter status permit any move at any time—yet in Southern, and especially Floridian, statewide politics, we rarely see that. You're ignoring the 'signal saturation' present: Morgan's sustained 'wait-and-see,' plus now a centrist lane claimed by Jolly, means both the window and the narrative space have closed, and the local party system has mechanisms (both soft and hard) to resist such a lategame shock. The rational play now—especially for an actor as legacy-minded as Morgan—is to maximize leverage as a power broker, not candidate. Your risk hedge is rooted in theoretical flexibility, not grounded precedent or field behavior. At this juncture, you're dressing up unlikely volatility as prudent recalculation, but it just doesn't match how Southern political traditions or Florida's party landscape operate at crunch time."
        }
    },
    "revision_results": {
        "CampaignConsultingUsGubernatorialCampaignStrategy": {
            "my_phase1_final_probability": 5,
            "reasoning_for_revised_probability": "After reviewing both my own initial forecast and the group deliberation—including the most aggressive alternative estimate (10%) being criticized for excessive optimism—I find no substantive new evidence or argument suggesting the probability should be higher than my initial estimate. On the contrary, the consensus among most forecasters is below 7%, with a logical focus on organizational realities, Morgan's repeated patterns of ambiguity without action, and the strategic closing of viable lanes following Jolly's official announcement. The group deliberation reinforced the validity of my low estimate; if anything, it exposes just how remote the possibility truly is. There is still some non-zero chance owing to Morgan's high profile, personal wealth, and penchant for surprise, but all observable indicators and historical base rates point to an exceedingly unlikely last-minute entry. No revision upward is warranted.",
            "revised_probability": 5
        },
        "PoliticalJournalismElectionCycleReportingStandards": {
            "my_phase1_final_probability": 7,
            "reasoning_for_revised_probability": "Group deliberation reinforced my original rationale: the consensus among diverse expert approaches found the probability of a late Morgan announcement to be extremely low. Critically, critiques of higher (10%) probabilities emphasized the lack of evidence for any invisible campaign ramp-up, the severe infrastructure/logistical barriers, and the historical base rates well below even single digits for surprise, late gubernatorial entries by high-profile individuals in Florida. Defenses of probabilities in the 3-8% range highlighted how both the news media and Morgan himself are actively shaping a public narrative not of impending candidacy, but of outsider/party-builder status, and that best-practices news reporting would not mistake these signals for a real announcement. The polemics further stress that unpredictability here is a weak justification on its own, given Morgan's well-established pattern of public flirtation but ultimate non-entry. As a result, my previous probability of 7% is, if anything, marginally generous, but remains valid to reflect his unique resources and idiosyncrasy. I will not revise downward purely to match the most pessimistic group members; the odds remain very low, but not zero.",
            "revised_probability": 7
        },
        "PoliticalScienceRationalChoiceTheory": {
            "my_phase1_final_probability": 10,
            "reasoning_for_revised_probability": "After reviewing group deliberation, my core rationale is reinforced: there is overwhelming alignment that Morgan’s deliberate ambiguity, party-building focus, and the now-set field (with Jolly's announcement) make a pre-July 1 candidacy declaration highly improbable. The critiques highlighted that giving double-digit odds—by overweighting Morgan’s unpredictability and resources—may inflate the true tail risk, while campaign consulting perspectives assert that billionaire outsiderness alone doesn't typically counteract base-rate realities or logistical/institutional barriers. However, as my own critique pointed out, a hyper-low estimate ignores Morgan’s genuine capacity for disruptive moves and his disregard for normal institutional choreography. The group’s modal forecast is in the 3–8% range, suggesting consensus that my initial estimate may be modestly high but not irrationally so, given the (very slim) possibility of a maverick late entry. I see no significant new evidence forcing a change—news and cross-field arguments all point the same direction. Therefore, I will slightly reduce my estimate in recognition of base rate emphasis and consensus, but maintain a small buffer for maverick risk.",
            "revised_probability": 7
        },
        "PoliticalSciencePoliticalOpportunityStructure": {
            "my_phase1_final_probability": 3,
            "reasoning_for_revised_probability": "The group deliberation reinforced the very low likelihood of a John Morgan gubernatorial announcement before July 1, 2025. The other forecasters' arguments—especially those from the Southern Politics, Candidate Emergence, and Framing/Agenda Setting perspectives—strongly agree on a near-consensus: late, third-party, or billionaire entries into gubernatorial races almost never materialize without extensive pre-announcement signals, infrastructure ramp-up, or a clear candidate vacuum (none of which exist here). Critiques emphasizing the theoretical unpredictability of high-resource mavericks are outweighed by the unified media framing, logistical hurdles, and Morgan's repeated emphasis on party-building over running. All evidence and base rates point to a probability very close to zero, barring a black-swan event. I see no reason to meaningfully raise or even further lower the initial probability; the original assessment remains justified, rigorous, and clearly supported by expert deliberation.",
            "revised_probability": 3
        },
        "PoliticalScienceCandidateEmergenceLiterature": {
            "my_phase1_final_probability": 3,
            "reasoning_for_revised_probability": "Upon reviewing the group deliberation, I found strong consensus—rooted in base rates, regional context, and empirical patterns of candidate emergence—that there is virtually no precedent, nor any substantive public sign, for Morgan making a late pivot to candidacy before July 1. The only dissent (Rational Choice) overestimates unpredictability and underestimates organizational/structural barriers, and was effectively critiqued for this. Defenses from Florida/regional and Southern-tradition perspectives reinforce that media hype and wealth do not negate the brutally low odds for last-minute major gubernatorial entries, especially given Morgan's own ongoing equivocation and strong alternative incentives for him to stay a party-builder, not a candidate. As such, my original probability (3%) appears slightly high in context, but lowering it further would approach signaling effective impossibility. For strict calibration, and reflecting the remote but almost-negligible possibility of a media stunt or black-swan reversal, I modestly revise my forecast to 2%.",
            "revised_probability": 2
        },
        "CommunicationStudiesAgendaSettingTheory": {
            "my_phase1_final_probability": 8,
            "reasoning_for_revised_probability": "After reviewing group deliberation, I find even more reinforcement for a low probability than in my initial analysis. The critiques—especially from regional and political opportunity perspectives—consistently highlight both Morgan’s continued avoidance of formal entry and the structural/cultural realities that make last-minute billionaire candidacies even less plausible than a surface-level reading of 'maverick' historical examples might suggest. The consensus is that logistical, narrative, and field-closure barriers are nearly insurmountable in the next three weeks, and that Morgan’s own public behavior emphasizes party-building and agenda creation, not sudden campaign launches. My earlier 8% was perhaps already a touch generous to account for Morgan’s unpredictability and resources; after considering further specialist arguments and the totality of group consensus, it becomes very clear that the plausibility—short of black swan events—is closer to the lower end of the range informed by base rates and observable messaging. Therefore, I revise down to 5%.",
            "revised_probability": 5
        },
        "CommunicationStudiesFramingTheory": {
            "my_phase1_final_probability": 7,
            "reasoning_for_revised_probability": "Upon reviewing the group deliberation, especially the critiques of Rational Choice Theory and repeated defenses of structural, regional, campaign, and communication-based arguments, I see even broader consensus for an extremely low probability—potentially even below my initial 7%. Deliberators across regional, candidate emergence, campaign, and communication perspectives all highlighted the closed 'windows' for narrative disruption, the practical and reputational risks of a late third-party entry, and the overwhelming media framing of Morgan as a party architect, not an imminent candidate. The critique of Rational Choice Theory persuasively exposes the mistake of overweighting a billionaire's latent unpredictability against a backdrop of coordinated anti-announcement signals, narrative closure (thanks to Jolly's entrance), and a lack of concrete campaign infrastructure. While a 'black swan' cannot be entirely ruled out (Morgan is still answering press inquiries and could, in theory, surprise), the collective argument is that such late, high-profile moves are nearly always empty noise. This holistic cross-disciplinary consensus convinces me to nudge my probability downward to best reflect these lessons.",
            "revised_probability": 4
        },
        "RegionalStudiesFloridaPoliticalCulture": {
            "my_phase1_final_probability": 3,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I am even more confident that my initial assessment was sound—and if anything, additional perspectives from Southern tradition and candidate emergence literature strengthen my estimate. The only argument for a higher probability (as offered by Rational Choice Theory) hinges on billionaire unpredictability, but this is outweighed by the empirical, structural, and cultural points made by other forecasters: deep skepticism about late entries, a closing narrative and agenda-setting window, and a pattern of non-announcement by Florida trial-ballooners. No new substantive evidence or reasoning emerged to justify even a small upward revision. If anything, base rates and the closure of the centrist lane to Jolly, plus Morgan's deep engagement in building a party rather than setting up a campaign, reinforce the 'No' baseline. Therefore, my probability remains at 3%.",
            "revised_probability": 3
        },
        "RegionalStudiesSouthernPoliticsTradition": {
            "my_phase1_final_probability": 6,
            "reasoning_for_revised_probability": "Having reviewed the group deliberation, I see strong reinforcement of my initial logic from both regional studies and campaign consulting perspectives, all of which point to an extremely low likelihood of a John Morgan announcement before July 1. The only relative outlier was Rational Choice Theory, holding at 10% but repeatedly criticized for overestimating Morgan's autonomy and not grounding its view in regional precedent or observed political structures. Defensive and supportive commentary focused almost entirely on the enduring power of party systems in the South, Morgan's own signaling, and the closing off of narrative and strategic lanes (especially with Jolly's declaration). The critiques of the higher probability essentially underscore and deepen the evidence base for a very low estimate. Nothing substantive arose to suggest upward revision, and several arguments actually endorse pushing the probability even lower. However, to respect a minuscule chance of true billionaire unpredictability (given Morgan's idiosyncratic style), I will maintain—but not lower—my 6% estimate, slightly below most outlier pessimists and consistent with the overwhelming consensus for 'No.'",
            "revised_probability": 6
        }
    },
    "revision_probability": [
        5,
        7,
        7,
        3,
        2,
        5,
        4,
        3,
        6
    ],
    "revision_mean_probability": 4.666666666666667,
    "revision_sd": 1.8027756377319946,
    "revision_probability_result": 5,
    "question_details": {
        "id": 37614,
        "title": "Will John Morgan announce his candidacy for Florida governor before July 1, 2025?",
        "description": "Politico: [John Morgan lays out campaign blueprint for possible Florida governor run](https://www.politico.com/news/2025/05/15/john-morgan-florida-governor-run-00351005)",
        "created_at": "2025-05-31T04:11:49.998284Z",
        "open_time": "2025-06-06T04:00:00Z",
        "cp_reveal_time": "2025-06-06T06:00:00Z",
        "spot_scoring_time": "2025-06-06T06:00:00Z",
        "scheduled_resolve_time": "2025-07-01T00:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-06-06T06:00:00Z",
        "actual_close_time": "2025-06-06T06:00:00Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 0.9,
        "resolution_criteria": "This question resolves as **Yes** if John Morgan announces his candidacy for governor of Florida before July 1, 2025. If no such announcement has been made before that date, the question resolves as **No**.",
        "fine_print": "",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_max": null,
            "range_min": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "post_id": 38338,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {}
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {}
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {}
            }
        },
        "nr_forecasters": 75,
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**David Jolly Announces Democratic Candidacy for Florida Governor**\nDavid Jolly, a 52-year-old former Republican congressman, has announced his candidacy as a Democrat to govern Florida. Jolly, who represented Florida's 13th Congressional District from 2014 to 2017, left the Republican Party in 2018 due to disagreements with Donald Trump's ideas. Despite the challenges Democrats face in winning the election next year, Jolly decided to run as the Democratic candidate. 'Let's end the politics of division and return Florida to voters who simply want a working economy, the best education system in the world, safe communities, and a government that stays out of our medical consultations and family decisions,' he said. When asked about his past as a Republican, Jolly stated that he never fully agreed with the party's principles and decided to end his relationship with them. 'It cost me to exercise those values in the Republican Party. The real registration as a Democrat was not a change. It was a formality,' he said. Jolly's mission to become the governor of Florida is complicated, as Republicans have made it a stronghold for over two decades. However, Jolly's path is clear after Jason William Barnet Pizzo, a former state senator, announced his candidacy as an independent candidate. 'We can clean up corruption in Tallahassee. It's time for women and doctors to make healthcare decisions, not politicians. We can resolve affordability crises, reduce costs, and lower insurance rates,' Jolly warns on his website.\nOriginal language: es\nPublish date: June 05, 2025 09:35 PM\nSource:[La Opinión Digital](https://laopinion.com/2025/06/05/david-jolly-excongresista-republicano-se-postula-como-candidato-democrata-a-gobernador-de-florida/)\n\n**Former U.S. Rep. David Jolly announces run for Florida governor**\nFormer U.S. Rep. David Jolly announced his candidacy for the Democratic nomination for Florida governor, citing the state's affordability crisis as a major issue. Jolly stated, 'We have an affordability crisis in Florida driven by an insurance crisis that continues to worsen in the face of complete neglect by Tallahassee. We have abandoned public education, and we've allowed corruption to run rampant. It's time for a change.' Despite the long odds, Jolly will face competition from other candidates, including Southwest Florida Congressman Byron Donalds, who has already launched his campaign for the GOP nomination, and Florida First Lady Casey DeSantis, who is considering a run. Florida's primary election is scheduled for August 18, 2026, with the general election on November 3, 2026.\nOriginal language: en\nPublish date: June 05, 2025 03:16 PM\nSource:[https://www.wcjb.com](https://www.wcjb.com/2025/06/05/former-us-rep-david-jolly-announces-run-florida-governor/)\n\n**What Pinellas' David Jolly brings to Florida's governor race | Column**\nDavid Jolly, a former congressman from Pinellas County, has announced his candidacy for Florida governor in 2026. Jolly, who switched from the Republican Party to the Democratic Party in April, is running on a moderate agenda that focuses on affordability, education, and economic growth. He has proposed reforms such as creating a state catastrophic fund to ease insurance premiums and giving Florida students better access to state colleges and universities. Jolly's appeal lies in his ability to work across the aisle and build a coalition to address concerns across a broad front. However, his biggest challenge is his own party, as registered Republicans outnumber Democrats in Florida. Jolly will need to break through the new mediascape and convince Democrats that he is genuinely one with them. As Jolly said, 'I've been out of politics long enough to tell the truth. Some of our leaders escalate problems instead of de-escalating them. We have to de-escalate division.'\nOriginal language: en\nPublish date: June 05, 2025 10:07 AM\nSource:[Tampa Bay Times](https://www.tampabay.com/opinion/2025/06/05/what-pinellas-david-jolly-brings-floridas-governor-race-column/)\n\n**Jolly takes the plunge into wide open field**\nDavid Jolly, a former Republican congressman, has officially filed to run for governor of Florida as a Democrat. Jolly's decision comes at a time when the Democratic field is relatively empty, with no other notable candidates having announced their intention to run. Jolly's campaign aims to unify the party and attract unaffiliated voters and Republicans. He believes that the 2026 cycle will be a 'change election' driven by Trump's policies and the unaffordability of Florida under GOP leadership. Jolly has already spoken with state Sen. Jason Pizzo, who plans to run as an independent, and has expressed respect for Pizzo's decision. Meanwhile, the state legislature is in the midst of budget negotiations, with several key issues still unresolved, including funding for state parks, the Florida Wildlife Corridor, and the Holocaust museum. Additionally, a federal judge has placed a temporary halt on part of a new law tightening Florida's control over ballot initiatives.\nOriginal language: en\nPublish date: June 05, 2025 06:59 AM\nSource:[POLITICO](https://www.politico.com/newsletters/florida-playbook/2025/06/05/jolly-takes-the-plunge-into-wide-open-field-00388857)\n\n**David Jolly Announces Democratic Candidacy for Florida Governor**\nDavid Jolly, a 52-year-old former Republican congressman, has announced his candidacy as a Democrat to govern Florida. Jolly, who represented Florida's 13th Congressional District from 2014 to 2017, left the Republican Party in 2018 due to disagreements with Donald Trump's ideas. Despite the challenges Democrats face in winning the election next year, Jolly decided to run as the Democratic candidate. 'Let's end the politics of division and return Florida to voters who simply want a working economy, the best education system in the world, safe communities, and a government that stays out of our medical consultations and family decisions,' he said. When asked about his past as a Republican, Jolly stated that he never fully agreed with the party's principles and decided to end his relationship with them. 'It cost me to exercise those values in the Republican Party. The real registration as a Democrat was not a change. It was a formality,' he said. Jolly's mission to become the governor of Florida is complicated, as Republicans have made it a stronghold for over two decades. However, Jolly's path is clear after Jason William Barnet Pizzo, a former state senator, announced his candidacy as an independent candidate. 'We can clean up corruption in Tallahassee. It's time for women and doctors to make healthcare decisions, not politicians. We can resolve affordability crises, reduce costs, and lower insurance rates,' Jolly warns on his website.\nOriginal language: es\nPublish date: June 05, 2025 09:35 PM\nSource:[La Opinión Digital](https://laopinion.com/2025/06/05/david-jolly-excongresista-republicano-se-postula-como-candidato-democrata-a-gobernador-de-florida/)\n\n**Former Republican Congressman David Jolly to Run for Florida Governor as Democrat**\nFormer Republican congressman David Jolly has announced his candidacy for governor of Florida as a Democrat. Jolly, a critic of Donald Trump, believes that issues such as affordability, public school funding, and campaign finance reform will resonate with voters in 2026. He predicts that the elections next year will signal a national change. 'I think the Republicans in Tallahassee have gone too far in dividing us. I think we should take the politicians out of the classrooms and the doctor's offices,' said Jolly. 'I think many people in Florida, even some Republicans, now understand that the cultural wars have gone too far,' he added. Jolly, a lawyer and former state representative, has undergone a political evolution that led him to leave the Republican Party in 2018 and become an independent and later a registered Democrat. He has gained a national profile as an anti-Trump commentator on MSNBC. Jolly said he has considered himself 'part of the Democratic coalition' for about five years and believes in what he considers the 'fundamental values' of the party: that government can help people, that the economy should be 'just' for all, and that immigrants should be celebrated. 'It cost me to exercise those values in the Republican Party,' Jolly said, and continued: 'Registering as a Democrat was not a radical change. It was a formality.' Jolly has distanced himself from his former party on the issue of immigration, while Florida lawmakers rush to help Trump fulfill his promise of mass deportations. Jolly harshly criticized Republicans, who, according to him, have 'combined immigration and crime,' which he described as incorrect and immoral.\nOriginal language: es\nPublish date: June 05, 2025 03:25 PM\nSource:[telemundo51.com](https://www.telemundo51.com/noticias/local/david-jolly-excongresista-republicano-se-postulara-para-gobernador-de-florida-como-democrata/2664341/)\n\n**Former U.S. Rep. David Jolly announces run for Florida governor**\nFormer U.S. Rep. David Jolly announced his candidacy for the Democratic nomination for Florida governor, citing the state's affordability crisis as a major issue. Jolly stated, 'We have an affordability crisis in Florida driven by an insurance crisis that continues to worsen in the face of complete neglect by Tallahassee. We have abandoned public education, and we've allowed corruption to run rampant. It's time for a change.' Despite the long odds, Jolly will face competition from other candidates, including Southwest Florida Congressman Byron Donalds, who has already launched his campaign for the GOP nomination, and Florida First Lady Casey DeSantis, who is considering a run. Florida's primary election is scheduled for August 18, 2026, with the general election on November 3, 2026.\nOriginal language: en\nPublish date: June 05, 2025 03:16 PM\nSource:[https://www.wcjb.com](https://www.wcjb.com/2025/06/05/former-us-rep-david-jolly-announces-run-florida-governor/)\n\n**'Radical Leftist': Byron Donalds Laughs Off Never Trumper Ex-GOP Rep Running For FL Gov As Dem**\nFormer Republican Rep. David Jolly announced his candidacy for the 2026 Florida gubernatorial race as a Democrat. Jolly, a longtime critic of President Donald Trump and Florida Gov. Ron DeSantis, stated that Florida is in crisis and needs a change. Florida Republican Rep. Byron Donalds, the Trump-endorsed frontrunner, referred to Jolly as 'an anti-Trump, radical leftist' and said he is 'completely out of touch with Florida's voters and our values.' Donalds added that he will fight side by side with Trump to protect Florida families and Make America Great Again. The Florida Republican Party also criticized Jolly, calling him a 'flip-flopping political relic' and stating that Floridians won't be swayed by his candidacy.\nOriginal language: en\nPublish date: June 05, 2025 03:01 PM\nSource:[IJR](https://ijr.com/radical-leftist-byron-donalds-laughs-off-never-trumper-ex-gop-rep-running-for-fl-gov-as-dem/)\n\n**Republican turncoat announces Democrat bid for Florida governor’s seat**\nFormer Republican David Jolly, who represented the Tampa Bay area in the U.S. House of Representatives from 2014 to 2017, has announced his bid to run for the Florida governor's seat in 2026. Jolly, who has since turned Democrat, is looking to take the position of term-limited Governor Ron DeSantis in the heavily red state of Florida. According to reports, Jolly's campaign is expected to be a significant challenge, with Florida's Republican stronghold and DeSantis' popularity in the state.\nOriginal language: en\nPublish date: June 05, 2025 10:50 AM\nSource:[dnyuz.com](https://dnyuz.com/2025/06/05/republican-turncoat-announces-democrat-bid-for-florida-governors-seat/)\n\n**What Pinellas' David Jolly brings to Florida's governor race | Column**\nDavid Jolly, a former congressman from Pinellas County, has announced his candidacy for Florida governor in 2026. Jolly, who switched from the Republican Party to the Democratic Party in April, is running on a moderate agenda that focuses on affordability, education, and economic growth. He has proposed reforms such as creating a state catastrophic fund to ease insurance premiums and giving Florida students better access to state colleges and universities. Jolly's appeal lies in his ability to work across the aisle and build a coalition to address concerns across a broad front. However, his biggest challenge is his own party, as registered Republicans outnumber Democrats in Florida. Jolly will need to break through the new mediascape and convince Democrats that he is genuinely one with them. As Jolly said, 'I've been out of politics long enough to tell the truth. Some of our leaders escalate problems instead of de-escalating them. We have to de-escalate division.'\nOriginal language: en\nPublish date: June 05, 2025 10:07 AM\nSource:[Tampa Bay Times](https://www.tampabay.com/opinion/2025/06/05/what-pinellas-david-jolly-brings-floridas-governor-race-column/)\n\n**Ex- GOP Congressman David Jolly Announces Run For Florida Governor, As A Dem**\nFormer Republican Congressman David Jolly has announced his bid to become the first Democrat in Tallahassee's governor's mansion since 1998. Jolly, who served three years in the House representing a Tampa Bay district, said 'Something is happening in Florida' and that 'We've got a shot in this governor's race.' He left the Republican Party in 2018, after its takeover by President Donald Trump, and formally registered as a Democrat in late April. Nikki Fried, the chair of the Florida Democratic Party, said that Jolly has impressed her with his willingness to go everywhere and talk to everyone, but that he will need validators from the progressive community and to persuade hardcore Democrats that he truly is one of them. Jolly said that Democrats nationally understand the importance of Florida in the elections to come, and that 'If we win the governor's race in '26, the road to the White House runs through Florida in 2028.' However, Republicans say that Jolly faces a steep hill and will need a large and steady influx of soft money and outside support to win the Democratic nomination.\nOriginal language: en\nPublish date: June 05, 2025 08:14 AM\nSource:[HuffPost](https://www.huffpost.com/entry/david-jolly-florida-governor_n_6840ac83e4b0280f7518680a)\n\n**Former Congressman David Jolly is running for Florida governor**\nFormer Republican Congressman David Jolly, now a registered Democrat, has announced his bid for Florida governor in 2026. Jolly cited economic concerns, including rising property insurance and utility rates, as key motivators for entering the race. He believes there is a viable path for a Democrat to win statewide, despite the Republican Party's massive voter advantage. Jolly, a vocal Trump critic, says his decision to align with the Florida Democratic Party is a continuation of his 'political evolution.' He plans to visit with traditional Democratic supporters as well as groups he says have 'been ignored' by statewide Dems, including churchgoers and gun owners. Jolly pushed back on comparisons to former Republican Gov. Charlie Crist, saying 'I have become a Democrat out of conviction,' and 'I've changed. I've grown.' He enters the race as the highest profile Democrat to throw their hat in the ring, with Congressman Byron Donalds already running on the Republican side with the backing of President Donald Trump.\nOriginal language: en\nPublish date: June 05, 2025 08:00 AM\nSource:[WTSP 10](https://www.wtsp.com/article/news/politics/david-jolly-running-florida-governor/67-fe87050c-fde3-4f88-b4a0-c264ed4f4a48)\n\n**Jolly takes the plunge into wide open field**\nDavid Jolly, a former Republican congressman, has officially filed to run for governor of Florida as a Democrat. Jolly's decision comes at a time when the Democratic field is relatively empty, with no other notable candidates having announced their intention to run. Jolly's campaign aims to unify the party and attract unaffiliated voters and Republicans. He believes that the 2026 cycle will be a 'change election' driven by Trump's policies and the unaffordability of Florida under GOP leadership. Jolly has already spoken with state Sen. Jason Pizzo, who plans to run as an independent, and has expressed respect for Pizzo's decision. Meanwhile, the state legislature is in the midst of budget negotiations, with several key issues still unresolved, including funding for state parks, the Florida Wildlife Corridor, and the Holocaust museum. Additionally, a federal judge has placed a temporary halt on part of a new law tightening Florida's control over ballot initiatives.\nOriginal language: en\nPublish date: June 05, 2025 06:59 AM\nSource:[POLITICO](https://www.politico.com/newsletters/florida-playbook/2025/06/05/jolly-takes-the-plunge-into-wide-open-field-00388857)\n\n**John Morgan Considers Run for Governor of Florida, Promises New Party for Centrist Voters**\nJohn Morgan, a billionaire lawyer and founder of the largest personal injury law firm in the US, has announced that he may run for governor of Florida in 2026. Morgan, who has a net worth of $1.5 billion, has been evaluating a potential candidacy for months. He has stated that the current bipartisan system 'is broken' and that his new party, which he is creating, could be the solution for those who feel 'trapped' between Democrats and Republicans. Morgan has a history of creating provocative ads, which have made him a well-known figure in the US. He has announced that his new party will aim to attract voters who feel disillusioned with the current system. Morgan has stated that he will not run as an independent and that his campaign will be brief, lasting only three months. He has expressed that he will wait to see who else will run before making a decision.\nOriginal language: es\nPublish date: May 16, 2025 07:48 AM\nSource:[La Nacion](https://www.lanacion.com.ar/estados-unidos/florida/adios-desantis-en-florida-quien-es-el-millonario-john-morgan-otro-posible-candidato-para-la-nid16052025/)\n\n**John Morgan lays out campaign blueprint for possible Florida governor run**\nJohn Morgan, a wealthy and successful campaigner, is considering a run for Florida governor. Morgan criticized Democrats, Gov. Ron DeSantis, and the state Legislature, saying they prioritize special interests over residents' problems. He believes income inequality is the country's defining problem, saying 'People can't afford to live.' Morgan has already proven his campaigning skills as the architect and primary funder of ballot initiatives that raised the state's minimum wage and legalized medical marijuana. He is willing to spend time and money on a campaign, but wants to see how other potential candidates fare before deciding. Morgan plans to launch a third party to represent those in the middle who are not aligned with the far-left and far-right wings of the Democratic and Republican Parties, saying 'We're stuck in the middle and we don't have a voice, any voice, but yet we have a lot to say but we're paralyzed.' \nOriginal language: en\nPublish date: May 15, 2025 10:28 AM\nSource:[POLITICO](https://www.politico.com/news/2025/05/15/john-morgan-florida-governor-run-00351005)\n\n**Attorney John Morgan continues to flirt with Florida gubernatorial run**\nBillionaire personal injury attorney John Morgan has been considering a run for Florida governor in 2026. He recently spoke at a luncheon in Tallahassee, stating that the current political system is missing a third party, as Republicans and Democrats are too extreme. Morgan believes a new party should focus on reducing economic inequality and helping everyday people. He has clashed with Gov. Ron DeSantis and other Republicans over his financial backing and advocacy of several ballot initiatives. Morgan is uncertain about running for governor, but if he does, it will be under a new party he is planning to launch. He plans to wait and see the field of candidates before making a decision, saying, 'When they start coming down the stretch, that's when you have a good idea how that race is going to finish.' \nOriginal language: en\nPublish date: May 15, 2025 09:40 AM\nSource:[wusf.org](https://www.wusf.org/politics-issues/2025-05-15/john-morgan-continues-to-flirt-with-florida-gubernatorial-run)\n\n**Morgan and Morgan and ... governor?**\nJohn Morgan, a famous attorney and founder of the nation's largest injury firm, is considering a run for Florida governor in 2026. Morgan, who has already proven to be a successful campaigner, has been teasing a potential candidacy for months. He criticized Democrats and Gov. Ron DeSantis, saying that income inequality is the defining problem in the country today. Morgan also expressed his willingness to spend time and money to mount a campaign, but admitted that he goes back and forth about the idea. He wants to see how other potential candidates fare before jumping in. Morgan also announced plans to launch a third party to represent those in the middle who are not aligned with the far-left and far-right wings of the Democratic and Republican Party.\nOriginal language: en\nPublish date: May 15, 2025 06:59 AM\nSource:[POLITICO](https://www.politico.com/newsletters/florida-playbook/2025/05/15/morgan-morgan-governor-00350949)\n\n**Orlando attorney John Morgan won’t say he’s running for governor. But he is starting a new party**\nOrlando attorney John Morgan has announced that he is starting a new political party, but has not ruled out running for governor in 2026. Morgan, known for his 'For the People' slogan and his efforts to legalize medical marijuana and raise the minimum wage in Florida, said that he is taking a wait-and-see approach before deciding whether to enter the gubernatorial race. He criticized both the Republican and Democratic parties, saying that they have failed Floridians and that there needs to be a team for those who are alienated by both parties. Morgan has the political savvy to start a statewide party, having successfully run two statewide campaigns, and has already spent money on a consultant to help file the paperwork to start a new party. He plans to recruit enough candidates to make the party viable and then ask people to join. Morgan said, 'There has to be a team for all of us stuck in the middle.' He also mentioned that he may turn around and find nobody is marching behind him down Main Street, but that's okay.\nOriginal language: en\nPublish date: May 14, 2025 08:53 PM\nSource:[orlandosentinel.com](https://www.orlandosentinel.com/2025/05/14/orlando-attorney-john-morgan-wont-say-hes-running-for-governor-but-he-is-starting-a-new-party/)\n\n**Orlando attorney John Morgan won't say he's running for governor. But he is starting a new party**\nOrlando attorney John Morgan, known for his 'For the People' slogan and successful ballot initiatives, has announced that he will not run for governor in 2026. However, he plans to start a new party, which he believes will be a 'team for all of us stuck in the middle.' Morgan, who has a history of investing his own money in campaigns, has already spent money on a consultant to help file the paperwork for the new party. He plans to hold a contest to come up with a name for the party and award a cash prize to the winner. Morgan believes that the current two-party system has failed Floridians and that his new party will provide an alternative for those who are alienated by both Republicans and Democrats. 'There has to be a team for all of us stuck in the middle,' Morgan said. 'There's a whole bunch of us. Maybe more of us than them to the left and the right that are stuck in the middle.'\nOriginal language: en\nPublish date: May 14, 2025 05:28 PM\nSource:[SunSentinel](https://www.sun-sentinel.com/2025/05/14/orlando-attorney-john-morgan-wont-say-hes-running-for-governor-but-he-is-starting-a-new-party/)\n\n**Three-way governor's race ahead**\nState Sen. Jason Pizzo has announced his intention to run for governor of Florida as an independent, with a campaign budget of $25 million. Pizzo's candidacy has raised concerns among Democrats, who fear he will split their vote and make it easier for Republicans to win. Prominent trial attorney John Morgan, who is also considering a run for governor, has expressed doubts about Pizzo's chances, saying it will take a 'perfect storm' for him to win. Meanwhile, the Republican Party of Florida has proposed a budget and tax summit to try to resolve the state's budget impasse, and Attorney General James Uthmeier has filed a motion to appeal a federal judge's ruling on a key provision of Florida's new immigration law.\nOriginal language: en\nPublish date: May 12, 2025 06:59 AM\nSource:[POLITICO](https://www.politico.com/newsletters/florida-playbook/2025/05/12/three-way-governors-race-ahead-00341474)\n\n**Democratic donor John Morgan launches new political party ahead of possible run for Florida governor**\nProminent attorney John Morgan has announced plans to launch a new political party, citing the need for a third choice beyond the two-party system. Morgan, a supporter of President Joe Biden but not Vice President Kamala Harris, has expressed frustration with the current system, saying 'People... we are all on the same f---ing team.' He has floated the idea of potentially running for governor in Florida, which will hold its next gubernatorial election in 2026. Morgan has been registered as an independent for years and has expressed admiration for politicians such as former President Barack Obama and Rep. Nancy Pelosi, D-Calif. 'For me, it's going to be giving to people, not party,' he said, adding that he plans to register his new party as '#ForThePeople.'\nOriginal language: en\nPublish date: February 28, 2025 07:59 PM\nSource:[Yahoo](https://www.yahoo.com/news/democratic-donor-john-morgan-launches-162149612.html)\n\n**Florida attorney and megadonor John Morgan says he's starting a new political party**\nFlorida attorney and megadonor John Morgan has announced plans to start a new political party, which he believes will give voters a third choice and allow for compromise. Morgan, who has been critical of politicians on both sides of the aisle, has been a major contributor to Democratic campaigns and has helped bankroll successful ballot measures in Florida. He acknowledged that his plan may be a 'pipe dream' but believes there's appetite for an alternative party. Morgan listed tackling property insurance problems and legalizing recreational marijuana as issues that transcend party lines. He is also considering a potential run for Governor in 2026, but has not ruled out the possibility of someone else being the nominee for his party.\nOriginal language: en\nPublish date: February 27, 2025 05:39 PM\nSource:[firstcoastnews.com](https://www.firstcoastnews.com/article/news/politics/florida-john-morgan-new-political-party/67-c4c2656b-c8cd-48ab-a01e-7ffe8afa9a06)\n\n**John Morgan, famed Florida attorney, wades further into 2026 political fray**\nJohn Morgan, a well-known Florida attorney and face of Morgan & Morgan, has announced plans to create a new political party, citing the need for a third option beyond the current two-party system. Morgan, who has previously considered a run for governor, stated that the current system is 'broken due to Gerrymandering and divisive issues on both sides.' He expressed his desire for a party that doesn't rely on labels, saying, 'No labels is not an option. Everyone wants a team or tribe.' This move comes as speculation grows about the 2026 gubernatorial race, with several potential candidates already throwing their hats into the ring, including U.S. Representative Byron Donalds and possibly Gov. Ron DeSantis' wife, Casey DeSantis.\nOriginal language: en\nPublish date: February 27, 2025 04:21 PM\nSource:[wftv.com](https://www.wftv.com/news/local/john-morgan-famed-florida-attorney-wades-further-into-2026-political-fray/F4O4W6FEP5C6BFOQD3M2RGEQHU/)\n\n**Is John Morgan running for governor? Attorney starts new political party amid speculation**\nFlorida trial lawyer John Morgan has announced his plan to start a new political party, the 'Capitalist Party', amid speculation that he may run for governor in 2026. Morgan, a longtime Democratic fundraiser, made the announcement on X, stating that the two-party system is 'broken due to Gerrymandering and divisive issues... both sides.' He has previously considered running as an independent, but has now decided to form his own party. Morgan's move comes as Florida's political landscape shifts towards Republican dominance, with Governor Ron DeSantis's term set to end in 2026. Other potential candidates for the governor's seat include Representative Byron Donalds, who announced his candidacy on Tuesday, and Casey DeSantis, the wife of Governor DeSantis.\nOriginal language: en\nPublish date: February 27, 2025 12:05 PM\nSource:[India Today](https://www.indiatoday.in/world/shows/story/the-buzz-is-john-morgan-running-for-governor-attorney-starts-new-political-party-amid-speculation-glbs-2686511-2025-02-27)\n\n",
    "date": "2025-06-06T04:34:01.061788",
    "summary": "All experts, from diverse fields such as campaign consulting, journalism, political science, communication studies, and regional studies, assign a very low probability (ranging from 3% to 10%) that John Morgan will announce his candidacy for Florida governor before July 1, 2025. The consensus reasoning rests on several key factors: \n\n- Morgan has not yet announced and is focused on launching a new centrist party, rather than a direct gubernatorial campaign.\n- He has publicly stated a 'wait-and-see' approach, consistently signaling indecision and hesitancy in his messaging.\n- The recent entry of prominent candidates such as David Jolly (Democrat) and Jason Pizzo (Independent) has crystallized the field, making a late Morgan entry less strategically advantageous.\n- Logistical and organizational challenges of launching a credible campaign and new party within such a short time frame are seen as formidable.\n- Multiple analysts point to Morgan’s pattern of teasing runs in previous cycles, only to ultimately refrain from entering the race.\n- The historical base rate for ultra-late, high-profile entry—especially from non-traditional or billionaire candidates—is extremely low in Florida politics.\n- While Morgan's wealth and media profile theoretically enable a rapid pivot, none see significant current movement towards an imminent announcement; all signals and press coverage underline party-building, not campaign launch.\n\nYes-scenarios are generally described as highly contingent, 'black swan' events (e.g., a major rival's implosion or an unexpected surge in demand), but these are universally deemed unlikely. The consensus, reflected across all expert analyses, is that Morgan is extremely unlikely to announce a gubernatorial run before the deadline, with the most common forecast clustered at 3-7% probability."
}