{
    "deliberation_results": {
        "DiplomacyTreatynegotiationprocedure": {
            "time_to_resolution": "Approximately 1 month (resolves on July 1, 2025; today is May 29, 2025)",
            "perspective_relevance": "As an expert in Diplomacy (TreatyNegotiationProcedure), I bring a nuanced understanding of multilateral treaty accession dynamics, including bureaucratic timelines, domestic review, strategic signals, and how symbolic/soft-power treaties like the Artemis Accords are handled at both technical and political levels. This insight will ground judgment in realistic pathways to signature, timing bottlenecks, and the frequency of similar diplomatic acts.",
            "status_quo": "In recent months, the Artemis Accords have seen new signatories at a rate of 1 to 2 per month (Bangladesh in April 2025, Norway in May 2025). There is no public indication of specific upcoming signatories for June, but past momentum is strong.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent Accession Pace",
                    "effect": "Increases probability",
                    "explanation": "With two new signatories in the past two months, base rates suggest a strong likelihood that at least one additional country would join during June if the momentum holds."
                },
                {
                    "factor": "Diminishing Pool of Prospective Signatories",
                    "effect": "Decreases probability",
                    "explanation": "With 55 current signatories (already including much of the US-aligned, European, and middle-power spaceflight hopefuls), the pool of unaligned, capable, or interested countries is shrinking, making future accessions more sporadic."
                },
                {
                    "factor": "Symbolic and Low-Cost Entry",
                    "effect": "Increases probability",
                    "explanation": "The Artemis Accords is a soft-power/diplomatic instrument with low political or economic cost to join, making it likely for states to sign even without immediate national capacity for space activity."
                },
                {
                    "factor": "Diplomatic Calender and Events",
                    "effect": "Slightly increases probability",
                    "explanation": "With Baku Energy Week and the Venice Architecture Biennale (both in June) featuring wide international participation—including several countries not yet signatories—opportunity exists for announcements in diplomatic margins."
                },
                {
                    "factor": "Geopolitics and Non-Alignment",
                    "effect": "Increases probability on the margins",
                    "explanation": "States seeking to signal alignment with the US or Western-led space norms (or distance from Russia/China space postures) may use signing as a symbolic move; recent signatories include countries outside the immediate circle of established space actors."
                },
                {
                    "factor": "Administrative Lags and Political Distractions",
                    "effect": "Decreases probability",
                    "explanation": "Domestic or regional crises, bureaucratic steps (inter-ministry coordination, ratification, ceremonial scheduling) can delay formal signature, pushing an interested country’s signing outside the narrow June window."
                }
            ],
            "no_scenario": "No country completes the domestic clearance and formal signature process within June 2025—either because no candidate country is at a point of readiness or administrative/political scheduling delays push the next signing into July or later. For example, a country might intend to sign but not finish internal reviews or schedule a public signing ceremony in time.",
            "yes_scenario": "A country—particularly one attending a major multilateral event in June, or which has recently signaled US alignment or support for space cooperation (e.g., from Asia, Africa, or Latin America)—moves from private intent to public action and signs the Artemis Accords, possibly capitalizing on diplomatic visibility at a June international event for the announcement.",
            "final_reasoning": "Base rates show the Artemis Accords are adding about 1 country per month. Given that recent accessions (Bangladesh, Norway) suggest ongoing diplomatic outreach and that diplomatic signing ceremonies are often timed to coincide with major international events (several such events are scheduled in June 2025), the status quo odds are above 50%. Still, as the list of prospective signatories not already on board is shrinking, and as signature often lags behind intention due to domestic/procedural delays, it would be unusual for a long dry spell at this stage but still possible for a single month to pass without a new signature. Balancing these factors—the steady pace, diminishing pool, and diplomatic/administrative calendar—a probability between 60% and 70% best reflects reality but rewards boldness. I judge a 68% chance a country will sign the Artemis Accords in June 2025.",
            "final_probability": 68
        },
        "SpacelawInternationalspacetreatypractice": {
            "time_to_resolution": "About 1 month (from May 29, 2025 to June 30, 2025)",
            "perspective_relevance": "As an expert in SpaceLaw (especially InternationalSpaceTreatyPractice), I can assess trends in international diplomatic engagement with the Artemis Accords. My knowledge includes the decision-making processes states use when evaluating space governance agreements and I can interpret base rates, patterns of accessions, diplomatic signaling, and the play of geopolitical events against the context of recent signatories. I am attuned to the ongoing diplomatic efforts by the US and partners to broaden the Accords’ reach, as well as national space ambitions and constraints.",
            "status_quo": "In recent months, the Artemis Accords have had frequent new signatories—Bangladesh and Norway joined in April and May 2025. There are currently 55 signatories. The status quo if nothing changes would be a continued, but possibly decelerating, trickle of states joining at a cadence of every 1-2 months. Signing is generally announced with some diplomatic fanfare, and often clusters around relevant space, diplomatic, or tech events.",
            "perspective_derived_factors": [
                {
                    "factor": "Base Rate of Signatory Accession",
                    "effect": "Increases probability—signings have been occurring at roughly every month or two like clockwork in 2024-25."
                },
                {
                    "factor": "Event-Driven Announcements",
                    "effect": "Slightly increases probability—Baku Energy Week (June 2-4, 2025), and ongoing international summits offer moments for high-profile signings."
                },
                {
                    "factor": "Shrinking Pool of Uncommitted Likely Candidates",
                    "effect": "Decreases probability—as more active space nations have joined, the remaining pool is less relevant or more resistant, less likely to suddenly accede."
                },
                {
                    "factor": "Accelerating US-Led Diplomatic Pressure",
                    "effect": "Increases probability—the State Department and NASA continue strategic outreach, especially to energy-rich and developing countries, and to European and African allies, exploiting events and soft power."
                },
                {
                    "factor": "Geopolitical Headwinds",
                    "effect": "Decreases probability—current events (e.g., heightened support for Palestine by some countries, fissures in EU cohesion, US/China rivalry) could make governments hesitant to visibly align with US initiatives at this moment."
                },
                {
                    "factor": "Recent Examples of Newcomers",
                    "effect": "Increases probability—recent signings by Bangladesh (a less obvious space nation) suggest the bar for accession may be lower and that smaller or less advanced states are being actively brought onboard."
                }
            ],
            "no_scenario": "No country joins in June 2025 (i.e., the total remains frozen at 55 signatories until July 1). This could occur if the remaining candidate countries are hesitant, distracted by diplomatic headwinds, or if the major events (like Baku Energy Week) are not leveraged for such signings. Alternatively, diplomatic priorities in key countries (e.g., elections, crises) take precedence, or negative press/political fallout from recent signings causes governments to postpone accession for optics.",
            "yes_scenario": "A country signs the Artemis Accords in June 2025. This might occur at or near Baku Energy Week (Azerbaijan is not a signatory, nor are several energy/technology aspiring states). Alternatively, an African, Central Asian, or smaller European or Asian nation could join as a result of sustained US or partner pressure, perhaps motivated by promised economic or technical cooperation. Recent newcomers suggest NASA/the US are successfully expanding the tent to less obvious candidates.",
            "final_reasoning": "The base rate is compelling: the Accords have added around one signatory per month in the past year, and two have just joined in April and May 2025. Although the remaining uncommitted pool is thinning and includes more resistant or geopolitically cautious states, sustained diplomatic campaigning (especially timed with international events) raises the odds. Baku Energy Week offers a near-term, high-visibility diplomatic stage. Moreover, the expansion to Bangladesh signals that the US outreach is targeting more diverse and less space-intensive states, possibly as symbolic or alliance-building gestures. Geopolitical turbulence (Middle East, EU rifts) could slow progress, but has not stalled forward momentum this year. Given all this, the likelihood that at least one (likely minor to mid-tier) country will sign in June remains strong, though not quite certain. A probability in the mid to high 70s best reflects these overlapping dynamics.",
            "final_probability": 77
        },
        "UspolicyanalysisUsspacediplomacydoctrine": {
            "time_to_resolution": "Approximately 1 month (from May 29, 2025, to July 1, 2025)",
            "perspective_relevance": "As an expert in US Space Policy Analysis and US Space Diplomacy Doctrine, my perspective brings nuanced understanding of soft power, alliance management, multilateral diplomatic outreach, and the Artemis Accords as tools for US-led space governance and norm-setting. This expertise allows analysis beyond surface-level international events, considering longer-term diplomatic cycles, recent signatory patterns, and US diplomatic strategy.",
            "status_quo": "If nothing changed, the status quo is that new signings continue at a pace of 1-2 countries every 1-2 months, with 55 signatories as of mid-May 2025. Recent signatories include Bangladesh (April 2025) and Norway (May 2025).",
            "perspective_derived_factors": [
                {
                    "factor": "Base rate and momentum of new signatories",
                    "effect": "Increases probability; with 2 signatories in the last 2 months and a pattern of 1-2 per month in 2024-2025, the status quo motion supports the likelihood of a new signature in June."
                },
                {
                    "factor": "Shrinking pool of eligible non-signatory countries",
                    "effect": "Decreases probability; as more countries join, those left tend to have either weak diplomatic engagement with the US, are already locked in rival blocs (notably China/Russia-led space interests), or have limited space/funding capacity."
                },
                {
                    "factor": "Diplomatic event calendar and US outreach",
                    "effect": "Increases probability; June is a geopolitically busy month, including gatherings like Baku Energy Week (Azerbaijan, with diverse diplomatic engagement), international summits, and active US diplomatic pushes ahead of the US election cycle."
                },
                {
                    "factor": "Recent news and hints of international engagement",
                    "effect": "Weakly increases probability; The news highlights numerous international meetings and enhanced engagement with countries like Azerbaijan, Togo, Oman, and others at prominent events. While not direct evidence, these summits can serve as venues for announcements."
                },
                {
                    "factor": "US strategic interests in broadening participation (including Africa, MENA, ASEAN, Eastern Europe)",
                    "effect": "Increases probability; US policy prioritizes onboarding countries not yet in the Accords, especially in Africa, Central Asia, and MENA, as both a diplomatic and norm-setting goal amid US-China space competition."
                },
                {
                    "factor": "Potential spoilers: geopolitics and Israel/Palestine dynamics",
                    "effect": "Decreases probability slightly; news shows heightened sensitivity in diplomatic alignments (e.g., European focus on Palestine/Israel), which may make some states more cautious about public alignment with Washington."
                }
            ],
            "no_scenario": "No new country signs the Artemis Accords in June 2025. Possible scenario: The remaining eligible non-signatories face domestic distractions, lack imminent bilateral summits, or have reasons to avoid a step perceived as aligning with the US in a tense international climate (e.g., reluctance from large emerging states, fence-sitting Middle Eastern or African countries, or Russia/China-aligned states).",
            "yes_scenario": "A country—likely one not yet strongly aligned with US or China in space, and with a moderate-to-strong international profile—signs the Artemis Accords. Possible candidates include an African (e.g. Ghana, Kenya, Morocco), Central Asian, or Southeast Asian state making a public announcement during a major international meeting, leveraging fanfare or bilateral ties. The signing could also be timed to coincide with a summit (e.g., during Baku Energy Week or other diplomatic events), following behind-the-scenes diplomatic work.",
            "final_reasoning": "The base rate of signings is strong: two in the last two months, 55 total, and the US maintains pressure to keep momentum up as a centerpiece of its space diplomacy doctrine. While the pool of potential signatories shrinks over time (making each new signing less likely), the annualized pace remains positive. June is a high-activity period for international diplomacy, with multiple stories noting big multinational gatherings and energetic regional engagement. The US has every incentive to secure a new signatory ahead of an election and in ongoing competition with China’s alternative frameworks. The most likely signatory would be a country not yet in a rival space bloc and not strongly adversarial to the US but seeking international visibility. The diminishing marginal return makes each new signature slightly harder, but with so many active venues and the pattern of 1-2 signings per month, the odds remain in favor. Probability above the pure base rate of 50% but below 85% due to increasing selection bias among non-signatories.",
            "final_probability": 70
        },
        "InternationalrelationsRegimetheory": {
            "time_to_resolution": "Approximately 1 month (between May 30, 2025, and July 1, 2025)",
            "perspective_relevance": "As an expert in International Relations (Regime Theory), I can deliver unique insight into the incentives, institutional dynamics, and normative pressures that drive states to join international agreements like the Artemis Accords. Regime theory suggests that state behavior in such issues is shaped by a combination of material self-interest, international socialization, status-seeking, and the logic of appropriateness. This expertise enables me to critically assess base rates, path dependencies, and which states have motives and opportunities to become signatories in the near term.",
            "status_quo": "No country is scheduled or publicly known to be about to sign the Artemis Accords as of May 29, 2025. Bangladesh and Norway have recently signed (April 8 and May 15, 2025, respectively), bringing the count to 55 signatories.",
            "perspective_derived_factors": [
                {
                    "factor": "Base Rate of New Signatories Per Month",
                    "effect": "Increases probability. Since the Artemis Accords were opened for signature in 2020, over 50 states have joined, averaging about 1 signatory/month in recent years, though with clusters following diplomatic pushes. Two countries joined in a 5-week span recently, suggesting moderate ongoing momentum."
                },
                {
                    "factor": "Expansion Saturation",
                    "effect": "Decreases probability. 55 countries have already joined, covering most US-aligned, space-interested, and cooperative states. Remaining non-signatories are either skeptical of US leadership, lack space capacity, or have conflicting alignments."
                },
                {
                    "factor": "Diplomatic Calendar and International Events",
                    "effect": "Increases probability. Major multilateral events and summits are typical times for high-visibility accord signatures. Baku Energy Week occurs June 2-4, bringing together numerous states, including some not yet signed. Such events provide opportunity and diplomatic theater for announcements."
                },
                {
                    "factor": "Regime Theory Socialization and Normative Spread",
                    "effect": "Slightly increases probability. As more countries join, international legal and social norms build, lowering perceived risk for fence-sitters. There is positive feedback as regimes reach threshold momentum, but only up to the point of resistance from rival regimes (e.g., China/Russia/SCO states and close partners likely abstain)."
                },
                {
                    "factor": "Absence of International Crisis or Major Negative News",
                    "effect": "Neutral to slightly increasing. No major space or US diplomatic crises are currently unfolding that would reduce the willingness of states to sign onto US-led initiatives."
                }
            ],
            "no_scenario": "No country with the willingness and capacity to sign chooses to act in June. This could be due to lack of US diplomatic pressure, scheduling constraints, or because the remaining pool of potentially willing signatories is exhausted for now. Candidate states opt to delay due to domestic preoccupations, alignment with rival powers, or sensitivities around signing so soon after the Norway and Bangladesh accessions.",
            "yes_scenario": "A state with moderate space aspirations and positive relations with the US—possibly a small European, African, Asian, or LATAM country—announces and completes the signature of the Artemis Accords, likely timed with a diplomatic event such as Baku Energy Week or through a bilateral meeting. This could be a state wishing to signal international alignment, attract US goodwill, or commit to peaceful space norms. Examples could include a state like Azerbaijan, Kazakhstan, or a lower-profile EU or African state.",
            "final_reasoning": "The base rate of new signings recently is about 1/month, with Bangladesh (April 8) and Norway (May 15) as the last two; June 2025 thus falls within typical cadence. Most 'easiest' signatories have already joined, but recent acceleration shows continued US outreach and readiness among some outliers. Baku Energy Week presents a plausible diplomatic window for a signature, boosting probability. The pool of non-signatories includes both highly unlikely candidates (antagonistic to the US or supportive of alternative space regimes) and some plausible fence-sitters (e.g., Azerbaijan, Kazakhstan, some African or South Asian countries). No negative shocks or major crises decrease the odds. Taking saturation into account, but also the regime norm feedback and diplomatic opportunity, I judge the probability to be above the base rate but not extreme, reflecting that while the pace is slower, momentum endures and a diplomatic 'event' could be leveraged by the US to secure another signatory. I estimate the probability at 62%.",
            "final_probability": 62
        },
        "InternationalrelationsTwolevelgamestheory": {
            "time_to_resolution": "About 1 month (June 1–30, 2025, today is May 29, 2025)",
            "perspective_relevance": "As a specialist in International Relations with a focus on Two-Level Games Theory, I am able to analyze how both domestic and international pressures shape a country's decision to join multilateral initiatives like the Artemis Accords. I integrate considerations of leader preferences, bureaucratic incentives, public opinion, international status competition, and coalition-building by the United States—providing a framework that goes beyond surface-level diffusion or simple alliance logic.",
            "status_quo": "The typical cadence for new signings in recent quarters is roughly 1–2 per month, with Norway as the most recent (May 15), and Bangladesh before that (April 8). No robust external signals indicate an imminent signing for June at this time, but historically, signings tend to be 'batchy' around major international events or following specific bilateral engagement.",
            "perspective_derived_factors": [
                {
                    "factor": "US Diplomacy and Prioritization",
                    "effect": "Increases probability—if the US State Department is actively working to expand the list of signatories in conjunction with events or anniversaries, new signings are more likely."
                },
                {
                    "factor": "International Competition and Signaling",
                    "effect": "Increases probability—a surge in new signatories can be partially attributed to status-seeking or a desire to signal alignment with US-led frameworks, especially among mid-sized states seeking technological or political ties."
                },
                {
                    "factor": "Domestic Constraints/Political Climate",
                    "effect": "May decrease probability—if a country is undergoing domestic political turmoil, leadership transitions, or legislative gridlock, ratification or accession to new treaties tends to be delayed."
                },
                {
                    "factor": "Event-Driven Bump",
                    "effect": "Increases probability—major space events or summits (e.g., IAC, UN events, Baku Energy Week as per the articles, etc.) often coincide with signings due to media attention and diplomatic presence."
                },
                {
                    "factor": "Base Rate of Signings",
                    "effect": "Slightly increases probability—historically, there is about 1 signing per month, which means that continued expansion is the default expectation absent shock factors."
                },
                {
                    "factor": "Pool of Remaining Non-Signatories",
                    "effect": "Decreases probability—the more countries join, the fewer likely 'easy' additions remain (diminishing-returns effect), so each successive month the base probability should tick slightly down."
                }
            ],
            "no_scenario": "No country signs the Artemis Accords in June 2025 because the remaining group of plausible signatories are either: a) major non-aligned states with ambiguous positions on space governance (China, Russia, etc.), b) countries facing urgent domestic priorities or political instability, c) small states uninterested or unengaged in space policy, or d) states that align with alternative frameworks (e.g., Sino-Russian lunar projects). Other complicating factors—such as limited US diplomatic bandwidth (perhaps absorbed in other international or crisis-oriented activity), no relevant international meeting, or negative spillovers from unrelated multilateral disputes—could also push potential signatories into postponement.",
            "yes_scenario": "A non-signatory (e.g., an African, Asian, or Latin American state, or a smaller European/Caribbean country) with some past engagement in US multilateral initiatives, and perhaps recently courted by US officials, chooses to sign during or shortly after a major political or scientific event (possibly leveraging the diplomatic traffic associated with Baku Energy Week, a G7/UN meeting, or upcoming international treaties anniversaries). Alternatively, a state seeking to signal alignment to the West in a shifting geopolitical landscape (e.g., responding to the benefits other recent signatories have gained or seeking to balance international image after a controversial vote or domestic event) signs in June, potentially as part of a small cluster.",
            "final_reasoning": "Base rate logic (circa one signing per month) still applies, but diminishing returns—fewer obvious remaining candidates—slightly temper that. Because the Artemis Accords continue to accumulate signatories—most recently Norway and Bangladesh, both fairly recent and drawing from a fairly geographically diverse pool—momentum remains. There's no strong evidence from the news that a specific country is poised to sign imminently in June, but Baku Energy Week (June 2–4) will bring together over 39 countries, including a handful of plausible signatories from Central Asia, Africa, and smaller states (e.g., Guinea-Bissau, Azerbaijan, Pakistan)—offering a strong diplomatic window. Furthermore, the US and its coalition partners frequently use major international events as platforms for new signings. No major domestic or international shock appears to threaten further signings imminently. Consequently, the history of regular signings, high salience international engagement in early June, and lack of negative signals make it probable that at least one new country joins the Artemis Accords in June 2025. However, the effect of diminishing pool is non-trivial, so not at the most extreme probability. I forecast: ",
            "final_probability": 71
        },
        "PoliticalscienceRationalchoiceinstitutionalism": {
            "time_to_resolution": "1 month (from May 29 to June 30, 2025)",
            "perspective_relevance": "As an expert in Rational Choice Institutionalism within Political Science, my perspective emphasizes state actors as rational agents, weighing institutional incentives, cost/benefit calculations, reputational dynamics, and the role of international institutions in shaping policy convergence and cooperation. This lens is especially relevant in predicting international agreement accessions like the Artemis Accords, as countries will be motivated by both material interests (access, technology, funding, partnerships) and reputational or signaling considerations (alignment with the US and its allies, signaling a commitment to the rule-based international order, or domestic resource politics).",
            "status_quo": "Roughly one country per month has acceded to the Artemis Accords in early 2025 (Bangladesh in April, Norway in May). There are 55 signatories. The group is diverse: rich and poor, North and South, Global West and emerging states. The US continues to pursue signatories, especially at international events and through bilateral or regional fora.",
            "perspective_derived_factors": [
                {
                    "factor": "Historical Base Rate",
                    "effect": "Moderate increase. The average rate over the past year is around 1 signatory per month, and both March, April, and May saw new joiners. This supports a solid baseline probability above 50%."
                },
                {
                    "factor": "Saturation Effect",
                    "effect": "Moderate decrease. With 55 signatories, many likely candidates have joined, leaving out countries that are either uninterested, face external constraints (Russia, China and their key partners), or lack capacity/interest. The pool of plausible joiners is getting thinner."
                },
                {
                    "factor": "US/International Diplomacy Push",
                    "effect": "Small-moderate increase. The US and core Artemis partners continue active diplomacy and make high-profile pushes at international events (e.g., Baku Energy Week, Venice Biennale). These gatherings are opportunities to lobby and announce new signings."
                },
                {
                    "factor": "Geopolitical Tensions/Polarization",
                    "effect": "Small decrease. The Russia-China bloc and some aligned countries are firmly outside for now. Tensions in the Middle East, over Palestine, or related to International Criminal Court stances might make some states less willing to visibly align with US-led initiatives in June 2025."
                },
                {
                    "factor": "Signaling/Reputational Benefits",
                    "effect": "Small increase. For small-to-midsize developing countries or fence-sitters, the Artemis Accords provide perceived reputational or technological dividends at low cost; joining is a low-risk, pro-technology/pro-cooperation signal."
                }
            ],
            "no_scenario": "No country is announced as a new signatory in June 2025. This could happen if the remaining pool of plausible signatories is not ready or interested, US diplomatic attention is distracted, or announcements are batched for a later high-profile event. Regional crises, domestic distraction, or uncertainty about Artemis project funding/delays could also make states cautious.",
            "yes_scenario": "A state not yet party (possibly from Africa, Asia, or Latin America) formally becomes a signatory, likely coinciding with their delegation at an international event such as Baku Energy Week or the Venice Biennale, or as a result of US/partner lobbying. The signing receives publicity through US and NASA channels and is added to the State Department's Accords list.",
            "final_reasoning": "The base rate (approximately 1 new signatory per month in recent quarters) suggests a high likelihood. While the pool of obvious candidates shrinks, recent new joiners show that smaller or less space-involved countries are still interested. No strong signals of a signing in June are evident in the news, but relevant meetings (e.g., Baku Energy Week, major diplomatic gatherings) are occurring, which in the past have coincided with such announcements. History suggests Artemis signings sometimes coincide with international events or US government diplomatic efforts. Rational choice logic suggests the reputational and potential partnership payoff remains for smaller or emerging economies, and the cost is near zero. Geopolitical headwinds persist but are largely confined to countries already outside the Accords; on balance, a small country is likely to find it beneficial to sign. Thus, I assess a probability considerably above the base rate (50–60%), factoring in new events and no negative developments.",
            "final_probability": 68
        },
        "SpacepolicystudiesOuterspacegovernancemodels": {
            "time_to_resolution": "Approximately 1 month (forecast date: May 29, 2025; resolution window: May 31 – June 30, 2025).",
            "perspective_relevance": "As a specialist in Outer Space Governance Models, I have deep expertise on how emerging international legal regimes—such as the Artemis Accords—diffuse across states, what drives or inhibits new signatories, and how geopolitical factors like multipolarity, alliance structures, and normative contestations shape the adoption of new space norms. I am adept at analyzing the global adoption curve for such agreements and recognizing when inflection points may occur.",
            "status_quo": "On average, one new country has signed the Artemis Accords about every 3-4 weeks in 2025. The last two signatories were Bangladesh (April 8, 2025) and Norway (May 15, 2025), suggesting ongoing internationalization but with a general throttling in pace versus prior years.",
            "perspective_derived_factors": [
                {
                    "factor": "Adoption base rate / trend momentum",
                    "effect": "Increases probability. With 55 countries signed, expansion is ongoing, and the recent pace has been about one new signatory every 3-4 weeks in 2025."
                },
                {
                    "factor": "Depletion of low-hanging fruit",
                    "effect": "Decreases probability moderately. Most of the US-aligned, pro-space, and/or diplomatic middle powers have already signed. The remaining non-signatories tend to include major skeptics (Russia, China), non-aligned, or very small states with little space engagement."
                },
                {
                    "factor": "International political climate/geopolitical headwinds",
                    "effect": "Marginal decrease. Unlike the past two years, there is greater polarization over the Israel-Gaza war and ICC sanctions, but this does not appear to directly touch space diplomacy. However, the diplomatic environment is somewhat tense, possibly reducing the appetite for grand gestures of alignment with the US/Western bloc."
                },
                {
                    "factor": "June as a known 'showcase' month",
                    "effect": "Increases probability modestly. June often coincides with global conferences (eg, UN COPUOS, ISU, Paris Air Show in some years) and is historically a favored month for symbolic signings to demonstrate international buy-in, especially before the northern summer lull."
                },
                {
                    "factor": "Recent expansion into Global South",
                    "effect": "Increases probability. With Bangladesh as most recent signatory, Artemis advocacy is clearly targeting new diplomatic geographies, and the pool of Global South/Emerging Market candidates is broad."
                },
                {
                    "factor": "Absence of direct signals in news",
                    "effect": "Decreases probability. None of the provided contemporary regional news covers a possible imminent signing or diplomatic overture by a likely candidate."
                },
                {
                    "factor": "Peer/competitor diffusion",
                    "effect": "Increases probability. Major diplomatic events and industry fairs tend to catalyze 'catch-up' moves: neighboring or peer countries sign to avoid being left behind or to extract side benefits from the US. The Baku Energy Week, with wide participation by non-signatory states, could be a platform for bilateral diplomacy."
                }
            ],
            "no_scenario": "The expansion momentum stalls as most remaining viable countries demand further technical guarantees, may be preoccupied with domestic matters, or see little marginal benefit in signing the Accords in June—especially if they're non-spacefaring or concerned about antagonizing major powers (Russia, China) or maintaining nonalignment. No relevant mid-tier or Global South state concludes the necessary negotiations within the short June window, possibly leaving the next signature for after July 1st, 2025.",
            "yes_scenario": "A mid-sized or emerging economy (e.g. Azerbaijan, Kazakhstan, or a Southeast Asian state) takes advantage of a diplomatic opportunity—such as Baku Energy Week, international air shows, or upcoming forums—to sign the Artemis Accords, either to cement ties with the US or join the wider international community on space norms. The United States, wanting to keep up momentum, pushes for at least one signing to sustain the narrative of expanding international governance in outer space.",
            "final_reasoning": "The base rate for new Artemis Accord signings in 2025 has been approximately one per month, so the historical frequency slightly favors 'Yes.' Most easily aligned countries have now joined, but the US has shown strong and sustained diplomatic effort to attract new Global South partners, as indicated by the Bangladesh signing. Major diplomatic showcases, such as Baku Energy Week (early June), offer platforms for backroom negotiations, and states like Azerbaijan, Kazakhstan, or even smaller emerging economies are plausible signers in the near horizon. Moreover, international forums in June often spur symbolic commitments. However, the absence of clear rumors, leaks, or overt diplomatic signals tempers extremes: there's no smoking gun suggesting a signature is imminent, and the pool of plausible signers is shrinking as more have already joined or chosen another bloc. Balancing the trend, the diplomacy incentive, and the finite pool of remaining (realistically eligible) states, I estimate the odds as higher than pure base rate but not at extreme certainty.",
            "final_probability": 67
        }
    },
    "deliberation_probability": [
        68,
        77,
        70,
        62,
        71,
        68,
        67
    ],
    "deliberation_mean_probability": 69.0,
    "deliberation_sd": 4.546060565661952,
    "deliberation_probability_result": 69,
    "group_results": {
        "DiplomacyTreatynegotiationprocedure": {
            "forecaster_to_engage": "InternationalrelationsRegimetheory",
            "response_type": "critique",
            "response": "You’re lowballing the probability to 62% by overplaying the 'saturation' hand. The evidence just isn’t there for a true plateau—recent signings like Bangladesh and Norway show that the US is hunting past the most obvious 'easy wins.' Claiming regime norm feedback but failing to weight the diplomatic engine behind ongoing recruitment—especially in a month packed with international conferences (Baku, Venice, etc.)—looks like a tactical oversight. The base rate for these sorts of 'soft power' accords almost always starts slow, accelerates, then gradually decelerates, but with the low cost and continued US effort, we’re just not at stall speed yet. Unless you’re seeing a cold, public signal that potential joiners are now entirely reticent (and there is none in the feed), bump your probability up: the real-world diplomatic machine doesn’t stop for 'norm saturation' until all plausible partners have said 'no,' and we’re not there yet."
        },
        "SpacelawInternationalspacetreatypractice": {
            "forecaster_to_engage": "SpacepolicystudiesOuterspacegovernancemodels",
            "response_type": "defense",
            "response": "Your reasoning threads the needle better than most—resisting base rate myopia and factoring in both the expanded US outreach and the thinning pool of qualified signatories. Where others get blinded by the apparent cadence, you’re right to note that lack of \"smoking gun\" hinders pushing the probability to extremes. The balance you strike—invoking the capacity for diplomatic showcases to catalyze new signatures, but recognizing the reality of bloc alignment and increasing selection bias among non-signers—is much closer to honest Bayesian reasoning than the generic optimism found elsewhere. The 'not at extreme certainty' language shows a good institutional grasp: the Artemis Accords’ recent history favors ongoing addition, but the pool is undeniably getting murkier. Well-defended, calibrated, and appropriately measured in the context of international space law and governance."
        },
        "UspolicyanalysisUsspacediplomacydoctrine": {
            "forecaster_to_engage": "PoliticalscienceRationalchoiceinstitutionalism",
            "response_type": "critique",
            "response": "You lean a bit too heavily on rational choice logic—assuming that the payoff/cost analysis for 'smaller or emerging economies' will always tip toward a signing in the short term. This overlooks the evolving nature of the pool: as more countries join, the remainder are disproportionally made up of fence-sitters, those with more complex balancing requirements, or who are actively being courted by China's rival frameworks. There’s also an unaddressed bureaucratic lag: 'relevant meetings' like Baku Energy Week often provide the announcement moment, but the actual legal, cabinet, or legislative process can create unpredictable delays, especially as stakes rise for the remaining club. And the 'no negative developments' angle is overly generous—a lack of direct headwinds doesn’t mean events are lining up for a Yes. In short, your 68% is reasonably close to my own, but your justification is a bit too breezy about the incentives and calendar logics at play in the marginal, harder-to-get leftovers."
        },
        "InternationalrelationsRegimetheory": {
            "forecaster_to_engage": "InternationalrelationsTwolevelgamestheory",
            "response_type": "critique",
            "response": "You're slipping into what I’d call diplomatic event determinism. Yes, Baku Energy Week brings the right crowd, but treating international summits as reliable catalysts for signatures ignores the two-level nature of these negotiations: government leaders have to play to BOTH international and domestic audiences. With each new signing, the remaining pool of countries tilts ever more toward those with complicated domestic politicking and rival bloc entanglements—countries for whom a quick, quiet signature is rarely feasible. The notion that an event itself creates a 70+% chance is overconfident; these processes don’t run on autopilot just because a bunch of flags are in the same room. Recent signings don’t disprove this; in fact, they highlight how much behind-the-scenes spadework is needed, sometimes months in advance. Summits provide a stage, sure, but the script still hinges on tough home-country variables that your forecast underweights."
        },
        "InternationalrelationsTwolevelgamestheory": {
            "forecaster_to_engage": "UspolicyanalysisUsspacediplomacydoctrine",
            "response_type": "critique",
            "response": "You've got your thumb on the scale for US diplomatic drive, but you're glossing over the crucial 'win-set' constraints that Two-Level Games Theory centers on—specifically, the shrinking set of countries where domestic and international incentives align for a quick Artemis signature. US pressure and incentives are powerful, but they don't eliminate the reality that, as the low-hanging fruit disappears, remaining states are more likely caught up in delicate domestic trade-offs or need to maintain room for international hedging (think: states balancing between US/China, or facing internal elections, legislative ratification, or coalition politics). Your argument that 'active venues and the pattern of 1-2 signings per month' will simply persist underweights how, in these two-level scenarios, even marginal domestic opposition can stall an otherwise enthusiastic executive. There's a reason major US diplomatic pushes still see months of gap (see also other multilateral frameworks). Over-relying on the US's capacity to keep the signing streak rolling discounts the increasingly sticky Two-Level Game politics in the slim pickings left."
        },
        "PoliticalscienceRationalchoiceinstitutionalism": {
            "forecaster_to_engage": "SpacelawInternationalspacetreatypractice",
            "response_type": "critique",
            "response": "Your rating of 77% is unjustifiably exuberant—it borders on ignoring the basic saturation constraint visible in the current Artemis expansion. Yes, you note the base rate and appreciate Baku as a prospect, but discounting the growing selection effect among remaining non-signatories is poor Bayesian hygiene. The very outreach that snagged Bangladesh, a clear outlier, is precisely what makes additional acceleration less likely—the initial pool included natural allies and low-cost joiners, but we're left now with tougher cases or strategic holdouts. Furthermore, you give short shrift to the actual timelines and procedural barriers that prevent countries from signing up at a whim, ignoring both institutional and domestic resistance, or the possibility of deferred announcements. The argument leans too much on momentum and too little on the narrowing pipeline logic that rational choice and regime theory both emphasize. You should have trimmed down your probability and reined in the optimism to reflect the reality of growing diminishing returns."
        },
        "SpacepolicystudiesOuterspacegovernancemodels": {
            "forecaster_to_engage": "DiplomacyTreatynegotiationprocedure",
            "response_type": "defense",
            "response": "DiplomacyTreatynegotiationprocedure’s critique of ‘norm saturation’ is spot-on, and deserves backup from the governance side: treating the pool as nearly tapped at this stage is a classic case of mistaking the nature of low-cost, prestige-oriented agreements for niche security regimes. The Artemis Accords—like other emerging space agreements—are designed for incremental, catch-up alignments, not just first-movers. Diplomacy, especially on the US side, is relentless and opportunistic, and the push toward recruiting in the Global South (Bangladesh as Exhibit A) proves there’s still fruit on the tree, just not always at eye level. Conferences and international events do more than provide photo ops—they’re pressure cookers for secondary powers and emerging economies to leap onto the bandwagon in order to gain a seat at the prestige table. ‘Saturation’ isn’t an abrupt cliff, it’s a gently declining slope, and the difference is crucial here. 62% is way too conservative for a question with this much underlying outreach and soft-power leverage still in play."
        }
    },
    "revision_results": {
        "DiplomacyTreatynegotiationprocedure": {
            "my_phase1_final_probability": 68,
            "reasoning_for_revised_probability": "After engaging with the group deliberation, I find that my initial forecast was well-calibrated, erring toward boldness but supported by strong evidence: two signings in the last two months, active US diplomatic outreach, and a June calendar rich with multilateral diplomatic opportunities. Critiquing the 'regime saturation' logic of another forecaster reinforced that we are not yet at a diplomatic plateau—less obvious countries continue to join, and no clear signals indicate momentum is stalling. The pool is shrinking, but proactive US engagement, the symbolic nature of the Artemis Accords, and a history of major announcements at international events in June support maintaining a probability close to my original judgment. No new argument or evidence emerged during deliberation to push my probability notably higher or lower.",
            "revised_probability": 68
        },
        "SpacelawInternationalspacetreatypractice": {
            "my_phase1_final_probability": 77,
            "reasoning_for_revised_probability": "After group deliberation, I reviewed base rate reasoning and the universal recognition that signings have continued at a steady clip, often linked to diplomatic events. Many forecasters emphasized a shrinking pool of candidates, which certainly tempers unlimited optimism, but no one brought forward clear evidence of an impending dry spell or strong negative signals. The critique of 'saturation' as an overplayed concept is convincing: history shows diplomatic engines keep pushing until resistance is overtly encountered. However, my own forecast was already on the optimistic edge (77%) and in line with the highest among the group; the modal range among skilled forecasters is around 67-71%. The process of deliberation validated most of my logic: event-driven outreach, ongoing US energy, and recent peripheral signers support a high probability, but not near certainty. No new evidence pushes me upward or downward significantly. I maintain my probability as sound, given how the diplomatic machine is operating and the historical cadence.",
            "revised_probability": 77
        },
        "UspolicyanalysisUsspacediplomacydoctrine": {
            "my_phase1_final_probability": 70,
            "reasoning_for_revised_probability": "Reviewing the group deliberation, I remain confident in a forecast in the upper 60s to low 70s. My critique of Rationalchoiceinstitutionalism highlighted how, at this stage, the remaining pool of potential signatories is skewed toward countries with more complex considerations and potential procedural or geopolitical delays, cautioning against overreliance on the appeal of 'easy' rational incentives. However, SpacepolicystudiesOuterspacegovernancemodels and SpacelawInternationalspacetreatypractice both persuasively argue for not swinging too extreme given the lack of a clear, imminent candidate—yet Baku Energy Week and similar events keep the diplomatic door wide open. The pace of new signings, ongoing US pressure, and high diplomatic activity keep the case for a new signatory strong, but the lack of leaks or direct signals tempers any rush to 75%+. On balance, the evidence leads me to maintain my prior 70%: base rate remains high but not unchallengeable, and the possibility of a one-month 'pause' is greater than in previous cycles as the pool narrows.",
            "revised_probability": 70
        },
        "InternationalrelationsRegimetheory": {
            "my_phase1_final_probability": 62,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I see persuasive arguments that suggest my original estimate was a bit too conservative. Notably, both 'DiplomacyTreatynegotiationprocedure' and 'SpacelawInternationalspacetreatypractice' emphasize that the US is actively pursuing signatories beyond the 'obvious' pool and that the cost is low for new members, with strong diplomatic incentives lingering—especially surrounding major events like Baku Energy Week. However, I maintain that many of the remaining non-signatories are less straightforward to flip and that signature timing can be unpredictable due to complex domestic and regional calculations, as I emphasized in my critique of 'InternationalrelationsTwolevelgamestheory.' Summits offer an opportunity but don't mechanically yield signatures. On balance, I now believe the probability should be nudged upwards since my initial estimate underweighted the persistence of diplomatic momentum and the empirical absence of stalling, but I will not take an extreme position because residual selection effects and bureaucratic lags remain nontrivial. I revise my probability upward, but only moderately.",
            "revised_probability": 68
        },
        "InternationalrelationsTwolevelgamestheory": {
            "my_phase1_final_probability": 71,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, several critiques reinforce the importance of factoring in two-level constraints even more strongly. The consensus among fellow forecasters is that while US diplomatic activity, event-driven opportunities, and a strong historical base rate all push the odds up, the remaining pool of signatories is defined more than ever by difficult domestic politics, international balancing, or bureaucratic friction. Critiques of overly event-centric or rational choice–optimistic arguments caution against letting the presence of summits or the base rate alone support a number over 70%. The most compelling new insight is a healthy skepticism about diplomatic events automatically yielding quick signatures, and increased attention to the 'win-set shrinking' nature of the game: the remaining eligible countries likely face more significant internal or external obstacles, and there is a real (if still slim) chance that June simply ends as a lull after the recent uptick. Calibration is key, and while the original 71% feels bold, the signal from deliberation is to nudge a bit more conservatively to reflect the increased selection bias and stickiness of the leftovers.",
            "revised_probability": 66
        },
        "PoliticalscienceRationalchoiceinstitutionalism": {
            "my_phase1_final_probability": 68,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I see several cogent points raised—especially regarding selection effects (shrinking, more recalcitrant pool of non-signatories) and the potential over-reliance on diplomatic event timing as a catalyst for new signings. Critiques backed by regime theory and two-level games theory correctly emphasize that the base rate alone is insufficient: the remaining countries now face harder domestic/international trade-offs, and institutional process/bureaucratic drag can slow new additions. While I maintain that active diplomatic venues and rational incentives favor at least one more signing, the small but real possibility of a dry month rises as the pool thins. Additionally, no clear positive signal or 'smoking gun' of an imminent signature in June has yet emerged. I therefore slightly moderate my probability downward to 64%, reflecting persistent but not overwhelming odds driven by ongoing (but increasingly challenging) expansionary logic.",
            "revised_probability": 64
        },
        "SpacepolicystudiesOuterspacegovernancemodels": {
            "my_phase1_final_probability": 67,
            "reasoning_for_revised_probability": "After engaging in group deliberation, the consensus is clear: the base rate logic is robust, and the ongoing US diplomatic drive for further Artemis Accords signatures remains a strong force, especially with recent Global South outreach and major international events in June. Critiques of overly cautious or conservative probabilities, notably the challenge to 'norm saturation', strengthen the argument that the pool of realistic joiners is not yet exhausted. At the same time, there are valid cautions from InternationalrelationsTwolevelgamestheory and others regarding the increasing difficulty due to two-level game constraints—however, these seem to slow but not stall progress, and recent, rapid signings by smaller states indicate continued diplomatic movement. The sharply higher probabilities (over 70%) advocated by some seem excessively optimistic given the thinning pool and lack of concrete rumors, but their arguments for a still-strong pipeline suggest that a modest upward nudge from my prior 67% is warranted. In sum: the chance that the June window passes with zero signings is not trivial, but the ongoing trend and context of diplomatic opportunity outweigh the slowdown signal.",
            "revised_probability": 70
        }
    },
    "revision_probability": [
        68,
        77,
        70,
        68,
        66,
        64,
        70
    ],
    "revision_mean_probability": 69.0,
    "revision_sd": 4.123105625617661,
    "revision_probability_result": 69,
    "question_details": {
        "id": 37397,
        "title": "Will a country sign the Artemis Accords in June 2025?",
        "description": "The most recent signatory was Bangladesh, on April 8, 2025 and [Norway](https://www.state.gov/united-states-welcomes-norways-signing-of-the-artemis-accords/) on May 15, 2025. There are 55 signatories at the time of this question: Angola, Argentina, Armenia, Australia, Austria, Bahrain, Bangladesh, Belgium, Brazil, Bulgaria, Canada, Chile, Colombia, the Republic of Cyprus, Czech Republic, Denmark, Dominican Republic, Ecuador, Estonia, Finland, France, Germany, Greece, Iceland, India, Israel, Italy, Japan, Liechtenstein, Lithuania, Luxembourg, Mexico, Netherlands, New Zealand, Nigeria, Norway, Panama, Peru, Poland, the Republic of Korea, Romania, Rwanda, Saudi Arabia, Singapore, Slovakia, Slovenia, Spain, Sweden, Switzerland, Thailand, Ukraine, the United Arab Emirates, the United Kingdom, the United States, and Uruguay. [(source)](https://www.state.gov/bureau-of-oceans-and-international-environmental-and-scientific-affairs/artemis-accords)",
        "created_at": "2025-05-24T05:50:07.122936Z",
        "open_time": "2025-05-29T14:00:00Z",
        "cp_reveal_time": "2025-05-29T16:00:00Z",
        "spot_scoring_time": "2025-05-29T16:00:00Z",
        "scheduled_resolve_time": "2025-07-01T00:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-05-29T16:00:00Z",
        "actual_close_time": "2025-05-29T16:00:00Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "resolution_criteria": "This question resolves as **Yes** if a country becomes an Artemis Accord signatory after May 30, 2025 and before July 1, 2025.",
        "fine_print": "",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_max": null,
            "range_min": null,
            "zero_point": null
        },
        "group_rank": null,
        "post_id": 38091,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {}
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {}
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {}
            }
        },
        "nr_forecasters": 80,
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**European Hotel Associations Launch Collective Action Against Booking.com**\nMore than 25 national hotel associations in Europe, coordinated by HOTREC, have joined forces to file a collective action against Booking.com for restrictive competition practices. The case will be heard in the Netherlands, with the support of the German law firm SGP Schneider Geiwitz, which has successfully led previous lawsuits against the platform. The initiative is based on a ruling by the European Court of Justice (ECJ) on September 19, 2024, which declared illegal the contractual parity clauses imposed by Booking.com on hotels for the past 20 years. These clauses forced accommodations to match prices and availability offered on the platform on all other channels, including their own websites, restricting competition, increasing costs, and limiting commercial autonomy. Hotels can claim compensation for commissions paid to Booking.com between 2004 and 2024, plus interest. The claim is open to all affected hotels, which can join the collective action through the designated platform. In Spain, the Spanish Hotel and Tourism Accommodation Confederation (CEHAT) has signed an agreement with CCS Abogados to facilitate the adhesion of its members. Due to the peculiarities of the Spanish judicial system, hotels can choose to join the main collective action in the Netherlands or file their claim in Spain, coordinated with other countries. The action is supported by the following national associations: IHA (Germany), APHA (Austria), Fédération Horeca Bruxelles and Horeca Vlaanderen (Belgium), UPUHH (Croatia), CHA (Cyprus), AHR CR (Czech Republic), HORESTA (Denmark), AHRS (Slovakia), TGZS (Slovenia), EHRA (Estonia), MaRa (Finland), HCH (Greece), HHRA (Hungary), IHF (Ireland), SAF (Iceland), FEDERALBERGHI (Italy), AHRL (Latvia), LHGV (Liechtenstein), LVRA (Lithuania), HORESCA (Luxembourg), NHO Reiseliv (Norway), KHN (Netherlands), IGHP (Poland), APHORT (Portugal), FIHR (Romania), and HOTELLERIESUISSE (Switzerland). CEHAT represents Spain, while other countries are still evaluating whether to join the procedure. The process remains open to new adhesions, while preparations are being finalized to formally submit the collective claim in the Netherlands in the coming weeks. 'This is a historic moment for the hotel industry,' said a spokesperson for HOTREC, 'and we are confident that justice will be served.' \nOriginal language: es\nPublish date: May 29, 2025 11:22 AM\nSource:[El Confidencial](https://www.elconfidencial.com/juridico/2025-05-29/hoteleros-europeos-accion-colectiva-booking_4140116/)\n\n**UK Energy Official to Visit Azerbaijan for Baku Energy Week**\nSophie Westlake, the head of the UK's Joint International Energy Unit at the Foreign and Commonwealth Office and the Ministry of Energy Security and Net Zero Emissions, will soon visit Azerbaijan. Her visit is scheduled to coincide with the Baku Energy Week, according to Trend. The 30th Baku Energy Week will take place from June 2-4, bringing together leading global energy experts at the largest industry event in the region. The event has established itself as a reliable platform for dialogue in the energy sector, both regionally and internationally, and is a key event in the global energy calendar. This year, 267 companies from 39 countries will participate in the Baku Energy Week, including Azerbaijan, as well as Austria, Belarus, Belgium, Bulgaria, China, the Czech Republic, Estonia, Finland, France, Georgia, Germany, Hungary, India, Israel, Italy, Japan, Kazakhstan, Luxembourg, Monaco, the Netherlands, Norway, Pakistan, Poland, Romania, Russia, Saudi Arabia, Singapore, Slovakia, Slovenia, Switzerland, Turkey, Ukraine, the UAE, the UK, Northern Ireland, the US, Uzbekistan, and Guinea-Bissau.\nOriginal language: ru\nPublish date: May 29, 2025 06:55 AM\nSource:[Информационный портал Day.Az](https://news.day.az/economy/1756458.html)\n\n**Important Deadlines and Tax Information for June 2025**\nImportant deadlines and tax information for June 2025. Key dates include: June 2: Deadline for employers to pay at least 75% of the basic tax deduction to the ZUS. June 5: Deadline for entrepreneurs to submit a request for a refund of health insurance contributions. June 9: Deadline for entrepreneurs to submit a VAT-14 declaration for intra-Community acquisitions of fuel. June 16: Deadline for entrepreneurs to submit an INTRASTAT declaration for May 2025. June 19: Day off from work, with a ban on trade and commercial activities. June 20: Deadline for entrepreneurs to pay their tax for May 2025. June 29: No ban on trade and commercial activities. June 30: Deadline for companies to submit their annual financial reports for 2024. The minimum wage for 2025 is 4666 zł. The maximum amount of severance pay for 2025 is 69,990 zł. The minimum wage for young people from June 1 to August 31, 2025 is 627.36 zł. The average monthly salary in 2025 is 8,673 zł. Emerytury and renty are increased annually from March 1. In 2025, the increase is based on the average annual salary in 2024, increased by 20%. The maximum amount of emerytury and renty that can be reduced or suspended is 11,651 zł. The maximum amount of emerytury and renty that can be reduced is 6,273.60 zł.\nOriginal language: pl\nPublish date: May 28, 2025 10:10 PM\nSource:[Rzeczpospolita](https://www.rp.pl/wskazniki-i-stawki/art42370051-terminy-stawki-limity-czerwiec-2025)\n\n**EU Countries Condemn Hungary's Constitutional Changes**\nTwenty European Union countries have signed a document condemning Hungary's recent constitutional changes, which prioritize the 'correct physical, intellectual, and moral development' of children over other fundamental rights. This move has led to the banning of Pride marches and has sparked protests from the Netherlands, which stated, 'We are deeply alarmed by these developments, which are contrary to the fundamental values of human dignity, freedom, equality, and respect for human rights.' The document, signed by 20 EU countries, urges Hungary to 'reconsider its measures' and encourages the European Commission to take 'full and rapid' action to address the issue. The countries that signed the document are Austria, Belgium, Czech Republic, Denmark, Estonia, Finland, France, Germany, Ireland, Latvia, Lithuania, Luxembourg, Netherlands, Portugal, Slovenia, Sweden, Spain, Cyprus, Malta, and Greece. Bulgaria, Croatia, Italy, Poland, Romania, and Slovakia did not sign the document.\nOriginal language: it\nPublish date: May 27, 2025 08:40 PM\nSource:[Rai news](https://www.rainews.it/articoli/2025/05/esteri-unione-europea-parlamento-ue-ungheria-marce-pride-documento-20-paesi-3a2dd47c-7d99-4bf0-b79b-a1734f5f880f.html)\n\n**New Education Funding Model 'Program in School' to be Implemented from Next Fall**\nThe government has approved amendments to the education law, paving the way for the implementation of a new education funding model, 'Program in School', starting from next fall. The new model will provide full state funding for targeted subsidies to teachers only to municipalities with school networks meeting the established criteria for student numbers, set by the Ministry of Education and Science (MON). The reform aims to address the current system's inequality, where teacher salary increases depend on the number of children in municipalities. The MON estimates that an additional 35.7 million euros will be needed for the reform next year, and 107.24 million euros annually from 2027 onwards. The additional funding for 2026 and beyond will be considered during the budget law development process. The Saeima still needs to approve the amendments.\nOriginal language: ru\nPublish date: May 27, 2025 01:09 PM\nSource:[RUS TVNET](https://rus.tvnet.lv/8256958/s-oseni-sleduyushchego-goda-budet-vnedrena-novaya-sistema-finansirovaniya-obrazovaniya)\n\n**Eurispes Report: Citizens' Trust in Institutions Declines, Except for the President**\nA recent Eurispes report shows a decline in citizens' trust in the country's institutions, with the exception of the President of the Republic, Sergio Mattarella, whose approval rating increased from 60.8% in 2024 to 63.6% in 2025. On the other hand, trust in the Parliament, Executive, judiciary, and other institutions such as political parties, religious confessions, trade unions, public administration, and business associations has decreased. According to the report, 'the trend is negative, but not all institutions are affected equally.' \nOriginal language: it\nPublish date: May 29, 2025 12:51 PM\nSource:[Il Sole 24 ORE](https://stream24.ilsole24ore.com/video/economia/eurispes-cala-fiducia-istituzioni-ma-sale-capo-stato/AHFZU5z)\n\n**European Hotel Associations Launch Collective Action Against Booking.com**\nMore than 25 national hotel associations in Europe, coordinated by HOTREC, have joined forces to file a collective action against Booking.com for restrictive competition practices. The case will be heard in the Netherlands, with the support of the German law firm SGP Schneider Geiwitz, which has successfully led previous lawsuits against the platform. The initiative is based on a ruling by the European Court of Justice (ECJ) on September 19, 2024, which declared illegal the contractual parity clauses imposed by Booking.com on hotels for the past 20 years. These clauses forced accommodations to match prices and availability offered on the platform on all other channels, including their own websites, restricting competition, increasing costs, and limiting commercial autonomy. Hotels can claim compensation for commissions paid to Booking.com between 2004 and 2024, plus interest. The claim is open to all affected hotels, which can join the collective action through the designated platform. In Spain, the Spanish Hotel and Tourism Accommodation Confederation (CEHAT) has signed an agreement with CCS Abogados to facilitate the adhesion of its members. Due to the peculiarities of the Spanish judicial system, hotels can choose to join the main collective action in the Netherlands or file their claim in Spain, coordinated with other countries. The action is supported by the following national associations: IHA (Germany), APHA (Austria), Fédération Horeca Bruxelles and Horeca Vlaanderen (Belgium), UPUHH (Croatia), CHA (Cyprus), AHR CR (Czech Republic), HORESTA (Denmark), AHRS (Slovakia), TGZS (Slovenia), EHRA (Estonia), MaRa (Finland), HCH (Greece), HHRA (Hungary), IHF (Ireland), SAF (Iceland), FEDERALBERGHI (Italy), AHRL (Latvia), LHGV (Liechtenstein), LVRA (Lithuania), HORESCA (Luxembourg), NHO Reiseliv (Norway), KHN (Netherlands), IGHP (Poland), APHORT (Portugal), FIHR (Romania), and HOTELLERIESUISSE (Switzerland). CEHAT represents Spain, while other countries are still evaluating whether to join the procedure. The process remains open to new adhesions, while preparations are being finalized to formally submit the collective claim in the Netherlands in the coming weeks. 'This is a historic moment for the hotel industry,' said a spokesperson for HOTREC, 'and we are confident that justice will be served.' \nOriginal language: es\nPublish date: May 29, 2025 11:22 AM\nSource:[El Confidencial](https://www.elconfidencial.com/juridico/2025-05-29/hoteleros-europeos-accion-colectiva-booking_4140116/)\n\n**Cabinet Regulates Determination of Main and Additional OKVED Codes**\nThe Cabinet has regulated how the main and additional OKVED codes will be determined. Starting from September 2025, the updated rules for confirming the type of activity that affects the tariff for workers' injury insurance will come into force. Now, there is no need to submit information, and the data on codes from companies, entrepreneurs, and Rosstat will be accumulated in the Unified State Register of Legal Entities and Individual Entrepreneurs (EGRUL) and the Unified State Register of Real Estate (EGRIP). The Social Fund will assess whether the main type of activity of the company corresponds to the one declared, and whether a tariff change is required. In connection with the new regulations, the Cabinet has approved the order for determining the OKVED codes by the Decree of May 27, 2025 No. 728. According to the document, starting from September 1, 2025, Rosstat and the Social Fund will determine the main and additional codes of the reporting type and calculate the percentage shares of business types of companies and IP as follows: they will consider all types of business for a year with a detail of not less than 4 digits of the OKVED code. For commercial companies, excluding companies in the insurance and financial sectors, the following parameters will be used: turnover: by services, works, and goods in breakdown by types of non-trading business; for the trade sector - gross profit by types of business. If a company conducts both trade and other business, the percentage shares of such businesses will be calculated by summing up the data by parameters. It is also indicated which parameters are used for IP and NKO, and what stages the process of determining the main code and additional codes includes.\nOriginal language: ru\nPublish date: May 29, 2025 08:12 AM\nSource:[Рамблер/финансы](https://finance.rambler.ru/business/54744003-travmvznosy-kabmin-reglamentiroval-kak-budut-opredelyat-osnovnoy-i-dopolnitelnye-okved/)\n\n**Baku Energy Week to Host 267 Companies from 39 Countries**\nThis year's Baku Energy Week will host 267 companies from 39 countries, according to Naile Aliyeva, project manager of Iteca Caspian. 'Among the participating countries, in addition to Azerbaijan, are Germany, the United States, Austria, Belarus, Belgium, the United Arab Emirates, the United Kingdom and Northern Ireland, Bulgaria, the Czech Republic, China, Estonia, Finland, France, Georgia, India, Israel, Switzerland, Italy, Kazakhstan, Guinea-Bissau, Luxembourg, Hungary, Egypt, Monaco, the Netherlands, Norway, Uzbekistan, Pakistan, Poland, Romania, Russia, Singapore, Saudi Arabia, Slovakia, Slovenia, Turkey, Ukraine, and Japan. Germany is represented with a national pavilion. The exhibition will also feature stands from well-known publishers, journals, newspapers, information agencies, and online media specializing in the oil and gas sector.' Aliyeva said. 'This year, 35% of the exhibition participants are new companies. International interest in Azerbaijan's oil and gas and energy sector continues to grow: around 70% of participants are foreign companies, 30% are local enterprises. This highlights both the high level of international cooperation and the active participation of local businesses. Permanent participants of the exhibition - leading companies in the industry - occupy 40% of the exhibition area. Traditionally, many of them participate in the exhibition as sponsors, confirming their commitment to the development of the energy sector.' Aliyeva added. The key sections of the 30th anniversary international exhibition 'Oil and Gas of the Caspian Sea' Caspian Oil&Gas cover the development of oil and gas fields, oil and gas transportation and extraction, telecommunications and information technologies, oil and gas processing, construction and installation work in the energy sector, innovative technologies, and other areas. 'The exhibition will also feature the latest solutions in the field of artificial intelligence, decarbonization, drilling technologies, and the production and storage of oil and petroleum products.' Aliyeva said. The 13th Caspian International Exhibition 'Energy and Green Energy' Caspian Power will focus on the latest developments and proposals from international and local companies in the field of renewable energy development and use. The exhibition will feature products, services, and new projects in areas such as solar and wind energy, geothermal energy, thermal energy, machine-building and energy equipment, electric transport, energy-saving technologies, and other areas.' she added.\nOriginal language: ru\nPublish date: May 29, 2025 07:46 AM\nSource:[Trend](https://www.trend.az/business/4050349.html)\n\n**UK Energy Official to Visit Azerbaijan for Baku Energy Week**\nSophie Westlake, the head of the UK's Joint International Energy Unit at the Foreign and Commonwealth Office and the Ministry of Energy Security and Net Zero Emissions, will soon visit Azerbaijan. Her visit is scheduled to coincide with the Baku Energy Week, according to Trend. The 30th Baku Energy Week will take place from June 2-4, bringing together leading global energy experts at the largest industry event in the region. The event has established itself as a reliable platform for dialogue in the energy sector, both regionally and internationally, and is a key event in the global energy calendar. This year, 267 companies from 39 countries will participate in the Baku Energy Week, including Azerbaijan, as well as Austria, Belarus, Belgium, Bulgaria, China, the Czech Republic, Estonia, Finland, France, Georgia, Germany, Hungary, India, Israel, Italy, Japan, Kazakhstan, Luxembourg, Monaco, the Netherlands, Norway, Pakistan, Poland, Romania, Russia, Saudi Arabia, Singapore, Slovakia, Slovenia, Switzerland, Turkey, Ukraine, the UAE, the UK, Northern Ireland, the US, Uzbekistan, and Guinea-Bissau.\nOriginal language: ru\nPublish date: May 29, 2025 06:55 AM\nSource:[Информационный портал Day.Az](https://news.day.az/economy/1756458.html)\n\n**Four European Countries Call for Palestine's Full Membership in the United Nations**\nIreland, Norway, Slovenia, and Spain have called for the full membership of Palestine in the United Nations and recognition of its statehood based on the 1967 borders and its capital in East Jerusalem. The four European countries reiterated their commitment to the two-state solution. According to a joint statement by the four countries, the meeting of the 'Madrid+' group aims to renew and strengthen the international commitment to the two-state solution. The statement emphasized that a viable and geographically connected Palestinian state, within internationally recognized borders, including the Gaza Strip and the West Bank, and with East Jerusalem as its capital, is the only way to achieve peace and security and meet the legitimate national aspirations of the Palestinian and Israeli peoples. The statement also noted that the implementation of the two-state solution and recognition of Palestine as a state after years of stagnation is not only an ethical but also a crucial step towards reviving momentum towards the implementation of this solution. The four countries called on all members of the international community to take practical steps to implement the two-state solution, including individual recognition of the Palestinian and Israeli states by countries that have not yet done so, support for Palestine's full membership in the United Nations, and promoting a path that ultimately leads to a final agreement based on mutual recognition between the two sides. Ireland, Norway, Slovenia, and Spain also emphasized that the upcoming conference on the Palestinian issue, scheduled for June 17, 2024, under the auspices of the United Nations and co-chaired by France and Saudi Arabia, is not just a legitimate international event but also a suitable framework for moving forward with the implementation of the two-state solution. In May 2024, Norway, Ireland, and Spain officially recognized Palestine as a state, effective from May 28, 2024. Prior to this development, eight European Union member states had recognized Palestine, including Bulgaria, Poland, the Czech Republic, Romania, Slovakia, Hungary, the Romanian Cypriot administration, and Sweden. 'The Madrid+' group was established to support Palestine against ongoing Israeli genocide in Gaza, and it includes several European, Arab, and Islamic countries, including Spain, Norway, Slovenia, Ireland, Turkey, Palestine, Qatar, Saudi Arabia, Jordan, Egypt, and Bahrain. Palestine is a non-member observer state in the United Nations, according to a UN General Assembly resolution on November 29, 2012. Since October 7, 2023, Israel, backed by the US, has been committing a genocide in Gaza, resulting in over 177,000 Palestinians killed or injured, mostly children and women, and over 11,000 missing, in addition to hundreds of thousands of displaced people. Concurrently, the Israeli army and settlers have escalated their attacks in the West Bank, including East Jerusalem, resulting in the deaths of at least 972 Palestinians and the injury of over 7,000, as well as the arrest of over 17,000, according to Palestinian statistics. \nOriginal language: ar\nPublish date: May 29, 2025 12:49 AM\nSource:[Aljazeera](https://www.aljazeera.net/news/2025/5/29/4-%d8%af%d9%88%d9%84-%d8%a3%d9%88%d8%b1%d9%88%d8%a8%d9%8a%d8%a9-%d8%aa%d8%af%d8%b9%d9%88-%d9%84%d9%85%d9%86%d8%ad-%d9%81%d9%84%d8%b3%d8%b7%d9%8a%d9%86-%d8%b9%d8%b6%d9%88%d9%8a%d8%a9)\n\n**Important Deadlines and Tax Information for June 2025**\nImportant deadlines and tax information for June 2025. Key dates include: June 2: Deadline for employers to pay at least 75% of the basic tax deduction to the ZUS. June 5: Deadline for entrepreneurs to submit a request for a refund of health insurance contributions. June 9: Deadline for entrepreneurs to submit a VAT-14 declaration for intra-Community acquisitions of fuel. June 16: Deadline for entrepreneurs to submit an INTRASTAT declaration for May 2025. June 19: Day off from work, with a ban on trade and commercial activities. June 20: Deadline for entrepreneurs to pay their tax for May 2025. June 29: No ban on trade and commercial activities. June 30: Deadline for companies to submit their annual financial reports for 2024. The minimum wage for 2025 is 4666 zł. The maximum amount of severance pay for 2025 is 69,990 zł. The minimum wage for young people from June 1 to August 31, 2025 is 627.36 zł. The average monthly salary in 2025 is 8,673 zł. Emerytury and renty are increased annually from March 1. In 2025, the increase is based on the average annual salary in 2024, increased by 20%. The maximum amount of emerytury and renty that can be reduced or suspended is 11,651 zł. The maximum amount of emerytury and renty that can be reduced is 6,273.60 zł.\nOriginal language: pl\nPublish date: May 28, 2025 10:10 PM\nSource:[Rzeczpospolita](https://www.rp.pl/wskazniki-i-stawki/art42370051-terminy-stawki-limity-czerwiec-2025)\n\n**Government Allocates 444.7 Million Levs to Settle Debts to Road Companies**\nThe government has provided a significant financial injection to the Ministry of Regional Development and Public Works (MRRB) by allocating 444.7 million levs (approximately 222.35 million euros) for 2025. The main goal of these funds is to settle long-standing debts to companies supporting the republican road network. Another part will go towards indexing contracts related to road marking and signage. The funds are allocated through a government decree as an additional expense in the ministry's budget. The necessary financial resources are secured by deducting from the planned expenses in the central budget for 2025, which is at least 1.8 billion levs, to settle debts from 2024. The exact breakdown of the funds is not clear, but it is mentioned that 238 million levs will be allocated for indexing and railway projects. Additionally, the decree allows for the payment of completed activities under contracts for the re-measurement of the state levelling network and the creation of a cadastral map and cadastral registers.\nOriginal language: bg\nPublish date: May 28, 2025 04:44 PM\nSource:[economic.bg](https://www.economic.bg/bg/a/view/ms-pogasjava-blizo-polovin-miliard-ot-zadyljenijata-na-api-kym-pytni-firmi)\n\n**EU Countries Condemn Hungary's Constitutional Changes**\nTwenty European Union countries have signed a document condemning Hungary's recent constitutional changes, which prioritize the 'correct physical, intellectual, and moral development' of children over other fundamental rights. This move has led to the banning of Pride marches and has sparked protests from the Netherlands, which stated, 'We are deeply alarmed by these developments, which are contrary to the fundamental values of human dignity, freedom, equality, and respect for human rights.' The document, signed by 20 EU countries, urges Hungary to 'reconsider its measures' and encourages the European Commission to take 'full and rapid' action to address the issue. The countries that signed the document are Austria, Belgium, Czech Republic, Denmark, Estonia, Finland, France, Germany, Ireland, Latvia, Lithuania, Luxembourg, Netherlands, Portugal, Slovenia, Sweden, Spain, Cyprus, Malta, and Greece. Bulgaria, Croatia, Italy, Poland, Romania, and Slovakia did not sign the document.\nOriginal language: it\nPublish date: May 27, 2025 08:40 PM\nSource:[Rai news](https://www.rainews.it/articoli/2025/05/esteri-unione-europea-parlamento-ue-ungheria-marce-pride-documento-20-paesi-3a2dd47c-7d99-4bf0-b79b-a1734f5f880f.html)\n\n**New Education Funding Model 'Program in School' to be Implemented from Next Fall**\nThe government has approved amendments to the education law, paving the way for the implementation of a new education funding model, 'Program in School', starting from next fall. The new model will provide full state funding for targeted subsidies to teachers only to municipalities with school networks meeting the established criteria for student numbers, set by the Ministry of Education and Science (MON). The reform aims to address the current system's inequality, where teacher salary increases depend on the number of children in municipalities. The MON estimates that an additional 35.7 million euros will be needed for the reform next year, and 107.24 million euros annually from 2027 onwards. The additional funding for 2026 and beyond will be considered during the budget law development process. The Saeima still needs to approve the amendments.\nOriginal language: ru\nPublish date: May 27, 2025 01:09 PM\nSource:[RUS TVNET](https://rus.tvnet.lv/8256958/s-oseni-sleduyushchego-goda-budet-vnedrena-novaya-sistema-finansirovaniya-obrazovaniya)\n\n**Leo XIV: Official List of Delegations Participating in the Mass of the Beginning of the Pontificate**\nA total of 153 delegations, including two extra delegations from Kosovo and Vietnam, will participate in the mass of the beginning of the pontificate of Pope Leo XIV. The list of official delegations was released by the Holy See Press Office. The Italian delegation will be led by President Sergio Mattarella, accompanied by his daughter Laura. Other notable attendees include Prime Minister Giorgia Meloni. The Peruvian delegation will be led by President Dina Ercilia Boluarte Zegarra. The United States delegation will be led by Vice President James David Vance. The delegations will also include monarchs from Andorra, Belgium, Emirates, Spain, Liechtenstein, Luxembourg, Monaco, Malta, and the Netherlands. Heads of state from Albania, Antigua and Barbados, Armenia, Colombia, Equator, Gabon, Georgia, Hungary, Ireland, Israel, Lebanon, Lithuania, Nigeria, Paraguay, Poland, Portugal, San Marino, Slovakia, Switzerland, Togo, Ukraine, and the European Union will also be present. The list also includes hereditary princes and royal families from Sweden, Saudi Arabia, Jordan, Oman, and the United Kingdom. The list of heads of government includes Spain, Andorra, Australia, Austria, Belgium, Bosnia and Herzegovina, Bulgaria, Canada, Croatia, eSwatini, France, Latvia, Liechtenstein, Luxembourg, Malta, Morocco, Mozambique, Montenegro, the Netherlands, Serbia, and Slovenia. Vice heads of state from Brazil, Burundi, Cuba, El Salvador, Namibia, Dominican Republic, and Zimbabwe will also attend. Two delegations of vice prime ministers will be present, from Spain and the United Kingdom. The list also includes presidents of parliament from Azerbaijan, Belarus, Chile, Estonia, Uzbekistan, Pakistan, Romania, and Timor-Leste. Ministers of foreign affairs from Saudi Arabia, Argentina, Costa Rica, Cyprus, Ghana, Panama, Seychelles, and South Sudan will also be present. International organizations represented include Fao, the Council of Europe, Ifad, Pam, Unhcr, Oim, and the Arab League. Ministers from Bahrain, Cameroon, Cape Verde, Korea, Ivory Coast, Egypt, Finland, Greece, Indonesia, Iran, Mauritius, Mexico, Palestine, the Czech Republic, the Russian Federation, Senegal, Singapore, Sweden, and Turkey will also attend. Other notable attendees include individuals from Burkina-Faso, China, Honduras, India, Japan, Uganda, and Thailand. The list of ambassadors is also extensive, including individuals from South Africa, Bahamas, Barbados, Bangladesh, Bolivia, the Republic of the Congo, Denmark, Guatemala, Equatorial Guinea, Haiti, Iraq, Iceland, Kenya, Kuwait, Nicaragua, Madagascar, Malaysia, Myanmar, Norway, New Zealand, Oman, the Philippines, Qatar, Saint Lucia, Syria, Tanzania, Chad, Trinidad and Tobago, and Vanuatu. Six delegations will be formed by individuals from various countries. Two extra delegations will be present from Kosovo and Vietnam.\nOriginal language: it\nPublish date: May 17, 2025 12:37 PM\nSource:[SIR - Servizio Informazione Religiosa](https://www.agensir.it/quotidiano/2025/5/17/leone-xiv-la-lista-ufficiale-delle-delegazioni-che-partecipano-domani-alla-messa-di-inizio-pontificato/)\n\n**65 National Pavilions to Participate in the 2025 Venice Architecture Biennale**\nThe 19th edition of the Venice Architecture Biennale 2025, which started on May 10 and will run until November 23, features 65 national pavilions, including four countries participating for the first time: Azerbaijan, Oman, Qatar, and Togo. The exhibition will take place in three main locations, including 26 pavilions in Giardini, 22 in Arsenale, and 15 scattered throughout the historic center of Venice, Italy. Over 750 participants, representing multiple disciplines and generations, will come together to discuss various topics, including artificial intelligence. The biennale will bring together architects, engineers, mathematicians, scientists, and climate experts to share diverse perspectives on the responsibility of architecture in adapting to a changing world. The exhibition will also focus on the traditional concept of architectural composition. The Venice Architecture Biennale 2025 includes 65 national pavilions, such as those from Albania, Argentina, Armenia, Australia, Austria, Azerbaijan, Bahrain, Belgium, Brazil, Bulgaria, Canada, Chile, China, Croatia, Cyprus, Denmark, Egypt, Estonia, Finland, France, Germany, Luxembourg, the United Kingdom, Greece, Grenada, the Holy See, Hungary, Iceland, Ireland, Italy, Japan, South Korea, Kosovo, Kuwait, Latvia, Lebanon, Slovenia, Lithuania, Mexico, Montenegro, Morocco, the Netherlands, the Nordic countries (Sweden, Norway, Finland), North Macedonia, Oman, Pakistan, Peru, the Philippines, Poland, Portugal, Qatar, Romania, Saudi Arabia, Serbia, Singapore, Spain, Switzerland, Thailand, Togo, Turkey, Ukraine, the United Arab Emirates, the United States, Uruguay, and Uzbekistan. The main theme of the exhibition is adapting to climate change, and it will delve into possible scenarios, considering the expected climate conditions in Venice during the next century and population changes. Topics to be discussed include artificial floods, the impact of population dynamics on our cities, and the interactions between urban planning and microbiology. The biennale will also highlight how artificial intelligence can be used for urban planning, explaining how it can help discover recyclable waste in rebuilding efforts and transform the city into a site for urban mining.\nOriginal language: ar\nPublish date: May 12, 2025 01:07 PM\nSource:[مجلة سيدتي](https://www.sayidaty.net/%D8%A8%D9%84%D8%B3/%D8%A3%D8%AE%D8%A8%D8%A7%D8%B1/1811874-65-%D8%AC%D9%86%D8%A7%D8%AD%D9%8B%D8%A7-%D9%88%D8%B7%D9%86%D9%8A%D9%8B%D8%A7-%D9%8A%D8%B4%D8%A7%D8%B1%D9%83-%D9%81%D9%8A-%D8%A8%D9%8A%D9%86%D8%A7%D9%84%D9%8A-%D8%A7%D9%84%D8%A8%D9%86%D8%AF%D9%82%D9%8A%D8%A9-%D9%84%D9%84%D8%B9%D9%85%D8%A7%D8%B1%D8%A9-2025)\n\n**160 delegations confirmed to attend Pope Francis' funeral**\nThe number of delegations confirmed to attend the funeral of Pope Francis has risen to 160, according to the Holy See Press Office. The delegations include heads of state, prime ministers, and ambassadors from around the world. The first two delegations are from Argentina and Italy, led by their respective presidents, Javier Milei and Sergio Mattarella. Other notable delegations include those from Andorra, Belgium, Denmark, the United Arab Emirates, Spain, Jordan, Lesotho, Liechtenstein, Luxembourg, Monaco, the Order of Malta, and Sweden. The delegations are led by heads of state from Albania, Germany, Angola, Armenia, Australia, Austria, Belize, Bosnia and Herzegovina, Brazil, Canada, Cape Verde, Cyprus, Central African Republic, Democratic Republic of the Congo, Croatia, Ecuador, Estonia, United States, Finland, France, Gabon, Georgia, Honduras, Hungary, India, Indonesia, Ireland, Kenya, Latvia, Lebanon, Lithuania, Macedonia, Madagascar, Moldova, Mozambique, Montenegro, Philippines, Poland, Portugal, Dominican Republic, Romania, San Marino, Seychelles, Sierra Leone, Slovakia, Slovenia, Switzerland, Timor-Leste, Togo, Ukraine, and the European Union. Additionally, there are delegations led by the heirs to the Norwegian and British thrones, as well as those led by prime ministers from Andorra, Bangladesh, Belgium, Bulgaria, Greece, Luxembourg, Morocco, New Zealand, Palestine, the Netherlands, Qatar, the United Kingdom, Serbia, and Sweden. The 'first lady' of Colombia will also be present. Vice-presidents from Burundi, Cuba, El Salvador, Equatorial Guinea, Tanzania, and Zimbabwe will also attend. Three delegations will be led by vice-prime ministers from Spain, Eswatini, and Mexico. Delegations led by presidents of parliament will come from Azerbaijan, Belarus, Chile, Nigeria, Paraguay, and Turkey. Delegations led by foreign ministers will come from Algeria, Burkina Faso, Japan, Mali, Mongolia, Namibia, Norway, Peru, South Sudan, Tunisia, Sri Lanka, Uruguay, Venezuela, and Zambia. International organizations such as the UN, the Council of Europe, and the WHO will also be present. Delegations led by ministers will come from Bahrain, Cameroon, South Korea, Côte d'Ivoire, Egypt, the United Arab Emirates, Guatemala, Iran, Kyrgyzstan, Malaysia, Pakistan, Russia, Senegal, Singapore, Syria, Chad, and Thailand. Other personalities will come from China, Iraq, Mauritius, and Uzbekistan. Additionally, delegations composed of ambassadors will come from the Bahamas, Bolivia, Costa Rica, Haiti, Israel, Jamaica, Kuwait, Malawi, Mauritania, Nicaragua, Myanmar, Papua New Guinea, Vanuatu, Oman, Rwanda, and St. Vincent and the Grenadines. Finally, delegations will come from Gambia and Sudan.\nOriginal language: it\nPublish date: April 25, 2025 04:13 PM\nSource:[SIR - Servizio Informazione Religiosa](https://www.agensir.it/quotidiano/2025/4/25/papa-francesco-160-le-delegazioni-al-funerale-tra-sovrani-capi-di-stato-primi-ministri-e-ambasciatori-da-tutto-il-mondo/)\n\n**FULL LIST: 50 happiest countries in the world 2025**\nFinland has been ranked as the happiest country for the eighth consecutive year in the World Happiness Report 2025, according to the rankings released on Thursday. The report, conducted in partnership with Gallup and the U.N. Sustainable Development Solutions Network, is based on people's self-rated life satisfaction. Finland's No. 1 ranking is attributed to its strong social support systems, as well as the happiness of its residents. The top 10 happiest countries in the world include Costa Rica at No. 6 and Mexico at No. 10, both of which entered the top 10 for the first time in the 2025 report. The full list of the world's 50 happiest countries in 2025 is as follows: 1. Finland 2. Denmark 3. Iceland 4. Sweden 5. Netherlands 6. Costa Rica 7. Norway 8. Israel 9. Luxembourg 10. Mexico 11. Australia 12. New Zealand 13. Switzerland 14. Belgium 15. Ireland 16. Lithuania 17. Austria 18. Canada 19. Slovenia 20. Czechia 21. United Arab Emirates 22. Germany 23. United Kingdom 24. United States 25. Belize 26. Poland 27. Taiwan 28. Uruguay 29. Kosovo 30. Kuwait 31. Serbia 32. Saudi Arabia 33. France 34. Singapore 35. Romania 36. Brazil 37. El Salvador 38. Spain 39. Estonia 40. Italy 41. Panama 42. Argentina 43. Kazakhstan 44. Guatemala 45. Chile 46. Vietnam 47. Nicaragua 48. Malta 49. Thailand 50. Slovakia. On the other hand, the bottom 5 countries are Afghanistan (No. 147), Sierra Leone (No. 146), Lebanon (No. 145), Malawi (No. 144) and Zimbabwe (No. 143).\nOriginal language: en\nPublish date: March 20, 2025 04:47 PM\nSource:[reubenabati.com.ng](https://reubenabati.com.ng/news/full-list-50-happiest-countries-in-the-world-2025)\n\n**Ukrainian National Driver's License Recognized by 89 Countries**\nAccording to the Ministry of Internal Affairs, 89 countries recognize the Ukrainian national driver's license. '89 countries in the world, in accordance with the Vienna Convention on Road Traffic 1968, recognize the Ukrainian national driver's license. 44 countries require drivers to have an international driver's license', - stated in the MVS. The countries that recognize the Ukrainian national driver's license are: Austria, Azerbaijan, Albania, Bahamas, Bahrain, Belgium, Belarus, Bulgaria, Bosnia and Herzegovina, Brazil, Venezuela (Bolivarian Republic), Vietnam, Armenia, Guyana, Ghana, Greece, Georgia, Denmark, Democratic Republic of the Congo, Ecuador, Estonia, Zimbabwe, Israel, Indonesia, Iraq, Iran (Islamic Republic), Spain, Italy, Kazakhstan, Qatar, Kenya, Kyrgyzstan, North Macedonia, Costa Rica, Côte d'Ivoire, Cuba, Kuwait, Latvia, Lithuania, Liberia, Luxembourg, Morocco, Mexico, Monaco, Mongolia, Niger, Nigeria, Netherlands, Germany, Norway, United Arab Emirates, Pakistan, Peru, South Africa, Poland, Portugal, Cape Verde, South Korea, Republic of Moldova, RF, Romania, San Marino, Saudi Arabia, Holy See, Seychelles, Senegal, Serbia, Slovakia, Slovenia, United Kingdom of Great Britain and Northern Ireland, Tajikistan, Thailand, Tunisia, Turkey, Turkmenistan, Hungary, Uzbekistan, Ukraine, Uruguay, Philippines, Finland, France, Croatia, Central African Republic, Czech Republic, Chile, Montenegro, Switzerland, Sweden. International driver's license is required in such countries: Australia, Algeria, Argentina, Bangladesh, Barbados, Benin, Botswana, Burkina Faso, Haiti, Guatemala, Dominican Republic, Egypt, India, Ireland, Iceland, Jordan, Cambodia, Canada, Cyprus, Congo, Laos, Lesotho, Lebanon, Madagascar, Malawi, Malaysia, Mali, Malta, Namibia, New Zealand, Papua New Guinea, Paraguay, Sierra Leone, Rwanda, Syria, Singapore, USA, Togo, Trinidad and Tobago, Uganda, Fiji, Sri Lanka, Jamaica, Japan.\nOriginal language: uk\nPublish date: March 07, 2025 02:14 AM\nSource:[УКРІНФОРМ](https://www.ukrinform.ua/rubric-society/3967795-ukrainske-posvidcenna-vodia-viznaut-89-krain.html)\n\n**ChatGPT Lists 64 Teams for Expanded 2030 World Cup**\nFox Sports asked ChatGPT to list 64 teams if the 2030 World Cup were to expand to 64 teams. The list includes countries such as Australia, China, India, Japan, Qatar, Saudi Arabia, and South Korea, as well as teams from Africa, South America, and Europe. Fox Sports also asked if this format would be a good idea, but did not provide a response. The 64 teams listed are: Australia, Bangladesh, China, India, Japan, Qatar, Saudi Arabia, South Korea, United Arab Emirates, Algeria, Angola, Cameroon, Egypt, Ghana, Ivory Coast, Mali, Morocco, Nigeria, Senegal, South Africa, Tunisia, Zambia, Canada, Costa Rica, El Salvador, Honduras, Jamaica, Mexico, Panama, Trinidad and Tobago, United States, Argentina, Brazil, Chile, Colombia, Ecuador, Paraguay, Peru, Uruguay, New Zealand, Solomon Islands, Austria, Belgium, Bulgaria, Croatia, Czech Republic, Denmark, England, Finland, France, Germany, Greece, Hungary, Italy, Netherlands, Norway, Poland, Portugal, Romania, Sweden, Switzerland, Turkey, Ukraine, and Wales.\nOriginal language: zh\nPublish date: March 07, 2025 01:35 AM\nSource:[k.sina.com.cn](https://k.sina.com.cn/article_2018499075_784fda03020029los.html?from=sports&subch=osport)\n\n**Demon Slayer: Infinity Castle release date announced - check when it's releasing in your country**\nThe release date for the movie 'Demon Slayer: Kimetsu no Yaiba - Infinity Castle' has been announced. The film will first be released in Japan, followed by India and other international markets. The movie tells the story of Tanjiro Kamado, a boy who becomes a Demon Slayer after his family is murdered by demons and his sister transforms into one. The film will be available in Japanese with English subtitles, as well as Hindi and English dubbed versions, and will be released in IMAX. The official synopsis reads: 'Tanjiro Kamado - a boy who joined an organization dedicated to hunting down demons called the Demon Slayer Corps after his younger sister Nezuko was turned into a demon... As the Demon Slayer Corps members and Hashira engaged in a group strength training program, the Hashira Training, in preparation for the forthcoming battle against the demons, Muzan Kibutsuji appears at the Ubuyashiki Mansion. With the head of the Demon Corps in danger, Tanjiro and the Hashira rush to the headquarters but are plunged into a deep descent to a mysterious space by the hands of Muzan Kibutsuji. The destination of where Tanjiro and Demon Slayer Corps have fallen is the demons' stronghold - the Infinity Castle. And so, the battleground is set as the final battle between the Demon Slayer Corps and the demons ignites.' The movie will be released in various countries on the following dates: September 11 in Kazakhstan, Mexico, Chile, Peru, Argentina, Bolivia, Brazil, Caribbean, Central America, Colombia, Dominican Republic, Ecuador, Paraguay, Uruguay, Venezuela, Australia, New Zealand, Thailand, Armenia, Azerbaijan, Bahrain, Croatia, Czech Republic, Denmark, Egypt, Ethiopia, Georgia, Greece, Hungary, Iceland, Iraq, Israel, Italy, Jordan, Lebanon, Lithuania, Macedonia, Netherlands, Oman, Portugal, Qatar, Saudi Arabia, Serbia, Slovakia, Slovenia, Switzerland (Italian-speaking), Syria, Ukraine, United Arab Emirates; September 12 in India, Mongolia, Spain, Bulgaria, Estonia, Finland, Kenya, Latvia, Nigeria, Norway, Poland, Romania, Southern Africa, Sweden, Turkey, United Kingdom; and September 17 in Belgium, France, French-speaking Africa, Luxembourg, Switzerland (French-speaking).\nOriginal language: en\nPublish date: March 06, 2025 02:35 PM\nSource:[WION](https://www.wionews.com/entertainment/demon-slayer-infinity-castle-release-date-announced-check-when-its-releasing-in-your-country-8828413)\n\n**Crunchyroll Announces International Release Dates for Demon Slayer's Infinity Castle Anime Movie**\nCrunchyroll has announced the international release dates for the highly anticipated Demon Slayer: Kimetsu no Yaiba Infinity Castle anime movie. The film will premiere in the U.S. and Canada on September 12, 2025, in both English subbed and dubbed form, and will also be available in IMAX and other premium large formats. The release dates for other countries are as follows: August 14: Malaysia, Singapore, Pakistan; August 15: Cambodia, Indonesia, Vietnam; August 20: Philippines; September 11: Mexico, Chile, Peru, Argentina, Bolivia, Brazil, Caribbean, Central America, Colombia, Dominican Republic, Ecuador, Paraguay, Uruguay, Venezuela, Australia, New Zealand, Thailand, Armenia, Azerbaijan, Bahrain, Croatia, Czech Republic, Denmark, Egypt, Ethiopia, Georgia, Greece, Hungary, Iceland, Iraq, Israel, Italy, Jordan, Kazakhstan, Kuwait, Lebanon, Lithuania, Macedonia, Netherlands, Oman, Portugal, Qatar, Saudi Arabia, Serbia, Slovakia, Slovenia, Switzerland (Italian-speaking), Syria, Ukraine, United Arab Emirates; September 12: India, Mongolia, Spain, Bulgaria, Estonia, Finland, Kenya, Latvia, Nigeria, Norway, Poland, Romania, Southern Africa, Sweden, Turkey, United Kingdom; September 17: Belgium, France, French-speaking Africa, Luxembourg, Switzerland (French-speaking); September 18: Moldova; September 25: Austria, Germany, Switzerland (German-speaking). The film serves as the culmination of the anime series, which first debuted in 2019.\nOriginal language: en\nPublish date: March 05, 2025 05:12 PM\nSource:[CBR](https://www.cbr.com/demon-slayer-infinity-castle-international-release-date-trailer/)\n\n**US unveils 2025 visa waiver list, snubs UK, Nigeria, others**\nThe United States government has released the 2025 Visa Waiver Programme (VWP) list, which includes 40 countries whose citizens can visit the US visa-free for up to 90 days. The UK, Nigeria, Ghana, and South Africa were excluded from the programme. However, the UK remains eligible under certain conditions. The US Bureau of Consular Affairs explains that travellers must secure approval through the Electronic System for Travel Authorization (ESTA) before departure. The US government has tightened security checks, prioritizing countries with strong diplomatic ties and strict border security standards. The update aims to streamline visa-free travel for eligible visitors, facilitating business, tourism, and transit travel to the United States. 'Travellers must have a valid ESTA approval prior to travel and meet all requirements explained below. If you prefer to have a visa in your passport, you may still apply for a visitor visa,' the US agency stated. The 40 countries included in the Visa Waiver Programme are: Andorra, Australia, Austria, Belgium, Chile, Czech Republic, Croatia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland, Italy, Israel, Japan, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, New Zealand, Norway, Poland, Portugal, Qatar, San Marino, Singapore, Slovakia, Slovenia, South Korea, Spain, Sweden, and Switzerland.\nOriginal language: en\nPublish date: February 25, 2025 03:04 PM\nSource:[torizone.com](https://www.torizone.com/posts/2025/02/158087-unveils-2025-visa-waiver-list-snubs-uk-nigeria)\n\n**Countries that do not require a visa for Venezuelans in 2025**\nAccording to Henley & Partners, a British migration and investment consultancy, Venezuelans can travel to approximately 119 countries without a visa in 2025. This ranks the Venezuelan passport 44th in the world's strongest passports, which evaluates around 199 passports. Some countries that do not require a visa for Venezuelans include: Antigua and Barbuda, Argentina, Barbados, Bahamas, Bolivia, Brazil, Colombia, Dominica, Granada, Guayana Francesa, Haiti, Jamaica, Paraguay, San Cristóbal y Nieves, San Vicente y las Granadinas, Uruguay, Albania, Germany, Andorra, Austria, Belgium, Belarus, Bosnia Herzegovina, Bulgaria, Cyprus, Vatican City, Croatia, Denmark, Slovakia, Slovenia, Spain, Estonia, Finland, France, Greece, Hungary, Iceland, Italy, Kosovo, Latvia, Liechtenstein, Lithuania, Luxembourg, North Macedonia, Malta, Moldova, Monaco, Montenegro, Norway, Netherlands, Poland, Portugal, Czech Republic, Romania, Russia, San Marino, Sweden, Switzerland, Turkey, Botswana, Gambia, South Africa, Fiji, Kiribati, Micronesia, Philippines, Iran, Malaysia, Singapore. However, Visa Index clarifies that in some cases, travelers must verify the time they are allowed to stay in the country without a visa. On the other hand, at least 38 countries require a visa for Venezuelans upon arrival, including Bahrain, Bangladesh, Qatar, Egypt, Indonesia, Jordan, Kyrgyzstan, Laos, Lebanon, Maldives, Nepal, Oman, Sri Lanka, Thailand, Tajikistan, Timor-Leste, Burkina Faso, Burundi, Cape Verde, Comoros, Guinea-Bissau, Mauritius, Seychelles, Madagascar, Malawi, Mozambique, Namibia, Rwanda, Tanzania, Djibouti, Zambia, Zimbabwe, Palau, Samoa, Tuvalu. Additionally, some countries require an electronic visa, which must be requested online and communicated to the applicant by email. These countries include Ecuador, El Salvador, Surinam, Myanmar, Bhutan, United Arab Emirates, India, Iraq, Kazakhstan, Mongolia, Pakistan, Syria, Uzbekistan, Vietnam, Benin, Côte d'Ivoire, Cameroon, Ethiopia, Gabon, Guinea, Lesotho, Libya, Mauritania, Nigeria, Democratic Republic of the Congo, Santo Tomé and Principe, Sierra Leone, South Sudan, Togo, Uganda, Armenia, Georgia. Finally, some countries require a regular visa, which can be requested at a consulate or embassy, including Belize, Canada, Chile, Costa Rica, Cuba, United States, Guatemala, Guyana, Honduras, Mexico, Nicaragua, Panama, Peru, Puerto Rico, Dominican Republic, Saint Lucia, Trinidad and Tobago, Ireland, United Kingdom, Serbia, Ukraine, Saudi Arabia, China, North Korea, Japan, Kuwait, Taiwan, Palestine, Turkmenistan, Yemen, Angola, Chad, Eritrea, Eswatini, Ghana, Liberia, Mali, Morocco, Niger, Central African Republic, Papua New Guinea, Republic of the Congo, Somalia, Sudan, Tunisia, Australia, Marshall Islands, Solomon Islands, Israel, Nauru, New Zealand, Tonga, Vanuatu. \nOriginal language: es\nPublish date: February 20, 2025 09:33 PM\nSource:[eldiario.com](https://eldiario.com/2025/02/20/paises-viajar-venezolanos-sin-visa/)\n\n**79 Countries Support the International Criminal Court Amid US Sanctions**\n79 countries have signed a statement in support of the International Criminal Court (ICC), which was initiated by a group of 5 regional countries: Slovenia, Luxembourg, Mexico, Sierra Leone, and Vanuatu. The statement comes after US President Donald Trump signed an executive order imposing sanctions on the ICC, its judges, and staff, including travel bans and asset freezes, due to the issuance of arrest warrants against Israeli Prime Minister Benjamin Netanyahu and his former Defense Minister Yoav Galant. The statement emphasizes the importance of the ICC's independence, impartiality, and neutrality, and warns that sanctions will undermine the rule of law and the pursuit of justice. The countries signing the statement include Afghanistan, Albania, Andorra, Antigua and Barbuda, Austria, Bangladesh, Belgium, Belize, Bolivia, Bosnia and Herzegovina, Brazil, Bulgaria, Cape Verde, Canada, Chile, Colombia, Comoros, Costa Rica, Croatia, Cyprus, Democratic Republic of the Congo, Denmark, Dominican Republic, Estonia, Finland, France, Gabon, Gambia, Germany, Ghana, Greece, Grenada, Guatemala, Honduras, Iceland, Ireland, Israel, Italy, Latvia, Lesotho, Liechtenstein, Lithuania, Luxembourg, Maldives, Malta, Mexico, Mongolia, Montenegro, Namibia, Netherlands, Nigeria, North Macedonia, Norway, Panama, Peru, Poland, Portugal, Moldova, Romania, Saint Kitts and Nevis, Saint Lucia, Saint Vincent and the Grenadines, San Marino, Senegal, Seychelles, Sierra Leone, Slovakia, Slovenia, South Africa, Spain, State of Palestine, Sweden, Switzerland, Timor-Leste, Trinidad and Tobago, Tunisia, Uganda, United Kingdom, Uruguay, and Vanuatu.\nOriginal language: ar\nPublish date: February 08, 2025 06:54 PM\nSource:[hashd-ahali.org](https://www.hashd-ahali.org/main/ahali/?p=74849)\n\n**79 Countries Issue Joint Statement in Support of International Criminal Court**\n79 countries, including Palestine, have issued a joint statement reaffirming their support for the International Criminal Court's independence, impartiality, and neutrality. The statement emphasizes the importance of the court's role in ensuring accountability for international crimes and upholding the rule of law. However, the statement notes that the court is facing unprecedented challenges, including 'punitive measures against the court and its officials and employees, as well as against those cooperating with it, as a reaction to the court's implementation of its mandate under the Rome Statute.' The statement warns that these measures 'increase the risk of impunity for the most serious crimes, and threaten to undermine the supremacy of international law, which is essential for promoting global order and security.' The statement also expresses concern that the sanctions may compromise the safety of sensitive information and the security of parties involved, including victims and witnesses. Palestinian Ambassador to the UN, Riyad Mansour, welcomed the statement, emphasizing the importance of maintaining the court's independence and neutrality, and rejecting any attempts to interfere with its affairs. The statement was signed by the following countries: Afghanistan, Albania, Andorra, Antigua and Barbuda, Austria, Bangladesh, Belgium, Belize, Bolivia, Bosnia and Herzegovina, Brazil, Bulgaria, Cape Verde, Canada, Chile, Colombia, Comoros, Costa Rica, Croatia, Cyprus, Democratic Republic of the Congo, Denmark, Dominican Republic, Estonia, Finland, France, Gabon, Gambia, Germany, Ghana, Greece, Grenada, Guatemala, Honduras, Iceland, Ireland, Israel, Italy, Latvia, Lesotho, Liechtenstein, Lithuania, Luxembourg, Maldives, Malta, Mexico, Mongolia, Montenegro, Namibia, Netherlands, Nigeria, North Macedonia, Norway, Panama, Peru, Poland, Portugal, Moldova, Romania, Saint Kitts and Nevis, Saint Lucia, Saint Vincent and the Grenadines, San Marino, Senegal, Seychelles, Sierra Leone, Slovakia, Slovenia, South Africa, Spain, State of Palestine, Sweden, Switzerland, Timor-Leste, Trinidad and Tobago, Tunisia, Uganda, United Kingdom, Uruguay, Vanuatu. \nOriginal language: ar\nPublish date: February 08, 2025 10:21 AM\nSource:[raya.ps](https://www.raya.ps/news/1189608.html)\n\n**79 Countries Support International Criminal Court, Reject Sanctions**\n79 countries, including Palestine, have issued a joint statement reaffirming their support for the International Criminal Court (ICC) and rejecting any attempts to impose sanctions on it. The statement emphasizes the importance of the ICC's independence, impartiality, and neutrality, and highlights the challenges it faces, including 'punitive measures' imposed against it and its officials. The statement warns that these measures 'increase the risk of impunity for the most serious international crimes' and 'threaten to undermine the rule of law, which is essential for promoting international peace and security.' It also expresses concern that sanctions could compromise the safety of sensitive information and the security of parties involved, including victims and witnesses. The statement reaffirms the importance of the ICC's work in promoting accountability and upholding international law, and calls on countries to support the court's efforts to ensure its independence and effectiveness. The signatory countries include Afghanistan, Albania, Andorra, Antigua and Barbuda, Austria, Bangladesh, Belgium, Belize, Bolivia, Bosnia and Herzegovina, Brazil, Bulgaria, Cape Verde, Canada, Chile, Colombia, Comoros, Costa Rica, Croatia, Cyprus, Democratic Republic of the Congo, Denmark, Dominican Republic, Estonia, Finland, France, Gabon, Gambia, Germany, Ghana, Greece, Grenada, Guatemala, Honduras, Iceland, Ireland, Israel, Italy, Latvia, Lesotho, Liechtenstein, Lithuania, Luxembourg, Maldives, Malta, Mexico, Mongolia, Montenegro, Namibia, Netherlands, Nigeria, North Macedonia, Norway, Panama, Peru, Poland, Portugal, Moldova, Romania, Saint Kitts and Nevis, Saint Lucia, Saint Vincent and the Grenadines, San Marino, Senegal, Seychelles, Sierra Leone, Slovakia, Slovenia, South Africa, Spain, State of Palestine, Sweden, Switzerland, Timor-Leste, Trinidad and Tobago, Tunisia, Uganda, United Kingdom, Uruguay, Vanuatu. The statement comes after US President Donald Trump issued an executive order imposing sanctions on ICC officials, citing 'unlawful actions' against the US and Israel. The order bans ICC officials and their families from entering the US and freezes their assets. The ICC had issued arrest warrants for Israeli Prime Minister Benjamin Netanyahu and former Defense Minister Yoav Gallant in November for 'war crimes against Palestinians.' \nOriginal language: ar\nPublish date: February 07, 2025 05:50 PM\nSource:[raya.ps](https://www.raya.ps/news/1189590.html)\n\n",
    "date": "2025-05-29T14:52:23.420397",
    "summary": "Across all expert forecasts, there is a strong consensus that a country is likely to sign the Artemis Accords in June 2025, with final probabilities assigned ranging from 62% to 77%. Experts base their reasoning primarily on the steady historical base rate of approximately one new signatory per month—recent additions (Bangladesh in April and Norway in May) sustain this momentum. Factors increasing the probability include ongoing US diplomatic outreach, June's busy calendar of international events (especially Baku Energy Week), and the low cost/signaling benefits for smaller or emerging nations. However, all experts note a slightly declining chance due to the 'shrinking pool' effect: most obvious and willing states have already signed, leaving a thinner field of potential joiners, many of whom are less inclined or are aligned with rival blocs. There is also recognition of geopolitical crosswinds, such as broader tensions around the US and its initiatives, but these are not seen as sufficient to significantly dampen momentum. Experts agree that while no specific imminent signing is publicly indicated, historical patterns, diplomatic opportunity, and the incentives at play make a new signature in June probable, with scenario descriptions focusing on a smaller or emerging economy leveraging a diplomatic event as the likely pathway."
}