{
    "deliberation_results": {
        "ElectionAdministrationInternationalIdeaElectoralStandards": {
            "time_to_resolution": "About 32 days (until July 1, 2025)",
            "perspective_relevance": "My expertise in Election Administration, especially vis-à-vis International IDEA Electoral Standards, uniquely positions me to analyze both the procedural legitimacy and historical patterns of candidate disqualification in Côte d’Ivoire. This expertise is crucial in interpreting the impact of judicial decisions, the structure and independence of the electoral commission (CEI), and the risk factors for politically motivated exclusions, all of which underpin the forecast for candidate disqualification.",
            "status_quo": "As of the forecast date, several major opposition leaders have already been disqualified or are under legal challenge, notably Laurent Gbagbo (legal conviction), Simone Gbagbo (still on list, but under scrutiny), and Gnangbo Kacou (active but outspoken about exclusion). Tidjane Thiam was recently disqualified over nationality technicalities. Jean-Louis Billon and Pascal Affi N’Guessan remain officially candidates, but opposition figures are under heavy legal/political pressure. If nothing changes, the pattern of recent disqualifications suggests a status quo of ongoing but not necessarily new disqualifications for the remaining names before July 1, 2025.",
            "perspective_derived_factors": [
                {
                    "factor": "Judicial/Legal Precedent for Disqualification",
                    "effect": "Strongly increases the probability; recent, high-profile exclusions of opposition candidates (Thiam, Gbagbo, Blé Goudé) indicate robust, ongoing use of judicial means to bar politically inconvenient opponents."
                },
                {
                    "factor": "Independence and Composition of the CEI",
                    "effect": "Increases probability; the CEI is perceived as insufficiently independent and structurally favors the ruling party, enabling continued exclusion on administrative and technical grounds."
                },
                {
                    "factor": "Political Strategy Ahead of a Competitive Election",
                    "effect": "Increases probability; the ruling regime has an interest in limiting credible challengers by all available means, a recurring pattern in Ivorian electoral history, especially as opposition mobilizes domestically and via regional courts."
                },
                {
                    "factor": "International/Regional Pressure and Appeals",
                    "effect": "Moderately decreases probability; appeals to ECOWAS/African Court can delay or deter further disqualifications, but their impact is muted before the election and rarely results in immediate reinstatement."
                },
                {
                    "factor": "Public Mobilization and Domestic Social Pressure",
                    "effect": "Slightly decreases probability; recent marches and vocal public pushback can raise costs for overt exclusion, but historically the regime has withstood such pressures."
                },
                {
                    "factor": "Base Rate: Recent Ivorian Presidential Elections (2010–2020)",
                    "effect": "Increases probability; each cycle has featured disqualifications, often finalized in the weeks before the official list closes."
                }
            ],
            "no_scenario": "Despite legal and political pressure, no further candidates on the specified list are formally disqualified before July 1, 2025. Billon, Affi N’Guessan, Simone Gbagbo, and Gnangbo Kacou all make it to July 1 still eligible, either due to lack of compelling legal grounds for removal, political calculation (regime prefers to maintain a façade of pluralism), or successful domestic/international pushback.",
            "yes_scenario": "At least one among Billon, Affi N’Guessan, Simone Gbagbo, or Gnangbo Kacou is disqualified or otherwise declared legally ineligible before July 1, 2025, likely through: (1) invocation of past legal proceedings (Gbagbo or Simone Gbagbo), (2) a CEI administrative ruling on technicalities, (3) a court ruling prompted by a rival challenge, or (4) government intervention citing threatening mobilization or procedural issues. Recent pattern shows this is plausible up to finalization of the eligible candidate list.",
            "final_reasoning": "Given the prominent use of disqualification to shape the competitive field (as seen with Thiam, Gbagbo, Blé Goudé), the close relationship between the judiciary and executive, and the lack of effective checks on the CEI, I expect a high probability that at least one more named candidate will be excluded by July 1, 2025. Public protests and appeals to international courts may provoke delay but are unlikely to reverse disqualifications within this short timeframe. Unless the regime calculates that marginalizing additional figures risks illegitimacy or unrest, the history of last-minute exclusions in Ivorian presidential races suggests a continuation of this pattern. Among the remaining candidates, Simone Gbagbo and Laurent Gbagbo face particular risk given prior convictions and precedent. Taking into account all above factors, I assess the likelihood of at least one of the specified individuals being disqualified by July 1 as very high.",
            "final_probability": 90
        },
        "ElectionAdministrationEcowasElectionObservationGuidelines": {
            "time_to_resolution": "Approximately 1 month until July 1, 2025.",
            "perspective_relevance": "My expertise in Election Administration, specifically as informed by ECOWAS Election Observation Guidelines, enables me to assess the procedural, legal, and political dynamics around candidate disqualification. The ECOWAS guidelines focus on legal clarity, due process, inclusion, and the fair application of rules, all of which are crucial when tracking candidate eligibility and disqualification trends in West African elections.",
            "status_quo": "Several high-profile opposition figures, including Tidjane Thiam (already disqualified), Laurent Gbagbo (ineligible due to a standing conviction), and others have been excluded or face significant judicial/legal barriers. Ongoing protests, appeals, and tensions persist, but the authorities are showing little sign of reversing exclusion decisions. The main instrument of exclusion (the electoral roll) appears settled as of late May 2025.",
            "perspective_derived_factors": [
                {
                    "factor": "Legal precedent and recent history of opposition disqualification",
                    "effect": "Increases probability. Historically, Côte d'Ivoire has seen legal and administrative frameworks used to exclude opposition figures (notably Gbagbo, Soro, and now Thiam). The courts and the Independent Electoral Commission have upheld these exclusions."
                },
                {
                    "factor": "ECOWAS/African Court interventions and compliance",
                    "effect": "Decreases probability slightly. While the African Court and ECOWAS have occasionally called for more inclusive processes (including prior calls for Gbagbo’s reinstatement), there is scant evidence that Ivorian authorities intend to comply in the immediate term—court decisions to date have been ignored or contested by the regime."
                },
                {
                    "factor": "Timing/proximity to candidate list finalization and legal deadlines",
                    "effect": "Increases probability. The close timing (just a month left) means that late-stage interventions are rare unless through extraordinary amnesty or executive decision."
                },
                {
                    "factor": "Political climate and regime incentives",
                    "effect": "Increases probability. The ruling regime has strong incentives to fragment and weaken the opposition before the official campaign period. The use of legal tools to sideline rivals appears likely to continue if new complications emerge."
                },
                {
                    "factor": "Civil society and international pressure",
                    "effect": "Decreases probability, but weakly. While there is increased mobilization and calls for inclusiveness, including interfaith and UN involvement, this has not translated into actual reversals of disqualification, and the power to reinstate or remove candidates rests almost entirely with domestic authorities."
                },
                {
                    "factor": "List of named candidates",
                    "effect": "Neutral. Of the five named—Gnangbo Kacou, Laurent Gbagbo, Pascal Affi N'Guessan, Jean-Louis Billon, Simone Gbagbo—Laurent Gbagbo is already widely regarded as disqualified (ineligible due to conviction), but the focus is on new exclusions/disqualifications before July 1. The others, especially Billon and Affi N'Guessan, have not shown immediate legal vulnerabilities in the latest reporting."
                }
            ],
            "no_scenario": "All named candidates except Gbagbo (whose ineligibility is longstanding news) remain on the electoral list and eligible by July 1, 2025. The authorities, wary of further unrest or international backlash, opt not to pursue new, high-profile disqualifications in the final weeks, even if legal disputes linger around certain candidacies.",
            "yes_scenario": "At least one of the named candidates—e.g., Jean-Louis Billon, Simone Gbagbo, or Gnangbo Kacou—is removed from the electoral list or ruled ineligible under a new legal pretext (dual nationality, questions of party legitimacy, civil status, or criminal cases) by the courts/CEI before July 1, 2025. This could occur as part of a continuing effort to weaken and fragment the opposition or due to administrative/judicial review of the finalized candidate files.",
            "final_reasoning": "Base rates from recent Ivorian elections and the present news environment clearly establish a pattern of strategic exclusion of opposition candidates via legal or administrative means. Laurent Gbagbo is already ineligible as of now (per multiple sources). Tidjane Thiam, although high-profile, is not on the named list for resolution. There is intense scrutiny on opposition figures as potential legal pretexts for last-minute exclusion remain plausible—most notably around party eligibility (e.g., infighting within PDCI potentially exposing Billon), criminal cases, or even administrative challenges. However, for remaining figures, no immediate legal move is in the works per the latest reporting (as of May 29-30, 2025), and candidate list finalizations are near closure. Given the government’s recent history, the risk remains non-negligible but is unlikely to affect a majority of the named candidates. Taking all factors—especially the regime's willingness for exclusion, slow but notable international scrutiny, and pending legal windows—a probability at the high end of the plausible range is justified. Factoring in both the strong propensity for exclusion shown recently and the near-finalization of lists, I judge a 70% chance that at least one of the listed candidates (apart from those already ineligible as of the forecast date) will be disqualified before July 1, 2025.",
            "final_probability": 70
        },
        "InternationalHumanRightsAfricanCharterOnDemocracyElectionsGover": {
            "time_to_resolution": "Approximately 1 month (until July 1, 2025)",
            "perspective_relevance": "As an expert in International Human Rights with a focus on the African Charter on Democracy, Elections and Governance (ACDEG), I bring an understanding of continental norms regarding fair, inclusive, and lawful electoral participation. I am attuned to both the legal technicalities of candidate eligibility as well as broader political factors influencing exclusion, including the use (and misuse) of legal/judicial mechanisms to restrict opposition candidacies. My perspective allows assessment of the intersection of domestic Ivorian law/politics and international/continental standards for democratic processes.",
            "status_quo": "As of late May 2025, several high-profile candidates have already been removed from the electoral list for the 2025 Ivorian presidential election (notably Tidjane Thiam and Laurent Gbagbo), but the named candidates in this forecast (Gnangbo Kacou, Laurent Gbagbo, Pascal Affi N'Guessan, Jean-Louis Billon, or Simone Gbagbo) are still at various stages of pursuing or maintaining their candidacies. If nothing changes, at least some of these candidates could remain eligible as per the current lists, though serious legal and political risks persist.",
            "perspective_derived_factors": [
                {
                    "factor": "Precedent of judicial and administrative exclusion of opposition candidates",
                    "effect": "Increases probability, as recent systematic exclusions (e.g., Thiam, Gbagbo, Soro) mark a clear pattern of using legal means to disqualify rivals ahead of elections."
                },
                {
                    "factor": "International and domestic advocacy in response to exclusions",
                    "effect": "Slightly decreases probability, since ongoing domestic demonstrations and international attention/pressure may create incentives for authorities to moderate further exclusions for global legitimacy, especially as international scrutiny increases in the election window."
                },
                {
                    "factor": "Unresolved legal status and ongoing challenges for some candidates",
                    "effect": "Increases probability, as candidates such as Laurent Gbagbo (ineligibility due to conviction), Simone Gbagbo, or even Jean-Louis Billon may still face legal or political challenges (for instance, over prior convictions, citizenship, or party disputes)."
                },
                {
                    "factor": "Base rate/history of exclusion in Ivorian presidential races",
                    "effect": "Increases probability. The post-2010 history, including exclusion of high-profile opposition through judicial and administrative means in at least two cycles, evidences a high base rate for such occurrences ahead of tense elections."
                },
                {
                    "factor": "African Charter and ECOWAS involvement/lack of robust enforcement mechanisms",
                    "effect": "Neutral to weakly decreasing: While the African Charter and ECOWAS frameworks require inclusive democratic processes, in practice, their ability to enforce the reversal of exclusionary measures is limited—thus their real-world impact is more diplomatic than practical."
                }
            ],
            "no_scenario": "Domestic and international pushback on prior exclusions (e.g., for Thiam and Gbagbo) raises the political cost for the ruling party to further disqualify candidates. Legal remedies, court appeals, or amnesty (potentially as a gesture of national reconciliation, as seen in calls by both opposition and international entities) allow all remaining named candidates to retain their eligibility. No further adverse judicial rulings or administrative removals occur before July 1, 2025.",
            "yes_scenario": "Authorities, citing application of nationality laws, prior convictions, disputes over party leadership, or other technicalities, use the courts or administrative decrees to remove at least one of the named candidates from the electoral list or render them legally ineligible before July 1, 2025. Such action is consistent with the pattern established in the current cycle (with Thiam, Soro, Gbagbo) and prior cycles. This could happen very close to filing deadlines or as a result of a triggered legal challenge in June.",
            "final_reasoning": "The historical precedent in Côte d'Ivoire is that exclusion of high-profile opposition candidates is routine in the run-up to presidential elections, purportedly on legalistic grounds (nationality, criminal conviction, party legitimacy). In 2025, we have already seen this with Tidjane Thiam and others; Gbagbo remains formally ineligible (conviction), Jean-Louis Billon’s candidacy is contested within his party, and Gnangbo Kacou is publicly protesting exclusion mechanisms. Moreover, the government has not hesitated to use the judiciary and electoral administration to prevent rivals from contesting. Domestic and international resistance to exclusions has modestly increased—yet, the authorities’ incentives to keep strong challengers out remain high, and the legal tools to do so are accessible and already in use. The risk is particularly acute for Laurent Gbagbo and possibly Simone Gbagbo; Jean-Louis Billon could also be targeted if intra-party disputes escalate or new legal challenges emerge. With just over a month to go—and a final electoral list not yet closed—there remains substantial time and political motive for at least one further exclusion. The base rate for such outcomes, plus the current pattern and the lack of robust external enforcement, lead me to a strong but not absolute probability that at least one named candidate will be disqualified before July 1, 2025.",
            "final_probability": 85
        },
        "InternationalHumanRightsUniversalDeclarationOfHumanRightsElecto": {
            "time_to_resolution": "About one month (until July 1, 2025)",
            "perspective_relevance": "As an expert in International Human Rights, specifically concerning Universal Declaration of Human Rights electoral rights (notably UDHR Article 21: right to participate in one's government through periodic, genuine elections), my perspective evaluates not only legal eligibility, but also international standards for exclusion from candidacy (unjust, politically driven disqualifications) and the domestic Ivorian legal and political context. This allows a multi-layered analysis: historical base rates of opposition exclusion, legal pretexts often invoked in West Africa to disqualify opposition, and the fragility or compromise of electoral institutions.",
            "status_quo": "As of now, several prominent opposition figures (notably Laurent Gbagbo, Tidjane Thiam, Charles Blé Goudé, and Guillaume Soro) have already been disqualified or excluded. The question focuses on whether, among Gnangbo Kacou, Laurent Gbagbo, Pascal Affi N'Guessan, Jean-Louis Billon, or Simone Gbagbo, any will be disqualified from running before July 1, 2025. The status quo is that Laurent Gbagbo is currently deemed ineligible due to judicial conviction, Simone Gbagbo's eligibility is being challenged, and the opposition is fragmented and subject to legal maneuvering.",
            "perspective_derived_factors": [
                {
                    "factor": "Base rate of opposition disqualification in Côte d'Ivoire and West Africa",
                    "effect": "Strongly increases probability; the exclusion of major opposition figures via technicalities or judicial means is a well-established pattern, especially close to elections under contentious regimes."
                },
                {
                    "factor": "Recent judicial and electoral commission activity",
                    "effect": "Increases probability; the removal of Tidjane Thiam in April/May 2025 evidences ongoing use of legalistic justification for exclusion, risking further disqualifications among opposition, including listed candidates like Laurent Gbagbo and potentially Simone Gbagbo."
                },
                {
                    "factor": "International and domestic reactions, legal appeals",
                    "effect": "Somewhat decreases probability; while international criticism (UN, ECOWAS) and domestic mobilization can sometimes pressure authorities to soften repressive measures, there is no strong evidence of imminent reinstatement. However, last-minute legal restorations—while rare—do occasionally occur as a result of intense pressure."
                },
                {
                    "factor": "Party fragmentation and intra-opposition conflict",
                    "effect": "Marginally increases probability; divided opposition often fails to generate mass mobilizations or coordinated resistance to candidate exclusions, making it easier for authorities to pick off individuals without much political cost."
                },
                {
                    "factor": "Current legal status of named candidates",
                    "effect": "Strongly increases probability; Laurent Gbagbo is explicitly described in multiple credible sources as ineligible due to conviction unless a presidential pardon or amnesty is granted. The provisional voter lists and court decisions suggest this exclusion will persist at least through July 1, unless executive clemency is unexpectedly issued."
                },
                {
                    "factor": "Stability imperative and regime's perceived threat from particular candidates",
                    "effect": "Increases probability; the government may justify exclusions on the grounds of stability, particularly for figures associated with past unrest or divisive politics (Laurent Gbagbo, to a degree Simone Gbagbo), seeing their candidacy as a destabilizing factor."
                }
            ],
            "no_scenario": "All listed candidates remain eligible and none are legally removed from the electoral list by July 1. This could occur if the government, under intense domestic and international pressure, refrains from further exclusions after already disqualifying key rivals (such as Thiam and Soro), or if courts find for the opposition in last-minute appeals, or if an amnesty/pardon is extended to the likes of Laurent Gbagbo, thus restoring their eligibility before the deadline.",
            "yes_scenario": "Any of the listed candidates—most likely Laurent Gbagbo (due to existing conviction and precedent)—remains disqualified or is newly and credibly reported as having been removed from the electoral list or banned from candidacy by July 1, 2025. It is possible, though a bit less likely, that Jean-Louis Billon, Pascal Affi N'Guessan, Simone Gbagbo, or Gnangbo Kacou face similar legal or administrative exclusion, particularly as the ruling party makes further moves to cement its electoral advantage before official candidate finalization.",
            "final_reasoning": "Given the base rate of opposition exclusion, current credible reporting (BBC and French media) explicitly noting Laurent Gbagbo as excluded from the voter/candidate list due to a judicial conviction, and no credible reports of imminent pardons or successful appeals, the probability that at least one named candidate is disqualified before July 1 is very high. News as recent as late May 2025 confirms Gbagbo's exclusion is essentially a fait accompli, with both local and international actors recognizing this status; thus, unless there is a dramatic and rapid legal or political reversal (which in itself would warrant a substantial update), the answer will be Yes. The possibility that additional candidates will be excluded cannot be ruled out, but is less certain than Gbagbo's already-confirmed exclusion. International legal appeals are ongoing, but as of now have not succeeded in reinstating excluded figures. Therefore, the forecast should be high-confidence.",
            "final_probability": 97
        },
        "PoliticalScienceEliteTheory": {
            "time_to_resolution": "About 1 month (until July 1, 2025).",
            "perspective_relevance": "Elite Theory posits that a small group of powerful individuals or coalitions control political decision-making, often using legal, institutional, or procedural mechanisms to serve their own interests and preserve their status. In Côte d'Ivoire, the political landscape is heavily shaped by elite maneuvering, with the ruling party and state apparatus exerting significant influence over judiciary and electoral processes. Thus, analyzing disqualification risks through this lens highlights how incumbent elites might leverage legal mechanisms to exclude rivals—especially amid threats to their hold on power.",
            "status_quo": "As of May 30, 2025, several top opposition figures (Laurent Gbagbo, Charles Blé Goudé, Guillaume Soro, and Tidjane Thiam) have already been disqualified. For the specific candidates in question: Laurent Gbagbo faces judicial exclusion unless granted presidential amnesty; Simone Gbagbo remains technically eligible but could face exclusion for other reasons; Jean-Louis Billon, Gnangbo Kacou, and Pascal Affi N'Guessan have so far not been formally disqualified, but the political environment remains fluid. The status quo is thus: a high-controversy pre-election environment, use of legalistic pretexts to sideline certain opposition leaders, but not all named candidates have yet been disqualified.",
            "perspective_derived_factors": [
                {
                    "factor": "Judicial Instrumentalization by Incumbent Elites",
                    "effect": "INCREASES the probability: The use of courts and electoral commissions to sideline credible opposition leaders is well-documented in recent Ivorian electoral history (e.g., Gbagbo in 2020, Thiam in 2025, and Blé Goudé). Elite theory suggests ongoing incentives for the ruling elite (RHDP/Ouattara) to manipulate processes and further disqualify threatening candidates."
                },
                {
                    "factor": "International and Domestic Pressure",
                    "effect": "DECREASES the probability: Visible pushback from domestic actors (protests, rallies) and some international diplomatic engagement (UN envoy urging dialogue, peace initiatives) raise potential costs for overtly undemocratic disqualifications going forward—especially with major opposition figures already disqualified."
                },
                {
                    "factor": "Legal Precedent/Baseline Rate",
                    "effect": "INCREASES probability: There is a strong precedent for judicially motivated disqualifications (2020, 2025), but these have generally targeted higher-profile figures already excluded (Gbagbo, Thiam, Blé Goudé, Soro). However, last-minute exclusions are not rare in Ivorian elections."
                },
                {
                    "factor": "Fragmentation and Weakness of Opposition",
                    "effect": "INCREASES probability: Divided opposition provides incentives for the ruling elite to pick off additional, less-threatening candidates if it helps minimize electoral risk (e.g., neutralizing Billon or Kacou), potentially on technicalities."
                },
                {
                    "factor": "Time Constraint",
                    "effect": "DECREASES probability: With about a month to go, the window is tightening for additional legal action or commission decisions to remove further candidates before July 1. The largest judicial purges have already occurred, so the marginal risk for further disqualifications is reduced."
                }
            ],
            "no_scenario": "The already-disqualified major figures (Gbagbo, Thiam, Blé Goudé, Soro) remain off the ballot. The remaining named candidates (Billon, Simone Gbagbo, Kacou, Affi N'Guessan) are not viewed as enough of a threat by the ruling elite to justify the cost (domestic unrest, international criticism) of further disqualifications, especially as opposition fragmentation reduces their electoral chances. Thus, no new disqualifications occur before July 1.",
            "yes_scenario": "One (or more) of the listed candidates—most likely Gnangbo Kacou, Jean-Louis Billon, or Pascal Affi N'Guessan—is removed from the race in the coming month, possibly on the basis of minor legal or procedural grounds (questions over registration, party endorsement, nationality paperwork, or judicial proceedings). Elite interests calculate the incremental benefit of such exclusion outweighs the risks, and the judiciary or electoral commission acts accordingly. Alternatively, Simone Gbagbo could be excluded under a revived judicial case, but there's less recent news of this.",
            "final_reasoning": "Elite Theory analysis suggests the Ivorian system is highly prone to incumbent manipulation of candidacy eligibility—especially when regime interests are threatened. This precedent is visible in the 2020 and 2025 cycles. Of the listed candidates, the biggest disqualification risks have already materialized, targeting the most prominent opposition threats (Thiam, Gbagbo). However, divisions within the remaining opposition and the history of last-minute legal moves mean disqualification risks remain non-trivial, especially for Billon or Kacou, who have become more vocal and visible. Current news suggests the ruling elite is content with the status quo, having eliminated the key threats; further moves would carry escalating risk. The short timespan (only one month to July 1) reduces the opportunity for action. Historically, in comparable environments, the base rate for late-stage high-profile candidate exclusion after major purges is moderate: roughly 15–25%. Taking all factors—ongoing elite incentives, legal precedents, but increased domestic/international cost and time pressure—into account, my forecast is at the higher end of this base rate due to the tension, protests, and precedent, but not extremely high, given the reduced threat from remaining candidates. Final probability: 27%.",
            "final_probability": 27
        },
        "PoliticalScienceAuthoritarianResilience": {
            "time_to_resolution": "Approximately 1 month (from May 30, 2025, until July 1, 2025).",
            "perspective_relevance": "As an expert in Political Science specializing in Authoritarian Resilience, I focus on how semi-authoritarian or competitive authoritarian regimes utilize legal frameworks, institutional manipulation, and selective electoral exclusion to manage opposition and maintain regime stability. Côte d'Ivoire's history of exclusionary politics and the regime's propensity to shield its hold on power via judiciary means are particularly pertinent when evaluating the likelihood of candidate disqualification, especially under mounting political tensions.",
            "status_quo": "As of the forecast date, several major opposition figures (e.g., Tidjane Thiam, Laurent Gbagbo, Charles Blé Goudé) have already been disqualified or excluded from the race. Among the candidates specified in the forecast (Gnangbo Kacou, Laurent Gbagbo, Pascal Affi N'Guessan, Jean-Louis Billon, Simone Gbagbo), Laurent Gbagbo is officially designated as a candidate by his party but has an unresolved legal status that puts his eligibility in question. For others, there is political friction but no concrete recent legal actions reported.",
            "perspective_derived_factors": [
                {
                    "factor": "Judicialization of Politics and Regime Use of Exclusionary Legal Mechanisms",
                    "effect": "Increases Probability"
                },
                {
                    "factor": "Recent Disqualification of Major Figures",
                    "effect": "Moderately Increases Probability—indicates ongoing willingness to remove challengers"
                },
                {
                    "factor": "Fragmentation and Weakening of the Opposition",
                    "effect": "Slightly Increases Probability—disunified opposition is easier to manipulate via targeted exclusions"
                },
                {
                    "factor": "Timing/Proximity to Candidate List Finalization",
                    "effect": "Increases Probability—disqualifications often occur close to deadlines to minimize opposition response"
                },
                {
                    "factor": "Past Authoritarian Resilience Tactics in Côte d'Ivoire",
                    "effect": "Increases Probability—Ouattara regime demonstrated readiness to use courts and electoral commission to manage threats"
                },
                {
                    "factor": "Legal/Technical Obstacles for Reinstatement",
                    "effect": "Decreases Probability—window for legal challenges is closing, most court challenges have already been exhausted"
                },
                {
                    "factor": "Public and International Scrutiny (UN/Ecowas involvement, political mobilization)",
                    "effect": "Slightly Decreases Probability—high-profile removals may trigger backlash, making regime cautious"
                }
            ],
            "no_scenario": "No new legal or procedural moves are made against the named candidates before July 1, 2025. The status quo remains: Laurent Gbagbo continues to be treated as ineligible but is not formally disqualified again during this period; Jean-Louis Billon, Simone Gbagbo, Gnangbo Kacou, and Affi N'Guessan retain their eligibility (assuming no outstanding court rulings or new challenges emerge). Mobilizations and protests remain contained without catalyzing further purges from the electoral list.",
            "yes_scenario": "Before July 1, 2025, authorities or courts explicitly disqualify one or more of: Gnangbo Kacou, Laurent Gbagbo, Simone Gbagbo, Jean-Louis Billon, or Pascal Affi N'Guessan. This could emerge via a sudden late court ruling (e.g., upholding Gbagbo’s ineligibility or finally formalizing his exclusion), technicalities related to electoral list appeals, or renewed efforts at weakening the opposition through legal removal. Given that Gbagbo and others have faced recurrent legal challenges, and the precedent of last-minute removals exists, this scenario is plausible.",
            "final_reasoning": "The regime has repeatedly used legal and technical mechanisms to eliminate strong challengers—Gbagbo and Blé Goudé in particular are historically vulnerable, as is any candidate whose documentation or status can be called into question. While protest activity and international attention argue for caution, the government has not hesitated to act if stability seems threatened. Given that less than a month remains and many high-profile disqualifications have already occurred, the base rate for last-minute removals is high but diminishes with time as the legal calendar closes. Still, Laurent Gbagbo remains a key risk given ambiguous eligibility and regime incentives; Jean-Louis Billon could face intra-party or technical challenges but appears less targeted. The probability of at least one further disqualification among the specified candidates before July 1, 2025, is thus above base political disqualification rates for competitive authoritarian systems in Africa at a comparable juncture—especially as Gbagbo remains formally named but not yet cleared. That said, most legal mechanisms have run their course for this electoral cycle, leaving a moderate but not extreme risk in the final month.",
            "final_probability": 65
        },
        "PoliticalScienceComparativeDemocratization": {
            "time_to_resolution": "Just over 1 month, until July 1, 2025.",
            "perspective_relevance": "As a political scientist specializing in comparative democratization, I can draw on insights into electoral authoritarianism, the use of legal-administrative tactics to manage electoral competition, and the elite strategies utilized in semi-competitive African regimes. Côte d'Ivoire is emblematic of 'managed' electoral competition where legal-institutional frameworks are often leveraged to disadvantage opposition, especially in high-stakes presidential races. Understanding these recurring patterns in democratizing and hybrid regimes enhances my ability to interpret both legal developments and their political underpinnings.",
            "status_quo": "Multiple major opposition candidates (Tidjane Thiam, Charles Blé Goudé, Guillaume Soro, and, crucially, Laurent Gbagbo) have already been removed from the electoral list or face legal bars to candidacy. Of the five named in the forecast question, Laurent Gbagbo is still considered ineligible at present due to a prior conviction; Jean-Louis Billon and Simone Gbagbo remain potential opposition standard-bearers. The government and courts have recently shown willingness to actively manage the list, amid opposition mobilization.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent high-profile exclusions of opposition candidates (using nationality and criminal record clauses)",
                    "effect": "Increases the probability. The courts and electoral commission have recently shown readiness to exclude viable challengers on legalistic grounds, a common tactic in hybrid regimes facing fragmented and antagonistic opposition."
                },
                {
                    "factor": "Judicial and administrative closure of appeals process",
                    "effect": "Increases the probability, as recourse for excluded candidates is minimal. News references the closure of the contestation period and judicial reluctance to revisit exclusion decisions (notably with Thiam and Gbagbo), showing that the window for legal or administrative reversal is closing, not opening."
                },
                {
                    "factor": "Candidate profile and perceived political threat",
                    "effect": "Increases the probability somewhat. The most prominent figures (e.g., Laurent Gbagbo, already ineligible, and Simone Gbagbo) provoke maximum regime caution. Jean-Louis Billon, as a PDCI dissident, is less individually threatening but PDCI's internal instability could be exploited to sideline rivals."
                },
                {
                    "factor": "Historical base rate of candidate exclusions in Ivorian and regional elections",
                    "effect": "Increases the probability given precedent: in 2020, multiple major opposition figures were excluded from the race via legal-institutional means, echoing trends in Cameroon, Togo, Gabon, and elsewhere where incumbent regimes routinely reduce competition using the courts and electoral commissions."
                },
                {
                    "factor": "International pressure and domestic protest activity",
                    "effect": "Decreases probability slightly. Strong international focus (e.g., UN, ECOWAS, religious leaders) and mobilization (marches, calls for peaceful contestation) might temper further exclusions if the ruling party feels the risk of unrest outweighs the benefit of further narrowing competition—especially with multiple rounds of protests already underway."
                },
                {
                    "factor": "Legal/final eligibility status of each specific candidate named",
                    "effect": "Critical for the baseline: Laurent Gbagbo and Simone Gbagbo's eligibility is ambiguous. Jean-Louis Billon is still running as of the latest news, Affi N'Guessan and Gnangbo Kacou are formally indicated as still in the race and not yet disqualified."
                }
            ],
            "no_scenario": "No additional candidates (Gnangbo Kacou, Laurent Gbagbo, Pascal Affi N'Guessan, Jean-Louis Billon, Simone Gbagbo) are legally disqualified before July 1, 2025 beyond the current status quo. The regime, feeling the costs of international and domestic scrutiny, refrains from further narrowing the field before the official candidate list is published. Active opposition mobilization and international mediation help preserve the nominal eligibility of secondary candidates such as Billon and N'Guessan, while Laurent Gbagbo and other previously excluded candidates remain legally shut out.",
            "yes_scenario": "At least one of the named candidates is disqualified, removed from the electoral list, or otherwise made legally ineligible before July 1, 2025. This most plausibly occurs via the authorities applying nationality, residency, or criminal record criteria, as in recent months. Laurent Gbagbo or Simone Gbagbo could face formal confirmation of their exclusion, or Jean-Louis Billon could face a procedural disqualification as PDCI's internal disputes play out. Alternatively, a sudden legal or administrative ruling (or the publication of the final candidate list by the CEI) could reveal new exclusions in the coming weeks.",
            "final_reasoning": "The baseline in Côte d'Ivoire is one of strong incumbent control over the electoral process, with regular use of legal and administrative levers to shape competition. The current status: at least two of the listed candidates (Laurent Gbagbo, Simone Gbagbo) face eligibility questions, and credible news sources connect them to legal contestation and possible exclusion. The judicial and administrative environment is openly adversarial to the opposition, with few effective recourses. Precedent is strong, with most prior elections in the last decade seeing the disqualification of major opposition figures on technical grounds. The recent removal of Tidjane Thiam, and references to Gbagbo's ineligibility, reinforce that the threat is current, not hypothetical. However, Jean-Louis Billon remains vigorously active, and the authorities may feel pressured to preserve at least a thin veil of competition, especially under international watch and after recent opposition mobilization. Weighing these factors, it is highly probable—not quite certain, but upwards of 80%—that at least one of the remaining named candidates is officially confirmed as disqualified by July 1, 2025. The remaining scenario for 'No' is narrow and would require a substantial shift in regime calculus or an unexpected legal reprieve. The most likely paths to 'Yes' are through the final publication of the candidate list or a court/commission ruling formalizing the already-de facto exclusions of Laurent or Simone Gbagbo. The limited time window reduces the chance of surprise but does not anchor it below the base rate established by recent events.",
            "final_probability": 83
        },
        "LawConstitutionalLawIvoryCoast": {
            "time_to_resolution": "About 1 month (forecast made May 30, 2025; question resolves July 1, 2025)",
            "perspective_relevance": "As an expert in Constitutional Law of Côte d'Ivoire, I bring legal insight into the technical eligibility requirements for presidential candidates and how the rule of law, judicial precedent, and political maneuvering impact disqualifications. My perspective includes reading the constitutional and legal clauses as applied in recent Ivorian practice, understanding the relationship between the judiciary and executive, and past patterns in politically-motivated exclusions.",
            "status_quo": "As of now, Laurent Gbagbo and Simone Gbagbo appear to be facing substantial eligibility challenges (Gbagbo due to a prior conviction and Simone perhaps as well), while Jean-Louis Billon, Gnangbo Kacou, and Pascal Affi N'Guessan have not been officially barred; but the environment is volatile and legal-political disputes remain unresolved and susceptible to rapid change.",
            "perspective_derived_factors": [
                {
                    "factor": "Legal barriers and recent precedence for exclusion",
                    "effect": "Increases probability. Recent decisions have barred several high-profile candidates, including Laurent Gbagbo and Tidjane Thiam, demonstrating the regime's willingness to apply strict legal/administrative criteria to sideline opposition figures."
                },
                {
                    "factor": "Judicial independence and political pressure",
                    "effect": "Increases probability. The judiciary in Côte d'Ivoire has a record of rulings in line with the interests of the executive, especially in the run-up to elections, suggesting susceptibility to political pressure for further disqualifications."
                },
                {
                    "factor": "Public mobilization and international attention",
                    "effect": "Decreases probability. Visible protests, international condemnation, and pressure from ECOWAS or other internationals actors can make further exclusions more costly and may lead the regime to moderate its stance if unrest threatens broader stability."
                },
                {
                    "factor": "Technical grounds for invalidation (nationality, criminal record, administrative technicalities)",
                    "effect": "Increases probability. The law, per Article 55 of the Constitution, is stringently applied (e.g., exclusive Ivorian nationality, no serious convictions). Candidates with ambiguous status or prior convictions (e.g., Laurent Gbagbo, Simone Gbagbo) are at elevated risk."
                },
                {
                    "factor": "Fragmentation of opposition and internal party disputes",
                    "effect": "Increases probability. Divided or weak opposition may embolden regime hardliners to proceed with targeted exclusions, perceiving little risk of a unified backlash."
                },
                {
                    "factor": "Base rate of candidate exclusion in past Ivorian elections (since 2010)",
                    "effect": "Increases probability. There is a consistent pattern of last-minute legal or administrative elimination of strong opposition candidates."
                }
            ],
            "no_scenario": "No further candidates are officially barred prior to July 1, 2025; those already facing obstacles (such as Laurent Gbagbo or Simone Gbagbo) remain excluded under earlier court decisions, but no new removals (such as Billon, Affi N'Guessan, or Kacou) are announced before the deadline. The authorities either consider the current exclusions sufficient or opt not to escalate the legitimacy crisis.",
            "yes_scenario": "The electoral or judicial authorities announce - before July 1, 2025 - the disqualification or removal from the electoral list of at least one among Gnangbo Kacou, Laurent Gbagbo, Pascal Affi N'Guessan, Jean-Louis Billon, or Simone Gbagbo, based on nationality, conviction, or technical procedural grounds.",
            "final_reasoning": "The immediate context is one in which several top-tier opposition candidates (Blé Goudé, Soro, Thiam) have already been removed from the race, with legal decisions being swift and largely non-appealable. News articles confirm that Laurent Gbagbo is ineligible owing to past convictions and lack of presidential amnesty (despite amnesty at the international level, Ouattara has not provided the national pardon necessary under Ivorian law). Simone Gbagbo's situation is less clear: she is campaigning but also has a conviction history. Billon and Affi N'Guessan have not been targeted yet. There is growing opposition mobilization, but no regime retreat so far. The base rate for disqualifying serious opposition figures just before the official candidate deadline is high in Côte d'Ivoire, especially where the opposition is fragmented and the regime sees electoral exclusion as a viable means to manage competition. Given the technical legal tools available, the willingness to use them, recent court decisions, and the stated intention to exclude 'four main opposition leaders' per the government narrative, a further disqualification before July 1 is quite possible. Even a single formal announcement or publication of ineligibility on the electoral list is enough to resolve this question as 'Yes.' Therefore, based on all these factors and weighing that some of those listed—Gbagbo and Simone Gbagbo—seem extremely likely to (continue to) be disqualified or to have that status formalized before July 1, 2025, I assess a very high probability.",
            "final_probability": 92
        },
        "LawElectoralLawAfricanStates": {
            "time_to_resolution": "Approximately 1 month until July 1, 2025.",
            "perspective_relevance": "As an expert in African electoral law, I can assess the specific legal grounds for candidate exclusion in Côte d'Ivoire, including both constitutional clauses (e.g., for nationality, criminal convictions) and patterns of legal or administrative interventions in the candidate vetting process. My familiarity with how political and judicial institutions behave in contested African elections is crucial for parsing both stated and implicit legal risks to candidates' eligibility.",
            "status_quo": "At this moment, Tidjane Thiam, a major opposition figure, has already been disqualified from the list, but he is not among the named forecasted candidates. Of the forecast group (Gnangbo Kacou, Laurent Gbagbo, Pascal Affi N'Guessan, Jean-Louis Billon, Simone Gbagbo), several are in a precarious legal situation but officially remain candidates, and disqualification of high-profile opposition figures is an established but irregular practice in Côte d’Ivoire.",
            "perspective_derived_factors": [
                {
                    "factor": "Legal Precedent for Disqualification of Opposition Leaders",
                    "effect": "Increases probability. Recent electoral cycles (2015, 2020) have shown that Ivorian authorities commonly use judicial means to bar major opposition figures, particularly those with criminal convictions or contested nationality issues. Laurent Gbagbo and Simone Gbagbo, for instance, have faced such barriers repeatedly."
                },
                {
                    "factor": "Current Legal Status of Named Candidates",
                    "effect": "Increases probability. Laurent Gbagbo remains under a judicial conviction for the 2010-2011 post-electoral crisis despite international amnesty, and has not been re-registered on the electoral list, yet his candidacy is pushed by his party—raising both legal and administrative risk of official exclusion before July 1."
                },
                {
                    "factor": "Timing and Publication of Final Electoral List",
                    "effect": "Significantly increases probability. The final list publication deadline (June 20, 2025) precedes the resolution date, creating a direct procedural moment for exclusions to be publicly confirmed."
                },
                {
                    "factor": "Political Context & Use of Law as Political Weapon",
                    "effect": "Increases probability. As tension rises approaching the election, there are clear signs (as reported) that the exclusion of opposition figures serves consolidation of power for the governing RHDP, who have established precedent for such actions."
                },
                {
                    "factor": "International/Regional Pressure or Legal Recourse",
                    "effect": "Decreases probability. Efforts to appeal to ECOWAS or the African Court of Justice have some, although limited, potential to stave off exclusions, but to date, these have not reversed major exclusions. If international observers pressure for due process, some figure may be provisionally included."
                },
                {
                    "factor": "Personal Positioning of Candidates (e.g., Affi N’Guessan, Billon)",
                    "effect": "Slightly decreases probability. Candidates without significant legal baggage (e.g., Affi N'Guessan, Jean-Louis Billon) currently face less explicit legal risk, assuming no new adverse rulings surface."
                }
            ],
            "no_scenario": "All five named candidates remain on the electoral list as of July 1, 2025, with authorities refraining from any last-minute exclusions either for fear of international reprisal or domestic unrest, and any legal disputes lingering without formal resolution prior to the cutoff date.",
            "yes_scenario": "One or more of Laurent Gbagbo, Simone Gbagbo, or Gnangbo Kacou (given his profile as a protest candidate) is formally disqualified on legal-judicial grounds—most likely due to unresolved criminal convictions (Gbagbo), administrative decisions based on contested eligibility, or explicit rulings from the electoral commission ahead of the final list's publication.",
            "final_reasoning": "The Ivorian state has repeatedly utilized the judiciary and administrative procedures to disqualify opposition figures, with current news showing a fresh round of legal exclusions ahead of the 2025 poll. Laurent Gbagbo, in particular, is highlighted in several news items as being excluded from the list due to his prior conviction, and party officials openly admit to fighting for his reintegration. There is a pending final electoral list release (June 20), and several signals (e.g., unrest over Thiam, continued campaigns for Gbagbo) indicate that government authorities continue to see exclusion as politically advantageous. While Jean-Louis Billon and Affi N'Guessan currently seem less at risk, the fate of Gbagbo is uncertain but precarious, and the state’s willingness to act is evident. Therefore, the odds of at least one candidate in the named list being (or remaining) excluded by July 1 are high, primarily due to Gbagbo's and possibly Simone Gbagbo's situations.",
            "final_probability": 85
        },
        "AfricanStudiesFrancophoneWestAfricanPolitics": {
            "time_to_resolution": "32 days (until July 1, 2025)",
            "perspective_relevance": "As an expert in Francophone West African Politics, I bring to bear a nuanced understanding of Côte d'Ivoire's political elite dynamics, the historical precedents of candidate exclusion, the mechanics of the Ivorian judiciary, and the strategic use of legal and administrative tools by the incumbent regime to shape the electoral landscape. My academic and practical knowledge of regional political culture, political party fragmentation, constitutional manipulation, and realpolitik in Côte d'Ivoire enable a granular reading of both national and sub-regional trends.",
            "status_quo": "As of now, several high-profile opposition figures have already been disqualified or are under legal exclusion—most prominently, Laurent Gbagbo (judicial conviction), and Tidjane Thiam (dual nationality issue, already legally excluded prior to this forecast). There is significant precedent for last-minute or ongoing exclusions on questionable legal grounds. Most other candidates on this list remain formally on the lists, though these processes are volatile.",
            "perspective_derived_factors": [
                {
                    "factor": "Political Instrumentalization of the Judiciary",
                    "effect": "Increases probability. The Ivorian regime has a robust history of using judicial rulings to disqualify real or perceived threats to incumbent power. This already resulted in Gbagbo, Blé Goudé, Soro, and Thiam’s exclusion. This remains a tool available for further exclusions among the listed candidates."
                },
                {
                    "factor": "Current Legal Status and Precedents",
                    "effect": "Strongly increases probability, especially for Gbagbo (already ineligible due to previous conviction) and Simone Gbagbo (also previously prosecuted though currently not officially disqualified). Jean-Louis Billon and Pascal Affi N'Guessan face internal party disputes but as of now, no known legal impediment for them. Gnangbo Kacou appears less threatening to the regime and historically less targeted."
                },
                {
                    "factor": "Short Remaining Window for Legal Contestation",
                    "effect": "Decreases probability modestly. With only a month remaining, the opportunity for procedural exclusions is narrowing, especially given the closure of official contestation periods for certain eligibility challenges."
                },
                {
                    "factor": "Base Rates and Historical Patterns",
                    "effect": "Increases probability. In every Ivorian presidential cycle since 2010, at least one opposition figure of consequence has been removed from contention, often multiple. However, for this specific list (excluding Thiam, who is already out), base rate is somewhat lower, but still substantial."
                },
                {
                    "factor": "Fragmented Opposition and Lack of Unified Pushback",
                    "effect": "Increases probability. The regime has little domestic or international incentive to refrain from additional exclusions, as the opposition is divided and international actors have shown limited willingness to impose costs for such behavior."
                },
                {
                    "factor": "International and Regional Pressure",
                    "effect": "Decreases probability slightly. While ECOWAS or the African Court can issue rulings or statements, these have proven largely ineffectual without direct action by the Ivorian government, as seen with the ignored ECOWAS/African Court rulings on Gbagbo."
                },
                {
                    "factor": "Recent News on Each Candidate's Status",
                    "effect": "Neutral overall. Jean-Louis Billon is vocally preparing a campaign, suggesting no imminent disqualification moves. Affi N'Guessan's calls for opposition unity suggest he is actively maneuvering and not facing exclusion. No direct hints in the news that Gnangbo Kacou or Simone Gbagbo are being targeted for exclusion at the moment. Most focus has been on Thiam and Gbagbo."
                }
            ],
            "no_scenario": "No further disqualifications are enacted before July 1, 2025. This could result from procedural deadlines closing, waning regime interest in additional exclusions, lack of perceived threat from the listed candidates, or a calculated decision to allow some opposition participation to avert legitimacy crises. Political and judicial attention remains squarely on Thiam (already out) and Gbagbo, with Billon, Affi N'Guessan, Simone Gbagbo, and Gnangbo Kacou all making it onto the final candidate list via default or inertia.",
            "yes_scenario": "Between now and July 1, 2025, at least one candidate is removed from the ballot. Possible triggers include a rapid court ruling on a pending case (e.g., due to a sudden legal challenge or revived past conviction), administrative exclusion (such as for 'irregularities' in paperwork or party disputes), or last-minute government intervention justified by security or nationality concerns. Given recent opposition mobilizations, the regime might perceive Jean-Louis Billon or Simone Gbagbo as newly threatening and act preemptively to neutralize them.",
            "final_reasoning": "Given the above factors, the historical base rate for high-profile, last-minute exclusions by the Ivorian regime is high. The current window for procedural exclusions is shrinking, but not closed, and the ruling party's dominance over both judicial and administrative systems creates persistent latent risk for further disqualifications. However, a number of the most likely exclusions (Gbagbo, Thiam) have already occurred or are practically locked in. Among the remainder, the most probable targets for new exclusion are Jean-Louis Billon (if he emerges as the main opposition figure for PDCI) and, to a lesser degree, Simone Gbagbo (given her history and the regime's tendency to restrict prominent Gbagbo family members). The main argument against further disqualification is that the regime may feel secure enough and international attention is relatively sleepy, which could favor allowing a controlled opposition to participate. Nevertheless, the presence of unaddressed legal vulnerabilities and regime paranoia suggest a significant risk remains. I therefore assess the probability at 35%, higher than a mere actuarial base rate for a random peaceful African democracy, but lower than in previous cycles because of the relatively advanced nature of current exclusions and the relatively low threat level posed by the remaining listed candidates.",
            "final_probability": 35
        },
        "AfricanStudiesPostcolonialStateFormation": {
            "time_to_resolution": "About 1 month until July 1, 2025.",
            "perspective_relevance": "As an expert in African Studies, specifically postcolonial state formation, I bring an understanding of how rule-of-law norms, party systems, and the contested legitimacy of state institutions shape electoral processes in Côte d'Ivoire. The interplay of legal exclusion, personalist politics, and the management of opposition figures are recurrent features in the political landscape of many postcolonial African states with histories of contested presidential succession.",
            "status_quo": "The status quo is one where several candidates have already faced serious hurdles or disqualification efforts. Tidjane Thiam, a prominent opposition leader, has been removed from the list; Laurent Gbagbo is declared ineligible due to a conviction; legal and administrative means are frequently employed to forestall strong opposition candidates. However, the five individuals specified in this forecast—Gnangbo Kacou, Laurent Gbagbo, Pascal Affi N'Guessan, Jean-Louis Billon, Simone Gbagbo—are all (as of 2025-05-30) publicly positioning themselves as candidates.",
            "perspective_derived_factors": [
                {
                    "factor": "Judicialized politics and legal manipulation",
                    "effect": "Increases probability: The Ivorian regime has a track record of disqualifying strong opposition figures on technical or legal grounds (e.g., nationality, convictions), often at late stages. This creates a high baseline risk for candidate exclusion, especially for Laurent Gbagbo and Simone Gbagbo who carry legal baggage from previous crises."
                },
                {
                    "factor": "State control over electoral institutions",
                    "effect": "Increases probability: The RHDP and President Ouattara have heavily influenced the Independent Electoral Commission (CEI) in the past, and the opposition has recently withdrawn from the CEI, which weakens checks on state-led exclusion."
                },
                {
                    "factor": "Fragmented and demobilized opposition",
                    "effect": "Could decrease probability: With the opposition divided and some candidates already disqualified, the regime's incentive to remove further less competitive candidates (e.g., Billon, Gnangbo) is modest unless they emerge as credible threats."
                },
                {
                    "factor": "Domestic and international scrutiny",
                    "effect": "Decreases probability: International actors and observers, including the UN and ECOWAS, are attentive to flagrant exclusions, and there have been calls for an amnesty to enhance legitimacy. However, their leverage is limited if the government frames exclusions as being fully within national law."
                },
                {
                    "factor": "Base rates of candidate exclusion in Côte d'Ivoire",
                    "effect": "Increases probability: Between 2010-2020, multiple Ivorian presidential elections have seen prominent opposition candidates excluded or otherwise prevented from running for legal or administrative reasons."
                },
                {
                    "factor": "Recent court decisions and legal deadlines",
                    "effect": "Increases probability: With court deadlines for contestation closed and legal routes largely exhausted domestically, the only recourse left for some is international legal action (e.g., ECOWAS Court), which may not yield rapid reinstatement. This solidifies current exclusions and raises the possibility of additional last-minute removals."
                }
            ],
            "no_scenario": "No new candidate from the specified list is disqualified before July 1, 2025. The government, calculating that it has sufficiently divided and weakened the opposition and has already neutralized the highest-risk adversaries (Thiam, Laurent Gbagbo), opts not to risk further controversy. Jean-Louis Billon, Simone Gbagbo, Gnangbo Kacou, and Affi N'Guessan remain on the list (even if facing ongoing political harassment), and only those already excluded as of May 30 stay excluded.",
            "yes_scenario": "One or more of the specified candidates are removed from the electoral list or declared ineligible before July 1, 2025, via a new court decision, administrative exclusion, or finalization of the list. This could happen due to a reinvigorated legal campaign to block Laurent Gbagbo (formalizing what some texts report as ongoing ineligibility), if Jean-Louis Billon's internal party challenges result in his exclusion, or if another legal technicality is invoked against a candidate such as Simone Gbagbo, given her prior political-judicial entanglements.",
            "final_reasoning": "Given recent historic trends in Côte d'Ivoire, the current climate of legal exclusions, and the precarious standing of some of these figures (notably Laurent Gbagbo, already facing contestation over his eligibility), the base rate for opposition candidate exclusion is high. The ruling party has shown willingness to use legalistic means against threats, and the finalization of the electoral list has not yet occurred. While the opposition is fragmented, which moderates the incentive to exclude further, there is ample precedent for late-stage legal maneuvers. International pressure may moderate but likely not prevent further exclusions, especially if framed as rule-of-law decisions. There is tangible risk—higher than random guessing but less than certainty—that another of the listed candidates will be excluded before July 1. Synthesizing these factors, I assign a probability of 70%.",
            "final_probability": 70
        }
    },
    "deliberation_probability": [
        90,
        70,
        85,
        97,
        27,
        65,
        83,
        92,
        85,
        35,
        70
    ],
    "deliberation_mean_probability": 72.63636363636364,
    "deliberation_sd": 22.922795323750233,
    "deliberation_probability_result": 73,
    "group_results": {
        "ElectionAdministrationInternationalIdeaElectoralStandards": {
            "forecaster_to_engage": "PoliticalScienceEliteTheory",
            "response_type": "critique",
            "response": "Elite Theory’s 27% is astonishingly low given both the Ivorian regime’s established playbook and the fresh pattern of judicial-technical knockouts up to and including the present moment. You’re too enamored with the 'window closing' logic and supposed regime risk-adverseness: Cote d’Ivoire’s rulers have always calculated that excluding opposition incurs little international or domestic cost, especially when the CEI and judiciary are regime tools. The 'reduced threat' from remaining candidates is an illusion—Billon is actively mobilizing, Simone Gbagbo still polarizes, and the regime incentivized to squeeze more. Disqualifications have come even closer to deadlines before (see 2020). A sub-30% call ignores both the ongoing legal skirmishes and the clear base rate for last-minute exclusion in Côte d'Ivoire, which is far, far higher after already removing the front-runners. That’s not sober analysis; it’s wishful thinking. Wake up to the dynamics of electoral authoritarianism—disqualification is not just possible, it’s practically expected here."
        },
        "ElectionAdministrationEcowasElectionObservationGuidelines": {
            "forecaster_to_engage": "PoliticalScienceEliteTheory",
            "response_type": "critique",
            "response": "Calling a 27% probability for candidate disqualification in this context is a classic case of underestimating both the regime’s audacity and the mechanics of late-stage exclusion so typical in Ivorian electoral warfare. You argue the regime will refrain from more moves due to 'increased domestic/international cost,' but recent disqualifications (Thiam, Blé Goudé, Gbagbo) happened with negligible blowback. The window for last-minute legal maneuvering remains wide open—as proven in previous cycles where the regime rode roughshod over formal deadlines. Claiming the opposition is not threatening enough for further purges is off-base: Billon’s positioning and ongoing protests show the field remains volatile. Your base rate is miscalibrated; in this setting, post-front-runner exclusion events cluster, not dissipate, towards final list publication. The true base rate for at least one exclusion in this last sprint is easily double your number. If you want to play it 'sober,' acknowledge that authoritarian incumbents finish what they start."
        },
        "InternationalHumanRightsAfricanCharterOnDemocracyElectionsGover": {
            "forecaster_to_engage": "AfricanStudiesFrancophoneWestAfricanPolitics",
            "response_type": "critique",
            "response": "A 35% probability is a dramatic underweighting of reality. Your reasoning asserts the regime could be content and the remaining opposition is too weak to bother with—classic error! This approach misses that the very logic of Ivorian electoral management is to remove unpredictability and to set examples, not merely to eliminate 'threats.' Billon and Simone Gbagbo fit the profile for exclusion simply by being focal points of alternative mobilization, even in a fragmented opposition. The final phase, before July 1, is routinely when legalistic crackdowns peak, not taper. The regime's track record is to sweep opposition from the field to proclaim 'stability.' International attention is not rising fast enough to change the calculus. If anything, the fact that disqualification machinery is already spinning makes further exclusions easier, not riskier. A 35% forecast is an outlier—much more African \"democratic\" optimism than is actually warranted."
        },
        "InternationalHumanRightsUniversalDeclarationOfHumanRightsElecto": {
            "forecaster_to_engage": "AfricanStudiesFrancophoneWestAfricanPolitics",
            "response_type": "critique",
            "response": "A 35% estimate here displays a surprising naivete about both recent Ivorian precedent and the syndrome of West African electoral exclusion. Your reasoning claims that the regime could now \"feel safe enough\" to allow a symbolic opposition and that international attention acts as a moderating factor—but that’s fantasy dressed in academic caution. The government has just excluded multiple contenders (Thiam, Soro, Blé Goudé, Gbagbo), the opposition is still agitating (see Billon and Kacou), and public mobilization actually raises regime paranoia, not forbearance. When the entire machinery is in motion—lawsuits, administrative reviews, and party fragmentation—late-stage exclusion is the rule, not the exception. The \"shrinking window\" does not close until the very last legal deadline passes, and historically, last-minute purges are common. Your optimistic lower figure is wishful thinking, not grounded in the current sustained legal-offensive and a context in which the regime is incentivized to control every risk. The odds are far higher."
        },
        "PoliticalScienceEliteTheory": {
            "forecaster_to_engage": "PoliticalScienceAuthoritarianResilience",
            "response_type": "critique",
            "response": "Authoritarian resilience theory is useful for understanding regime tactics, but your forecast (65%) fails to properly weight the time horizon and diminishing returns of further exclusions after the main threats are already neutralized. Historically, once high-profile figures like Gbagbo and Thiam are sidelined, rulers often allow a rump field to preserve a thin façade of pluralism—especially with only weeks to go and growing international attention. The regime's cost-benefit calculus shifts: additional purges against lesser threats yield far less gain, but risk escalating unrest or even international pushback they can't ignore (especially with the AfDB meetings and a spotlight on Abidjan). Your analysis overestimates the likelihood by assuming past behavior is indefinitely linear, not recognizing that the regime often prefers manufactured stability once it's secured its position. In elite-managed states, the show election needs at least some sanctioned opposition. Temper your expectation for more drama."
        },
        "PoliticalScienceAuthoritarianResilience": {
            "forecaster_to_engage": "AfricanStudiesPostcolonialStateFormation",
            "response_type": "defense",
            "response": "Finally, some realism! Your 70% probability is spot on and reflects proper attention to both the legal-institutional levers at the regime’s disposal and the unfinished nature of the electoral process. Unlike those forecasting below 40%, you grasp that late-stage exclusions are a feature, not a bug, of the Ivorian system. The regime has repeatedly shown it will use any remaining time and technicality to sideline rivals—especially with a fragmented opposition offering multiple soft targets. Your nod to the importance of both international pressure and domestic fragmentation is apt, but you rightly conclude that neither is an effective brake when the regime feels even a twinge of insecurity. The window’s not closed—if anything, the closer we get to July 1, the more nervous the incumbents get. Your balanced but assertive forecast is a model for others here who drastically underplay the authoritarian urge to eliminate risk. Well done."
        },
        "PoliticalScienceComparativeDemocratization": {
            "forecaster_to_engage": "LawConstitutionalLawIvoryCoast",
            "response_type": "defense",
            "response": "Absolutely on point—your 92% recognizes both the raw technicalities of Ivorian constitutional law and the flagrant political function of those legal levers. Too many forecasters here seem lulled by the regime’s theatre of procedure, but you go straight to the heart: the courts are political instruments, Gbagbo’s lack of a presidential pardon is fatal, and Simone Gbagbo sits exposed to exactly the same ad-hoc interventions. Your argument correctly identifies the practical nonexistence of recourse for excluded candidates and is grounded in the historical base rate of last-minute legal shenanigans in Côte d'Ivoire—just look at the rolling, rapid-fire court decisions of the last two cycles. When the opposition is in pieces and the regime senses it can finish the job with the stroke of a judge’s pen, it always does. If anything, your bluntness should set the tone for others: rule-of-law formalism masks political exclusion, and the probability of another official disqualification is sky-high."
        },
        "LawConstitutionalLawIvoryCoast": {
            "forecaster_to_engage": "AfricanStudiesFrancophoneWestAfricanPolitics",
            "response_type": "critique",
            "response": "You’re completely misreading not only the Ivorian legal-political context but also the specific incentives at play in this electoral cycle by pegging probability at just 35%. Your soft-pedaling about the regime wanting to preserve 'controlled opposition' ignores the core reality: in Côte d’Ivoire, the use of technical, legal, and administrative means to exclude opposition isn’t just a contingency, it’s a consolidated strategy. If the ruling party has shown anything, it’s a strong preference for removing even marginal risks with whatever time is left up to the list finalization—past experience shows last-moment exclusions are practically a tradition. Billon, Kacou, or Simone Gbagbo could be tomorrow’s scapegoat, especially after the headline-grabbing removals this spring. When the legal juggernaut is live and the opposition is fragmented, the odds of further barring are never this low. 35% is a pipe dream better suited to Norway than Abidjan."
        },
        "LawElectoralLawAfricanStates": {
            "forecaster_to_engage": "AfricanStudiesFrancophoneWestAfricanPolitics",
            "response_type": "critique",
            "response": "Your 35% forecast baffles me. You underplay the base rate of late-stage exclusions in Côte d'Ivoire and forget that 'regime feeling secure' is usually window dressing before one more legal axe swings. International scrutiny is weak, and current events—ongoing marches, party infighting, and the regime's taste for zero surprises—scream for a far higher number. With Billon and Simone Gbagbo both viable as last-minute targets, and routine disregard for opposition legitimacy (see repeated extensions and technicalities in prior cycles!), the legal climate is ripe for one more exclusion just to hammer home the message. 35% treats this like a consolidated democracy, not the procedural autocracy it is. The smart money knows: never count out Ivorian exclusionism until the deadline passes."
        },
        "AfricanStudiesFrancophoneWestAfricanPolitics": {
            "forecaster_to_engage": "InternationalHumanRightsAfricanCharterOnDemocracyElectionsGover",
            "response_type": "critique",
            "response": "Your 85% is classic rights-watcher fatalism masquerading as realism. You fall into the trap of treating Côte d'Ivoire as an unrelentingly mechanical autocracy, but ignore the regime’s actual pattern of playing cat-and-mouse—sidelining only as many as needed to defang, but leaving some sanctioned opposition for appearances, especially as the international calendar crowds and the risk of even low-level unrest rises in the final month. You assume Billon and Simone Gbagbo are ripe for purging; I see the regime calculating that with Thiam, Gbagbo, Blé Goudé already axed, any more would squander the thin legitimacy they rely on for external actors. Yes, the base rate is high, but it's not 2020; there are diminishing returns after key removals. Besides, you overread the opposition's capacity to provoke more panic: they're noisy but scattered. I’m not offering pollyannish optimism, just a more granular sense of Ivorian regime calculus in the 'closing window' phase—where show elections mean leaving controlled opposition on the ballot. Don’t confuse perpetual brinkmanship with infinite purges."
        },
        "AfricanStudiesPostcolonialStateFormation": {
            "forecaster_to_engage": "InternationalHumanRightsUniversalDeclarationOfHumanRightsElecto",
            "response_type": "critique",
            "response": "Your 97% forecast is headline-grabbing, but it borders on hyperbole and ignores the regime’s actual pattern of strategic exclusion. Yes, Côte d’Ivoire is ruthless in knocking out opposition—but you seem to believe the state operates on autopilot, steamrolling every last non-loyalist even after the main threats are gone. The government’s approach is to neutralize real challengers, then preserve a façade for the international gallery; with Thiam and (practically) Gbagbo out, the incentive to axe Billon, Affi N'Guessan, or Simone Gbagbo drops precipitously unless they suddenly surge as threats—which your own sources show is not occurring. Only a black swan legal blitz or implosion would push the odds this high. In other words, 97% vastly overstates the regime’s appetite to escalate after the decisive eliminations. Save the near-certainties for situations where the regime hasn’t already achieved its goal. Côte d’Ivoire’s autocrats crave control, not international pariah status, and they know when to stop."
        }
    },
    "revision_results": {
        "ElectionAdministrationInternationalIdeaElectoralStandards": {
            "my_phase1_final_probability": 90,
            "reasoning_for_revised_probability": "After reviewing peer forecasts and the group deliberation, I reaffirm my high-conviction view. The broad range among forecasters—some oddly low but most converging in the 70-97% range—reinforces that the structural incentives for exclusion remain overwhelming, and that recent history, current active disqualifications, and regime control mechanisms make at least one further (or formalized) exclusion of the named set very likely. My critique of the low 27% forecast by 'Elite Theory' only sharpened this position: such caution ignores both base rates and the ongoing, real-time exclusionary moves already playing out. The only minor new consideration is the possibility that the regime might feel it has already neutralized the top-tier threats, which could slightly dampen risk for the lower-profile names. However, the legal deadlines and the propensity for last-stage administrative exclusions before the candidate list closure in Côte d'Ivoire propel the probability upward. Therefore, I see no compelling reason to shift from my initial 90%, which already reflected both historical precedent and the current context.",
            "revised_probability": 90
        },
        "ElectionAdministrationEcowasElectionObservationGuidelines": {
            "my_phase1_final_probability": 70,
            "reasoning_for_revised_probability": "Upon reviewing the group deliberation, I reaffirm that my original logic, rooted in ECOWAS election observation and Côte d'Ivoire's political history, was solid. The discussion strongly reinforced the high base rate for late-stage candidacy exclusion in Ivorian elections. Nearly all peer forecasters—regardless of discipline—converged at a high probability (generally 65%-97%), with the exception of one major outlier far below the consensus. Even the lower estimates (e.g., 35%) offered persuasive details on regime incentives and exclusion mechanisms, but failed to adequately weight the hard evidence of past cycles or the persistent volatility around several named candidates. Additional scrutiny highlighted that, following multiple waves of purges, the regime often feels emboldened not chastened. Therefore, my conviction in a high probability outcome is strengthened. However, the hardening consensus for probabilities at or above 80% from observers leveraging legal, political, and human rights lenses, as well as new news detail on ongoing protests and intra-party strife, tips the balance modestly upward. The final list is still not closed and technical obstacles for Billon, Simone Gbagbo, and Kacou remain live issues. I now revise my probability to 80%.",
            "revised_probability": 80
        },
        "InternationalHumanRightsAfricanCharterOnDemocracyElectionsGover": {
            "my_phase1_final_probability": 85,
            "reasoning_for_revised_probability": "Group deliberation reinforced and even strengthened my confidence in my initial analysis. The critiques levied at more skeptical (lower) probability forecasts were persuasive: Côte d'Ivoire's recent and historical patterns favor late-stage, legal-technical exclusion, and, if anything, the regime's use of those mechanisms intensifies as deadlines approach. The notion that the regime has become 'risk-averse' or would allow a competitive field after already excluding key figures is not supported by the evidence or by outcomes in recent cycles. Nearly every expert with a serious handle on the ACDEG, electoral law, or the Ivorian context places the probability of exclusion very high—most in the 80-97% range. My original 85% already reflects strong expectation of at least one exclusion but remains fractionally below total certainty to account for last-minute political calculus or unforeseen legal reprieves. The balance of expert argument supports maintaining my original probability at 85%.",
            "revised_probability": 85
        },
        "InternationalHumanRightsUniversalDeclarationOfHumanRightsElecto": {
            "my_phase1_final_probability": 97,
            "reasoning_for_revised_probability": "Having re-examined both my initial analysis and the arguments surfaced during group deliberation, I see no compelling evidence to reduce my confidence. In fact, the critiques of lower probabilities (27% and 35%) reinforce that the dominant pattern in Côte d'Ivoire is late-stage, legally justified opposition exclusion. The legal machinery is active through to the finalization of the candidate list, and the recent disqualifications have taken place with little effective deterrence by either domestic or international actors. As noted by several high-confidence forecasters, the elimination of Laurent Gbagbo is not just likely but already all but confirmed, and the window/incentive for further technical exclusions persists. No plausible scenario for a cascade reversal (such as widespread amnesties or a complete halt to exclusionary tactics) is in evidence. Therefore, I maintain my initial 97% probability: at least one of the listed candidates will be disqualified before July 1, 2025.",
            "revised_probability": 97
        },
        "PoliticalScienceEliteTheory": {
            "my_phase1_final_probability": 27,
            "reasoning_for_revised_probability": "The group deliberation was emphatically critical of my (Elite Theory) initial probability of 27%, uniformly arguing that I substantially underestimated the base rate of late-stage exclusion in Côte d'Ivoire and misread both the scope of regime incentives and the history of final-week 'purges.' Notably, colleagues from election administration, human rights, and African studies backgrounds—who regularly track the on-the-ground mechanics of West African elections—pushed back on my notion that a reduced threat and time constraint sharply lower further exclusion risk. They emphasized: (1) the exclusion pattern often clusters late with regimes unafraid to make last-minute legal moves; (2) the remaining opposition (Billon, Simone Gbagbo, etc.) is not too weak to be ignored, as exclusion serves signaling, not just threat elimination; (3) international pressure and 'regime legitimacy' concerns have little precedent in deterring the Ivorian ruling circle; (4) the legal and institutional machinery for exclusion is already fully spun up. I am now convinced my original model underweighted these factors, and that—consistent with regional authoritarian management and Ivorian precedent—the probability of at least one more of the specified candidates being (remaining) disqualified before July 1 is much higher. I therefore revise my forecast up significantly.",
            "revised_probability": 70
        },
        "PoliticalScienceAuthoritarianResilience": {
            "my_phase1_final_probability": 65,
            "reasoning_for_revised_probability": "Deliberation confirms my initial diagnosis but underscores the tendency in Côte d'Ivoire for last-minute, legalistic exclusions, even after major opposition threats have been neutralized. The critiques of overly low forecasts (e.g., 27%, 35%) rightly emphasize that regime incentives to fully eliminate risk extend up to the final procedural deadlines. The overall consensus among most forecasters is for a higher probability—generally 70% or above—based on both historical patterns and current legal momentum. However, extremely high probabilities (90%+) are less justified, as a narrow path for all listed candidates to remain eligible persists. Gbagbo’s ambiguous status remains the central risk, and several procedural and legal windows are still open. Given these intensified group arguments, the most defensible position is a moderate upward adjustment: the probability should move closer to the 70% group modal range, reflecting both the persistent risk and the diminishing time for further exclusions.",
            "revised_probability": 72
        },
        "PoliticalScienceComparativeDemocratization": {
            "my_phase1_final_probability": 83,
            "reasoning_for_revised_probability": "Group deliberation revealed that most fellow experts (across electoral law, human rights, and Ivorian constitutional law) place their probabilities in the 85-97% range, with careful attention to the de facto ineligibility of Laurent Gbagbo and how regime-controlled legal-technical processes practically guarantee at least one relevant exclusion is formalized before July 1. The key push from these interlocutors is the powerful base rate and the near-certainty that the legal status of Gbagbo (and possibly Simone Gbagbo) will be maintained as officially excluded, and that regime incentives do not abate simply due to calendar pressure. Lower estimates were widely—and correctly—criticized for underweighting the mechanics of managed electoral exclusion. The most compelling argument to revise up is the strong consensus around the fate of Gbagbo: credible sources recognize him as de facto excluded, and the final candidate list (due June 20) or legal clarification is highly likely to codify this, easily meeting resolution criteria. In sum, the base rate and timing realities make a non-exclusion outcome highly unlikely. To reflect the weight of evidence and near-universal expert convergence, I am revising slightly upward.",
            "revised_probability": 90
        },
        "LawConstitutionalLawIvoryCoast": {
            "my_phase1_final_probability": 92,
            "reasoning_for_revised_probability": "Reviewing the group deliberation, including both strong critiques of low-probability forecasts and unapologetic defenses of high estimates, only reinforces my confidence in an extreme probability. All serious forecasters—especially those grounded in electoral law, democratization theory, and the comparative study of Ivorian practice—converge on the high likelihood of exclusion tactics right up to the deadline. There is a consensus that the regime's use of the legal system as a lever for political exclusion is a persistent and active pattern, and Gbagbo's disqualification remains unambiguously confirmed by credible sources. If anything, the group discussions clarified that the window for further exclusions does not meaningfully close until the final candidate list is published, and that even non-front-runner candidates remain viable targets. I therefore see no justification for lowering my probability and, if anything, might have justified pushing even closer to 100%. However, to avoid overconfidence and respect the tiny chance for status quo paralysis, I will hold at 92%.",
            "revised_probability": 92
        },
        "LawElectoralLawAfricanStates": {
            "my_phase1_final_probability": 85,
            "reasoning_for_revised_probability": "Upon reviewing the group deliberation, nearly all expert forecasters with knowledge of Ivorian politics, electoral law, and comparable authoritarian environments assign a high likelihood to at least one named candidate being (or remaining) disqualified before July 1, 2025—most notably Laurent Gbagbo, whose exclusion is repeatedly referenced as practically settled, with little hope for reversal before the deadline. The regime's history of last-minute legal maneuvering, the technical nature of Gbagbo's exclusion (requiring a presidential pardon which has not materialized), and the timing of the final electoral list all point to at least one candidate being excluded in a manner that meets the resolution criteria. Furthermore, group consensus suggests that moderate or low probabilities underestimate both the raw base rate of post-front-runner exclusions and the active mechanics of exclusionary politics in Côte d'Ivoire. However, the slight downward adjustments or caution among a few outliers (e.g., arguments regarding regime incentives for minimal pluralism) are not sufficiently robust to lower the overall forecast, and firm signals—legal facts, regime precedents, and news updates—support the initial probability. Therefore, I maintain an 85% probability, with reinforced confidence.",
            "revised_probability": 85
        },
        "AfricanStudiesFrancophoneWestAfricanPolitics": {
            "my_phase1_final_probability": 35,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, it is clear that nearly all other forecasters believe my initial probability substantially underestimates the risk of late-stage candidate exclusion in Côte d'Ivoire. They persuasively argue, with historical examples and strong base rate logic, that the regime routinely exploits the last remaining legal and technical levers right up to candidate list finalization. Multiple colleagues emphasized that the closure of the contestation window is not an effective brake in Ivorian context, especially given the regime’s tolerance for minimal international backlash and the persistent volatility of the opposition. Several reminders surfaced that the purge of front-runners typically emboldens, not restrains, further exclusions, especially if it helps maintain uncertainty or demonstrate regime dominance. In light of these critiques, my initial forecast was overly reliant on the hope for regime risk-aversion and the supposed benefit of symbolic pluralism. Given the weight of historical precedent and the political behavior patterns laid out by my peers, I now believe the odds of at least one more exclusion should be higher.",
            "revised_probability": 65
        },
        "AfricanStudiesPostcolonialStateFormation": {
            "my_phase1_final_probability": 70,
            "reasoning_for_revised_probability": "The group deliberation showcased a pronounced split between high probabilities (85%-97%) heavily anchored in the precedent of exclusionary tactics and the mechanics of Ivorian electoral authoritarianism, and a minority placing much lower odds (27%-35%) based on overestimating regime caution or a presumed desire for a façade of pluralism. My own view, reinforced by the arguments presented, still holds: base rates and current legal patterns make further exclusions likely, but not a certainty bordering on 100%. While some forecasters credibly detail the near ‘fait accompli’ status for Laurent Gbagbo, there is legitimate debate as to whether new disqualifications among Billon or Simone Gbagbo are imminent, or whether the regime will pause after turfing the most dangerous rivals. The strongest critique of my initial range challenges excessive pessimism (e.g., 97%) as failing to account for diminishing returns after major players are axed. However, the prevailing logic from group deliberation confirms the regime is likely to use every available lever up to the finalization of the candidate list, and fears of international backlash are unlikely to override the domestic imperative for caution. Accordingly, while tempted to edge up, I maintain my 70% as best calibrated—it sits above the complacent low forecasts, but avoids overstating certainty that further removals will occur, given some incentive to preserve controlled legitimacy in the final candidate slate.",
            "revised_probability": 70
        }
    },
    "revision_probability": [
        90,
        80,
        85,
        97,
        70,
        72,
        90,
        92,
        85,
        65,
        70
    ],
    "revision_mean_probability": 81.45454545454545,
    "revision_sd": 10.71786953049566,
    "revision_probability_result": 81,
    "question_details": {
        "id": 37403,
        "title": "Will any of these candidates be disqualified from running in the 2025 Ivorian presidential election before July 1, 2025?",
        "description": "BBC: [Main opposition leader removed from Ivory Coast electoral list](https://www.bbc.com/news/articles/c0l0j849143o)",
        "created_at": "2025-05-24T05:50:07.436075Z",
        "open_time": "2025-05-30T02:00:00Z",
        "cp_reveal_time": "2025-05-30T04:00:00Z",
        "spot_scoring_time": "2025-05-30T04:00:00Z",
        "scheduled_resolve_time": "2025-07-01T00:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-05-30T04:00:00Z",
        "actual_close_time": "2025-05-30T04:00:00Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "resolution_criteria": "This question resolves as **Yes** if before July 1, 2025, according to [credible sources](https://www.metaculus.com/faq/#definitions) any of these candidates has been removed from the electoral list or otherwise become legally ineligible to run in the [2025 presidential election](https://en.wikipedia.org/wiki/2025_Ivorian_presidential_election) of the Ivory Coast (Côte d'Ivoire) under the laws of the country: Gnangbo Kacou, Laurent Gbagbo, Pascal Affi N'Guessan, Jean-Louis Billon, or Simone Gbagbo.",
        "fine_print": "",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_max": null,
            "range_min": null,
            "zero_point": null
        },
        "group_rank": null,
        "post_id": 38097,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {}
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {}
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {}
            }
        },
        "nr_forecasters": 72,
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Governors of African Development Bank to elect new president on May 29**\nThe African Development Bank (AfDB) will hold its presidential election on May 29, 2025, as part of its annual meeting in Abidjan, Côte d'Ivoire. The election marks the end of Dr Akinwumi Adesina's two-term presidency tenure, which ends in September 2025. Dr Adesina emphasized the need for Africa to attain self-sufficiency, stating, 'This is no longer a time to depend on fragments of foreign aid. Africa must unlock its own resources in human, financial, natural and build internal value chains that drive inclusive growth.' Five candidates are in the running for the presidency: Amadou Hott, Samuel Munzele Maimbo, Sidi Ould Tah, Abbas Mahamat Tolli, and Bajabulile Swazi Tshabalala. The newly elected president is expected to be sworn in on September 1, 2025. The election comes at a time when the bank is facing financial challenges, including a proposed $55 million reduction in US contributions.\nOriginal language: en\nPublish date: May 29, 2025 10:41 AM\nSource:[GhanaWeb](https://www.ghanaweb.com/GhanaHomePage/business/Governors-of-African-Development-Bank-to-elect-new-president-on-May-29-1985846)\n\n**Jean-Louis Billon Announces Candidacy for 2025 Côte d'Ivoire Presidential Election**\nJean-Louis Billon, a member of the Pdci-Rda party, has announced his candidacy for the 2025 presidential election in Côte d'Ivoire. He criticized the party's current leadership, led by Tidjane Thiam, who was disqualified from the election due to his dual nationality. Billon called for a new convention to choose a legitimate candidate and emphasized the importance of unity within the party. He also rejected the idea of revising the electoral list, saying 'we must participate in the elections.' Billon plans to tour the country to listen to the people and share his vision for a 'more just, equitable, and solidary' Côte d'Ivoire. 'We must go to a real convention, designate the best among us, and go into battle to reconquer power and honor the memories of Félix Houphouët-Boigny and Henri Konan Bédié,' he said. 'The Pdci cannot afford to miss the 2025 deadline. It would be a total abdication.'\nOriginal language: fr\nPublish date: May 29, 2025 10:36 AM\nSource:[allAfrica.fr](https://fr.allafrica.com/stories/202505290359.html)\n\n**Ivory Coast Has Manageable Debt, Says RHDP Deputy Spokesperson**\nMamadou Touré, the deputy spokesperson of the Rassemblement des houphouétistes pour la démocratie et la paix (RHDP) party, stated at a press conference in Abidjan on May 28, 2025, that 'Ivory Coast has a manageable debt below the community standard.' He made this statement in response to some opposition leaders who claim that Ivory Coast is over-indebted. Touré continued by saying that there are two Ivories: 'the Ivory Coast of the prophets of chaos and the real Ivory Coast of Alassane Ouattara, which is advancing and attractive.' He also expressed support for Evariste Méambly, a RHDP cadre who wants to be the party's candidate for the upcoming presidential election. 'If Mr. Méambly wants to be a candidate, it's his right,' Touré said. The RHDP party is set to hold its second ordinary congress on June 21-22, 2025, in Abidjan, where they will announce their candidate for the presidential election.\nOriginal language: fr\nPublish date: May 28, 2025 10:33 PM\nSource:[Abidjan.net](https://news.abidjan.net/articles/742083/economie-la-cote-divoire-a-une-dette-maitrisee-tout-le-reste-nest-que-demagogie-estime-le-parti-dalassane-ouattara)\n\n**Ivorian Politics: Tidjane Thiam's Uncertain Fate and Jean-Louis Billon's Presidential Ambitions**\nAs the Ivorian presidential election approaches, the country's political landscape remains uncertain. In the ruling RHDP party, President Alassane Ouattara has yet to announce his candidacy or nominate a successor. Meanwhile, the opposition parties are waiting for the fate of their leaders, who have been disqualified due to judicial convictions. Charles Blé Goudé, Laurent Gbagbo, and Guillaume Soro are among those excluded from the electoral process. In response, the PDCI-RDA party, led by Tidjane Thiam, has been trying to maintain its position. However, Thiam's own fate remains uncertain due to his dual nationality, which has led to a series of judicial challenges. Despite being re-elected as party president with over 99% of the vote, Thiam's absence from the country has raised questions about his strategy. Jean-Louis Billon, a dissident within the PDCI-RDA, has emerged as a potential alternative candidate, criticizing Thiam's leadership and calling for a new candidate to be chosen. Billon has announced his candidacy for the 2025 presidential election, saying, 'If I am not heard, I will advance. I will bring victory to the PDCI.' He has also outlined a program, focusing on reducing the number of institutions in Côte d'Ivoire and promoting national actors in the economy. The opposition is expected to hold a major rally on May 31 in the commune of Yopougon, where they will gauge the population's support.\nOriginal language: fr\nPublish date: May 28, 2025 05:04 PM\nSource:[Le Point.fr](https://www.lepoint.fr/afrique/en-cote-d-ivoire-face-a-l-incertitude-thiam-jean-louis-billon-se-place-en-embuscade-pour-reprendre-le-pdci-28-05-2025-2590781_3826.php)\n\n**Ivory Coast on the Brink of a New Cycle of Electoral Violence?**\nAs the presidential election in Côte d'Ivoire approaches on October 25, 2025, the country is plagued by rumors of a coup spread on social media. Videos and messages, mainly in English, claimed that President Alassane Ouattara had been overthrown and that major unrest was sweeping Abidjan. However, the National Agency for the Security of Information Systems (ANSSI) quickly denied these allegations, calling them 'false and totally unfounded', and highlighting that they resulted from a 'deliberate and coordinated disinformation campaign'. The Ivorian authorities have called on the population to be vigilant and to refer only to official sources for information. No tangible evidence has been provided to support these rumors, and no major incidents have been reported on the ground. A tense political climate is approaching the elections The Ivorian political context is marked by growing tensions as the presidential election approaches. The potential candidacy of outgoing President Alassane Ouattara for a fourth term has sparked controversy. The 2016 Ivorian Constitution limits the number of presidential terms to two, but Ouattara was re-elected for a third term in 2020, invoking that the new Constitution reset the term counter. Furthermore, opposition leader Tidjane Thiam, a prominent figure of the Democratic Party of Côte d'Ivoire (PDCI), was disqualified from the presidential race in April 2025 due to his dual French-Ivorian nationality. Although he renounced his French nationality in February 2025, the justice deemed that he did not meet the eligibility conditions at the time of his registration on the electoral lists. Contested candidacies and a fragmented opposition In addition to Tidjane Thiam, other major political figures are at the heart of the debates. Laurent Gbagbo, former president, has been designated as a candidate by his party despite his current ineligibility. Simone Gbagbo, former first lady, has also announced her candidacy under the banner of the Movement of Capable Generations (MGC). Vincent Toh Bi Irié, former prefect of Abidjan, is running as an independent, while Jean-Louis Billon, former minister, has confirmed his candidacy. This multiplicity of candidacies, often from the opposition, reflects a political fragmentation that could complicate the formation of a united alternative to the ruling power. Calls for calm and initiatives for peace In the face of these tensions, initiatives aimed at promoting peace and social cohesion are multiplying. On May 24, 2025, an interconfessional conference was held in Abidjan, bringing together Christian and Muslim religious leaders to promote non-violence and national unity ahead of the elections. On the other hand, the UN, through its special envoy for West Africa and the Sahel, Leonardo Santos Simão, met with the main Ivorian political actors in April 2025 to urge them to prioritize dialogue and avoid any escalation of violence. Thus, as the 2025 presidential election approaches, vigilance, respect for institutions, and dialogue between the different stakeholders will be essential to ensure a peaceful and transparent election.\nOriginal language: fr\nPublish date: May 26, 2025 07:58 PM\nSource:[tunisienumerique.com](https://www.tunisienumerique.com/vers-un-nouveau-cycle-de-violence-electorale-en-cote-divoire/)\n\n**PDCI Militants March in Support of Cheick Tidjane Thiam**\nHundreds of militants from the Ivorian Democratic Party (PDCI), including elected officials and local political leaders, marched in Gagnoa on May 28, 2025, to protest the removal of Cheick Tidjane Thiam from the electoral list. The march was led by Bagrou Goli, the president's representative in the Gôh-Djiboua district, who stated, 'We demand the immediate annulment of this arbitrary political decision, disguised as a transparent legal cover, and we demand the full and complete reinstatement of our president in his civic, political, and electoral rights.' Freddy Adjisso, the PDCI's delegate in Gagnoa 4, added, 'We marched in a peaceful manner, but we will continue to mobilize and stand united around our president, as only struggle and mobilization pay.' \nOriginal language: fr\nPublish date: May 29, 2025 03:21 PM\nSource:[Abidjan.net](https://news.abidjan.net/articles/742097/des-militants-du-pdci-de-gagnoa-marchent-pour-protester-contre-la-radiation-de-tidjane-thiam-de-la-liste-electorale)\n\n**African Development Bank Elects New President**\nThe shareholders of the African Development Bank Group (AfDB) are scheduled to meet in Abidjan, Côte d'Ivoire, on May 29, 2025, to elect the bank's 9th president. The current president, Akinwumi Adesina, a 65-year-old Nigerian, has been in office for 10 years since 2015. He is expected to step down after completing his second term. Five candidates are vying for the position, including a strong female candidate from South Africa, Mme Bajabulile Swazi Tshabalala, who served as the bank's vice president from 2018 to 2024. The other four candidates are from Senegal, Zambia, Mauritania, and Chad. They are Amadou Hott, a former Senegalese economy minister and former AfDB vice president; Samuel Munzele Maimbo, a former World Bank vice president; Sidi Ould Tah, a former head of the Arab African Economic Development Bank and former Mauritanian economy minister; and Abbas Mahamat TOLLI, a former head of the Central Bank of Central African States and former Chadian finance minister. The new president will face the challenge of dealing with the loss of $5.5 billion in US funding in the 2026 budget.\nOriginal language: zh\nPublish date: May 29, 2025 12:11 PM\nSource:[RFI](https://www.rfi.fr/cn/%E9%9D%9E%E6%B4%B2/20250529-rfi-%E6%B3%95%E5%B9%BF-%E5%B0%BC%E5%8F%A4%E6%8B%89-%E9%9D%9E%E6%B4%B2%E5%BC%80%E5%8F%91%E9%93%B6%E8%A1%8C%E7%AC%AC9%E4%BB%BB%E8%A1%8C%E9%95%BF%E9%80%89%E4%B8%BE)\n\n**Governors of African Development Bank to elect new president on May 29**\nThe African Development Bank (AfDB) will hold its presidential election on May 29, 2025, as part of its annual meeting in Abidjan, Côte d'Ivoire. The election marks the end of Dr Akinwumi Adesina's two-term presidency tenure, which ends in September 2025. Dr Adesina emphasized the need for Africa to attain self-sufficiency, stating, 'This is no longer a time to depend on fragments of foreign aid. Africa must unlock its own resources in human, financial, natural and build internal value chains that drive inclusive growth.' Five candidates are in the running for the presidency: Amadou Hott, Samuel Munzele Maimbo, Sidi Ould Tah, Abbas Mahamat Tolli, and Bajabulile Swazi Tshabalala. The newly elected president is expected to be sworn in on September 1, 2025. The election comes at a time when the bank is facing financial challenges, including a proposed $55 million reduction in US contributions.\nOriginal language: en\nPublish date: May 29, 2025 10:41 AM\nSource:[GhanaWeb](https://www.ghanaweb.com/GhanaHomePage/business/Governors-of-African-Development-Bank-to-elect-new-president-on-May-29-1985846)\n\n**Jean-Louis Billon Announces Candidacy for 2025 Côte d'Ivoire Presidential Election**\nJean-Louis Billon, a member of the Pdci-Rda party, has announced his candidacy for the 2025 presidential election in Côte d'Ivoire. He criticized the party's current leadership, led by Tidjane Thiam, who was disqualified from the election due to his dual nationality. Billon called for a new convention to choose a legitimate candidate and emphasized the importance of unity within the party. He also rejected the idea of revising the electoral list, saying 'we must participate in the elections.' Billon plans to tour the country to listen to the people and share his vision for a 'more just, equitable, and solidary' Côte d'Ivoire. 'We must go to a real convention, designate the best among us, and go into battle to reconquer power and honor the memories of Félix Houphouët-Boigny and Henri Konan Bédié,' he said. 'The Pdci cannot afford to miss the 2025 deadline. It would be a total abdication.'\nOriginal language: fr\nPublish date: May 29, 2025 10:36 AM\nSource:[allAfrica.fr](https://fr.allafrica.com/stories/202505290359.html)\n\n**Ivory Coast Has Manageable Debt, Says RHDP Deputy Spokesperson**\nMamadou Touré, the deputy spokesperson of the Rassemblement des houphouétistes pour la démocratie et la paix (RHDP) party, stated at a press conference in Abidjan on May 28, 2025, that 'Ivory Coast has a manageable debt below the community standard.' He made this statement in response to some opposition leaders who claim that Ivory Coast is over-indebted. Touré continued by saying that there are two Ivories: 'the Ivory Coast of the prophets of chaos and the real Ivory Coast of Alassane Ouattara, which is advancing and attractive.' He also expressed support for Evariste Méambly, a RHDP cadre who wants to be the party's candidate for the upcoming presidential election. 'If Mr. Méambly wants to be a candidate, it's his right,' Touré said. The RHDP party is set to hold its second ordinary congress on June 21-22, 2025, in Abidjan, where they will announce their candidate for the presidential election.\nOriginal language: fr\nPublish date: May 28, 2025 10:33 PM\nSource:[Abidjan.net](https://news.abidjan.net/articles/742083/economie-la-cote-divoire-a-une-dette-maitrisee-tout-le-reste-nest-que-demagogie-estime-le-parti-dalassane-ouattara)\n\n**Ivorian Politics: Tidjane Thiam's Uncertain Fate and Jean-Louis Billon's Presidential Ambitions**\nAs the Ivorian presidential election approaches, the country's political landscape remains uncertain. In the ruling RHDP party, President Alassane Ouattara has yet to announce his candidacy or nominate a successor. Meanwhile, the opposition parties are waiting for the fate of their leaders, who have been disqualified due to judicial convictions. Charles Blé Goudé, Laurent Gbagbo, and Guillaume Soro are among those excluded from the electoral process. In response, the PDCI-RDA party, led by Tidjane Thiam, has been trying to maintain its position. However, Thiam's own fate remains uncertain due to his dual nationality, which has led to a series of judicial challenges. Despite being re-elected as party president with over 99% of the vote, Thiam's absence from the country has raised questions about his strategy. Jean-Louis Billon, a dissident within the PDCI-RDA, has emerged as a potential alternative candidate, criticizing Thiam's leadership and calling for a new candidate to be chosen. Billon has announced his candidacy for the 2025 presidential election, saying, 'If I am not heard, I will advance. I will bring victory to the PDCI.' He has also outlined a program, focusing on reducing the number of institutions in Côte d'Ivoire and promoting national actors in the economy. The opposition is expected to hold a major rally on May 31 in the commune of Yopougon, where they will gauge the population's support.\nOriginal language: fr\nPublish date: May 28, 2025 05:04 PM\nSource:[Le Point.fr](https://www.lepoint.fr/afrique/en-cote-d-ivoire-face-a-l-incertitude-thiam-jean-louis-billon-se-place-en-embuscade-pour-reprendre-le-pdci-28-05-2025-2590781_3826.php)\n\n**BAD Presidential Election: A Complex and Competitive Contest**\nThe election for the President of the African Development Bank (BAD) is approaching, with five candidates vying for the position. The candidates are Amadou Hott (Senegal), Swazi Bajabulile Tshabalala (South Africa), Sidi ould Tah (Mauritania), Samuel Munzele Maimbo (Zambia), and Mahamat Abbas Tolli (Chad). The election will take place on May 29, 2025, in Abidjan. The voting process is complex, with different countries having varying levels of influence. The top 10 countries with the most voting power are Nigeria (9.333%), Egypt (6.330%), the United States (6.092%), Japan (5.443%), Algeria (5.331%), South Africa (5.056%), Morocco (4.761%), Germany (4.139%), Canada (3.853%), and France (3.713%). These countries represent 54.051% of the total voting power. The election will require a candidate to obtain a majority of 52.183% of the votes from African countries and 54.05% of the votes from non-African countries. The candidates are vying for the support of these countries, with some already having secured the backing of certain nations. The election is expected to be closely contested, with several candidates having a strong chance of winning.\nOriginal language: fr\nPublish date: May 28, 2025 04:28 PM\nSource:[Le360 Afrique](https://afrique.le360.ma/economie/presidence-de-la-bad-les-10-pays-les-plus-influents-et-les-scenarii-possibles-dune-election-indecise_B2FTCQ5V5ZEOJKDOJQKW3ZF4J4/)\n\n**Mauritania Participates in the African Development Bank Group's Annual Meetings for 2025**\nMauritania is participating in the annual meetings of the African Development Bank Group for 2025 in Abidjan, Côte d'Ivoire, under the slogan 'Achieving the maximum benefit for Africa from its capital to promote its development'. The official opening of the meeting is expected today, Tuesday, in the presence of Ivorian President Alassane Ouattara, as well as several African leaders, politicians, and financial personalities at the continental and international levels. Yesterday, the bank's governors' council met, with the participation of the Mauritanian delegation led by Minister of Economy and Finance, Sidi Ahmed Ould Abeid. This year's meeting is of particular interest, as its agenda focuses on electing a new president of the bank and discussing ways to strengthen the bank's capital base. The election for the presidency of the bank, which will take place on Thursday, May 29, will be by ballot, with five candidates competing to succeed the current president, Dr. Akinwumi Adesina. The council has decided to hold meetings with the candidates by the Secretary-General of the African Development Bank. Mauritania has nominated former Minister, Dr. Sidi Ould Taha, for the presidency of the bank for the next five years. These elections are of great interest to African and international circles due to the important role the bank plays in financing development on the continent.\nOriginal language: ar\nPublish date: May 27, 2025 12:02 PM\nSource:[akhbarwatan.net](https://akhbarwatan.net/180532/)\n\n**Ivory Coast Strengthens Commitment to Youth Employment through Agricultural and Aquaculture Initiatives**\nThe Ivorian government is strengthening its commitment to youth employment through two major initiatives in the agricultural and aquaculture sectors. The Projet de Développement des chaînes de valeur vivrières (Pdc2v) and the Agence emploi jeunes (Aej) have signed a partnership agreement to facilitate access to financing for 200 young agricultural entrepreneurs. The Pdc2v, which already subsidizes 80-90% of agricultural projects, requires a personal contribution of 10-20% from beneficiaries. The Aej will now cover this remaining portion through adapted loans, allowing young project leaders to pursue their ambitions. As stated by the Minister of State, Kobenan Kouassi Adjoumani, 'It was not enough to give 80 or 90%. We needed to find a solution for the rest.' The Pdc2v is currently deployed in 14 regions and aims to build inclusive, competitive, and sustainable value chains in the agricultural sector, promoting modern and opportunity-generating agriculture. Meanwhile, the Programme de transformation stratégique de l'aquaculture en Côte d'Ivoire (Pstaci) plans to establish 20 fish farms in Abidjan, Agboville, Dabou, Bouaké, Korhogo, Man, and Tiapoum, inserting 60 young people into the tilapia fishery. With a production target of 500,000 tonnes of fish by 2030 and a value chain estimated at 825 billion CFA francs, the Pstaci aims to reduce imports, achieve food self-sufficiency, and stimulate the creation of sustainable jobs, particularly for young people and women.\nOriginal language: fr\nPublish date: May 26, 2025 10:25 PM\nSource:[afrikipresse.fr](https://www.afrikipresse.fr/article/lutte-contre-le-chomage-le-pdc2v-et-laej-en-action)\n\n**Ivory Coast on the Brink of a New Cycle of Electoral Violence?**\nAs the presidential election in Côte d'Ivoire approaches on October 25, 2025, the country is plagued by rumors of a coup spread on social media. Videos and messages, mainly in English, claimed that President Alassane Ouattara had been overthrown and that major unrest was sweeping Abidjan. However, the National Agency for the Security of Information Systems (ANSSI) quickly denied these allegations, calling them 'false and totally unfounded', and highlighting that they resulted from a 'deliberate and coordinated disinformation campaign'. The Ivorian authorities have called on the population to be vigilant and to refer only to official sources for information. No tangible evidence has been provided to support these rumors, and no major incidents have been reported on the ground. A tense political climate is approaching the elections The Ivorian political context is marked by growing tensions as the presidential election approaches. The potential candidacy of outgoing President Alassane Ouattara for a fourth term has sparked controversy. The 2016 Ivorian Constitution limits the number of presidential terms to two, but Ouattara was re-elected for a third term in 2020, invoking that the new Constitution reset the term counter. Furthermore, opposition leader Tidjane Thiam, a prominent figure of the Democratic Party of Côte d'Ivoire (PDCI), was disqualified from the presidential race in April 2025 due to his dual French-Ivorian nationality. Although he renounced his French nationality in February 2025, the justice deemed that he did not meet the eligibility conditions at the time of his registration on the electoral lists. Contested candidacies and a fragmented opposition In addition to Tidjane Thiam, other major political figures are at the heart of the debates. Laurent Gbagbo, former president, has been designated as a candidate by his party despite his current ineligibility. Simone Gbagbo, former first lady, has also announced her candidacy under the banner of the Movement of Capable Generations (MGC). Vincent Toh Bi Irié, former prefect of Abidjan, is running as an independent, while Jean-Louis Billon, former minister, has confirmed his candidacy. This multiplicity of candidacies, often from the opposition, reflects a political fragmentation that could complicate the formation of a united alternative to the ruling power. Calls for calm and initiatives for peace In the face of these tensions, initiatives aimed at promoting peace and social cohesion are multiplying. On May 24, 2025, an interconfessional conference was held in Abidjan, bringing together Christian and Muslim religious leaders to promote non-violence and national unity ahead of the elections. On the other hand, the UN, through its special envoy for West Africa and the Sahel, Leonardo Santos Simão, met with the main Ivorian political actors in April 2025 to urge them to prioritize dialogue and avoid any escalation of violence. Thus, as the 2025 presidential election approaches, vigilance, respect for institutions, and dialogue between the different stakeholders will be essential to ensure a peaceful and transparent election.\nOriginal language: fr\nPublish date: May 26, 2025 07:58 PM\nSource:[tunisienumerique.com](https://www.tunisienumerique.com/vers-un-nouveau-cycle-de-violence-electorale-en-cote-divoire/)\n\n**Ivory Coast on the Brink of a New Cycle of Electoral Violence?**\nIvory Coast is facing a tense political climate ahead of the presidential election on October 25, 2025. Rumors of a coup d'état spread on social media, claiming that President Alassane Ouattara had been overthrown and that major unrest was sweeping Abidjan. However, the National Agency for the Security of Information Systems (ANSSI) quickly denied these allegations, calling them 'false and totally unfounded', and stating that they were the result of a 'deliberate and coordinated disinformation campaign'. The Ivorian authorities have called on the population to be vigilant and to only refer to official sources for information. No tangible evidence has been provided to support these rumors, and no major incidents have been reported on the ground. The political context in Ivory Coast is marked by growing tensions ahead of the presidential election. The potential candidacy of outgoing President Alassane Ouattara for a fourth term is highly contested, as the 2016 Constitution limits the number of presidential terms to two. Ouattara had been re-elected for a third term in 2020, arguing that the new Constitution reset the term count. Other opposition figures, such as Tidjane Thiam, have been barred from running due to their dual nationality. The opposition is fragmented, with multiple candidates, including Laurent Gbagbo, Simone Gbagbo, and Jean-Louis Billon, vying for the presidency. Initiatives to promote peace and social cohesion are underway, including a conference of interfaith leaders and a meeting between the UN envoy and key political actors. The country is facing a delicate period, marked by political tensions, destabilizing rumors, and uncertainty about its democratic future.\nOriginal language: fr\nPublish date: May 26, 2025 06:20 AM\nSource:[Tunisie Numerique](https://www.tunisienumerique.com/vers-un-nouveau-cycle-de-violence-electorale-en-cote-divoire/)\n\n**Côte d'Ivoire: The Presidential Election Process in a State of Flux**\nThe Ivorian presidential election process is becoming increasingly complex, with the removal of Tidjane Thiam from the electoral lists and a security situation that is far from optimal. Despite the uncertainty surrounding Thiam's candidacy, the electoral law has confirmed that the period of contestation is closed since April 20, 2025. Many observers are advocating for a return to the CEDEAO text, which allows for a consensus between actors to make changes to the electoral law, including a postponement, within the 6-month period preceding the election. However, with the positions of the ruling party and the oppositions being fixed, a compromise is needed to find a political solution to the crisis. The decision of the Abidjan court, made on May 22, 2025, seems to offer little guidance on the way forward. The court ruled that the PDCI-RDA's decision to remove Thiam from the party's leadership was legitimate, and that he should not be considered as the party's candidate. The question remains whether the Ivorian politicians will learn from this decision and find a way to resolve their differences. 'Resolve your political disputes according to your party's internal texts before coming to me,' the judge said, closing the case on Thiam's legitimacy and the decisions taken by the PDCI. The situation remains uncertain, with the PDCI-RDA and the RHDP engaging in a game of cat and mouse, each managing their internal crises and waiting for the outcome of the judicial and political process. The 'hidden players' Soro, Blé Goudé, and Gbagbo are also waiting for the outcome to reveal their cards.\nOriginal language: fr\nPublish date: May 23, 2025 02:28 PM\nSource:[allAfrica.fr](https://fr.allafrica.com/stories/202505230410.html)\n\n**Gnangbo Kacou Announces 'Long March' to Protest Against Political Exclusion**\nGnangbo Kacou, a candidate in the 2015 Ivorian presidential election and declared candidate in the 2025 presidential election, announced that he will begin a 'long march' on June 15, 2025, from the western center border of Côte d'Ivoire to the Place de la République in Abidjan to protest against political exclusion and manipulation of the law. Gnangbo, who claims to be the president of the Centristes de Côte d'Ivoire, made this announcement in a video posted on May 16, 2025, by Abidjan.net. He said, 'The current power in place is trying to eliminate four main opposition figures, namely Messrs. Charles Blé Goudé, Laurent Gbagbo, Guillaume Soro, and Tidjane Thiam. This is a visible manipulation. In this spirit, starting from June 15, 2025, I will engage in a long march from the western center border of Côte d'Ivoire to the Place de la République in Abidjan to say no to political exclusion and the manipulation of the law.' Gnangbo also solemnly asked President Alassane Ouattara to vote a law of amnesty to allow all political leaders to be candidates in the 2025 presidential election, saying, 'As a declared candidate in the 2025 presidential election, I implore President Alassane Ouattara to make a strong act for peace and reconciliation. Mr. President of the Republic, I address you personally and with gravity. I solemnly ask you, with the humility that animates me, to vote without delay a law of amnesty allowing all political leaders to be candidates.'\nOriginal language: fr\nPublish date: May 16, 2025 01:18 PM\nSource:[Abidjan.net](https://news.abidjan.net/articles/741745/presidentielle-2025-radiation-de-thiam-gbagbo-et-ble-goude-un-opposant-annonce-une-longue-marche-solitaire-pour-dire-non-a-lexclusion-politique)\n\n**Ivory Coast Opposition Demands Reinstatement of Candidate Tidjane Thiam**\nOver a thousand young people from the main opposition party in Ivory Coast, the Parti démocratique de Côte d'Ivoire (PDCI), gathered in Abidjan on Sunday to demand the reinstatement of their candidate, Tidjane Thiam, in the October presidential election. 'It's time to stop talking and take action,' said Henri Joël Kouadio, president of the PDCI's youth and student wing. 'If Tidjane Thiam is not on the final electoral list, there will be no elections in Côte d'Ivoire,' he emphasized. The PDCI has been mobilizing thousands of people in Abidjan and calling for a 'national mobilization' against 'injustice, tyranny, and fear.' A rally is planned for Thursday in the Plateau business district, the same day a court in Abidjan will hear a case that could strip Thiam of his party leadership due to a dispute over his nationality. Thiam, a 62-year-old international banker, was removed from the electoral list after a court ruled on April 22 that he had lost his Ivorian nationality when he registered in 2022. The final electoral list is expected to be published on June 20. Other opposition figures, including former President Laurent Gbagbo, are also excluded from the presidential election due to judicial convictions. The authorities reject any political interference and rely on legal texts and judicial decisions. President Alassane Ouattara, 83, has not yet commented on a potential candidacy but has expressed his desire to continue serving his country.\nOriginal language: fr\nPublish date: May 04, 2025 06:36 PM\nSource:[TV5MONDE](https://information.tv5monde.com/afrique/presidentielle-ivoirienne-un-millier-de-jeunes-en-soutien-lopposant-thiam-2772178)\n\n**Côte d'Ivoire: Opposition Withdraws from CEI, Raising Questions about Election Legitimacy**\nIn Côte d'Ivoire, six months before the presidential election, tensions are rising. The removal of Tidjane Thiam from the electoral list, on a court decision, has reignited criticism of a process deemed biased by the opposition. After the judicial elimination of Laurent Gbagbo, Guillaume Soro, and Charles Blé Goudé, it is now the PDCI candidate, who was invested at 99.5%, who is being excluded due to a nationality clause. The Independent Electoral Commission (CEI), already criticized for anomalies during the registration and electoral disputes, is now at the center of suspicion. The opposition, led by the PDCI-RDA and the PPA-CI of Laurent Gbagbo, has announced its withdrawal from the CEI, breaking one of the founding commitments of the commission to represent the entire Ivorian political landscape. This move has raised questions about the legitimacy of the October 2025 election. The CEI maintains its stance, but a question remains: beyond the criticism, what do the parties do to anchor democratic culture outside of Abidjan?\nOriginal language: fr\nPublish date: April 24, 2025 05:30 PM\nSource:[Le Point.fr](https://www.lepoint.fr/afrique/cote-d-ivoire-l-opposition-desormais-en-retrait-de-la-cei-et-du-jeu-politique-24-04-2025-2588128_3826.php)\n\n**Cap-Côte d'Ivoire Denounces Removal of President Tidjane Thiam from Electoral List**\nThe Cap-Côte d'Ivoire party has denounced the removal of President Tidjane Thiam from the electoral list in Côte d'Ivoire. Dr. Simone Ehivet Gbagbo, spokesperson for the Cap-Côte d'Ivoire, read a statement in Abidjan on April 23, 2025, condemning the decision. The party had previously opposed any attempts to remove Thiam from the list, citing his legitimacy as President of the PDCI-RDA and his ability to represent the party in the October 2025 presidential election. The party accuses the ruling regime of using legal tricks to exclude Thiam and other opposition leaders, including Laurent Gbagbo, Soro Kigbafori Guillaume, and Charles Blé Goudé. The Cap-Côte d'Ivoire demands the reinstatement of Thiam on the electoral list, the opening of a dialogue with all stakeholders, the dissolution of the current electoral commission, and the organization of a revision of the electoral list before the October 2025 elections. The party also calls for the reinstatement of the excluded leaders and the establishment of a peaceful climate conducive to credible, transparent, and violence-free elections.\nOriginal language: fr\nPublish date: April 24, 2025 12:56 PM\nSource:[allAfrica.fr](https://fr.allafrica.com/stories/202504240468.html)\n\n**Ivory Coast Opposition Calls for Demonstration Against Exclusion of Candidate Tidjane Thiam**\nSix months after the Ivorian presidential election, the main opposition party has called for a demonstration in front of the country's courts on Thursday to protest the exclusion of its candidate, Tidjane Thiam. The Abidjan court has removed Mr. Thiam from the electoral list, ruling that he had lost his Ivorian nationality. The decision is not subject to appeal and closes the door to his candidacy for the October 25 presidential election. Other opponents, such as former President Laurent Gbagbo, are also excluded from the race due to a judicial conviction. 'Tomorrow (Thursday), everywhere in the country, every Ivorian will march in front of the palace of justice of his region, of his city,' said Simon Doho, leader of the deputies of the Parti démocratique de Côte d'Ivoire (PDCI), at the party's headquarters in the Plateau district of Abidjan. 'It's me or no one, we will not present another candidate,' Thiam said earlier in a phone interview with AFP. He also announced that he would take the case to the Court of Justice of the Economic Community of West African States (ECOWAS). 'We will go to ECOWAS, we have the right. And we will continue to fight on the ground and show the power that this decision is bad for Côte d'Ivoire,' he said. 'We've had enough,' said Appolline Mimi, 67, at the PDCI headquarters. 'Today, it's not about Tidjane Thiam, it's about the survival of Côte d'Ivoire.'\nOriginal language: fr\nPublish date: April 23, 2025 03:41 PM\nSource:[Orange Actualités](https://actu.orange.fr/monde/presidentielle-ivoirienne-appel-a-manifester-jeudi-contre-l-eviction-de-l-opposant-thiam-CNT000002itWgW.html)\n\n**Côte d'Ivoire's Electoral List Sparks Controversy Over Exclusion of Presidential Candidates**\nThe provisional electoral list in Côte d'Ivoire has sparked controversy, with the exclusion of Charles Blé Goudé and Laurent Gbagbo, who are both running for president in October 2025. The Independent Electoral Commission (CEI) has released a list of 8,761,348 voters, but around 3.5 million people are reportedly excluded. Sébastien Dano Djédjé, Executive Director of the PPA-CI, claims that 'Côte d'Ivoire is the only country in the sub-region where the choice of leaders is made by an extreme minority of citizens.' The PPA-CI is denouncing an 'injustice' and plans to exhaust all legal remedies. The opposition party is vowing to use all legal means to get Laurent Gbagbo re-registered, citing a ruling by the African Court of Justice that demanded his return to the electoral list. 'President Laurent Gbagbo is a candidate in the 2025 presidential election,' Sébastien Dano Djédjé emphasized, calling for 'just, democratic, and peaceful' elections. The COJEP is also demanding the reinstatement of Blé Goudé: 'we launch this appeal: restore the rights of President Charles Blé Goudé, reintegrate him into the electoral list so that he can participate in the 2025 election,' said Me Serge Ouraga, COJEP spokesperson. Gbagbo and Blé Goudé were sentenced to 20 years in prison for their roles in the 2010-2011 post-electoral crisis, but were amnestied by international justice. However, without an amnesty from President Alassane Ouattara, they cannot be re-registered on the electoral list. The ruling party, RHDP, claims that the opposition is trying to find a way to delay or disrupt the electoral process, making the October 25 election impossible.\nOriginal language: fr\nPublish date: March 20, 2025 05:20 PM\nSource:[maliweb.net](https://www.maliweb.net/international/gbagbo-et-ble-goude-les-grands-absents-dune-liste-electorale-controversee-3100319.html)\n\n**Côte d'Ivoire's Electoral List Sparks Controversy Over Exclusion of Presidential Candidates**\nThe provisional electoral list in Côte d'Ivoire has sparked controversy, with the exclusion of Charles Blé Goudé and Laurent Gbagbo, who are both running for president in October 2025. The Independent Electoral Commission (CEI) has released a list of 8,761,348 voters, but around 3.5 million people are excluded, according to Sébastien Dano Djédjé, Executive Director of the PPA-CI. 'Côte d'Ivoire is the only country in the sub-region where the choice of leaders is made by an extreme minority of citizens,' he said. The PPA-CI is denouncing an 'injustice' and will exhaust all legal remedies to get Laurent Gbagbo re-registered. 'President Laurent Gbagbo is a candidate in the presidential election of October 2025,' Djédjé emphasized, calling for 'just, democratic, and peaceful' elections. The COJEP is also demanding the reintegration of Blé Goudé: 'we launch this appeal: restore the rights of President Charles Blé Goudé, reintegrate him on the electoral list to allow him to participate in the 2025 election,' said Me Serge Ouraga, COJEP spokesperson. Gbagbo and Blé Goudé were sentenced to 20 years in prison for their roles in the 2010-2011 post-electoral crisis, but were amnestied by international justice. However, without a pardon from President Alassane Ouattara, they cannot be re-registered on the electoral list. The ruling RHDP party believes the opposition is trying to delay the electoral process to make the October 25 election impossible, according to Kobenan Kouassi Adjoumani, RHDP spokesperson.\nOriginal language: fr\nPublish date: March 20, 2025 10:54 AM\nSource:[Africanews](https://fr.africanews.com/2025/03/20/gbagbo-et-ble-goude-les-grands-absents-dune-liste-electorale-controversee/)\n\n**Gbagbo Announces Presidential Bid, Calls for Independent Electoral Commission**\nLaurent Gbagbo, a 79-year-old Ivorian politician, has announced that he will run for president in the upcoming election, despite being currently ineligible due to a conviction related to the 2010-2011 post-electoral crisis. Gbagbo has outlined several conditions for a peaceful election, including the establishment of an independent electoral commission, a revision of the electoral rolls to ensure only Ivorian citizens are registered, and a democratic debate without repression. He also criticized the current electoral commission for being 'inféodée' to President Alassane Ouattara. Gbagbo's party, the Parti des peuples ivoiriens - Côte d'Ivoire (PPA-CI), has accused the government of conducting 'procès politiques' against its leaders, who are facing trial for alleged crimes. Gbagbo said, 'If we want an election in peace and tranquility, we must stop repressing those who have a different point of view from those in power.' Several other candidates, including Tidjane Thiam, Jean-Louis Billon, and Pascal Affi N'Guessan, have also announced their candidacy for the October 25, 2025 presidential election.\nOriginal language: fr\nPublish date: February 09, 2025 07:56 AM\nSource:[Le360 Afrique](https://afrique.le360.ma/politique/cote-divoire-gbagbo-veut-se-battre-pour-une-presidentielle-juste_O6SZEXPAZBFB3K2OXKWC3LC6YE/)\n\n**Côte d'Ivoire: Opposition Leader Tidjane Thiam Renounces French Nationality to Run for President**\nTidjane Thiam, the president of the Parti démocratique de Côte d'Ivoire (PDCI), has announced that he will renounce his French nationality to be eligible for the upcoming presidential election in October 2025. 'We have made an important step today (...) that we had planned for a long time, which consisted of going to deposit my request for the release of my French nationality, which will allow me to be exclusively Ivorian at the time of the election,' Thiam said. 'It's an administrative formality,' he added. According to Article 55 of the Ivorian Constitution, a presidential candidate must be 'exclusively of Ivorian nationality, born of an Ivorian father or mother.' Thiam, a former engineer, minister, and bank executive, lived outside of Côte d'Ivoire for 20 years before returning in August 2022. He became the president of the PDCI in December 2023 and will be designated as the party's candidate at a convention whose date has yet to be determined. He may face Jean-Louis Billon, a former minister of Commerce who has already announced his candidacy and opposes Thiam. Several other candidates, including former President Laurent Gbagbo, his ex-wife Simone Ehivet Gbagbo, and former Prime Minister Pascal Affi N'Guessan, have also announced their candidacy.\nOriginal language: fr\nPublish date: February 07, 2025 06:34 PM\nSource:[lefigaro.fr](https://www.lefigaro.fr/flash-actu/cote-d-ivoire-l-opposant-tidjane-thiam-renonce-a-sa-nationalite-francaise-20250207)\n\n**Côte d'Ivoire Presidential Election 2025: Key Players and Debates**\nThe national news in Côte d'Ivoire on February 5, 2025, is dominated by political topics, particularly the debates surrounding the upcoming presidential election in October. According to L'Expression, the two main opponents of the RHDP are Cissé Bacongo and an unnamed second opponent. Le Matin criticizes the opposition for trying to discredit the Independent Electoral Commission (CEI). Le Patriote quotes Cissé Bacongo, saying that President Alassane Ouattara 'deserves to continue' and that the opposition's goal is to elect the president in the first round. Le Jour plus states that Ouattara is the favorite to win the election, citing reasons why Ivorians support him. L'Avenir presents alternative candidates for the PDCI and PPA-CI, who are reportedly out of the running for the election. Le Bélier suggests that Ouattara is seeking international support for a fourth term. Le Nouveau Réveil argues that Ouattara's fourth term is a big equation and a big concern. Dernière Heure Monde claims that Tidjane Thiam cannot be disqualified from the election, despite opposition from some groups. Le Quotidien d'Abidjan states that a 'big mission' has been given to Laurent Gbagbo in the context of the election, and Le Canard déchaîné suggests that Gbagbo will be a candidate in the election. Koné Daouda explains why he has chosen to support Pascal Affi N'guessan, the president of the FPI. L'Inter reports that former demobilized soldiers have called on Ouattara, Gbagbo, and Thiam to preserve peace in Côte d'Ivoire during the election.\nOriginal language: fr\nPublish date: February 05, 2025 07:43 AM\nSource:[aip.ci](https://www.aip.ci/152144/cote-divoire-aip-revue-de-presse-les-sujets-politiques-dominent-lactualite-nationale-de-ce-mercredi-5-fevrier-2025/)\n\n**Affi N'Guessan Calls on Laurent Gbagbo to Unite Opposition Ahead of 2025 Presidential Election**\nPascal Affi N'Guessan, president of the Front Populaire Ivoirien (FPI), has called on Laurent Gbagbo, former president of Côte d'Ivoire, to unite the opposition ahead of the 2025 presidential election. In a speech, Affi N'Guessan denounced the fragmentation of the opposition and urged its leaders to put aside personal interests for the sake of democratic alternance. 'The responsibility of the opposition is immense at this moment in our country's history. The time must not be one of personal and egoistic calculations. Our people are unhappy with our divisions, with the image we project, of a fragmented and paralyzed opposition, unable to fight together for the only essential combat: that of democratic alternance,' he said. Affi N'Guessan also called for a sincere dialogue between the opposition and the ruling power, as a guarantee of inclusive, free, and transparent elections. He invited Laurent Gbagbo to take on a unifying role, recalling that the late Henri Konan Bédié had brought the opposition together against Alassane Ouattara's third term. 'Following the Bonoua Appeal, President Laurent Gbagbo must now work towards the unity of the entire opposition around the essential. He must lay the foundations for the Rassemblement pour une Alternance Pacifique, Inclusive et Démocratique (RAPID), a crucial initiative to ensure a rapid and democratic change in 2025,' he said.\nOriginal language: fr\nPublish date: February 01, 2025 09:09 PM\nSource:[Abidjan.net](https://news.abidjan.net/articles/739011/presidentielle-2025-affi-nguessan-appelle-laurent-gbagbo-a-rassembler-lopposition-ivoirienne-abidjan)\n\n",
    "date": "2025-05-30T03:05:30.834867",
    "summary": "Across all expert perspectives, there is broad consensus that the probability of at least one of the named candidates (Gnangbo Kacou, Laurent Gbagbo, Pascal Affi N'Guessan, Jean-Louis Billon, or Simone Gbagbo) being disqualified from running in the 2025 Ivorian presidential election before July 1, 2025 is high. Multiple experts highlight the recent disqualification of high-profile opposition figures, such as Tidjane Thiam and Laurent Gbagbo, as strong precedent for further exclusions, noting that the Ivorian regime routinely uses the judiciary and administrative mechanisms to restrict opposition participation. The status quo is that Gbagbo has already been disqualified due to a prior conviction, and others, especially Simone Gbagbo, remain at risk due to ongoing or past legal issues. Factors increasing the probability include the regime's history of manipulating candidate lists, weak judicial independence, base rates from past elections, fragmentation of the opposition, and the use of legal-technical grounds to justify exclusions.\n\nSlightly offsetting these factors are considerations such as increased domestic protest activity, some international scrutiny (from bodies like ECOWAS and the African Court), and the narrowing window for administrative or legal action as deadlines approach. Even so, most experts believe these pressures only modestly decrease the probability. A few outlier experts, applying elite theory or focusing on the advanced stage of the exclusion process, suggest a lower risk for new disqualifications (around 27–35%), reasoning that the regime may feel secure with the main threats already eliminated and additional exclusions could entail higher political costs. However, the predominant view, especially among those focused on legal, electoral, and democratization dynamics, is that the risk remains very substantial—with probabilities often above 70–80% and some as high as 97%.\n\nIn summary, the aggregation of expert forecasts strongly points to a high likelihood (typically 70–90%) that at least one of the named candidates will be (or continue to be) officially disqualified before July 1, 2025, primarily due to persistent regime incentives, established exclusionary practices, unresolved legal vulnerabilities for several opposition figures, and a history of last-minute disqualifications in Ivorian elections."
}