{
    "deliberation_results": {
        "PoliticalConsultingCampaignStrategy": {
            "time_to_resolution": "Approximately 25 days (resolves July 1, 2025); today is June 5, 2025.",
            "perspective_relevance": "As a political consulting and campaign strategy expert, I am attentive to candidate announcement timing, the coordination of campaign rollouts, intra-party power dynamics, polling/endorsement impacts, and the specific incentives for high-profile figures like Casey DeSantis. Campaigns rarely make major moves without clear strategic rationale, especially when a frontrunner has already announced and the window for early entry is nearly closed. My experience also helps assess the weight of donor networks, spouse-of-incumbent pathways, and the risks of entering a bruising primary, particularly in a polarized environment where a Trump endorsement (for Byron Donalds) reshapes the usual Republican nominating calculus.",
            "status_quo": "Casey DeSantis is 'considering' a run but has NOT announced her candidacy. Byron Donalds, with Trump’s endorsement, is already an official candidate. The narrative appears concentrated on Donalds as the GOP frontrunner, while media references consistently mention DeSantis as 'potential' or 'mulling.' Polls now show Donalds with a double-digit lead (after the Trump endorsement) over Casey DeSantis in hypothetical matchups.",
            "perspective_derived_factors": [
                {
                    "factor": "Base Rate of Late-Stage Non-Incumbent Announcements",
                    "effect": "Strongly decreases probability. Major candidates, especially those with a name and donor advantage, usually announce with enough lead time to lock in money and endorsements. With less than four weeks left and Donalds/Trump dominating, the base rate for a 'surprise' high-profile entry is very low."
                },
                {
                    "factor": "Polls and Trump Endorsement Impact",
                    "effect": "Decreases probability. Donalds leads DeSantis by 20+ points when respondents know Trump is backing him. This reduces the incentive for Casey DeSantis to jump in now, as the risk of a high-profile loss rises and GOP actors are coalescing around Donalds."
                },
                {
                    "factor": "DeSantis Family Political Calculus",
                    "effect": "Decreases probability. Ron DeSantis is described as alienating allies and looking for influence post-governorship. But a weak entry or loss for Casey would further reduce their power, especially as DeSantis has his own aspirations. Timing may be more favorable in the future, after letting the Trump circle win or falter first."
                },
                {
                    "factor": "Donor/Party Network Feedback",
                    "effect": "Decreases probability. Early 2025 speculation suggested donors were 'encouraging' Casey, but there’s no evidence of real momentum or commitments now. Party infrastructure usually signals support before a major announcement and seems aligned with Donalds."
                },
                {
                    "factor": "Strategic Announcement Timing (Window Nearing Close)",
                    "effect": "Decreases probability. Most high-profile candidates maximize earned media, donor signaling, and field-building by announcing months before the fundraising or campaign field infrastructure deadlines. Late-announcing candidates usually do so for 'spoiler' or protest purposes, not as would-be frontrunners."
                },
                {
                    "factor": "Potential for Political Black Swan events or Withdrawals",
                    "effect": "Slightly increases probability. If Donalds were suddenly engulfed in scandal or Trump withdrew support, there might be a rush to fill the gap. But there is no evidence of such an immediate crisis."
                }
            ],
            "no_scenario": "The status quo holds: Casey DeSantis continues to be described as 'mulling' a campaign, but with the polling lead for Donalds widening (due to Trump’s involvement) and the absence of significant donor pressure or media 'leaks' priming a candidacy, she does NOT make a public announcement before July 1, 2025. Media and party infrastructure coalesce around Byron Donalds as the established GOP candidate. Casey potentially holds off for a future cycle, especially given risk of a bruising, high-profile loss.",
            "yes_scenario": "A major, unexpected event shifts the field — e.g., Donalds is suddenly sidelined by scandal, Trump withdraws his endorsement, or polling collapses. Major party actors and donors urge Casey DeSantis to announce as a unity or rescue candidate, and she launches a campaign just before July 1 to seize the moment. Alternatively, Ron DeSantis recalculates that a DeSantis candidacy now is essential to maintain family political influence, despite the risks, and signals an immediate announcement.",
            "final_reasoning": "Casey DeSantis has not announced her candidacy with less than a month left, despite months of speculation and analysis. All major signals (polling, Trump endorsement, lack of donor enthusiasm, absence of leaks or campaign infrastructure) point toward her sitting out for now, not launching a last-minute bid for a race where the frontrunner advantage is rapidly being solidified by Byron Donalds and Trump. While she remains a potential future candidate, the base rate for such a late high-profile announcement is extremely low except in crisis situations, and there are currently no credible reports of such. My estimate adjusts for a sliver of uncertainty around possible black swan events but is otherwise heavily weighted against a pre-July 1 announcement.",
            "final_probability": 4
        },
        "PoliticalConsultingCandidateEmergenceAnalysis": {
            "time_to_resolution": "Approximately 25 days (until July 1, 2025)",
            "perspective_relevance": "My expertise as a Political Consulting (Candidate Emergence Analysis) specialist is especially relevant in evaluating the calculus behind timing, signaling, and announcement strategies for high-profile political figures like Casey DeSantis. Understanding candidate emergence requires deep insight into donor networks, party dynamics, optics in competitive primaries, as well as base rates for political spouses seeking office, and the strategic value (or risk) of entering crowded/hostile fields early or late.",
            "status_quo": "Casey DeSantis has not announced her candidacy. Byron Donalds, backed by Trump, has already declared and is consolidating support. Ron DeSantis, the incumbent, has highlighted Casey as a potential successor but she remains undecided. Most reporting describes her as 'considering' a run, not imminent.",
            "perspective_derived_factors": [
                {
                    "factor": "Trump Endorsement of Byron Donalds",
                    "effect": "Decreases probability. As the clearest MAGA lane candidate is locked up, the value of an immediate Casey DeSantis entry is reduced, and she faces the prospect of a divided primary. GOP insiders may deter a divisive primary."
                },
                {
                    "factor": "Polls Showing Donalds' Lead Over Casey",
                    "effect": "Decreases probability. She is trailing (44% to 25%) in key Republican primary polling post-Trump-endorsement. Political consultants typically advise against jumping in when momentum is against their client unless they can immediately shift the dynamic."
                },
                {
                    "factor": "Ron DeSantis' Political Uncertainty and Defensive Posture",
                    "effect": "Slightly increases probability. The DeSantises' need to maintain relevance and power may motivate a sooner announcement to freeze out other donors and show strength. However, evidence suggests Casey is still calculating rather than ready for a rapid campaign launch."
                },
                {
                    "factor": "Historical Emergence Patterns for High-Profile Spouses",
                    "effect": "Decreases probability. Most governor/cabinet-level political spouses carefully avoid premature or losing launches; they tend to enter after careful groundwork, not on the heels of another candidate's major power move unless they have overwhelming support."
                },
                {
                    "factor": "Primary is Over a Year Away, Ample Time for Entry",
                    "effect": "Decreases probability for imminent announcement. There is no filing deadline or urgent event (debates, fundraising quarters) that demands entry before July 1."
                },
                {
                    "factor": "Recent News/Buzz About Candidates Only Refers to Casey as 'Considering a Run'",
                    "effect": "Decreases probability. No leaks, stories, or event planning suggests an imminent launch within next few weeks. If announcement were set, political rumor mill would be full of date speculation, and that's absent."
                },
                {
                    "factor": "Potential for Strategic Delayed Entry",
                    "effect": "Decreases probability. With an opponent like Donalds being the clear frontrunner after Trump's endorsement, the DeSantis team is more likely to wait for polling movement or any Donalds stumble to time a launch for maximum effect."
                }
            ],
            "no_scenario": "Casey DeSantis continues to weigh her options, monitors polling and fundraising, and opts to delay her entry at least until after July 1, seeing no strategic imperative to announce early. She may be pressured by poor poll numbers and Trump world consolidation around Donalds, or may prefer to build a donor/consultant network quietly before going public.",
            "yes_scenario": "A development—such as a grassroots groundswell, a crisis/scandal for Donalds, or a major policy rift in the state GOP—triggers an urgent need to announce and rally support, causing Casey DeSantis to formally launch her campaign before July 1 in an attempt to regain momentum and reassert DeSantis world dominance.",
            "final_reasoning": "Base rate analysis and current news cycle show that high-profile political spouses rarely announce without done-deal establishment support, a favorable polling environment, and a compelling reason to enter early—none of which is current. All public signals indicate that Casey DeSantis is biding her time, gauging Donalds' strength post-Trump endorsement, and has little incentive to formally enter a race before July 1, 2025. The absence of reporting on imminent campaign activity (hire staff, event planning, leaks) further corroborates this. Barring an unforeseen event, the probability of a pre-July 1 announcement is very low.",
            "final_probability": 5
        },
        "FloridaPoliticsExpertiseFloridaPoliticalDynamics": {
            "time_to_resolution": "Approximately 3 weeks (until July 1, 2025 from June 5, 2025—26 days)",
            "perspective_relevance": "As an expert in Florida political dynamics, I bring an understanding of intra-party maneuvering, candidate emergence patterns, campaign timeline norms, the influence of endorsements (especially Trump’s), the DeSantis family’s political ambitions, and the workings of both donor and activist networks in the state. These factors are especially salient in gubernatorial succession battles within a term-limited, ideologically competitive state like Florida.",
            "status_quo": "Casey DeSantis has not announced her candidacy for governor, though speculation and reporting persists that she is considering a run. Rep. Byron Donalds has announced, secured Trump’s endorsement, and is actively campaigning as the clear Republican frontrunner. Matt Gaetz and others are mentioned as potential candidates, but no announcement from Casey DeSantis has taken place as of June 5, 2025.",
            "perspective_derived_factors": [
                {
                    "factor": "Trump Endorsement Consolidating Support for Byron Donalds",
                    "effect": "Decreases probability—With Trump’s public and sustained backing, Republican establishment, donors, and activists increasingly rally to Donalds, reducing the incentive for Casey DeSantis to enter the race now. Polls show Trump’s endorsement swings large segments of the Florida GOP base."
                },
                {
                    "factor": "Typical Campaign Launch Timeline for Major Florida Statewide Races",
                    "effect": "Decreases probability—Announcements for Florida gubernatorial races generally occur more than a year ahead of the primary (August 2026), but 3 weeks from now is not a norm for late-breaking entries. Major contenders typically announce by early-mid spring for proper fundraising and organization."
                },
                {
                    "factor": "DeSantis Family’s Strategic Calculus/Post-Governor Influence",
                    "effect": "Increases probability, but only slightly—Ron DeSantis has floated Casey as a possible successor to maintain influence. If Byron Donalds’ momentum appeared fragile or DeSantis world perceived a window closing, a surprise June launch would be plausible, though risky."
                },
                {
                    "factor": "Current Rumor, Reporting, and Donor Chatter",
                    "effect": "Neutral to slightly negative—Recent stories and political gossip do not indicate imminent announcement; rather, most reporting uses language like 'considering' or 'speculation.' No leaks or official pre-announcements suggest rollout is prepared for June."
                },
                {
                    "factor": "Political Risk of a Late Entry",
                    "effect": "Decreases probability—Every day Casey delays her entry, she surrenders base and donor support to Donalds. A late June entry carries risk of being seen as a spoiler or opportunist, challenging a Trump-endorsed candidate with a head start, which is not generally the DeSantis style."
                }
            ],
            "no_scenario": "Casey DeSantis continues to float her interest, maintains high public profile, but ultimately refrains from making a formal announcement before July 1. She may take a 'wait and see' approach amid strong Trump-Donalds momentum, opting to preserve her political capital for a later date or reevaluating based on the Republican landscape after Donalds’ likely continuing consolidation.",
            "yes_scenario": "In a bid to disrupt Donalds’ growing dominance and seize back the narrative as the DeSantis influence in Tallahassee ebbs, Casey DeSantis convenes an emergency strategy session, rallies key donors and several under-disposed Republican establishment figures, and holds a press conference before July 1 to announce. This would require a visible, swift organizational push and likely some news leaks beforehand, which thus far are absent.",
            "final_reasoning": "Base rates for late-in-the-cycle gubernatorial announcements among major contenders in Florida are low, as organization building and fundraising begin earlier. Trump’s endorsement has proven reliably decisive in state GOP primary outcomes, swinging both voters and donors, as seen in past cycles. Casey DeSantis remains a notional candidate, but all reporting describes her as 'considering' or 'potential.' There is no evidence of active campaign infrastructure, FEC filings, or staff movement; nor has the DeSantis camp floated any imminent timeline. Meanwhile, Donalds’ poll surge, consolidation after Trump’s endorsement, and the lack of prepping signals from Casey’s side suggest any announcement in the next 3 weeks is unlikely. The only plausible path to a 'Yes' is an 11th-hour counterstrike as DeSantis world senses their influence waning—but there are no current signs of such a gambit. On balance, the evidence points strongly to a No.",
            "final_probability": 8
        },
        "PoliticalScienceRationalChoiceTheory": {
            "time_to_resolution": "Approximately 25 days until July 1, 2025.",
            "perspective_relevance": "As an expert in Rational Choice Theory, I focus on the incentives, constraints, and strategic calculus facing Casey DeSantis and key stakeholders in the Florida Republican Party. This perspective is especially relevant in a high-stakes, multi-candidate primary where timing, political capital, and resource mobilization are critical. Rational actors will pursue actions that maximize their expected utility—factoring in polling, endorsements, party dynamics, and future political ambitions.",
            "status_quo": "As of June 5, 2025, Casey DeSantis has not announced her candidacy for governor, though she is widely considered a potential contender but is trailing Byron Donalds in recent polls, especially after Trump’s endorsement of him.",
            "perspective_derived_factors": [
                {
                    "factor": "Polling and Trump Endorsement Effect",
                    "effect": "Decreases probability—Byron Donalds holds a strong polling lead after receiving Trump’s explicit endorsement. This reduces the rational incentive for Casey DeSantis to quickly enter a race in which she is not currently favored."
                },
                {
                    "factor": "Timing and Strategic Entry",
                    "effect": "Decreases probability—With the primary over a year away (August 2026), key resources (endorsements, money, organizational mobilization) may not necessitate an early formal announcement, especially if the current environment is disadvantageous."
                },
                {
                    "factor": "Ron DeSantis’ Influence and Family Strategy",
                    "effect": "Slightly increases probability—Ron DeSantis has floated Casey as a successor, and some donors are reportedly encouraging her run, creating latent potential if circumstances change quickly. However, his diminished leverage amid party splits and scandals curbs this somewhat."
                },
                {
                    "factor": "Opportunity Costs and Future Ambitions",
                    "effect": "Decreases probability—Announcing now puts Casey on a collision path with the Trump/Donalds machine. Delaying keeps options open for other roles (e.g., national posts, later cycles) if the 2026 contest looks unwinnable."
                },
                {
                    "factor": "Elite Coordination and Donor Calculus",
                    "effect": "Decreases probability—Major GOP donors appear cautious or split, with some shifting to Donalds and others hedging. This reduces the minimum necessary coalition for a viable immediate announcement."
                },
                {
                    "factor": "Scandal/Resignation Risk or External Shocks",
                    "effect": "Increases probability—but only if some emergent scandal or withdrawal alters the field (e.g., Donalds implodes, Trump withdraws support). No evidence in the reporting of such imminent developments."
                }
            ],
            "no_scenario": "Casey DeSantis continues to 'consider' a run but, sensing the strategic disadvantages created by Trump’s endorsement of Donalds and her polling deficit, delays a formal announcement. She waits for the August 2026 filing deadlines (or later in 2025) to reassess the landscape, thereby missing the July 1 cut-off.",
            "yes_scenario": "Some major scandal, health event, or sudden withdrawal takes Donalds off the field; DeSantis world senses a fleeting opening and, with encouragement from key donors and Ron DeSantis himself, Casey makes a rapid announcement to consolidate the anti-Donalds lane and claim early media momentum.",
            "final_reasoning": "Base rate analysis of major gubernatorial campaigns in Florida and other large states suggests candidates rarely announce more than 14-18 months ahead of the primary unless they are under acute competitive pressure or lead in polls. In this case, Casey DeSantis trails Byron Donalds significantly post-Trump endorsement, undermining the incentive to announce quickly. Strategic actors typically avoid jumping into a losing race when time is still available to wait for shocks or opportunities. Current news provides no evidence of imminent events that would rapidly improve her position. All key signals (polling, endorsements, donor hesitation, and the rational preference for optionality) favor waiting rather than an announcement before July 1, 2025.",
            "final_probability": 8
        },
        "PoliticalSciencePoliticalAmbitionTheory": {
            "time_to_resolution": "Approximately 25 days (until July 1, 2025)",
            "perspective_relevance": "As an expert in Political Science Political Ambition Theory, my analysis emphasizes the motivations, calculations, and trajectories of individuals in pursuit of elected office, including strategic timing, opportunity structures, and signaling among elites and voters. Applying this lens helps to assess not just candidate interest, but also the likelihood and rationality of entry decisions in the context of intra-party dynamics, electoral timing, and competitive environments.",
            "status_quo": "As of June 5, 2025, Casey DeSantis has NOT announced her candidacy for Florida governor. She is publicly known to be 'considering' a run, but has made no official move. Byron Donalds has formally announced and is consolidated as the GOP frontrunner with Donald Trump's endorsement. Governor Ron DeSantis has continued to leave the door open for his wife's possible candidacy but has not confirmed it.",
            "perspective_derived_factors": [
                {
                    "factor": "Political Ambition Calculus & Timing",
                    "effect": "Decreases probability: With the August 2026 primary over a year away, high-profile candidates—especially those with name recognition and spousal access to key donors—often have the luxury of waiting to announce. The short time frame until July 1, 2025, reduces the necessity and benefit of an imminent announcement."
                },
                {
                    "factor": "Opportunity Structure (Trump and Donalds Consolidation)",
                    "effect": "Decreases probability: Donalds's formal entry, Trump's backing, and recent polling showing Donalds pulling ahead reduce the incentive for Casey DeSantis to rush an entry, as the environment does not uniquely favor her swift announcement. Instead, she is likely to assess whether Donalds' momentum sustains."
                },
                {
                    "factor": "Elite and Donor Signaling",
                    "effect": "Neutral to lowers probability: While some donors reportedly encourage Casey DeSantis to run, there is no evidence of a large-scale donor migration or A-list GOP establishment push for her to announce imminently. The field is not yet locked in, giving her room to wait."
                },
                {
                    "factor": "Status of Ron DeSantis and Family Calculation",
                    "effect": "Decreases probability: Governor DeSantis is still in office, has not firmly endorsed any candidate, and may view withholding Casey’s decision as strategic for maintaining leverage within state GOP and national politics. This increases likelihood of a post-July 1 announcement, maximizing mystery and maneuverability."
                },
                {
                    "factor": "Strategic Calculation vs. Primary Calendar",
                    "effect": "Decreases probability: The August 2026 GOP primary is still 14 months away, so an immediate announcement is not structurally required for ballot access, fundraising, or campaign organization—particularly for a figure with established public profile like Casey DeSantis."
                },
                {
                    "factor": "Precedent/Base Rate for Politically Prominent Spouses",
                    "effect": "Decreases probability: Historically, the spouses of sitting governors tend to delay announcement until late in the sitting governor’s final term, often months or even a year before the primary—well after the window in question."
                }
            ],
            "no_scenario": "Casey DeSantis continues to 'consider' a run, leveraging speculation, donor interest, and media coverage, but strategically withholds a formal announcement to maximize leverage within the party, avoid early attacks, and observe the outcome of Donalds’s campaign growth and other developments. She formally announces after July 1, 2025, to still have sufficient time for organization and fundraising, entering the race as a fresh alternative later in the cycle.",
            "yes_scenario": "Casey DeSantis perceives significant risk of losing key donors, endorsements, or favorable momentum due to Donalds' consolidation. In response to internal and external pressure to rally the DeSantis base or counteract Trump’s dominance, or in response to a new political scandal or opportunity, she accelerates her timeline and announces her candidacy in June 2025, ahead of July’s deadline.",
            "final_reasoning": "All key indicators derived from Political Ambition Theory, news articles, and electoral precedent suggest Casey DeSantis is strategically incentivized to delay her announcement until after July 1, 2025. The entry of Byron Donalds with powerful Trump backing, polling indicating her slipping position, the lack of acute pressure for an early announcement (especially for a well-known figure with substantial party infrastructure), and the tactical benefits of timing suggest she and her political team will continue to 'consider' and test the waters rather than commit ahead of schedule. Base rate analysis for spouses of sitting governors, combined with the value of retaining strategic flexibility, further lowers the odds. While a sudden political shock or strong donor revolt could accelerate her timeline, no present evidence supports such a development. Instead, all signs point to continued hedging and controlled ambiguity.",
            "final_probability": 12
        },
        "PoliticalScienceAmericanStatePolitics": {
            "time_to_resolution": "Approximately 3.5 weeks (until July 1, 2025)",
            "perspective_relevance": "As an expert in American State Politics, I closely follow Florida's political landscape, party dynamics, and candidate emergence patterns at the gubernatorial level. I have studied candidate announcement timing, candidate field development, and the interplay between power brokers (e.g., Trump and DeSantis) and the ambitions of political spouses. This expertise enables me to accurately weigh base rates and idiosyncratic factors in Florida's GOP contest.",
            "status_quo": "Casey DeSantis has not announced her candidacy for governor. Byron Donalds is the declared GOP frontrunner with Donald Trump's endorsement. Casey is openly considering a run but has not taken public legal steps to enter the race.",
            "perspective_derived_factors": [
                {
                    "factor": "Historical Base Rate for Spouse-Immediate Successor Announcements",
                    "effect": "Decreases probability. In modern US state politics, it is rare for a sitting governor's spouse to announce for immediate succession, and when they do, announcements generally occur after some party consultation and when the field is less consolidated. The short timeframe reduces likelihood."
                },
                {
                    "factor": "Party Field Consolidation and Trump Endorsement of Donalds",
                    "effect": "Strongly decreases probability. The Trump endorsement has solidified Donalds’ front-runner status and reduced momentum for others to enter. Public polls show his lead growing over Casey DeSantis when Trump's backing is noted."
                },
                {
                    "factor": "Casey DeSantis' Public Statements and Reported Internal Deliberations",
                    "effect": "Slightly increases probability. She is 'mulling' a run and cited as a possible candidate in every article, with reported donor encouragement. However, no move has been made thus far."
                },
                {
                    "factor": "Timing of Announcement Relative to Election Calendar",
                    "effect": "Decreases probability. The 2026 primary is over a year away, so most announcements occur between 12-18 months prior. With only three weeks left for eligibility in this forecast, an imminent announcement would need to leap ahead of standard timelines—suggesting lower likelihood barring a major shift."
                },
                {
                    "factor": "Ron DeSantis’ Political Interests",
                    "effect": "Neutral to Slightly Decreases. While Ron DeSantis references his wife as a strong candidate, his lack of an explicit push or coordinated party moves diminishes the odds of a surprise entrance before July 1."
                },
                {
                    "factor": "Potential for Internal Party Conflict",
                    "effect": "Decreases probability. A major intra-GOP contest between Casey DeSantis and Trump-backed Donalds is not obviously in the party's or Trump's interests, making a late entry less likely barring unexpected developments."
                }
            ],
            "no_scenario": "Casey DeSantis continues to be discussed as a possible candidate in media and among donors, but with Byron Donalds consolidating support (thanks to Trump's endorsement), she does not announce her candidacy prior to July 1, opting either to delay until later in the cycle or not run at all.",
            "yes_scenario": "Amidst a sudden shift in the GOP landscape—such as a damaging scandal for Donalds, unexpected polls or grassroots movement, or a calculated move to reclaim the initiative for the DeSantis family—Casey DeSantis announces her candidacy within the next three weeks to quickly organize a competitive campaign.",
            "final_reasoning": "The overwhelming balance of evidence—historical base rates, the presence and consolidation of a Trump-backed front-runner, the absence of clear signals or coordinated campaign action from the DeSantis camp, and the extremely short time window—makes an announcement from Casey DeSantis highly unlikely before July 1, 2025. While she remains prominent in speculation and has donor interest, all coverage aligns with mere consideration, and no reporting indicates imminent preparations for a launch. The only plausible path to a Yes would be a highly unusual, rapid pivot due to external shocks—which is not reflected in current news or party strategy. Therefore, the base rate and the particular dynamics of the current cycle strongly suggest a No outcome.",
            "final_probability": 7
        },
        "SociologyEliteTheory": {
            "time_to_resolution": "Just over 3 weeks (until July 1, 2025)",
            "perspective_relevance": "As a sociologist specializing in Elite Theory, my forecast employs the lens that political outcomes, especially candidate entry decisions for high office, are best explained not by the stated preferences of individual politicians or voters, but by the strategic calculations and power struggles of elite networks—donors, party power-brokers, aligned media figures, and influential families. In Florida's Republican Party, the ongoing Trump-DeSantis contest for dominance and the ability of elite actors to broker consensus candidates are key forces shaping Casey DeSantis's choices.",
            "status_quo": "Casey DeSantis has not officially announced her candidacy for governor. The race's highest-profile Republican entrant is Byron Donalds, with strong support and an explicit, repeated endorsement from Donald Trump. Ron DeSantis has signaled that his wife is considering a run, but thus far she remains noncommittal, and her candidacy appears to be 'on hold.'",
            "perspective_derived_factors": [
                {
                    "factor": "Elite Coordination and Factional Power Balance",
                    "effect": "Decreases probability—The consolidation of Trump’s endorsement (and donor base) behind Byron Donalds makes it less likely that Casey DeSantis will announce imminently, given the risk of splitting the party and the lack of strong signals that the DeSantis faction is prepared to mount a serious challenge before the July 1st threshold."
                },
                {
                    "factor": "Timing and Political Rationality of Announcement",
                    "effect": "Decreases probability—Elite candidates (especially those with significant family or spousal ties to incumbents) usually time announcements to maximize leverage, minimize intra-party division, and/or wait for opportune moments (e.g., shifts in polling, fundraising crises for rivals, or elite dealmaking). With polls showing Donalds surging and the DeSantis network hampered by recent scandals and muddled succession planning, there is little strategic incentive for Casey DeSantis to declare right now."
                },
                {
                    "factor": "Party and Donor Network Pressure",
                    "effect": "Mixed—Some DeSantis-aligned donors or GOP officials could be pressuring Casey to run, fearing total Trump capture of Florida politics. However, the weight of evidence suggests the majority of GOP donor and elite networks are on hold, hedging, or aligning with Donalds. This pressure may not reach an actionable threshold before July 1st."
                },
                {
                    "factor": "Family Reputation and Dynasty Preservation",
                    "effect": "Slightly increases probability—If the DeSantis family calculates that losing momentum now will make a later run impossible, or if a high-profile negative revelation about Donalds emerges, Casey DeSantis could gamble by announcing early to defend the family’s standing. No news points definitively in this direction."
                }
            ],
            "no_scenario": "Casey DeSantis continues to publicly weigh her options, keeps her name in the discussion via media allies, but does not formally enter the race before July 1, 2025. She and her inner circle watch Byron Donalds solidify his elite and donor network backing (especially with Trump’s support), and wait for either an expected stumble by Donalds or a strategic opening later in 2025. The DeSantis sphere seeks to avoid a damaging primary feud with Trump’s coalition that could weaken her future prospects (including potentially for Senator or a federal post if the national GOP climate shifts).",
            "yes_scenario": "Some major destabilizing event—such as a Trump legal crisis, a damaging scandal for Byron Donalds, sharp donor movement back toward the DeSantis family, or a dramatic change in party elite sentiment—suddenly makes an immediate run by Casey DeSantis the best hope for her faction to maintain relevance. A well-organized rollout, possibly coupled with Ron DeSantis making a major public play or brokering with hesitant GOP donors, leads her to announce her candidacy before July 1, 2025.",
            "final_reasoning": "The overwhelming weight of evidence from current Florida GOP elite behavior, polling, and media analysis is that Byron Donalds, with Trump's active endorsement, is now the center of gravity for Republican elites seeking influence in post-Ron DeSantis Florida. Casey DeSantis, despite her name recognition and spousal connection, faces a political landscape where her own network is weakened and may damage itself by forcing an early confrontation. With little new donor movement, no major polling bounce, and the strong Elite Theory base rate that intra-party family dynastic succession is rare when a dominant outside faction (in this case, Trump's) coalesces around another candidate, it is most rational for Casey DeSantis to 'wait and see.' The next three weeks are too short for the kind of seismic elite realignment that would typically precede such an announcement, making the odds sharply against her declaring. I see at most a slim outside risk—possibly 1 in 10—of an unforeseen elite rupture propelling an early entry, but otherwise, the prevailing incentives all argue for waiting.",
            "final_probability": 10
        },
        "SociologySocialCapitalTheory": {
            "time_to_resolution": "Approximately 25 days until July 1, 2025",
            "perspective_relevance": "As an expert in Social Capital Theory, I analyze how networks of relationships, shared norms, and social trust enable collective political action. In the context of political candidacies, social capital – such as endorsements, grassroots support, elite networks, and public reputation – is a crucial asset informing a candidate's viability and timing to announce or withhold a run. My perspective highlights intra-party trust, elite/establishment signaling, and grassroots mobilization capacity as major determinants shaping Casey DeSantis's decision calculus.",
            "status_quo": "Casey DeSantis has not announced her candidacy for Florida governor. Byron Donalds is the only major Republican to have officially entered the race, with a powerful Trump endorsement and significant early momentum. Casey DeSantis is reportedly considering a run but has made no formal moves, and her husband's political capital is diminished but not eliminated.",
            "perspective_derived_factors": [
                {
                    "factor": "Intra-party Elite Support and Social Trust",
                    "effect": "Decreases probability. With Donalds receiving Trump's explicit endorsement and a subsequent polling surge, Casey faces the risk of fracturing GOP elite consensus and activating antagonistic networks if she launches now."
                },
                {
                    "factor": "DeSantis Family Social Capital (Name Recognition and Donor Network)",
                    "effect": "Increases probability. As First Lady and with Ron DeSantis's robust gubernatorial legacy, Casey benefits from high name recognition and an established donor/activist network potentially eager to retain the family's influence in Florida politics."
                },
                {
                    "factor": "Timing Norms for Florida Gubernatorial Announcements",
                    "effect": "Decreases probability. Base rates indicate that high-profile candidates (including established political families) in Florida typically launch gubernatorial campaigns at least 12-14 months before the primary (set for August 2026). However, the current media and party environment favor waiting, especially given Trump's intervention."
                },
                {
                    "factor": "Effect of Public Endorsements and Polling Momentum",
                    "effect": "Decreases probability. The Trump endorsement of Donalds has altered the opportunity structure. Early polls now favor Donalds, making it strategically unattractive for Casey DeSantis to announce imminently and risk a messy primary."
                },
                {
                    "factor": "Potential for Maintaining or Reinforcing Political Capital Through Delay",
                    "effect": "Decreases probability. With party division risks and primary field volatility, social capital theory suggests it may be optimal for a candidate with significant reserve capital (name recognition, media access, latent donors) to defer entry, waiting for a more opportune or consensus-building moment."
                }
            ],
            "no_scenario": "Casey DeSantis, recognizing Trump’s strong support for Donalds, judges an immediate entry would provoke damaging intra-party conflict and loss of Republican elite social capital. She defers her announcement, perhaps keeping the option alive for a later strategic entry or leveraging her network for another cycle.",
            "yes_scenario": "Casey DeSantis, buoyed by pressure from DeSantis loyalists, donors, and supportive polling among certain GOP blocs, makes a rapid strategic move to seize momentum—announcing in the next three weeks to forestall further consolidation around Donalds and present herself as a consensus, unity, or nostalgia candidate.",
            "final_reasoning": "The balance of social capital within Florida's GOP now favors Byron Donalds, due to a definitive Trump endorsement translating into elite signaling and a quick polling boost. Casey DeSantis’s formidable family name and latent support are counterbalanced by the significant risk of a divisive and premature primary fight. The historical base rate of announcements this far out from the primary is already modest; most declarations fall in late summer to early winter, giving candidates time to organize post-summer fundraising and field operations. The primary is August 2026, so there is ample time for Casey to wait, especially given no urgency from scandal or policy crisis driven by her as First Lady. The social capital calculus thus counsels caution: there is little to gain but much to lose by entering now—absent any new, disruptive developments. I assess a less-than-even (but not negligible) probability that Casey DeSantis will announce in this time window, reflecting her latent strengths but the current unfavorable coalition signals. Probability is set below base rate due to the massing of evidence around Trump's intervention and the lack of counter-move so close to the July 1 deadline.",
            "final_probability": 15
        },
        "AmericanStudiesUsRegionalPoliticalCulture": {
            "time_to_resolution": "Approximately 3 weeks (until July 1, 2025)",
            "perspective_relevance": "As an expert in American Studies with a focus on US regional political culture, I bring an understanding of Florida's unique hyper-partisan political climate, the influence of political dynasties, the power of endorsements in Southern GOP primaries, and the gendered dynamics of political spousal succession in the South. My regional lens also gives attention to intra-party power jockeying and the importance of timing for high-profile candidacies in a state with a competitive primary environment.",
            "status_quo": "Casey DeSantis has NOT announced her candidacy for Florida governor. She is regularly discussed as a potential candidate, but Rep. Byron Donalds (with Trump's endorsement) is the only high-profile Republican officially in the race. The press consistently describes her as 'considering a run,' and not yet an active candidate.",
            "perspective_derived_factors": [
                {
                    "factor": "Timing Norms and Strategic Announcement",
                    "effect": "Decreases probability. In Florida and comparable Southern states, high-profile political figures—especially ones with easy name recognition and a fundraising base—often delay their official announcement to avoid early negative campaigning, conserve resources, and evaluate the opposition. There is little advantage for Casey DeSantis to announce before the July 1, 2025 line, given the primary is more than a year away (August 2026), and Byron Donalds has already solidified the initial front-runner slot. GOP primaries in the South often crystallize after Trump endorsements, not before."
                },
                {
                    "factor": "Competitive Landscape: Trump/Donalds Faction and DeSantis Faction",
                    "effect": "Decreases probability. Trump’s explicit endorsement of Byron Donalds and Donalds’ strong poll numbers suggest that there will be heavy pressure on GOP elites to avoid a bruising primary. The news reveals a significant lead for Donalds over Casey DeSantis among Republican voters (44% to 25% after the Trump endorsement). This both complicates her calculus (potential to lose face with a weak launch) and may lead her to delay or even forego entering the contest."
                },
                {
                    "factor": "Florida Political Culture: Power Families and Gendered Succession",
                    "effect": "Increases probability, somewhat. It is common in Southern regional cultures for political spouses—especially those as popular and visible as Casey DeSantis—to seek and hold high office, leveraging existing networks. There's also speculation that DeSantis' prolonged non-commitment to key appointments (e.g., lieutenant governor) hints he is keeping lanes open for his wife, potentially increasing the probability she could jump in to rally their loyalist base if Donalds stumbles or a new scandal emerges."
                },
                {
                    "factor": "Political Timing and Media Coverage",
                    "effect": "Decreases probability. Multiple articles explicitly state she is 'considering' but not about to announce. There is no indication of an imminent launch, and with the media intensely covering Jolly/Donalds right now, a Casey DeSantis announcement would turn the spotlight on a political split within the DeSantis/Trump axis—a dynamic that, in Southern political culture, is generally avoided until absolutely necessary."
                },
                {
                    "factor": "Unpredictable Events (e.g., Scandal, Sudden Illness, Withdrawal of Donalds)",
                    "effect": "Negligibly increases probability. Should Donalds suddenly implode or drop out, or should DeSantis face a fresh political crisis, it's not impossible Casey could be pressured to announce quickly. However, with only three weeks left, the likelihood is quite low."
                }
            ],
            "no_scenario": "Casey DeSantis continues to test the waters, fundraises discreetly, and waits for the Republican field to clarify post-Q3 fundraising reports, possibly reserving her formal announcement until after the summer or closer to the winter debates. She leverages her name and network without committing, preserving political capital should the Donalds campaign weaken or circumstances change. The July 1 deadline passes without an official announcement.",
            "yes_scenario": "Sensing vulnerability in the Donalds campaign (e.g., sudden misstep, criminal probe, Trump shifts focus), or under pressure from family allies to ensure continuity of the DeSantis brand, Casey accelerates her timeline and launches a formal campaign before July 1, seizing the narrative and hoping to force a party split in the primary. This would be a high-risk gambit, likely signaled by a media blitz and coordinated endorsements.",
            "final_reasoning": "Given Florida's primary is 14 months away, Trump's endorsement has cemented Byron Donalds as the GOP front-runner—a major cultural force in the current regional climate—and all reporting characterizes Casey DeSantis as only 'considering,' with no apparent preparations for an imminent launch. Strategic calculation and Southern state political culture both favor waiting, particularly in a major intra-party showdown. Historical base rates suggest most non-incumbent, high-name-ID candidates in favorable primary environments (especially political spouses) do not announce this early. The only plausible path to a 'Yes' (major Donalds implosion, or orchestrated family/party push) is currently unsupported by any news. Therefore, a 'No' is highly likely.",
            "final_probability": 9
        }
    },
    "deliberation_probability": [
        4,
        5,
        8,
        8,
        12,
        7,
        10,
        15,
        9
    ],
    "deliberation_mean_probability": 8.666666666666666,
    "deliberation_sd": 3.391164991562634,
    "deliberation_probability_result": 9,
    "group_results": {
        "PoliticalConsultingCampaignStrategy": {
            "forecaster_to_engage": "SociologySocialCapitalTheory",
            "response_type": "critique",
            "response": "Setting a 15% probability here is far too generous, and honestly, it overstates both the volatility of Florida GOP social capital and the actual operational landscape. The base rate for a major candidate—especially a gubernatorial spouse with built-in establishment connections—making a late-breaking entry with zero media or donor leak chatter this close to the deadline is vanishingly small. The idea that Casey DeSantis has some meaningful latent social capital that could instantly push her to announce, when all hard evidence (Trump endorsement, rapid poll swing to Donalds, party/donor alliance settling, and universal signaling of 'consideration' not action) points the other way, doesn't hold. Social capital in politics gets converted into action when networks see a plausible opening; right now, everyone's closing ranks behind Trump and Donalds. The odds for a black swan are barely above zero, and suggesting anything close to a 1-in-6 chance feels like wishcasting, not savvy campaign assessment."
        },
        "PoliticalConsultingCandidateEmergenceAnalysis": {
            "forecaster_to_engage": "AmericanStudiesUsRegionalPoliticalCulture",
            "response_type": "defense",
            "response": "This take is dead-on. While it might sound like restating the obvious, the regional political culture in Florida matters enormously here—Trump's dominance as a cultural and political figure, especially in the Sunshine State, leaves almost no oxygen for the DeSantis family to make a clean entrance without looking desperate or divisive. The 'wait and see' approach is totally consistent with Southern/Florida norms when a dynasty's footing wobbles. Most political wives in the South who've sought high office did so with a clear runway, usually after groundwork was visible for months. The only possible disruptor would be an unforeseen crisis or scandal, which is absent in all news. This is a great synthesis of both cultural and tactical realities, and the <10% probability is solid analytical work."
        },
        "FloridaPoliticsExpertiseFloridaPoliticalDynamics": {
            "forecaster_to_engage": "SociologyEliteTheory",
            "response_type": "defense",
            "response": "This is one of the sharper and more grounded takes in the group, and actually gives a clearer view of intra-party succession dynamics than many of the number-crunching approaches. Elite Theory correctly spotlights that the locus of power in Florida's GOP has shifted rapidly and decisively toward Trump-aligned actors, with Donalds now serving as the nexus. The rare cases where dynastic succession occurs at this level always depend on an elite consensus or the backing of a dominant coalition—neither of which is present for Casey DeSantis. Her family's waning leverage, the absence of donor/donor-class signals, and the almost ceremonial 'consideration' talk all reinforce the thesis. This framework cleanly sidesteps the mirage of latent potential and instead hammers home what actually moves the chessboard: coordinated elite shifts, which simply aren't happening. The probability here (10%) captures the tiny chance of a last-minute realignment, but it's sober, not melodramatic. Great use of theory to frame the natural limits of personality-driven speculation."
        },
        "PoliticalScienceRationalChoiceTheory": {
            "forecaster_to_engage": "PoliticalSciencePoliticalAmbitionTheory",
            "response_type": "critique",
            "response": "You’re giving Casey DeSantis way too much credit for strategic agency under Political Ambition Theory—12% presumes a far more unstable environment than exists and overestimates the incentive for a political actor with poor current odds to make a move. The structure of incentives here is obvious: all the classic motivational preconditions (clear path, party backing, favorable polling, donor windfall) are missing, and as acknowledged, DeSantis-world is a party in controlled ambiguity mode, not desperate launch mode. Political ambition isn’t just about wanting the job; it’s about timing it when you can credibly win, and the rational actor—especially with DeSantis’ resources and prominence—knows the downsides of a suicide mission bid. You even note the lack of a ‘compelling reason to enter early’ and the absence of triggering events, which should push the number lower, not leave it hovering at 12%. That’s nearly double the best supported base rate for a late-breaking gubernatorial spouse entry under these circumstances. If we take rational ego-maximization seriously, this is an 8% shot, at most."
        },
        "PoliticalSciencePoliticalAmbitionTheory": {
            "forecaster_to_engage": "PoliticalConsultingCampaignStrategy",
            "response_type": "defense",
            "response": "You're absolutely right to hammer home how minuscule the real odds are here—your 4% is much truer to both recent campaign precedent and what Political Ambition Theory would project for a high-resource, high-profile candidate poised for optional timing. When campaigns break late like this, it's virtually always due to a major, publicly visible shock—not silent, wishful talk about 'latent social capital.' With no leak, no infrastructure mobilizing, and every incentive to preserve flexibility, a near-zero probability is historically and theoretically sound. Your argument that only a true black swan could trigger a last-minute jump fits perfectly with the risk-aversion that guides decisions at this level. If anything, your probability could be the most defensible of the bunch."
        },
        "PoliticalScienceAmericanStatePolitics": {
            "forecaster_to_engage": "PoliticalSciencePoliticalAmbitionTheory",
            "response_type": "critique",
            "response": "You're overplaying the odds for a move here—12% doesn't pass scrutiny given the evidence-base and the classic ambition sequencing you mention. You acknowledge that candidates of Casey DeSantis's stature only leap when all signals line up: party support, polls, donor groundwork, and, crucially, the absence of an entrenched, Trump-backed rival actively consolidating the field. None of that's in play. In fact, the rational game for DeSantis is pure delay—she holds name ID and latent goodwill without risking a humiliating misfire. To score it as a roughly 1-in-8 chance when there are zero leaks, zero staff moves, and every structural factor urging caution, is mathematically unjustified. Most forecasts here put the odds somewhere between 4 and 8%, which lines up with political ambition literature: theoretical ambition does not transform into action unless the landscape is primed. Bringing in the rare base rate of successful late-game announcements puts your number on the high side—tighten up!"
        },
        "SociologyEliteTheory": {
            "forecaster_to_engage": "PoliticalScienceRationalChoiceTheory",
            "response_type": "defense",
            "response": "This is finally a forecast that understands the hard incentives underpinning elite action. Rational Choice Theory, applied here, does what too few others have: treats Casey DeSantis not as an emotionally-driven actor but as a calculating political entrepreneur who knows when she's outgunned—especially when the dominant coalition (Trump + donors) is lined up behind Donalds. The note on time horizons and preference for optionality is spot on: why announce now, only to eat a costly loss, when waiting preserves flexibility and could be parlayed into another office or window later? You’re correct to focus on the lack of compelling external shocks and the overwhelming evidence that her best move is inaction. Your prediction (8%) is parsimonious, logical, and fully defensible in light of both empirical precedent and the structural realities of the GOP contest."
        },
        "SociologySocialCapitalTheory": {
            "forecaster_to_engage": "PoliticalConsultingCandidateEmergenceAnalysis",
            "response_type": "critique",
            "response": "You're hitting the right base rates and facts, but your argument ignores the critical role of latent social networks—especially in a state like Florida, with deeply nested political donor and media ecosystems. While I agree the absence of visible leaks or event planning signals a low probability, you underplay how elite actors sometimes conceal mobilization until the last moments, particularly in high-stakes, dynastic battles (think Jeb Bush's last-minute maneuvers). The DeSantis network's existing reach could, theoretically, enable a rapid turn if an unexpected scandal hit Donalds. 5% is fine, but it's prudent to allow for more contingency planning capacity than pure ‘base rate and surface signals’ analysis indicates. Undervaluing the informal, pre-announcement coalition-building that can erupt into formal candidacy misses a crucial lever—social capital often only materializes after a triggering event, not before."
        },
        "AmericanStudiesUsRegionalPoliticalCulture": {
            "forecaster_to_engage": "FloridaPoliticsExpertiseFloridaPoliticalDynamics",
            "response_type": "defense",
            "response": "Your perspective is entirely on point and arguably the most attuned to the realpolitik and pace of Florida’s internal party machinations. You cut through the surface noise and address the nuts-and-bolts that actually drive candidate emergence here: the machinery of campaign building, the donor network signals, and the consequences of Trump's pre-emptive endorsement. Highlighting the lack of FEC filings, staffing moves, or even DeSantis-camp trial balloons demonstrates a granular knowledge of how modern campaigns roll out, and why a high-profile candidate can't summon a competitive effort overnight in this environment. The way you frame the 'last-minute counterstrike' scenario as outlandishly rare—without any visible setup—is exactly right for Florida. In this landscape, if you're not mobilizing by now, you're waiting on purpose, and there's no tactical reason for her to move early. Your probability and reasoning fit both the unique regional tempo and the generalizable pattern of GOP succession politics."
        }
    },
    "revision_results": {
        "PoliticalConsultingCampaignStrategy": {
            "my_phase1_final_probability": 4,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, especially the SocialCapitalTheory forecaster's argument for a higher probability, I remain convinced that the odds of a Casey DeSantis announcement before July 1, 2025, are extremely low. My critique highlighted the implausibility of a major late entry without any hard signals, given the locked-in advantages for Donalds and Trump and the historically low base rate for such last-minute decisions among highly networked, high-profile candidates. No new information from the group challenged my campaign strategy-based logic or identified credible precursors for a late-breaking announcement. If anything, the moderate inflation in other forecasts underscores the low anchor of realistic, evidence-based campaign assessment. I therefore see no reason to move my estimate.",
            "revised_probability": 4
        },
        "PoliticalConsultingCandidateEmergenceAnalysis": {
            "my_phase1_final_probability": 5,
            "reasoning_for_revised_probability": "After reviewing the full slate of peer forecasts and my own critique of SociologySocialCapitalTheory, I am even more confident that my initial estimate closely aligns with the base rate and observable facts. With the exception of one outlier, all other experts converged on extremely low single-digit to low-teens probabilities, and their reasoning consistently cited the decisive effect of Trump's endorsement, polling trends, the absence of campaign infrastructure or imminent announcement buzz, and historical precedent. My critique of higher probability models stands: there is simply no evidence to justify a move above 5%—no late breaking social capital or elite shift is visible, and the collective wisdom of the field points sharply to 'No.' Therefore, I see no reason to revise upward or downward; if anything, my confidence in the low estimate is reinforced.",
            "revised_probability": 5
        },
        "FloridaPoliticsExpertiseFloridaPoliticalDynamics": {
            "my_phase1_final_probability": 8,
            "reasoning_for_revised_probability": "After reviewing group deliberation, the consensus remains overwhelmingly bearish on a Casey DeSantis pre-July 1 announcement, and, if anything, my own 8% looks generous rather than understated. Virtually all forecasters, using theoretical, historical, and campaign strategy lenses, find base rates for such a last-minute high-profile campaign launch to be extremely low barring a major black swan or destabilizing event, which is not evident from the current news cycle. Notably, critiques highlighted that overestimating latent 'social capital' or potential for elite realignment ignores the hard evidence of network consolidation behind Donalds. The theoretical defense of Elite Theory further crystallized that only a sweeping and presently unobservable rupture among state GOP elites could plausibly bring about an announcement. All reporting and campaign signals consistently indicate no preparatory movement from the DeSantis side. Therefore, the collective argumentation and a reconfirmation of base rates support a marginal downward adjustment to reflect the exceedingly low plausibility of a 'Yes' outcome.",
            "revised_probability": 5
        },
        "PoliticalScienceRationalChoiceTheory": {
            "my_phase1_final_probability": 8,
            "reasoning_for_revised_probability": "After reviewing group deliberations, the consensus across expert frameworks—ranging from campaign strategy to Elite Theory to regional political culture—clearly reinforces my original rational choice analysis: the structural, incentive-based, and network factors are all stacked against Casey DeSantis announcing before July 1, 2025. Notably, the stronger arguments in the group skew even lower than my initial 8%, with persuasive critiques given for probabilities above 10% being wishful or disconnected from signals. There is essentially universal agreement: the Trump/Donalds consolidation, lack of visible campaign or donor movement, and absence of a destabilizing external event make a pre-deadline announcement extremely unlikely. If anything, my estimate could be nudged slightly downward, but the difference is not practically significant—there’s no new evidence favoring a higher probability. I will keep my forecast unchanged at 8%, reflecting both base rate rigor and reinforced collective judgment.",
            "revised_probability": 8
        },
        "PoliticalSciencePoliticalAmbitionTheory": {
            "my_phase1_final_probability": 12,
            "reasoning_for_revised_probability": "Group deliberation revealed that nearly all domain experts, across campaign strategy, candidate emergence, state politics, and multiple sociological theories, assign even lower probabilities than my original 12%, typically between 4% and 10%. The core arguments—lack of campaign infrastructure leaks, Trump's consolidation, the clear rational-choice disincentive for an early, disadvantageous announcement, the historical absence of late-breaking high-profile spousal entries, and the complete lack of elite or donor movement toward Casey DeSantis—were emphasized repeatedly and persuasively. Critiques specifically noted that my original estimate gives too much weight to strategic 'optionality' and the mere theoretical chance of a black swan, rather than the demonstrated (and extremely stable) party environment. I am therefore reducing to 7%, better aligning with both base rate rigor and the overwhelming present evidence.",
            "revised_probability": 7
        },
        "PoliticalScienceAmericanStatePolitics": {
            "my_phase1_final_probability": 7,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, which emphasized the consensus on historical base rates, the decisive effect of Trump's endorsement, and the total lack of campaign signals for a Casey DeSantis candidacy prior to July 1, I see no compelling evidence to increase the probability. In fact, the best arguments—especially from campaign strategy and rational choice perspectives—favor going slightly lower than 7%. Other forecasters reinforced that action this late in the cycle is vanishingly rare barring an extreme black swan, with suggested estimates mostly clustered lower than my initial forecast, some even as low as 4-5%. Given this, I will revise downward modestly to align with the lowest defensible analytical range, recognizing both the strong negative base rate and the utter lack of movement in state or donor networks. The probability now reflects a near-zero chance unless a highly improbable political shock intervenes.",
            "revised_probability": 5
        },
        "SociologyEliteTheory": {
            "my_phase1_final_probability": 10,
            "reasoning_for_revised_probability": "Reviewing the group deliberation, most expert forecasters (cutting across campaign strategy, local expertise, and theory) converge on an even lower probability than my initial 10%. The strongest arguments repeatedly emphasized: (1) The base rate for a high-profile political spouse entering so late with no evidence of sudden campaign-building is extremely low—historically closer to 4-8%. (2) True campaign launches are always presaged by leaks, staffing, fundraising moves, and visible elite jockeying—which are all absent. (3) Even the most plausible case for a last-minute dynastic move requires a split among elites or an emergent crisis among rivals, none of which are present. The critiques of higher estimates (12-15%) were persuasive, reinforcing that optimism for a black swan is closer to wishcasting than evidence-based prognosis. As a result, and acknowledging the greater consensus around the 5-8% band, I will revise my forecast slightly downward.",
            "revised_probability": 7
        },
        "SociologySocialCapitalTheory": {
            "my_phase1_final_probability": 15,
            "reasoning_for_revised_probability": "After reviewing strong arguments from other forecasters, particularly those rooted in campaign precedent, elite theory, and rational choice analysis, my initial estimate at 15% appears overly generous. The consensus is overwhelming: there are no signals, leaks, or emergent crises creating space for Casey DeSantis to credibly leap into the race this close to the deadline. Arguments that latent social capital might enable a rapid launch are outweighed by historical base rates, party consolidation around Donalds and Trump, and the absence of campaign infrastructure-building or donor mobilization for Casey DeSantis. My own critique of too-low estimates stressed contingency planning, but the empirical record and incentive structure simply counsel further caution. A revised estimate slightly above the modal group consensus but significantly lower than my original, reflecting only a slim 'black swan' possibility, is appropriate.",
            "revised_probability": 7
        },
        "AmericanStudiesUsRegionalPoliticalCulture": {
            "my_phase1_final_probability": 9,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, the overall consensus supports a very low probability—generally between 4 and 10 percent—with clear, consistent arguments emphasizing the lack of campaign groundwork, donor movement, or actionable scandal that could catalyze a Casey DeSantis announcement within the short time frame. The pushback against the highest probabilities in the group (notably the 12-15% range) is persuasive: base rates, Florida’s specific primary dynamics, and Trump’s centralizing influence make a late-breaking entry all but inconceivable. The best arguments for a slightly higher probability point to latent social capital and the possibility of rapid mobilization, but these are deeply contingent on events for which there is currently no evidence. Given all this, and the extreme alignment of real-world signals against an imminent announcement, my already-low probability remains appropriate. I see no justification, even with some more generous group input, for raising the figure. If anything, there’s a case for a marginal decrease, but to remain within the plausible range and given the value of rounding to a realistic estimate, I will hold at 9%.",
            "revised_probability": 9
        }
    },
    "revision_probability": [
        4,
        5,
        5,
        8,
        7,
        5,
        7,
        7,
        9
    ],
    "revision_mean_probability": 6.333333333333333,
    "revision_sd": 1.6583123951777,
    "revision_probability_result": 6,
    "question_details": {
        "id": 37611,
        "title": "Will Casey DeSantis announce her candidacy for Florida governor before July 1, 2025?",
        "description": "[Poll: Trump's endorsement boosts Byron Donalds over Casey DeSantis for Florida governor](https://www.tallahassee.com/story/news/local/state/2025/05/09/poll-byron-donalds-surges-past-casey-desantis-with-trump-backing/83412367007/)",
        "created_at": "2025-05-31T04:11:49.754335Z",
        "open_time": "2025-06-05T22:00:00Z",
        "cp_reveal_time": "2025-06-06T00:00:00Z",
        "spot_scoring_time": "2025-06-06T00:00:00Z",
        "scheduled_resolve_time": "2025-07-01T00:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-06-06T00:00:00Z",
        "actual_close_time": "2025-06-06T00:00:00Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 0.9,
        "resolution_criteria": "This question resolves as **Yes** if Casey DeSantis announces her candidacy for governor of Florida before July 1, 2025. If no such announcement has been made before that date, the question resolves as **No**.",
        "fine_print": "",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_max": null,
            "range_min": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "post_id": 38335,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {}
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {}
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {}
            }
        },
        "nr_forecasters": 73,
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Former U.S. Rep. David Jolly announces run for Florida governor**\nFormer U.S. Rep. David Jolly announced his candidacy for the Democratic nomination for Florida governor, citing the state's affordability crisis as a major issue. Jolly stated, 'We have an affordability crisis in Florida driven by an insurance crisis that continues to worsen in the face of complete neglect by Tallahassee. We have abandoned public education, and we've allowed corruption to run rampant. It's time for a change.' Despite the long odds, Jolly will face competition from other candidates, including Southwest Florida Congressman Byron Donalds, who has already launched his campaign for the GOP nomination, and Florida First Lady Casey DeSantis, who is considering a run. Florida's primary election is scheduled for August 18, 2026, with the general election on November 3, 2026.\nOriginal language: en\nPublish date: June 05, 2025 03:16 PM\nSource:[https://www.wcjb.com](https://www.wcjb.com/2025/06/05/former-us-rep-david-jolly-announces-run-florida-governor/)\n\n**'Radical Leftist': Byron Donalds Laughs Off Never Trumper Ex-GOP Rep Running For FL Gov As Dem**\nFormer Republican Rep. David Jolly announced his candidacy for the 2026 Florida gubernatorial race as a Democrat. Jolly, a longtime critic of President Donald Trump and Florida Gov. Ron DeSantis, stated that Florida is in crisis and needs a change. Florida Republican Rep. Byron Donalds, the Trump-endorsed frontrunner, referred to Jolly as 'an anti-Trump, radical leftist' and said he is 'completely out of touch with Florida's voters and our values.' Donalds added that he will fight side by side with Trump to protect Florida families and Make America Great Again. The Florida Republican Party also criticized Jolly, calling him a 'flip-flopping political relic' and stating that Floridians won't be swayed by his candidacy.\nOriginal language: en\nPublish date: June 05, 2025 03:01 PM\nSource:[IJR](https://ijr.com/radical-leftist-byron-donalds-laughs-off-never-trumper-ex-gop-rep-running-for-fl-gov-as-dem/)\n\n**'Radical Leftist': Byron Donalds Brushes Off Never Trumper Ex-GOP Rep Running For FL Gov As Dem**\nFormer Republican Florida Rep. David Jolly announced his candidacy for the state's 2026 gubernatorial race as a Democrat. Jolly, a longtime critic of President Donald Trump and Republican Florida Gov. Ron DeSantis, stated that Florida is 'in crisis -- not just a crisis of policy, not right versus left, but a crisis of right versus wrong.' Florida Republican Rep. Byron Donalds, the Trump-endorsed frontrunner, referred to Jolly as 'an anti-Trump, radical leftist' and claimed that he is 'completely out of touch with Florida's voters and our values.' Donalds added that he will 'fight side by side with President Trump to protect Florida families and Make America Great Again.' The Florida Republican Party also criticized Jolly, calling him a 'flip-flopping political relic' and stating that he has 'no platform, no base, and no chance in Florida.'\nOriginal language: en\nPublish date: June 05, 2025 02:57 PM\nSource:[The Daily Caller](https://dailycaller.com/2025/06/05/david-jolly-runs-governor-florida-democrat/)\n\n**David Jolly, a Trump critic and former GOP congressman, to run for Florida governor as a Democrat - Times of India**\nDavid Jolly, a former Republican congressman and vocal critic of Donald Trump, has announced his bid to run for Florida governor as a Democrat. Jolly, who has been a vocal advocate for issues such as affordability, public education, and campaign finance reform, believes that these issues will resonate with voters in 2026. He predicts that the elections next year will herald nationwide change. Jolly, who has built a national profile as an anti-Trump commentator on MSNBC, has undergone a political evolution, leaving the Republican Party in 2018 to become an independent and then a registered Democrat. He stated, 'I think enough people in Florida, even some Republicans, now understand that the culture wars have gone too far.' Jolly will face Trump-backed Rep. Byron Donalds in the Republican primary, as well as other potential candidates such as former Rep. Matt Gaetz and Casey DeSantis.\nOriginal language: en\nPublish date: June 05, 2025 08:40 AM\nSource:[The Times of India](https://timesofindia.indiatimes.com/world/us/david-jolly-a-trump-critic-and-former-gop-congressman-to-run-for-florida-governor-as-a-democrat/articleshow/121644165.cms)\n\n**Inside Ron DeSantis' tough year in Florida**\nFlorida Governor Ron DeSantis is facing a tough year in office, with his popularity waning among some Republicans and his future prospects uncertain. According to a longtime top Florida Republican operative, DeSantis is 'flailing' and 'alienating even the people he thinks are his friends.' DeSantis has declined to endorse Rep. Byron Donalds for governor, and his wife Casey has been mulling her own gubernatorial run. The DeSantises have also been playing defense after the House probed a foundation linked to Hope Florida, an initiative launched by the first lady to help steer people away from government welfare programs. DeSantis remains popular among Republican voters in the state, but his own political prospects beyond 2026 are murky. He has not yet moved on several key appointments, including the lieutenant governor position, which is being closely watched to see whether he installs a placeholder or someone with ambitions to run in 2026.\nOriginal language: en\nPublish date: June 04, 2025 06:58 AM\nSource:[POLITICO](https://www.politico.com/news/2025/06/04/ron-desantis-florida-state-politics-00382476)\n\n**Former GOP congressman David Jolly running for governor in Florida as Democrat**\nFormer Republican congressman David Jolly is running for governor in Florida as a Democrat. Jolly, a vocal critic of Donald Trump, believes that issues such as affordability, funding public schools, and strengthening campaign finance and ethics laws will resonate with all voters in 2026. He predicts that elections next year will herald nationwide change. Jolly said, 'I actually think Republicans in Tallahassee have gone too far in dividing us. I think we should get politicians out of the classrooms, out of the doctor's offices.' He added, 'I think enough people in Florida, even some Republicans, now understand that. That the culture wars have gone too far.' Jolly has undergone a political evolution, leaving the Republican Party in 2018 to become an independent and then a registered Democrat. He has built a national profile as an anti-Trump political commentator on MSNBC. Jolly will face Trump-backed Republican U.S. Rep. Byron Donalds in the gubernatorial election.\nOriginal language: en\nPublish date: June 05, 2025 06:29 PM\nSource:[PBS.org](https://www.pbs.org/newshour/politics/former-gop-congressman-david-jolly-running-for-governor-in-florida-as-democrat)\n\n**Fmr. Republican never-Trumper taking on Florida gubernatorial run as a Democrat - good luck with that buddy**\nDavid Jolly, a former Florida Republican and outspoken Trump critic, has announced his bid for governor as a Democrat. Jolly, who represented Florida's 13th district from 2014 to 2017, stated, 'Let's end the politics of division and return Florida to voters who simply want an economy that works, the best education system in the world, safe communities, and a government that stays out of their doctors' offices and family decisions.' Jolly faces an uphill battle in the Sunshine State, which went for President Trump by 13 points in the last election. His biggest contender is Republican Rep. Byron Donalds, who has earned Trump's endorsement. Donalds responded to Jolly's announcement, saying, 'He's completely out of touch with Florida's voters and our values. Florida is Trump Country, and I am proudly endorsed by President Trump to be Florida's next Governor.'\nOriginal language: en\nPublish date: June 05, 2025 04:12 PM\nSource:[Conservative News Today](https://www.bizpacreview.com/2025/06/05/fmr-republican-never-trumper-taking-on-florida-gubernatorial-run-as-a-democrat-good-luck-with-that-buddy-1549110/)\n\n**Former U.S. Rep. David Jolly announces run for Florida governor**\nFormer U.S. Rep. David Jolly announced his candidacy for the Democratic nomination for Florida governor, citing the state's affordability crisis as a major issue. Jolly stated, 'We have an affordability crisis in Florida driven by an insurance crisis that continues to worsen in the face of complete neglect by Tallahassee. We have abandoned public education, and we've allowed corruption to run rampant. It's time for a change.' Despite the long odds, Jolly will face competition from other candidates, including Southwest Florida Congressman Byron Donalds, who has already launched his campaign for the GOP nomination, and Florida First Lady Casey DeSantis, who is considering a run. Florida's primary election is scheduled for August 18, 2026, with the general election on November 3, 2026.\nOriginal language: en\nPublish date: June 05, 2025 03:16 PM\nSource:[https://www.wcjb.com](https://www.wcjb.com/2025/06/05/former-us-rep-david-jolly-announces-run-florida-governor/)\n\n**'Radical Leftist': Byron Donalds Laughs Off Never Trumper Ex-GOP Rep Running For FL Gov As Dem**\nFormer Republican Rep. David Jolly announced his candidacy for the 2026 Florida gubernatorial race as a Democrat. Jolly, a longtime critic of President Donald Trump and Florida Gov. Ron DeSantis, stated that Florida is in crisis and needs a change. Florida Republican Rep. Byron Donalds, the Trump-endorsed frontrunner, referred to Jolly as 'an anti-Trump, radical leftist' and said he is 'completely out of touch with Florida's voters and our values.' Donalds added that he will fight side by side with Trump to protect Florida families and Make America Great Again. The Florida Republican Party also criticized Jolly, calling him a 'flip-flopping political relic' and stating that Floridians won't be swayed by his candidacy.\nOriginal language: en\nPublish date: June 05, 2025 03:01 PM\nSource:[IJR](https://ijr.com/radical-leftist-byron-donalds-laughs-off-never-trumper-ex-gop-rep-running-for-fl-gov-as-dem/)\n\n**'Radical Leftist': Byron Donalds Brushes Off Never Trumper Ex-GOP Rep Running For FL Gov As Dem**\nFormer Republican Florida Rep. David Jolly announced his candidacy for the state's 2026 gubernatorial race as a Democrat. Jolly, a longtime critic of President Donald Trump and Republican Florida Gov. Ron DeSantis, stated that Florida is 'in crisis -- not just a crisis of policy, not right versus left, but a crisis of right versus wrong.' Florida Republican Rep. Byron Donalds, the Trump-endorsed frontrunner, referred to Jolly as 'an anti-Trump, radical leftist' and claimed that he is 'completely out of touch with Florida's voters and our values.' Donalds added that he will 'fight side by side with President Trump to protect Florida families and Make America Great Again.' The Florida Republican Party also criticized Jolly, calling him a 'flip-flopping political relic' and stating that he has 'no platform, no base, and no chance in Florida.'\nOriginal language: en\nPublish date: June 05, 2025 02:57 PM\nSource:[The Daily Caller](https://dailycaller.com/2025/06/05/david-jolly-runs-governor-florida-democrat/)\n\n**Converted Democrat David Jolly launched bid for Florida governor**\nFormer congressman David Jolly has launched his bid for Florida governor, promising to end the politics of division and return Florida to voters who want a functional economy, top-notch education, safe communities, and a government that respects personal freedoms. Jolly's campaign centers around expanding Medicaid, relaxing strict immigration policies, tackling the affordability crisis, increasing education investments, and rolling back what he sees as intolerant Republican policies. He faces a difficult path ahead, as Florida has swung solidly red in recent years, and a potentially crowded field of Republican and Democratic candidates, including Rep. Byron Donalds and Casey DeSantis. Jolly believes he can win by winning over independent voters and disillusioned Republicans, saying, 'There are not enough Democratic votes to win the governorship... We need a campaign, a candidate, and a party that can win hearts and minds back... And that's our job.'\nOriginal language: en\nPublish date: June 05, 2025 02:20 PM\nSource:[Washington Examiner](https://www.washingtonexaminer.com/news/campaigns/state/3432187/converted-democrat-david-jolly-bid-florida-governor/)\n\n**David Jolly, a Trump critic and former GOP congressman, to run for Florida governor as a Democrat - Times of India**\nDavid Jolly, a former Republican congressman and vocal critic of Donald Trump, has announced his bid to run for Florida governor as a Democrat. Jolly, who has been a vocal advocate for issues such as affordability, public education, and campaign finance reform, believes that these issues will resonate with voters in 2026. He predicts that the elections next year will herald nationwide change. Jolly, who has built a national profile as an anti-Trump commentator on MSNBC, has undergone a political evolution, leaving the Republican Party in 2018 to become an independent and then a registered Democrat. He stated, 'I think enough people in Florida, even some Republicans, now understand that the culture wars have gone too far.' Jolly will face Trump-backed Rep. Byron Donalds in the Republican primary, as well as other potential candidates such as former Rep. Matt Gaetz and Casey DeSantis.\nOriginal language: en\nPublish date: June 05, 2025 08:40 AM\nSource:[The Times of India](https://timesofindia.indiatimes.com/world/us/david-jolly-a-trump-critic-and-former-gop-congressman-to-run-for-florida-governor-as-a-democrat/articleshow/121644165.cms)\n\n**David Jolly, a Trump critic and former GOP congressman, to run for...**\nDavid Jolly, a former Republican congressman and vocal critic of Donald Trump, has announced his bid to run for governor in Florida as a Democrat. Jolly, who has been a vocal critic of Trump's policies, believes that issues such as affordability, funding public schools, and strengthening campaign finance and ethics laws will resonate with all voters in 2026. He predicts that the elections next year will herald nationwide change. Jolly, who was first elected to his Tampa Bay-area congressional seat in 2014, has undergone a political evolution, leaving the Republican Party in 2018 to become an independent and then a registered Democrat. He has built a national profile as an anti-Trump political commentator on MSNBC. Jolly has broken from his old party on immigration, and has criticized Republicans who have 'conflated immigration and crime,' which he described as wrong and immoral. He will face Trump-backed Rep. Byron Donalds in the Republican primary, as well as other potential candidates such as former Rep. Matt Gaetz and Casey DeSantis.\nOriginal language: en\nPublish date: June 05, 2025 08:14 AM\nSource:[Daily Mail Online](https://www.dailymail.co.uk/wires/ap/article-14782909/David-Jolly-Trump-critic-former-GOP-congressman-run-Florida-governor-Democrat.html)\n\n**Former Congressman David Jolly is running for Florida governor**\nFormer Republican Congressman David Jolly, now a registered Democrat, has announced his bid for Florida governor in 2026. Jolly cited economic concerns, including rising property insurance and utility rates, as key motivators for entering the race. He believes there is a viable path for a Democrat to win statewide, despite the Republican Party's massive voter advantage. Jolly, a vocal Trump critic, says his decision to align with the Florida Democratic Party is a continuation of his 'political evolution.' He plans to visit with traditional Democratic supporters as well as groups he says have 'been ignored' by statewide Dems, including churchgoers and gun owners. Jolly pushed back on comparisons to former Republican Gov. Charlie Crist, saying 'I have become a Democrat out of conviction,' and 'I've changed. I've grown.' He enters the race as the highest profile Democrat to throw their hat in the ring, with Congressman Byron Donalds already running on the Republican side with the backing of President Donald Trump.\nOriginal language: en\nPublish date: June 05, 2025 08:00 AM\nSource:[WTSP 10](https://www.wtsp.com/article/news/politics/david-jolly-running-florida-governor/67-fe87050c-fde3-4f88-b4a0-c264ed4f4a48)\n\n**Inside Ron DeSantis' tough year in Florida**\nFlorida Governor Ron DeSantis is facing a tough year in office, with his popularity waning among some Republicans and his future prospects uncertain. According to a longtime top Florida Republican operative, DeSantis is 'flailing' and 'alienating even the people he thinks are his friends.' DeSantis has declined to endorse Rep. Byron Donalds for governor, and his wife Casey has been mulling her own gubernatorial run. The DeSantises have also been playing defense after the House probed a foundation linked to Hope Florida, an initiative launched by the first lady to help steer people away from government welfare programs. DeSantis remains popular among Republican voters in the state, but his own political prospects beyond 2026 are murky. He has not yet moved on several key appointments, including the lieutenant governor position, which is being closely watched to see whether he installs a placeholder or someone with ambitions to run in 2026.\nOriginal language: en\nPublish date: June 04, 2025 06:58 AM\nSource:[POLITICO](https://www.politico.com/news/2025/06/04/ron-desantis-florida-state-politics-00382476)\n\n**Florida Gubernatorial Election: Byron Donalds and Casey DeSantis Emerge as Front-Runners**\nAs Florida prepares for the 2026 gubernatorial election, several Republican candidates are emerging to succeed current Governor Ron DeSantis. Recent polls show a close race between Byron Donalds and Casey DeSantis. Byron Donalds, a 46-year-old congressman from Naples, Florida, has confirmed his candidacy and has the support of former President Donald Trump, who sees him as a strong candidate. Matt Gaetz, a former congressman, has also expressed interest in running, citing his 'convinced vision' for the state and his focus on consumer protection. Casey DeSantis, the wife of Ron DeSantis, is also a potential candidate, with some polls showing her as a favorite to win the Republican primary. According to a recent poll, Donalds leads DeSantis 44% to 25% among Republican voters, with Trump's endorsement giving him a significant boost. In a hypothetical matchup against Democratic candidate Daniella Levine Cava, Donalds and Casey DeSantis both lead by four points.\nOriginal language: es\nPublish date: May 29, 2025 09:59 PM\nSource:[La Nacion](https://www.lanacion.com.ar/estados-unidos/florida/adios-ron-desantis-quienes-serian-los-candidatos-que-aspiran-al-cargo-de-gobernador-nid29052025/)\n\n**Trump backed Donalds on his run to succeed DeSantis as Florida governor: 'This thing is going to take off'**\nRepublican Rep. Byron Donalds has announced his candidacy for Florida governor in 2026, with the endorsement of former President Donald Trump. Donalds, a conservative lawmaker, has been a staunch supporter of Trump and has represented Florida's 19th Congressional District for four years. He has pledged to 'take this to every part of Florida' and to make the state the 'financial capital of the world.' Donalds has also emphasized the importance of consistency and has criticized the current governor, Ron DeSantis, for lacking it. DeSantis' wife, Casey, has also announced her consideration of a run for governor, but Donalds has expressed confidence in his ability to win the election. The next campaign cash filing deadline in the Florida governor's race comes at midnight Monday, and a source predicts that Donalds will 'easily eclipse' the $1 million DeSantis raised in his first month as a gubernatorial candidate in his successful 2018 campaign.\nOriginal language: en\nPublish date: March 28, 2025 11:21 PM\nSource:[Yahoo](https://www.yahoo.com/news/trump-backed-donalds-run-succeed-232149989.html)\n\n**Trump ally Donalds on president's endorsement in Florida governor race:  'it's a great thing to have'**\nRepublican Rep. Byron Donalds, a close ally of President Donald Trump, announced his candidacy for Florida governor in 2026. Donalds, who has represented Florida's 19th Congressional District for four years, is the only major Republican to date to enter the race. He emphasized the importance of Trump's endorsement, saying 'having his endorsement, it's a great thing to have, I'm glad I have it.' Donalds predicted that his campaign will 'take off' and that he will 'easily eclipse' the $1 million raised by Gov. Ron DeSantis in his first month as a gubernatorial candidate in 2018. However, Casey DeSantis, the governor's wife, is also considering a run for governor, and Donalds acknowledged that 'races take on a shape of their own, so we'll see what actually happens.' The next campaign cash filing deadline in the Florida governor's race comes at midnight Monday.\nOriginal language: en\nPublish date: March 28, 2025 11:21 PM\nSource:[Fox News](https://www.foxnews.com/politics/trump-ally-donalds-presidents-endorsement-florida-governor-race-its-great-thing-have)\n\n**Trump backed Donalds on his run to succeed DeSantis as Florida governor: ‘This thing is going to take off’**\nRep. Byron Donalds, a Republican from Florida, has announced his candidacy for the 2026 Florida gubernatorial election. Donalds, who is currently the only major Republican to enter the race, has received the backing of former President Donald Trump. In an interview with Fox News Digital, Donalds predicted that his campaign 'is going to take off' and that he will 'take this to every part of Florida.' He also highlighted his vision for the state, including making Florida the 'financial capital of the world' and improving public education. Casey DeSantis, the wife of current Governor Ron DeSantis, has also been mentioned as a potential candidate, but has not yet made a decision. Donalds expressed confidence in his ability to win the election, saying 'I have a vision for their future and I think that when they hear it, they’re going to choose me.' The next campaign cash filing deadline in the Florida governor's race comes at midnight Monday, and a source in Donalds' orbit predicted that he will 'easily eclipse' the $1 million DeSantis raised in his first month as a gubernatorial candidate in his successful 2018 campaign.\nOriginal language: en\nPublish date: March 28, 2025 11:21 PM\nSource:[yahoo.com](https://www.yahoo.com/news/trump-backed-donalds-run-succeed-232149989.html)\n\n**'Show of force': Trump ally kicking off campaign in race to succeed Florida Gov DeSantis**\nRep. Byron Donalds, a staunch supporter of President Donald Trump, has formally launched his campaign for Florida governor. Donalds, who is currently the only major Republican to jump into the 2026 race to succeed term-limited GOP Gov. Ron DeSantis, has received the president's endorsement and has recorded videos for his campaign kick-off from Donald Trump Jr. and Charlie Kirk. Casey DeSantis, the governor's wife, has acknowledged she is considering a 2026 gubernatorial run to succeed her husband in Tallahassee. 'I think what you'll see is a show of force and I think the support and the momentum that Bryon is generating across the state, whether it's fundraising or grassroots support, will be evident,' said Stephen Lawson, a veteran Republican strategist. An internal poll conducted for Donalds' campaign indicated the congressman edging Casey DeSantis by single digits in a hypothetical GOP primary showdown, but his lead surged to more than 20 points when respondents were informed that he is supported by Trump.\nOriginal language: en\nPublish date: March 28, 2025 12:00 PM\nSource:[Fox News](https://www.foxnews.com/politics/show-force-trump-ally-kicking-off-campaign-race-succeed-florida-gov-desantis)\n\n**Byron Donalds points to Trump endorsement while addressing Casey DeSantis rivaling campaign rumors**\nRep. Byron Donalds, R-Fla., has announced his plans to run for Florida governor in 2026, citing his support from President Trump. Donalds stated, 'I'm really honored to have the same support from President Trump. He has a history of making good picks, and I think his picks have always worked out for the Sunshine State.' This comes after rumors that First Lady Casey DeSantis could challenge Donalds in the gubernatorial election. Donalds emphasized that he will remain 'focused on Floridians' and will address primary challengers once they have officially entered the race. He added, 'We're going to be focused on the ideas to move our state to the next level.' \nOriginal language: en\nPublish date: March 02, 2025 08:06 PM\nSource:[Fox News](https://www.foxnews.com/media/byron-donalds-points-trump-endorsement-addressing-casey-desantis-rivaling-campaign-rumors)\n\n**Byron Donalds Launches Gubernatorial Bid with Trump's Endorsement, Raising Tensions with DeSantis**\nRepublican congressman Byron Donalds has officially announced his candidacy for governor of Florida in 2026, with the endorsement of former President Donald Trump. This move intensifies the competition for control of the Republican Party in the state. Donalds, 46, has been a representative of Florida's 19th district since 2020 and has aligned himself with Trump's agenda. 'I've been on the front lines of these conservative battles and I'm ready to take Florida to the next level,' he said. Trump praised Donalds on Truth Social, calling him 'a proven leader and a total winner.' However, the absence of an official endorsement from Governor Ron DeSantis, who will be leaving office in January 2027, adds uncertainty to the landscape. DeSantis has hinted that his wife, Casey, could be a strong candidate, saying 'she would be a great governor. She has conservative fiber and has been with me on every achievement.' This move is seen as an attempt by DeSantis to maintain influence in the state party after his failed presidential bid in 2024. Donalds has been endorsed by Trump, but DeSantis has downplayed his qualifications, saying 'he didn't participate in our conservative victories.' This move highlights the rift between the DeSantis and Trump factions within the Republican Party. Casey DeSantis is now being considered as a serious contender, with some donors reportedly encouraging her to run during a meeting in Palm Beach in early 2025.\nOriginal language: es\nPublish date: February 26, 2025 06:17 PM\nSource:[evtv.online](https://evtv.online/actualizados/congresista-byron-donalds-lanza-su-candidatura-a-la-gobernacion-de-florida-con-el-respaldo-de-trump/)\n\n**Byron Donalds Announces Gubernatorial Bid with Trump's Support**\nFlorida Representative Byron Donalds announced on Tuesday night that he will run for governor of Florida in 2026, potentially setting up a showdown with current Governor Ron DeSantis, who has been discussing the possibility of his wife succeeding him when he leaves office. 'After much prayer and reflection with my family and friends, I am here to announce my candidacy to be the next governor of the great state of Florida,' said Donalds, a Naples Republican, to Fox News host Sean Hannity. Donalds, who served four years in the Florida Legislature before being elected to Congress in 2020, is running with the support of President Donald Trump, who announced last week that he would back Donalds if he ran against DeSantis. Trump's endorsement has been a decisive factor in Florida campaigns, including DeSantis's 2018 gubernatorial win. However, DeSantis is expected to leave office in 2027 due to term limits, and his wife, First Lady Casey DeSantis, has been considering a run to succeed him. DeSantis has been discussing his chances of winning, while also criticizing Donald Trump's record. Donald Trump said on Tuesday night that DeSantis is a 'great governor.' 'Ron DeSantis has done an extraordinary job for our state. But now the work is to keep the best state in the country as the best state in the country,' said Donalds.\nOriginal language: es\nPublish date: February 26, 2025 03:56 PM\nSource:[elnuevoherald.com](https://www.elnuevoherald.com/noticias/florida/article301022369.html#storylink=latest_side)\n\n**Rep. Byron Donalds, backed by Trump, says he’s running for Florida governor**\nRepublican U.S. Rep. Byron Donalds announced his candidacy for Florida governor in 2026, backed by President Donald Trump's endorsement. Donalds praised Governor Ron DeSantis' 'tremendous job' for the state, but DeSantis suggested that his wife, Casey DeSantis, would be a worthy governor and implied that Donalds was not responsible for his victories on conservative priorities. Donalds plans to prioritize lowering insurance costs, promoting the cryptocurrency industry, and preserving the Everglades, saying 'Now is the time to keep the best state in the country as the best state in the country.'\nOriginal language: en\nPublish date: February 26, 2025 04:01 AM\nSource:[mysuncoast.com](https://www.mysuncoast.com/2025/02/26/rep-byron-donalds-backed-by-trump-says-hes-running-florida-governor/)\n\n**It's Official: Byron Donalds Makes Big Announcement About His Plans for the Future**\nGOP Rep. Byron Donalds has announced his candidacy for the 2026 Florida gubernatorial election, aiming to succeed Gov. Ron DeSantis. Donalds made the announcement on Fox News' 'Hannity,' praising DeSantis' leadership and expressing his desire to keep Florida 'the best state in the country.' Donalds acknowledged DeSantis' accomplishments, saying, 'We have a great governor. DeSantis has done a tremendous job for our state, but now the job is to keep the best state in the country as the best state in the country.' Donald Trump has already endorsed Donalds, calling him a 'TOTAL WINNER' and urging him to run. However, DeSantis' response to the announcement remains to be seen, with some speculating that his wife, Casey DeSantis, may also run for office.\nOriginal language: en\nPublish date: February 26, 2025 03:40 AM\nSource:[Redstate](https://redstate.com/bobhoge/2025/02/25/its-official-byron-donalds-makes-big-announcement-about-his-plans-for-the-future-n2186026)\n\n**Representative Byron Donalds, backed by Trump, says he’s running for Florida governor**\nRepublican U.S. Rep. Byron Donalds announced his candidacy for Florida governor in 2026, backed by President Donald Trump's endorsement. Donalds, a frequent Trump surrogate, praised DeSantis for his 'tremendous job' in the state, but noted his own record in elected office and Trump's support. He plans to prioritize lowering insurance costs, promoting the cryptocurrency industry, and preserving the Everglades. Donalds, a 46-year-old Black Republican, would be the first African American to serve as governor if he wins. Other potential GOP candidates include Casey DeSantis, Matt Gaetz, and Wilton Simpson, but Trump's endorsement may clear the way for Donalds.\nOriginal language: en\nPublish date: February 26, 2025 03:16 AM\nSource:[bostonglobe.com](https://www.bostonglobe.com/2025/02/25/nation/florida-governor-race-byron-donalds/)\n\n**Rep. Byron Donalds, backed by Trump, says he's running for Florida...**\nU.S. Rep. Byron Donalds, a Republican from Florida, announced his candidacy for the 2026 Florida gubernatorial election, backed by President Donald Trump's endorsement. Donalds praised Governor Ron DeSantis, saying he had done a 'tremendous job for our state,' but did not directly address speculation about DeSantis' wife, Casey DeSantis, potentially running for the position. Donalds' priorities include lowering insurance costs, promoting the cryptocurrency industry, and preserving the Everglades. He would be the first African American to serve as governor if he wins. Other potential GOP candidates include former U.S. Rep. Matt Gaetz and Florida Agriculture Commissioner Wilton Simpson.\nOriginal language: en\nPublish date: February 26, 2025 03:05 AM\nSource:[Daily Mail Online](https://www.dailymail.co.uk/wires/ap/article-14436877/Rep-Byron-Donalds-backed-Trump-says-hes-running-Florida-governor.html)\n\n**DeSantis Names Wife as Potential Successor, Criticizes Trump's Support for Donalds**\nFlorida Governor Ron DeSantis has indicated his wife, Casey DeSantis, as a potential successor for the governor's position in the 2026 elections. In an interview in Tampa, DeSantis described Casey as a 'conservative committed to continuing his legacy and attracting more voters than he himself has.' DeSantis won re-election in 2022 with a significant margin of almost 20 points. This announcement comes after Donald Trump expressed support for Byron Donalds, a Republican congressman from Florida, for the state governor election. Trump has praised Donalds and stated that he will give his full support if the congressman decides to run. DeSantis, who is at the end of his second term, may attempt to run for president again in 2028 and has been working to strengthen his relationship with Trump after being defeated by him in the 2024 Republican primaries. Trump reinforced his support for Donalds in a post, saying 'RUN, BYRON, RUN!' The potential candidacy of Casey DeSantis has generated speculation in Tallahassee, especially with the growing tension between DeSantis and Trump's allies in the Florida State Legislature.\nOriginal language: pt\nPublish date: February 25, 2025 05:03 PM\nSource:[acheiusa.com](https://www.acheiusa.com/Noticia/desantis-cita-esposa-como-sucessora-e-critica-apoio-de-trump-153300/)\n\n**Trump Backs Byron Donalds for Florida Governor in 2026**\nDonald Trump has announced his support for Byron Donalds, a congressman, as his preferred candidate for the governorship of Florida in 2026. Trump made the announcement on his social media platform Truth Social, where he described Donalds as a 'total winner' and a leader who can work with him to push the 'America First' agenda. Trump highlighted Donalds' experience in politics, his commitment to key issues such as border security, military strength, veteran protection, and Second Amendment defense, and said that he would be a 'truly great and powerful governor' for Florida. Meanwhile, Casey DeSantis, the wife of Ron DeSantis, leads in the polls for the governorship, but Trump has not endorsed her. A recent poll by the University of North Florida shows that 57% of Trump's supporters approve of DeSantis, while only 4% disapprove. However, Trump's endorsement of Donalds could change the landscape, and analysts suggest that if the president becomes more involved in the campaign, Donalds' popularity could increase significantly.\nOriginal language: es\nPublish date: February 21, 2025 04:34 PM\nSource:[La Nacion](https://www.lanacion.com.ar/estados-unidos/florida/adios-desantis-trump-ya-eligio-a-quien-quiere-de-gobernador-de-florida-en-2026-nid21022025/)\n\n",
    "date": "2025-06-05T22:26:17.153212",
    "summary": "Across all expert perspectives, the consensus is that Casey DeSantis is highly unlikely to announce her candidacy for Florida governor before July 1, 2025. Key factors cited include: (1) Byron Donalds' consolidation of GOP support and receipt of Donald Trump's powerful endorsement, which has shifted polling and incentives away from a DeSantis entry; (2) the typical campaign launch timing in Florida, which usually occurs with more lead time, especially for high-profile figures; (3) a lack of donor enthusiasm, party infrastructure, or media leaks hinting at an imminent Casey DeSantis campaign; and (4) the substantial risks of entering a race as an underdog when most elite and party signals favor another candidate. While some analysts note Casey DeSantis' strong name ID, family political ambition, and latent donor network could enable a fast pivot if a major scandal or black swan event impacted Donalds, all agree there is currently no evidence of such a disruption. Base rate analysis and political science theories support the overwhelming expectation that any announcement would strategically be delayed past July 1 to maintain flexibility and minimize intra-party conflict. Final probability estimates for a 'Yes' outcome range from 4% to 15%, with the weight of argument and evidence anchoring expectations strongly in the 'No' camp absent a dramatic unforeseen development in the next three weeks."
}