{
    "deliberation_results": {
        "WealthmanagementHighnetworthtracking": {
            "time_to_resolution": "About 1 month and 2 days (until July 1, 2025)",
            "perspective_relevance": "As an expert in Wealth Management with a focus on High Net Worth Tracking, I am experienced in analyzing billionaire demographics, cross-border wealth flows, and the mechanisms underpinning the public billionaire indexes. This perspective allows for a nuanced interpretation of population composition trends, regional wealth aggregation, and market-driven dynamics likely to affect the Bloomberg Billionaires Index at its median in the short term.",
            "status_quo": "As of April 30, 2025, the 250th-ranked person on the Bloomberg Billionaires Index is Giancarlo Devasini of Italy. The US remains the country with by far the largest number of billionaires globally (based on Forbes and Bloomberg methodologies) and dominates the top of the list.",
            "perspective_derived_factors": [
                {
                    "factor": "Base Rate of US Representation near the 250th Spot",
                    "effect": "Increases probability. Historically, the US has comprised over a third of global billionaires, and US citizens have often held median spots on global billionaire rankings—especially as more recent entrants and dropouts are disproportionately from non-US/emerging-market regions, which are more volatile."
                },
                {
                    "factor": "Recent Surge in Non-US Billionaires (Especially Italians and Crypto Entrepreneurs)",
                    "effect": "Decreases probability slightly. Evidence from the last few months indicates a notable influx of Italian and crypto industry billionaires into the lower half of the global top 500, reflecting the globalized and sometimes transient nature of new wealth. This suggests a possible short-term increase in European or non-US presence at the median."
                },
                {
                    "factor": "Stock Market Performance and Currency Fluctuations",
                    "effect": "Increases probability. The US equity markets have performed well in H1 2025, supporting the wealth of tech and finance-related US billionaires, while EUR/USD and other major currency volatilities may disadvantage non-USD wealth when converted for these lists."
                },
                {
                    "factor": "Highly Diversified US Billionaire Pool",
                    "effect": "Increases probability. Given not just top but hundreds of US billionaires contributing to the middle tier of the global billionaire distribution, there is a statistical tendency for the US to occupy the median rank in the absence of significant external shocks."
                },
                {
                    "factor": "Continued Entry/Exit Volatility Among Emerging Market and Crypto Billionaires",
                    "effect": "Increases probability. These fortunes are typically more volatile than those of established US billionaires, with rapid upswings occasionally followed by regulatory crackdowns or valuation corrections, favoring the stability of US representation at the median."
                }
            ],
            "no_scenario": "A non-US billionaire—most plausibly from Italy or another European country that has seen recent major wealth entries (such as through inheritance, business growth, or exceptional returns in the crypto sector)—remains or rises to rank 250th, or a significant market/currency move reduces US dollar denominated fortunes in the middle billionaire ranks.",
            "yes_scenario": "Either Giancarlo Devasini drops below 250 (through a mild valuation decline or due to new entrants above him), or a US billionaire rises/re-enters into the 250th spot, as more typical, given ongoing inflows of tech, finance, or diversified wealth from the stable US pool.",
            "final_reasoning": "While there has been a notable surge in Italian/crypto billionaires and recent volatility around the 250th spot (as shown by Giancarlo Devasini's current rank), the base rate, statistical profile, and underlying US-dominated billionaire population support a strong likelihood that the 250th spot will revert to a US individual by July 1, 2025—absent a major market shock. The US still has the most billionaires overall (with the closest competitors, like China and India, lagging and their entrants subject to greater volatility and regulatory risk). Moreover, US-based fortunes are generally more stable and less likely to be affected by the sudden exits/entries that have typified the bottom of the billionaire list. The final probability is therefore above base rate, but modestly shaded down to reflect the observable short-term upward movement of non-US, especially European, entrants near the cutoff.",
            "final_probability": 78
        },
        "FinancialjournalismBillionairerankingmethodologies": {
            "time_to_resolution": "Just over 1 month (from May 29, 2025, to July 1, 2025)",
            "perspective_relevance": "As an expert in Financial Journalism specializing in billionaire ranking methodologies, I bring an understanding of how wealth estimates are constructed, how country attribution works on indexes like Bloomberg, and trends in both the composition and volatility of global billionaire lists. Importantly, I know that the lower ranks of such lists (around the median) are much more dynamic and international than the US-heavy top ranks, and that changes are often driven by minor market movements, new entries from fast-growing markets, and currency fluctuations.",
            "status_quo": "As of April 30, 2025, the 250th person on Bloomberg's Billionaires Index is Giancarlo Devasini of Italy. Historically, the bottom half of global billionaire lists have seen increased representation from outside the United States, particularly from Europe and Asia as their wealthy classes expand and high-velocity sectors (like crypto or technology) create new fortunes outside the traditional US/Western base.",
            "perspective_derived_factors": [
                {
                    "factor": "Country Distribution of Billionaires",
                    "effect": "Decreases probability. Despite the US still having the largest total number of billionaires (Forbes: 900+), the middle of the distribution is increasingly internationalized. With Italy, France, Germany, China, India, and other countries posting record billionaire counts and given the April status quo is Italian, the US is not the default median."
                },
                {
                    "factor": "Wealth Volatility at the Margins",
                    "effect": "Could slightly increase probability, but on balance is neutral-to-negative. While market swings can rapidly reshuffle marginal wealthy, large numbers of new billionaires in emerging markets (crypto, Europe, Asia) mean displacement of the US at the median is more likely than in prior years."
                },
                {
                    "factor": "Recent Trends in Italian/European Billionaires",
                    "effect": "Decreases probability. News shows a surge in Italian billionaires, with new entrants (crypto, tech, heirs) and Giancarlo Devasini rising sharply. The influx of new European wealth in the 200-300th range suggests continued non-US representation at the median."
                },
                {
                    "factor": "Short Time Horizon",
                    "effect": "Slightly increases probability of no change. Only a month remains. Unless a US billionaire overtakes Devasini or other near-median Europeans/Asians, the current configuration is likely to persist absent major market disruptions."
                },
                {
                    "factor": "Reporting and Attribution Methods on Bloomberg",
                    "effect": "Generally neutral. Country attributions are rarely changed except on clear residency or nationality shifts. Bloomberg is usually consistent with public disclosures/documented citizenship."
                },
                {
                    "factor": "US Tech Stock Movement",
                    "effect": "Could increase probability. US equities (esp. tech) tend to be volatile and if there was a sharp rally, a US-based near-median billionaire could surpass Devasini. But no such movement is reported in the relevant news, and April/May saw more non-US than US upward mobility."
                }
            ],
            "no_scenario": "Steady growth in international billionaire counts, especially in Europe (Italy, France), India, or another non-US country, pushes or retains a non-US billionaire (like Devasini) at the median rank. No significant increase in the net worth or position of US-based billionaires around the 250th spot. The US retains dominance at the top but not at the 250th position. Devasini or another European/Asian remains at #250.",
            "yes_scenario": "A US-based billionaire just below Devasini in rank (e.g., due to favorable stock market movement or private asset revaluation) rises slightly, overtakes Devasini or other non-US peers, and is listed at #250 on July 1. Alternatively, a major drop in the net worth of Devasini (e.g., due to crypto market downturn or regulatory issue) pushes him below the threshold, allowing a US billionaire to reclaim the spot.",
            "final_reasoning": "The starting point is Giancarlo Devasini, an Italian, at the median rank as of end-April. All recent data points to a surge in non-US billionaires, especially from Italy and Europe (up to record levels), and sustained global expansion of the billionaire class. The US remains the largest single country but its share at the median is diluted by expansion elsewhere. Only about a month remains, and no reports suggest a reversal via US gains or European/crypto declines at the margin. Market volatility could shift things, but recent US tech corrections (as noted in the news) suggest the tailwind is more to non-US than US mobility. The index's methodology, based on net worth and nationality as documented by Bloomberg, tends to be slow to reattribute countries and doesn't quickly reflect small, cross-national fortunes. Absent a large movement in US equity markets or a crypto crash, it is more likely that the median will remain non-US. Base rate: In previous years, the median was US, but the new Italian surge and the April snapshot show a plausible shift away from US for July. I therefore estimate the probability that the Bloomberg Index's 250th-ranked person will be US-based on July 1, 2025, at only 27%.",
            "final_probability": 27
        },
        "EconomicsGlobalwealthdistribution": {
            "time_to_resolution": "Approximately 1 month until July 1, 2025",
            "perspective_relevance": "As an expert in global wealth distribution, I am uniquely positioned to assess macro trends in billionaire demographics, regional wealth dynamics, and the interplay of sectoral developments—especially the significant growth in non-US billionaire wealth, including the impact of cryptocurrency and tech fortunes outside the US. My expertise allows for robust base rate analysis and a nuanced understanding of how shifts in economic centers affect rankings on rich lists.",
            "status_quo": "As of April 30, 2025, the 250th richest person on Bloomberg's Billionaires Index is Giancarlo Devasini of Italy. Historically, the US has dominated the middle and upper ranks of billionaire lists, but recent years have seen increased internationalization of wealth distribution.",
            "perspective_derived_factors": [
                {
                    "factor": "Relative growth rate of billionaire populations by country",
                    "effect": "Decreases probability—the US billionaire population is growing, but the rest of the world (notably Europe, India, and China) is growing faster in both absolute numbers and median wealth, shrinking the US share."
                },
                {
                    "factor": "Surge of cryptocurrency and tech fortunes outside the US",
                    "effect": "Decreases probability—Europe (esp. Italy with Devasini of Tether), the Middle East, and Asia have seen rapid ascension due to crypto and tech, changing the nationality mix at the median."
                },
                {
                    "factor": "US dollar strength/yield, equity market performance",
                    "effect": "Increases probability—if US financial markets outperform and the dollar strengthens, this lifts US billionaire wealth and can help American billionaires retain their positions."
                },
                {
                    "factor": "Succession, inheritance, and splits among non-US fortunes",
                    "effect": "Ambiguous—splits can dilute non-US wealth and push US nationals up, but multi-heir successions (esp. Italy) spread wealth thinner, reducing impact on the very top but potentially padding the middle ranks with new non-US entries."
                },
                {
                    "factor": "Recent national distribution at the 250th-260th ranks",
                    "effect": "Decreases probability—Current data confirms a non-US billionaire (Italy’s Giancarlo Devasini) precisely at the median, and related news indicates more new European non-US entries around this cutoff."
                }
            ],
            "no_scenario": "No outcome: Continued or accelerated growth in non-US fortunes—especially in cryptocurrency, Europe (Italy), India, and China—means that the 250th richest person remains non-American, as was the case with Giancarlo Devasini. No major US wealth surge or foreign market crash occurs to change positionings.",
            "yes_scenario": "Yes outcome: US equity markets outperform in June, boosting mid-list American billionaires. Meanwhile, non-US crypto or European fortunes decline due to asset price drops or regulatory actions, causing the 250th spot to revert to a US national. Additionally, a mass succession or legal action could dilute or strip wealth from a cluster of non-US billionaires just below the cutoff.",
            "final_reasoning": "The dominant macro trend is increasing dispersion of extreme wealth: the US still has the most billionaires, but its share is shrinking, especially at the median (250th) level. News confirms an Italian currently holds spot 250, backed by the rapid rise in crypto billionaires (several of whom are not US citizens) and new European entries. Recent years have seen other mid-list cutoffs increasingly feature individuals from Italy, India, and China, supported by inheritance and business growth—not transient, reversible effects. Furthermore, the Bloomberg Index updates during market hours, but US fortunes would need a strong, broad June rally to displace the current European median holder. With only about a month left and no large, plausible catalyst for a US median surge, the conservative, base rate–aligned expectation is that the 250th spot will remain non-US. I assign a moderately high probability accordingly.",
            "final_probability": 77
        },
        "EconomicsInternationalincomeinequality": {
            "time_to_resolution": "Just over 1 month (as of May 29, 2025, resolves July 1, 2025)",
            "perspective_relevance": "As an economist specializing in international income inequality, I focus on the concentration and distribution of extreme wealth across countries, how macroeconomic factors, market performance, and sectoral dynamics affect billionaire demographics, and the resilience of national billionaire cohorts to changes in wealth thresholds. This expertise is directly relevant because the question concerns the shifting geographic composition of billionaires at the margin (the 250th-ranked individual on Bloomberg's list), which tends to be more sensitive to global economic trends, asset prices, sector shocks (e.g., tech or crypto), and country-level economic policy.",
            "status_quo": "On April 30, 2025, Italy's Giancarlo Devasini was ranked 250th. Historically and at present, the US has by far the largest cohort of billionaires, especially concentrated around the median of global billionaire rankings.",
            "perspective_derived_factors": [
                {
                    "factor": "Relative Share of US Billionaires",
                    "effect": "Increases probability. The US, with 902 billionaires (per latest Forbes), is far ahead of any other country, and this dominance is even more pronounced in the lower billionaire ranks, i.e., towards the 250th place. That means the 'median' billionaire is usually American absent specific countervailing trends."
                },
                {
                    "factor": "Recent Surge in Italian and Crypto-Related Wealth",
                    "effect": "Slightly decreases probability. Italy has seen a marked uptick in billionaire numbers and visibility, driven in part by crypto (Tether) and inheritance (Berlusconi heirs), as demonstrated by Devasini's placement at #250. Crypto market volatility could see rapid movement just above or below the threshold, giving non-US nationals (especially Italians) an increased chance."
                },
                {
                    "factor": "Global Asset Market Performance",
                    "effect": "Neutral/slightly increases probability. US equity markets remain near historic highs into mid-2025, which buoys the wealth of the US cohort, whereas European and Asian equity performance has generally lagged. Thus, US-based billionaires likely retain or gain spots."
                },
                {
                    "factor": "Continued Expansion of Wealth in Asia and Emerging Economies",
                    "effect": "Decreases probability. Expanding billionaire populations in China, India, and crypto-driven wealth increases the chances that a non-US national could occupy the median spot, though this effect is more pronounced below the 250th rank."
                },
                {
                    "factor": "Short-Term Wealth Shocks and Volatility",
                    "effect": "Could swing either way but tends to slightly decrease probability, as the 250th spot is particularly sensitive to fluctuations. If there are large crypto or sectoral swings, another non-US entrant could knock an American off the 250th spot or vice versa."
                }
            ],
            "no_scenario": "Crypto markets see a major surge or there is continued exceptional performance by European (particularly Italian) billionaires (e.g., Tether, inheritance), keeping Devasini or a new non-American in the #250 slot, or a new billionaire from China, India, or another rapidly growing region enters and edges out a US national.",
            "yes_scenario": "The typical base rate holds: US stock market strength continues, or at least is stable, and Bloomberg's billionaire index median (250th slot) reverts to its usual baseline—an American—due to the much larger pool and stability among American billionaires. Alternatively, crypto and European asset values stabilize or fall, pushing non-US billionaires below the line.",
            "final_reasoning": "The base rate strongly favors an American at the median. The US billionaire population is not only the largest globally but also dominates the 'tail' of the ultra-wealthy distribution, making it statistically likely that the median (250th) on Bloomberg's list is American. While there is recent evidence of Italian billionaires (notably Devasini) and a crypto-driven wealth surge entering high ranks, these cases are volatile and idiosyncratic. The main risk to the status quo is a sudden surge in non-US (especially Italian/crypto) fortunes, but with over 900 US billionaires and continued outperformance of US tech/market sectors, these are relatively unlikely to persist or intensify enough to sustain a non-US median on July 1. Thus, my probability is well above even chance, but not extreme due to recent volatility and crypto uncertainty.",
            "final_probability": 80
        },
        "SociologyElitetheory": {
            "time_to_resolution": "About 1 month until July 1, 2025",
            "perspective_relevance": "Elite theory emphasizes the role of entrenched elites and their networks, state-corporate interlinkages, and the persistence of transnational capitalist class structures. Applying this lens, I analyze how the distribution of billionaire wealth reflects deeper power continuities and transitions, focusing on whether the US elite's global dominance is weakening or consolidating among the upper echelons (the 250th-wealthiest individual) in the wake of shifting capital flows, tech disruption, and emerging global elites.",
            "status_quo": "As of April 30, 2025, the 250th-ranked person on Bloomberg's Billionaires Index is Giancarlo Devasini from Italy, meaning the status quo answer is No (i.e., a non-US billionaire holds the median slot).",
            "perspective_derived_factors": [
                {
                    "factor": "Base rate: US preponderance at the top and depth of the billionaire class",
                    "effect": "Increases probability; the US has ~900+ billionaires and the tightest concentration of wealth, historically making it more likely for Americans to comprise the bulk even at the 250th position. However, a non-US billionaire at #250 this year is notable and may signal a shift."
                },
                {
                    "factor": "Recent European/Italian surge and crypto wealth impact",
                    "effect": "Decreases probability; Italy and other European nations have experienced a sharp increase in new billionaires, particularly driven by succession (e.g., Berlusconi heirs), crypto gains (e.g., Devasini), and new tech fortunes, meaning the median is moving away from the traditional US cohort."
                },
                {
                    "factor": "US stock market and wealth volatility",
                    "effect": "Mixed; while the US equity market remains broadly robust and many top US billionaires remain dominant, recent news of minor corrections in stock prices for tech titans and continued market volatility can squeeze the lower end of the US billionaire list, making it easier for new foreign entrants to surpass the US median slot."
                },
                {
                    "factor": "Elite reproduction and inheritance moments",
                    "effect": "Decreases probability; large wealth transfers in non-US families (e.g., Berlusconi, Ferrero, Sirivadhanabhakdi in Thailand) result in sudden new entrants clustering in the lower ranks of the billionaire list, increasing the odds that the 250th spot is claimed by a non-US individual."
                },
                {
                    "factor": "Crypto/tech sector transnationalism",
                    "effect": "Decreases probability; the rise of non-US crypto and fintech billionaires (notably based in Europe or Asia, but operating globally) is boosting the global diversification of elite wealth."
                },
                {
                    "factor": "Resolution timing vs. seasonal list revisions",
                    "effect": "Slightly decreases probability; most major billionaire lists are updated quarterly or semi-annually, and the most recent uptick in non-US entrants—especially crypto and inheritance-based—suggests a structural shift unlikely to reverse in just one month barring significant US financial market rallies."
                }
            ],
            "no_scenario": "Between now and July 1, there is no major upswing in US asset prices, no exit of Devasini or similar non-US billionaires from the list, and ongoing consolidation or entrance of non-US billionaires (European heirs, crypto founders). The Bloomberg list remains similar or sees further slight dilution of US representation at the median.",
            "yes_scenario": "US markets surge in June 2025, boosting the net worth of several US billionaires and/or public company valuations, pushing a US billionaire back over the threshold. Alternatively, Devasini or comparable non-US billionaires fall out due to significant asset price drops (e.g., a crypto crash), restoring a US name at #250.",
            "final_reasoning": "The US remains the single largest origin of billionaires and has exceptional representation at the very top. However, applying elite theory, the durability of entrenched American elite dominance is no longer universal all down the rankings. Recent Italian/European/Crypto-driven wealth surges, inheritance booms, and broadening billionaire origins mark a growing transnational elite class. With Devasini, an Italian with crypto wealth, at #250 on April 30, and a short time frame until the resolution, a US return to the 250th slot requires either a reversal in this new non-US wealth or significant upward volatility in US billionaire net worths (or downward fortunes for non-US billionaires). The base rate would still slightly favor a US billionaire if wealth mere numbers translated linearly, but given the latest data and trend, the odds have shifted below 50%. Factoring the persistence of global shifts and the sociological analysis of elite class broadening, the most probable outcome is that the 250th-ranked Bloomberg billionaire is not from the US on July 1, 2025. However, due to historic US strength, the odds are not far below even.",
            "final_probability": 41
        },
        "SociologyGlobalizationsociology": {
            "time_to_resolution": "About 1 month (as of May 29, 2025, the question resolves on July 1, 2025)",
            "perspective_relevance": "As an expert in Globalization Sociology, my perspective is focused on the structural and demographic shifts in global wealth distribution, international economic integration, and how the rise of new economic centers, the effects of digitization/cryptocurrency, and national economic policies impact the ultra-wealthy. I also bear in mind the sociological inertia of elite classes, global mobility of capital, and transnational patterns shaping billionaire ranks.",
            "status_quo": "On April 30, 2025, the 250th-ranked person on Bloomberg's Billionaires Index (the 'median' for this question) was Giancarlo Devasini of Italy—not a US national. Historically, however, the US has usually dominated the median point due to the sheer number of American billionaires.",
            "perspective_derived_factors": [
                {
                    "factor": "US Share of Billionaire Population",
                    "effect": "The US still has by far the largest number of billionaires (902 of 3,028, nearly 30%), and US economic dominance in digital sectors remains strong, which tends to keep many US citizens at every percentile rank, including the median. Increases the probability."
                },
                {
                    "factor": "European and Italian Surge",
                    "effect": "Italy, along with other European countries, has seen a notable increase in new billionaires, largely from inheritance (e.g., Berlusconi heirs), crypto (Devasini, Ardoino), and other emergent sectors. This recently pushed an Italian, Giancarlo Devasini, to the 250th spot, a sign of diminished US dominance at the exact median rank. Decreases the probability."
                },
                {
                    "factor": "Rise of Non-US Billionaires (especially from China, India, Crypto, and SE Asia)",
                    "effect": "Billionaire growth in China, India, and sectors like crypto (lots of non-US founders) weakens the structural dominance the US had at every index decile. Increasing internationalization at the margin could keep a non-US person at #250. Decreases the probability."
                },
                {
                    "factor": "Market Volatility in Tech and Crypto",
                    "effect": "Rapid changes in tech stocks and crypto values can quickly shift individual fortunes, especially around the cutoff where net worths are similar. If crypto or certain US tech stocks dip, it could knock out highly-leveraged US or non-US actors from the 250th slot. Increases volatility/uncertainty."
                },
                {
                    "factor": "Base Rate Analysis",
                    "effect": "Historically, the US overwhelmingly claims both the very top and most percentile spots on global billionaire lists year to year (see Forbes, Bloomberg, Wealth-X, etc.), indicating the prior probability for a US person to be in any given rank, including 250th, is high. Increases the probability."
                },
                {
                    "factor": "Resolution Date Style Effects",
                    "effect": "Over a 1-month period, it's plausible for the 250th spot to switch back to a US billionaire due to the ordinary churn as values fluctuate, barring a massive crypto/Italian/Chinese value surge. Increases the probability, as temporary non-US medians tend to revert."
                }
            ],
            "no_scenario": "The Italian/European/crypto billionaire surge sustains itself, and Giancarlo Devasini or another non-US person maintains or snags the 250th spot due to either continued crypto growth, Euro/Asia stock appreciation, or US tech weakness. With further inheritance boosts or stable crypto prices, this would deny US reentry at the margin.",
            "yes_scenario": "US tech or market resilience (or even a mild rebound) boosts the net worth of marginal US billionaires, while European/Italian/crypto assets either plateau or slightly decline, bumping a US billionaire back to #250. Ordinary statistical probability plus historic US dominance asserts itself at this granular position on the list.",
            "final_reasoning": "The US remains the global billionaire powerhouse, historically occupying the vast majority of percentile ranks (including the median) on the Bloomberg Billionaires Index. While recent surges in Italian and crypto billionaires have shifted the 250th spot as of April 30, 2025, toward Giancarlo Devasini (Italy), such deviations are usually temporary, and the month left until resolution provides ample time for churn. US dominance, strong capital markets, and the tendency of the index to revert to US medians once brief shocks abate all increase the likelihood of a US person regaining the 250th place by July 1. However, the Italian/crypto uptick lowers certainty compared to prior years—this is not a 90+% forecast—but the base rate, structural US advantage, and volatility argue for a clear US edge.",
            "final_probability": 74
        },
        "AreastudiesunitedstatesUswealthconcentration": {
            "time_to_resolution": "About 1 month (forecast date: May 29, 2025; resolves July 1, 2025)",
            "perspective_relevance": "As an expert in US wealth concentration, I closely track the global composition and distribution of billionaire wealth, including which countries dominate the median and tail ranks of global billionaire lists. I am knowledgeable about the structural drivers supporting US billionaire growth, as well as international trends that may affect shifts in the median billionaire's nationality.",
            "status_quo": "As of April 30, 2025, the 250th-ranked person (the 'median' of the Bloomberg Billionaires Index) was Giancarlo Devasini of Italy. Historically, prior to his appearance, the United States often dominated the mid-ranks of global billionaire indexes, but recent surges in wealth outside the US (notably Italy and crypto) have changed the makeup.",
            "perspective_derived_factors": [
                {
                    "factor": "Base rate dominance of US billionaires",
                    "effect": "Increases probability. The US has consistently had the largest share of billionaires globally and a deep bench beyond the very top. With about 900+ US billionaires in global lists and a heavy presence in the top 250, even amid recent surges elsewhere, the US remains the default national origin for the median billionaire."
                },
                {
                    "factor": "International surge, especially from Italy and crypto sector",
                    "effect": "Decreases probability. Italy's billionaire count has risen sharply due to inheritances and crypto (e.g., Devasini), rapidly filling the mid-ranks where the 250th spot lies. A new wave of crypto billionaires globally (including non-Americans) could push out the median US billionaire."
                },
                {
                    "factor": "US stock market performance and technology sector resilience",
                    "effect": "Increases probability. Strong or stable US equities, especially in tech, underpin the wealth of a large cohort of American billionaires who occupy not just the top, but also the median ranks."
                },
                {
                    "factor": "Stability/volatility of non-US sources of billionaire wealth (e.g., crypto, inheritance cases)",
                    "effect": "Increases probability if volatility causes sharp drops; decreases probability if foreign billionaire numbers continue to expand or stay flat. The fortunes that propelled Devasini and similar non-US billionaires into the median may be more volatile than the US cohort's."
                },
                {
                    "factor": "Short forecast window (just over a month until resolution)",
                    "effect": "Increases status quo stickiness. Dramatic reshuffling at the 250th spot in just one month is less likely barring a crypto crash or a large-scale reallocation of inherited fortunes."
                }
            ],
            "no_scenario": "The mid-rank of the Bloomberg Billionaires Index remains dominated by newly wealthy non-US individuals: Italian inheritance cases and/or additional global crypto executives enter or maintain position around the 250th rank, keeping a non-US billionaire (likely European or possibly from Asia via crypto or family conglomerates) at the median.",
            "yes_scenario": "Devasini or other non-US billionaires at just above or just below the 250th spot fall in rank due to market volatility, crypto fluctuations, or revised wealth estimates, enabling a US-based billionaire to retake the median spot. Alternatively, the US base rate and continued upward performance of US equities/tech ensure the 250th spot naturally reverts to an American due to the depth and resilience of the US billionaire class.",
            "final_reasoning": "The US continues to be the world’s largest source of billionaire wealth, with ~900+ individuals (roughly three times the figure for China and other countries), and its dominance in the top echelons is undisputed. However, recent surges in Italian super-wealth and a global wave of crypto-generated billionaires have challenged the old status quo, resulting in the current 250th billionaire (as of April 30) being Giancarlo Devasini of Italy. The US has historically seen strong representation in the median ranks, but the rapid rise of new international billionaires (specifically in Italy, largely due to inheritance and crypto, and in other countries due to digital assets) means the US’s grip on the median is less secure now than in previous years. However, the short time window to July 1 means that only substantial, sudden wealth rebalancing (such as a large crypto price drop, a drastic inheritance re-evaluation, or an upward surge in US tech stocks/firms just below the median) would be likely to alter the current composition. On balance, the US base rate and strength of the US billionaire bench are still significant, but the immediate status quo—an Italian in the 250th spot—reflects real shifts. Absent a specific trigger (e.g., a Bitcoin or Tether crash), the most likely scenario is that the 250th spot remains non-US, at least for this resolution window, since international surges have just recently taken effect and tend to persist for a few months barring external shocks. I therefore give the US only a modest chance to recapture the median by July 1, 2025.",
            "final_probability": 30
        },
        "AreastudiesunitedstatesUsbusinessdominance": {
            "time_to_resolution": "About 1 month (from May 29, 2025 to July 1, 2025)",
            "perspective_relevance": "As an expert in AreaStudiesUnitedStates (USBusinessDominance), I bring a historical and structural understanding of global billionaire demographics, US economic dynamism, capital market depth, and how the US sustains its global dominance in wealth creation through technological innovation and financial networks. This perspective emphasizes the outsized role of US-based companies in the ultra-high-net-worth population and the structural inertia behind those distributions.",
            "status_quo": "As of April 30, 2025, the 250th person on the Bloomberg Billionaires Index is Giancarlo Devasini of Italy. Over recent years, non-US billionaires (especially newcomers from tech and crypto) have gained ranks, but the US continues to have the largest billionaire population by far.",
            "perspective_derived_factors": [
                {
                    "factor": "Base rate of US dominance in billionaire lists",
                    "effect": "Strongly increases probability. Bloomberg, Forbes, and similar lists consistently show that not only are the richest individuals mostly from the US, but so are a majority of those around the median (250th spot). Unless there are truly seismic shifts, the US has a structural lead due to institutional and market advantages."
                },
                {
                    "factor": "Recent surge in non-US/crypto billionaires",
                    "effect": "Moderately decreases probability. High volatility in crypto and tech wealth can push new non-US billionaires into the rankings, as evidenced by Giancarlo Devasini in 250th spot and Tether leadership. However, such gains are often volatile and can reverse quickly, making sustained presence at exactly the median less certain."
                },
                {
                    "factor": "US equity market performance and asset prices",
                    "effect": "Moderately increases probability. US markets remain robust, with significant gains among public and private company founders/executives. The S&P 500 and tech stocks, in particular, have elevated US-based wealth; strong fundamentals and innovation continuities support further dominance."
                },
                {
                    "factor": "Threshold effects at the median and international wealth growth",
                    "effect": "Marginally decreases probability. As more billionaires emerge from rapidly growing economies (notably China, India, crypto sector, Italy with sudden surges), the median is less reliably US, but these surges usually take time to percolate through the top 250 positions."
                },
                {
                    "factor": "Bloomberg's methodology and reporting bias",
                    "effect": "Slightly increases probability. US-based billionaires may be more visible, better documented, and more frequently audited than their peers elsewhere, biasing rankings toward US residents."
                }
            ],
            "no_scenario": "The global rise of new billionaires, especially from regions with burgeoning tech or crypto wealth (e.g., China, Italy, crypto leaders) continues apace, and at the July 1, 2025 update, a non-US billionaire still occupies the 250th spot — possibly still Devasini or another European/Asian/crypto figure, owing to a softening of US asset prices or appreciation in foreign/currency/crypto valuations.",
            "yes_scenario": "US capital markets perform well or remain stable while crypto and European billionaire surges recede, or at least plateau. US billionaire ranks remain the deepest, and the churn at the median pushes a US-based person into the 250th slot once again, which is the historical norm (the modal and median billionaire on the list is American). The sudden entries from Italy and crypto either fall back or don't coincide with the snapshot date.",
            "final_reasoning": "The US remains overwhelmingly dominant both at the summit and the base of the billionaire pyramid, and has historically occupied the median/bottom as new wealth grows. While recent months have seen notable new billionaire entries from Italy and the crypto sector, these are at the margin, and many such positions can be volatile. There is a real, albeit temporary, clustering of non-US, especially Italian/crypto, individuals near the 250th mark, but there is no evidence of a mass replacement of US billionaires in the median. Given the lag time for wealth surges to reshape global medians, and the enduring dominance of the US capitalist system, the most likely outcome is reversion to the mean: a US individual is more likely than not to be 250th on July 1, 2025. However, the probability is not overwhelming, reflecting the visible churn seen this year, so I adjust lower than the long-run base rate (which would be 80%+), but still favor a US outcome.",
            "final_probability": 68
        }
    },
    "deliberation_probability": [
        78,
        27,
        77,
        80,
        41,
        74,
        30,
        68
    ],
    "deliberation_mean_probability": 59.375,
    "deliberation_sd": 22.740382582533655,
    "deliberation_probability_result": 59,
    "group_results": {
        "WealthmanagementHighnetworthtracking": {
            "forecaster_to_engage": "AreastudiesunitedstatesUswealthconcentration",
            "response_type": "critique",
            "response": "You vastly underestimate the base-rate resilience of US billionaires when it comes to the churn at the median. Your focus on Italy's recent billionaire surge and the current Italian at 250th mistakes a short-term blip for a durable new trend. Sure, crypto and inheritance waves make for volatile, eye-catching stories—but over a month, mid-tier American billionaires have the numbers, portfolio diversity, and market exposure to elbow their way back into that median spot. Crypto and inheritance fortunes are notoriously unstable: regulatory news, asset sell-offs, or global headlines can destroy billions in hours. Meanwhile, the US stock market's breadth enables nearly algorithmic wealth shifts at this level. Even if you dismiss a total market catalyst, the small valuation noise among the US billionaire 'bench' makes it far more likely for a US name to reappear by July 1. Your 30% probability badly underplays just how powerful sheer statistical momentum remains for US representation at these cutoffs. Don't let recency bias from one Italian's fleeting holding obscure decades of American dominance in this part of the wealth curve."
        },
        "FinancialjournalismBillionairerankingmethodologies": {
            "forecaster_to_engage": "EconomicsInternationalincomeinequality",
            "response_type": "critique",
            "response": "You're clinging too tightly to the historical base rate of US dominance at the median and dismissing clear, structural changes evident in 2024-2025. The argument that '900+' US billionaires ensure statistical odds at the median ignores how the billionaire population is not evenly distributed; giant upward mobility in Italy, Europe, and especially crypto billionaires has remade the median landscape. Devasini isn't some one-off freak event, but the representative tip of a broader surge—look at ten new Italian entries, crypto assets breaking record highs, and stable new global fortunes. Meanwhile, US tech fortunes at the margin are wobbling or even decreasing, as news reports consistently highlight. The idea that idiosyncratic volatility relegates non-US billionaires to the sidelines neglects the fact that, at the median, swings equally affect Americans: there is no moat. With only a month left and no dramatic upward catalyst for US markets in May, you're overvaluing the so-called 'structural' US advantage. It's time to accept that at the margin, the US median is not the default—your 80% probability just doesn't wash with the reality of current trends."
        },
        "EconomicsGlobalwealthdistribution": {
            "forecaster_to_engage": "WealthmanagementHighnetworthtracking",
            "response_type": "critique",
            "response": "You're overconfident in the US median snapback—the same narrative that's been recycled since the first big non-US surges, but it misses the transformation in the composition and volatility of billionaire lists at the margin. The US 'statistical muscle' near the bottom of the billionaire class is real, but you underestimate just how quickly and durably clusters of new fortunes—crypto, inheritance, even cross-border conglomerates—can enter and anchor in the 200–300 rank strata, especially in years with regulatory reforms and asset bubbles that disproportionately benefit non-US actors. Right now, the Italian/crypto 'blip' is underpinned by more than headlines: inheritance waves and major asset price shifts have already happened and aren't about to reverse en masse without a trigger, and we've seen these new entrants persist for multiple quarters before. Your probability is too elevated; it fits past cycles, not the present regime where global wealth distribution is no longer as US-centric even just one rank shy of the median. Recency bias isn't the only risk—so is assuming that structural inertia beats rapid, globalized capital movements now baked into the billionaire ecosystem."
        },
        "EconomicsInternationalincomeinequality": {
            "forecaster_to_engage": "FinancialjournalismBillionairerankingmethodologies",
            "response_type": "critique",
            "response": "Your reasoning underestimates the gravitational pull of the US billionaire cohort at the median. Yes, the surge in non-US billionaires—Italian, crypto, inheritance-based—makes the competition closer than it’s been in a while, but bestseller turnover at the edge of the billionaire threshold is exactly that: high-churn and highly sensitive to market oscillations. You ignore how even modest gains in US equities, or a mild retreat in crypto or European valuations, can flip several ranks in a heartbeat due to how clustered net worths are near the 250th spot. The US 'structural advantage' is just that: a statistical bulwark against short-term reshuffling. The focus on index methodology 'lag' is a red herring—the main entries and exits are updated promptly for major shifts. Betting heavily against US reversion to the median lacks appreciation of how, historically, the US bench fills temporary vacuums quickly, and a month is an eternity in edge-of-list billionaire rankings. A 27% US probability is far too bearish."
        },
        "SociologyElitetheory": {
            "forecaster_to_engage": "EconomicsGlobalwealthdistribution",
            "response_type": "defense",
            "response": "This is finally a voice that gets the power dynamics at play beyond mere asset-counting. The US billionaire population, while enormous, is no longer shielded by the old insulation at the margins—transnational capital, especially in areas like crypto, and dynastic re-shufflings in old money European families are not brief glitches but the new normal in elite mobility. What critics miss is that the churn at the bottom isn't just about US market performance, but about independent asset classes and global mechanisms of elite reproduction that can cement non-US billionaires in those key slots for quarters at a time. You're exactly right that the US bench is less 'deep' at the 250 mark now because more rivals have joined the global game and their fortunes are less correlated with near-term S&P or Nasdaq shifts. It's not just recency bias to notice Devasini and peers holding these positions; it's a structural elite transition. Your 77% probability is aggressive but entirely defensible given base rates meeting real-world shifts."
        },
        "SociologyGlobalizationsociology": {
            "forecaster_to_engage": "AreastudiesunitedstatesUsbusinessdominance",
            "response_type": "critique",
            "response": "You're still hung up on 'reversion to the mean' as if the global billionaire list is governed by some natural law of US dominance, but the evidence from the past year exposes the cracks in that logic. The notion that Italian, crypto, or Asian billionaires clustering at the 250th spot is a 'temporary' phenomenon misses the deeply rooted changes in global wealth creation: transnational asset surges, inheritance booms, and digital assets now operate on timelines and cycles outside the traditional US business cycle. Moreover, your reliance on 'lag time' ignores the remarkably fast entry of new fortunes into the rankings, especially in volatile digital markets. American dominance lower down the rich list is not as entrenched as it was a decade ago; if anything, the current median suggests persistent diversification, not easy reversion. Your 68% is just inertia talking—open your eyes to a more multipolar era of elite wealth."
        },
        "AreastudiesunitedstatesUswealthconcentration": {
            "forecaster_to_engage": "SociologyElitetheory",
            "response_type": "defense",
            "response": "This is one of the only forecasts here that doesn't simplistically overstate 'US base rates' and actually integrates the observed sociological patterns in contemporary billionaire formation. The American economic structure may still pump out the super-rich, but the elite class at the edges of the billionaire pile has diversified: transnational inheritances, new asset classes like crypto, and the institutionalization of European wealth mean that the 250th slot is no longer just a statistical accident waiting to revert to US default. You're precisely right that the US won't always fill every crevice of the rankings at all times, and that shifts like the Italian inheritance wave or crypto billionaire entries aren't just transient, but the result of long-term shifts in global elite formation. Those pushing 70-80% US odds ignore the data on global ranking churn and elite transition. Good call for resisting the default 'US always wins' view."
        },
        "AreastudiesunitedstatesUsbusinessdominance": {
            "forecaster_to_engage": "EconomicsGlobalwealthdistribution",
            "response_type": "critique",
            "response": "You're letting headline-grabbing narratives about inheritance waves and the internationalization of billionaire ranks obscure the mathematical reality: the US has a deep, diversified bench at the 200–300 range that can absorb quite a bit of turbulence. The persistence of US billionaires at the median is not just a function of inertia—it reflects thousands of tightly packed fortunes backed by robust public markets and diversified private holdings. The cluster of Italian and crypto entrants may look durable short-term, but history shows these surges often reverse or see individuals drop out due to volatility, regulatory hits, or market revaluations. You say a 'trigger' is needed for reversal, but even routine fluctuations in US stock prices or portfolio valuations are enough to push a US billionaire right back onto median turf—especially with a month to go and active June markets ahead. Betting so strongly on the durability of this new 'globalized' median at the expense of US base rates and historical stickiness at the cutoff is overconfident, bordering on blinkered. The center can—and likely will—hold."
        }
    },
    "revision_results": {
        "WealthmanagementHighnetworthtracking": {
            "my_phase1_final_probability": 78,
            "reasoning_for_revised_probability": "After reviewing group deliberation, the divide between high and low probabilities largely hinges on whether recent surges in Italian/crypto billionaires are seen as structural or transitory at the median. The strong US base rate (large and resilient billionaire pool) and the inherent volatility of non-US/new wealth support the likelihood of reversion to a US billionaire at #250. Critiques of more pessimistic US forecasts reinforced my view: the short time frame and frequency of list churn favor the US, barring a major shock. However, the consensus among several credible specialists (EconomicsGlobalwealthdistribution, AreastudiesunitedstatesUswealthconcentration) and their persuasive acknowledgment of the immediate status quo—an Italian at #250—argue against extreme confidence. I modestly reduce my probability to account for the stickiness of European/crypto fortunes, which could persist short-term without a market/currency catalyst, but still weight the probability in favor of the US based on underlying demographics, wealth stability, and historical patterns.",
            "revised_probability": 73
        },
        "FinancialjournalismBillionairerankingmethodologies": {
            "my_phase1_final_probability": 27,
            "reasoning_for_revised_probability": "The group deliberation reveals a wide split: some forecasters (notably those focused on US wealth management, US business dominance, and international inequality) strongly emphasize the US base rate and the statistical resilience of American billionaires circulating in and out of the median slot, while others (especially using wealth distribution and area studies with a global lens) highlight structural changes brought about by surges in non-US and crypto fortunes. No one provided compelling evidence of an imminent upward catalyst for US fortunes at the margin before July 1, and my polemic critique of the base rate argument underscores that US dominance isn't as sticky at the median as at the summit. Nevertheless, the deliberation underscores that the uncertainties are genuine: minor market changes or crypto volatility could quickly flip the 250th slot. Given the strong contestation and the underlying unpredictability of both crypto and tech-heavy wealth movements—and acknowledging that my initial estimate possibly underweighted the 'reversion' tendency when a gap is not large—I am nudging my probability up slightly. However, I remain below 50% due to the fundamental trends and current snapshot. Revised probability: 33%.",
            "revised_probability": 33
        },
        "EconomicsGlobalwealthdistribution": {
            "my_phase1_final_probability": 77,
            "reasoning_for_revised_probability": "Group deliberation revealed a notable split between forecasters who see US base-rate dominance as decisive and those, like myself, who recognize persistent structural shifts at the median. Critiques (including my own) highlighted that volatility and new international entrants—especially from Italy and crypto—are stickier than mere transients, given inheritance booms and durable asset surges. On the flip side, the strongest arguments for a US return centered on both the sheer volume of US billionaires and the latent volatility on the marginal slots. However, the last few months have already absorbed high crypto and European volatility without a US median snapback. There is no clear imminent catalyst (like a major US market rally or crypto crash) to force a rapid reversal before July 1. While a complete disregard for US statistical momentum would be rash, the additional arguments slightly reinforce my view that the new normal is a non-US median, though with modestly increased downside risk if the US market suddenly rallies. On balance, the information warrants only a slight reduction in confidence—by 2 percentage points—to reflect open tail risk for US median resurgence.",
            "revised_probability": 75
        },
        "EconomicsInternationalincomeinequality": {
            "my_phase1_final_probability": 80,
            "reasoning_for_revised_probability": "Reviewing the group deliberation reinforced the sharp divide between base rate-focused forecasters (like myself and others who emphasize US billionaire dominance) and those who stress the recent surge and persistence of non-US, especially Italian and crypto, entrants. Critiques of heavy reliance on historical structural advantage did remind me that the median is more sensitive to sudden regional/sectoral fortune surges than, say, the top 10. However, I found the more bearish forecasts (sub-50% US), and even the mid-range ones, to underweight just how statistically lopsided the US billionaire cohort remains, and how median volatility often results in US billionaires reclaiming the median quickly after blips. There is merit in noting the Italian/crypto position could persist, but with a month left, and given recent US market outperformance and the tendency for US names to reassert at exactly these thresholds, my confidence remains quite high. Nevertheless, I’ll modestly lower my probability to acknowledge the persistence risk highlighted by the criticism and the lack of an obvious short-term catalyst for US upward movement. The probability of a US median on July 1, 2025 stands at 75%.",
            "revised_probability": 75
        },
        "SociologyElitetheory": {
            "my_phase1_final_probability": 41,
            "reasoning_for_revised_probability": "The group deliberation reinforced the salience of recent non-US billionaire surges (particularly Italy/crypto) as more than a transient blip. Both critiques and defenses highlighted that these new entrants, especially those stemming from transnational wealth channels and inheritance booms, have demonstrated persistence at the median in similar timeframes. Critiques of the high-confidence US median snapback (e.g., WealthmanagementHighnetworthtracking's 78%) failed to convincingly rebut the core point that the old margin buffer of US dominance is eroding due to independent asset cycles and elite transition dynamics, a trend I already weighted heavily but see further validated by the broader argument consensus. At the same time, the group pushed me to acknowledge how close these probabilities remain and how quickly net worth clusterings can pivot on asset volatility. The gap between US and non-US at the median is now a coin-flip region—not as low as 27% but not robustly in favor of the US either. However, further review makes me slightly more confident that global wealth dispersion and elite turnover, especially absent a large late-June US rally or spectacular crypto collapse, will keep the 250th spot non-US this cycle.",
            "revised_probability": 38
        },
        "SociologyGlobalizationsociology": {
            "my_phase1_final_probability": 74,
            "reasoning_for_revised_probability": "Group deliberation has surfaced a stronger case for the durability of the recent Italian/crypto surge at the median and provided further evidence that these global shifts are more than a short-term blip. Some arguments highlighted that recent midlist wealth transfers, particularly inheritance and crypto-driven gains, can persist for months, with less sensitivity to US market churn than in past cycles. While I am not persuaded by extremely low odds for a US median, the critical mass of international billionaires at the 200–300 ranks and the recency of their accumulation means the statistical inertia of the US is less decisive than it once was. Volatility can quickly flip the median, but the specific combination of inheritance booms, European entrance, and crypto market stickiness argues for a decreased probability that the median will revert to the US in just a month without a clear catalyst. Thus, I am compelled to nudge my probability downward.",
            "revised_probability": 62
        },
        "AreastudiesunitedstatesUswealthconcentration": {
            "my_phase1_final_probability": 30,
            "reasoning_for_revised_probability": "The group deliberation reaffirms my analysis that the status quo—an Italian (Devasini) at the 250th spot—reflects real, structural changes in global billionaire distribution, not just a passing blip. Multiple forecasters, especially from economics, journalism, and sociological perspectives, note that the wave of non-US (mostly Italian, European, and crypto) billionaires entering or maintaining positions around the median is more than noise; it's a new phase in global elite wealth building. The bullish US base-rate arguments are challenged convincingly: US 'bench strength' doesn't guarantee constant median dominance, especially as new billionaire pipelines (inheritance, crypto) become more entrenched. No compelling evidence suggests a US median snapback is likely in the coming month, barring a disruptive event (e.g., crypto crash or massive US market rally), and the time horizon is too short for a structural reversion. Therefore, my initial probability remains valid.",
            "revised_probability": 30
        },
        "AreastudiesunitedstatesUsbusinessdominance": {
            "my_phase1_final_probability": 68,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I'm less convinced that the probability should remain above two-thirds. While my initial reasoning emphasized the US's overwhelming depth and reversion to the mean, several persuasive points were surfaced by others—especially regarding the durability of inheritance-driven and crypto wealth surges in Italy and elsewhere and the recent persistence of new entrants clustered near the 250th spot. The critique of relying too much on base rates, while ignoring the current, well-documented anomaly of an Italian median and the broader internationalization of the billionaire population, is valid. The risk of recency bias cutting both ways is real—yet the statistical weight of over 900 US billionaires and the volatility of margins still lend the US an edge, though a smaller one. I now judge the US's edge as thinner and would shade my forecast lower, giving nearly even odds to a rapid US resurgence but acknowledging the plausible persistence of the new international cohort.",
            "revised_probability": 60
        }
    },
    "revision_probability": [
        73,
        33,
        75,
        75,
        38,
        62,
        30,
        60
    ],
    "revision_mean_probability": 55.75,
    "revision_sd": 19.24095334733406,
    "revision_probability_result": 56,
    "question_details": {
        "id": 37394,
        "title": "Will the median person on Bloomberg's Billionaires Index be from the United States on July 1, 2025?",
        "description": "On April 30, 2025, the 250th-ranked name on the list was Giancarlo Devasini of Italy",
        "created_at": "2025-05-24T05:50:07.107902Z",
        "open_time": "2025-05-29T08:00:00Z",
        "cp_reveal_time": "2025-05-29T10:00:00Z",
        "spot_scoring_time": "2025-05-29T10:00:00Z",
        "scheduled_resolve_time": "2025-07-01T00:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-05-29T10:00:00Z",
        "actual_close_time": "2025-05-29T10:00:00Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "resolution_criteria": "This question resolves as **Yes** if the person ranked 250th on the Bloomberg Billionaires Index (available at [this link](https://www.bloomberg.com/billionaires/)) is listed as being from the United States, when accessed by Metaculus Admins on or after July 1, 2025. It resolves as **No** if the 250th-ranked person is from any other country.",
        "fine_print": "For purposes of this question, the \"median\" from the question's title is defined as the 250th ranked person on the Bloomberg Billionaires Index, no matter how many are on the list.",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_max": null,
            "range_min": null,
            "zero_point": null
        },
        "group_rank": null,
        "post_id": 38088,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {}
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {}
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {}
            }
        },
        "nr_forecasters": 70,
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Who is the Richest Man in the World in 2025?**\nAccording to Forbes, Elon Musk is the richest man in the world in 2025, with a fortune valued at $386.5 billion. His leadership in the electric vehicle market, space exploration, and artificial intelligence has contributed to his success. Musk's net worth increased by $46 billion in April, solidifying his position as the leader in these sectors. Jeff Bezos, founder of Amazon, comes in second with a fortune of $201.6 billion, despite a $5.3 billion loss due to a 4% decline in Amazon's stock price. Mark Zuckerberg, CEO of Meta, ranks third with a net worth of $190 billion, despite a $9.3 billion decline in his fortune due to a 5% drop in Meta's stock price. Larry Ellison, founder of Oracle, comes in fourth with a net worth of $176.9 billion, thanks to the growth of Oracle and his participation in the Proyecto Stargate. Warren Buffett, who announced that he will leave the direction of Berkshire Hathaway at the end of 2025, ranks fifth with a net worth of $166.4 billion. Bernard Arnault, president of LVMH, ranks sixth with a net worth of $146.5 billion, despite a 14.6 billion decline in his fortune due to a 15% drop in LVMH's stock price. The ranking of the world's richest people is not just about accumulated wealth, but also about their ability to adapt to a changing economic environment. The recovery of Tesla was essential for Musk, and he has taken advantage of opportunities in the technology sector. Other individuals, such as Bezos, Arnault, and Ellison, have also increased their wealth during this period. Despite market volatility, most of the billionaires have managed to maintain or increase their wealth, suggesting that certain sectors continue to thrive. The diversification of investments and innovation in their respective fields have been key to their success.\nOriginal language: es\nPublish date: May 28, 2025 08:47 PM\nSource:[LaRepublica.pe](https://larepublica.pe/mundo/2025/05/28/quien-es-el-hombre-mas-rico-del-mundo-en-2025-descubre-a-cuanto-asciende-su-fortuna-evatia-1500604)\n\n**Forbes Releases 2024 Billionaires List: Record Number of 3,028 Billionaires Worldwide**\nForbes magazine has released its 2024 Billionaires List, which shows a record number of 3,028 billionaires worldwide, with a total wealth of $16.1 trillion, a 2 trillion dollar increase from last year. The list includes 35 Turkish billionaires, with Murat Ülker being the richest with a net worth of $5.5 billion. The top 5 billionaires in the world are Elon Musk ($342 billion), Mark Zuckerberg ($216 billion), Jeff Bezos ($215 billion), Larry Ellison ($192 billion), and Bernard Arnault ($178 billion). Donald Trump's wealth has doubled to $5.1 billion in the past year. The United States has the most billionaires with 902, followed by China with 516 and India with 205. The number of female billionaires has also increased to 406, with Alice Walton being the richest with a net worth of $101 billion. The average age of billionaires is 66, with George Joseph being the oldest at 103 and Johannes von Baumbach being the youngest at 19.\nOriginal language: tr\nPublish date: May 28, 2025 08:00 AM\nSource:[karar.com](https://www.karar.com/hayat-haberleri/milyarderler-rekabeti-arttirdi-dunyanin-en-zenginleri-secildi-1963304)\n\n**Thailand's second-richest man Charoen Sirivadhanabhakdi transfers stakes in major firms to heirs - VnExpress International**\nCharoen Sirivadhanabhakdi, Thailand's second-richest person, has transferred his full stake in Sutthasup 9 Company to his five children as part of his succession plan. The company, which has indirect control over three of his conglomerate's core companies, has redistributed its shareholdings equally among his heirs. According to late Monday filings by Asset World Corp and Berli Jucker, the restructuring of their major shareholders will not affect their management, operations, or strategic direction. Charoen, the 81-year-old founder and chairman of TCC Group, is seen as passing the torch to the next generation in a structured way, having stepped down as chairman of Fraser and Neave in January and retired as chairman of Frasers Property in February. With an estimated net worth of US$11.6 billion, he ranks as the country's second-richest individual after energy magnate Sarath Ratanavadi, according to the Bloomberg Billionaires Index.\nOriginal language: en\nPublish date: May 28, 2025 05:15 AM\nSource:[VnExpress International – Latest news, business, travel and analysis from Vietnam](https://e.vnexpress.net/news/business/billionaires/thailand-s-second-richest-man-charoen-sirivadhanabhakdi-transfers-stakes-in-major-firms-to-heirs-4891229.html)\n\n**Top 20 Richest People In The World: Forbes Billionaires List 2025**\nForbes has released its 2025 list of the top 20 richest people in the world. The list is led by Elon Musk with a net worth of $389.4 billion, followed by Jeff Bezos with $206.7 billion and Mark Zuckerberg with $206.4 billion. The top 10 richest people include Larry Ellison, Warren Buffett, Bernard Arnault, Larry Page, Sergey Brin, Steve Ballmer, and others. The list is based on the net worth of each individual, which is calculated using a combination of financial data, market valuations, and public records. Musk's net worth is largely due to his ownership of Tesla, which he helped start, and his recent purchase of Twitter for $44 billion. Bezos' net worth is largely due to his ownership of Amazon, which he started in 1994. Zuckerberg's net worth is largely due to his ownership of Facebook, which he started in 2004. The list also includes other notable billionaires such as Bill Gates, Michael Bloomberg, and Carlos Slim Helu. According to Forbes, the net worth of the top 20 richest people in the world is over $2.5 trillion.\nOriginal language: en\nPublish date: May 04, 2025 01:52 AM\nSource:[townflex.com](https://townflex.com/top-20-richest-people/)\n\n**Canva Founders & Kerry Stokes Make Top Ten Appearance In 2025 AFR Rich List**\nThe 2025 Australian Financial Review Rich List has been released, with Canva co-founders Melanie Perkins and Cliff Obrecht ranking sixth with a combined wealth of $14.14 billion. Seven Group Holdings chairman Kerry Stokes joins them in the top ten, with a net worth of $12.69 billion, a $1 billion increase from last year. The top 10 richest individuals in Australia now control $202 billion, a 9.2% drop from last year. Gina Rinehart retains the top spot for the sixth consecutive year, with a wealth of $38.11 billion. Rich List editor Yolanda Redrup noted that making it onto the list has never been harder, and that the business achievements of this year's 10 debutants are even more impressive. This year also marks a record number of Australian billionaires, with 161 in total, and a record 16 billionaires in the elite 'ten-digit club'.\nOriginal language: en\nPublish date: May 28, 2025 11:12 PM\nSource:[B&T](https://www.bandt.com.au/canva-founders-kerry-stokes-make-top-ten-appearance-in-2025-afr-rich-list/)\n\n**Who is the Richest Man in the World in 2025?**\nAccording to Forbes, Elon Musk is the richest man in the world in 2025, with a fortune valued at $386.5 billion. His leadership in the electric vehicle market, space exploration, and artificial intelligence has contributed to his success. Musk's net worth increased by $46 billion in April, solidifying his position as the leader in these sectors. Jeff Bezos, founder of Amazon, comes in second with a fortune of $201.6 billion, despite a $5.3 billion loss due to a 4% decline in Amazon's stock price. Mark Zuckerberg, CEO of Meta, ranks third with a net worth of $190 billion, despite a $9.3 billion decline in his fortune due to a 5% drop in Meta's stock price. Larry Ellison, founder of Oracle, comes in fourth with a net worth of $176.9 billion, thanks to the growth of Oracle and his participation in the Proyecto Stargate. Warren Buffett, who announced that he will leave the direction of Berkshire Hathaway at the end of 2025, ranks fifth with a net worth of $166.4 billion. Bernard Arnault, president of LVMH, ranks sixth with a net worth of $146.5 billion, despite a 14.6 billion decline in his fortune due to a 15% drop in LVMH's stock price. The ranking of the world's richest people is not just about accumulated wealth, but also about their ability to adapt to a changing economic environment. The recovery of Tesla was essential for Musk, and he has taken advantage of opportunities in the technology sector. Other individuals, such as Bezos, Arnault, and Ellison, have also increased their wealth during this period. Despite market volatility, most of the billionaires have managed to maintain or increase their wealth, suggesting that certain sectors continue to thrive. The diversification of investments and innovation in their respective fields have been key to their success.\nOriginal language: es\nPublish date: May 28, 2025 08:47 PM\nSource:[LaRepublica.pe](https://larepublica.pe/mundo/2025/05/28/quien-es-el-hombre-mas-rico-del-mundo-en-2025-descubre-a-cuanto-asciende-su-fortuna-evatia-1500604)\n\n**Forbes Releases 2024 Billionaires List: Record Number of 3,028 Billionaires Worldwide**\nForbes magazine has released its 2024 Billionaires List, which shows a record number of 3,028 billionaires worldwide, with a total wealth of $16.1 trillion, a 2 trillion dollar increase from last year. The list includes 35 Turkish billionaires, with Murat Ülker being the richest with a net worth of $5.5 billion. The top 5 billionaires in the world are Elon Musk ($342 billion), Mark Zuckerberg ($216 billion), Jeff Bezos ($215 billion), Larry Ellison ($192 billion), and Bernard Arnault ($178 billion). Donald Trump's wealth has doubled to $5.1 billion in the past year. The United States has the most billionaires with 902, followed by China with 516 and India with 205. The number of female billionaires has also increased to 406, with Alice Walton being the richest with a net worth of $101 billion. The average age of billionaires is 66, with George Joseph being the oldest at 103 and Johannes von Baumbach being the youngest at 19.\nOriginal language: tr\nPublish date: May 28, 2025 08:00 AM\nSource:[karar.com](https://www.karar.com/hayat-haberleri/milyarderler-rekabeti-arttirdi-dunyanin-en-zenginleri-secildi-1963304)\n\n**Thailand's second-richest man Charoen Sirivadhanabhakdi transfers stakes in major firms to heirs - VnExpress International**\nCharoen Sirivadhanabhakdi, Thailand's second-richest person, has transferred his full stake in Sutthasup 9 Company to his five children as part of his succession plan. The company, which has indirect control over three of his conglomerate's core companies, has redistributed its shareholdings equally among his heirs. According to late Monday filings by Asset World Corp and Berli Jucker, the restructuring of their major shareholders will not affect their management, operations, or strategic direction. Charoen, the 81-year-old founder and chairman of TCC Group, is seen as passing the torch to the next generation in a structured way, having stepped down as chairman of Fraser and Neave in January and retired as chairman of Frasers Property in February. With an estimated net worth of US$11.6 billion, he ranks as the country's second-richest individual after energy magnate Sarath Ratanavadi, according to the Bloomberg Billionaires Index.\nOriginal language: en\nPublish date: May 28, 2025 05:15 AM\nSource:[VnExpress International – Latest news, business, travel and analysis from Vietnam](https://e.vnexpress.net/news/business/billionaires/thailand-s-second-richest-man-charoen-sirivadhanabhakdi-transfers-stakes-in-major-firms-to-heirs-4891229.html)\n\n**Six new billionaires among 10 Rich List debuts this year**\nThis year's Financial Review Rich List features 10 new faces, including a fund manager, two brothers behind a well-known pet shop, and a family running a major steel group. Despite a record-high threshold of $747 million, six of the new faces have enough wealth to be counted among the 161 billionaires on the list, which will be published in full this Friday.\nOriginal language: en\nPublish date: May 27, 2025 07:01 PM\nSource:[Australian Financial Review](https://www.afr.com/rich-list/six-new-billionaires-among-10-rich-list-debuts-this-year-20250514-p5lz2k)\n\n**The Rise of Giancarlo Devasini: From Surgeon to Crypto Billionaire**\nThe Italian TV show 'Farwest' is investigating the world of cryptocurrencies, a sector that has become established in Italy with around 3.5 million people investing in crypto. The show's host, Salvo Sottile, explores the story of Giancarlo Devasini, the president and largest shareholder of Tether, one of the most widely used cryptocurrencies in the world. Devasini, a Torinese-born surgeon who has become the third richest man in Italy with a fortune of over $22 billion, has kept a low profile, refusing to give interviews and not using social media. The show delves into Devasini's past, including his involvement in a major operation against computer piracy and his conviction for selling counterfeit Microsoft software. The episode also explores alternative punishments to prison and the phenomenon of children becoming internet celebrities, with experts providing insight into the complexities of these issues.\nOriginal language: it\nPublish date: May 16, 2025 03:08 PM\nSource:[Il Fatto Quotidiano](https://www.ilfattoquotidiano.it/2025/05/16/farwest-indaga-sul-mondo-delle-criptovalute-come-ha-fatto-uno-sconosciuto-a-diventare-un-cripto-guru-multimiliardario-lanticipazione/7991175/)\n\n**Top 20 Richest People In The World: Forbes Billionaires List 2025**\nForbes has released its 2025 list of the top 20 richest people in the world. The list is led by Elon Musk with a net worth of $389.4 billion, followed by Jeff Bezos with $206.7 billion and Mark Zuckerberg with $206.4 billion. The top 10 richest people include Larry Ellison, Warren Buffett, Bernard Arnault, Larry Page, Sergey Brin, Steve Ballmer, and others. The list is based on the net worth of each individual, which is calculated using a combination of financial data, market valuations, and public records. Musk's net worth is largely due to his ownership of Tesla, which he helped start, and his recent purchase of Twitter for $44 billion. Bezos' net worth is largely due to his ownership of Amazon, which he started in 1994. Zuckerberg's net worth is largely due to his ownership of Facebook, which he started in 2004. The list also includes other notable billionaires such as Bill Gates, Michael Bloomberg, and Carlos Slim Helu. According to Forbes, the net worth of the top 20 richest people in the world is over $2.5 trillion.\nOriginal language: en\nPublish date: May 04, 2025 01:52 AM\nSource:[townflex.com](https://townflex.com/top-20-richest-people/)\n\n**Forbes 2025 List Includes 16 Cryptocurrency Billionaires**\nForbes magazine has announced its annual list of the world's billionaires for 2025, which includes 16 individuals working in the cryptocurrency field, with a total wealth of over $164 billion and an average wealth of $6.8 billion per person. This increase in the number of cryptocurrency billionaires is a direct result of the significant changes that took place in 2024, including the approval of the first Bitcoin ETF and the Bitcoin price breaking the $6 billion barrier. The list is topped by Binance founder Changpeng Zhao, with a net worth of $63 billion, making him the richest person in the cryptocurrency world. Zhao had previously stated in 2023 that he sold his house and invested all his money in Bitcoin, a decision that led to a remarkable financial rise later on. Other notable individuals on the list include the founders of large cryptocurrency projects, such as the CEO of Thether, Giancarlo Devasini, who has a net worth of $22.4 billion. Thether is a leading global company in issuing stablecoins and achieved a record profit of $13 billion last year alone. The company has a staff of less than 100 employees, making this achievement even more impressive. Other notable individuals on the list include the founders of exchanges such as Coinbase, Gemini, and Tron, as well as notable figures such as Justin Sun from Tron, Chris Larsen from Ripple, and Jed McCaleb from Stellar. \nOriginal language: ar\nPublish date: April 04, 2025 06:33 PM\nSource:[مجلة الرجل](https://www.arrajol.com/content/371278/%D8%A5%D8%AF%D8%A7%D8%B1%D8%A9-%D9%88%D8%A3%D8%B9%D9%85%D8%A7%D9%84/%D9%82%D8%A7%D8%A6%D9%85%D8%A9-%D9%81%D9%88%D8%B1%D8%A8%D8%B3-2025-%D8%AA%D8%B6%D9%85-16-%D9%85%D9%84%D9%8A%D8%A7%D8%B1%D8%AF%D9%8A%D8%B1%D9%8B%D8%A7-%D9%85%D9%86-%D8%A7%D9%84%D8%B9%D9%85%D9%84%D8%A7%D8%AA-%D8%A7%D9%84%D8%B1%D9%82%D9%85%D9%8A%D8%A9)\n\n**Forbes Releases Annual List of World's Richest Men**\nThe Forbes annual list of the world's richest men has been released, showing a surge in billionaires globally, with 3,028 individuals, a 247 increase from last year. The total wealth has reached $16.1 trillion, a growth of $2 trillion in just 12 months. Elon Musk tops the list for the second consecutive year with a net worth of $342 billion, followed by Mark Zuckerberg and Jeff Bezos. Larry Ellison, founder of Oracle, ranks fourth with $192 billion, while Bernard Arnault, CEO of LVMH, drops to sixth place with $178 billion due to declining fashion sales. Warren Buffett ranks fifth with $154 billion, followed by Google co-founders Larry Page and Sergey Brin. Giovanni Ferrero is the richest Italian, ranking 41st with a net worth of $38.2 billion, followed by Andrea Pignataro and Giancarlo Devasini. Giorgio Armani ranks 208th with $11.8 billion.\nOriginal language: it\nPublish date: April 03, 2025 01:03 PM\nSource:[Il Fatto Quotidiano](https://www.ilfattoquotidiano.it/2025/04/03/uomini-piu-ricchi-del-mondo-forbes/7939204/)\n\n**Forbes Confirms Elon Musk as World's Richest Person, Italians Dominate Top 100**\nElon Musk, CEO of Tesla and Space X, and owner of X (formerly Twitter), has been confirmed as the richest person in the world by Forbes, with an estimated net worth of $342 billion in March 2025. The list of the world's richest people includes 74 Italians, with Giovanni Ferrero ranking 41st globally and 6th in the EU with a net worth of $38.2 billion. Andrea Pignataro, founder of Ion Group, ranks 53rd globally with a net worth of $34.2 billion, followed by Giancarlo Devasini, CEO of Tether, in 90th place with a net worth of $22.4 billion. Giorgio Armani ranks 4th among Italians with a net worth of $11.8 billion, while Paolo Ardoino, CEO of Tether, ranks 293rd globally with a net worth of $9.5 billion. Piero Ferrari ranks 6th among Italians with a net worth of $9.2 billion, followed by Francesco Gaetano Caltagirone in 7th place with a net worth of $8.2 billion, and Massimiliana Landini Aleotti, owner of Menarini, in 453rd place globally with a net worth of $7.2 billion. The top 10 list also includes Miuccia Prada and Patrizio Bertelli, as well as the eight heirs of Leonardo Del Vecchio, with a combined net worth of $6.6 billion.\nOriginal language: it\nPublish date: April 03, 2025 04:10 AM\nSource:[Il Messaggero](https://www.ilmessaggero.it/economia/news/forbes_classifica_piu_ricchi_elon_musk_ferrero_armani_caltagirone-8754867.html)\n\n**Crypto Billionaires Make Forbes' 2025 World Billionaires List**\nForbes' 2025 World Billionaires List includes Tron founder Justin Sun, who entered the list at 353rd place with an 8.5 billion dollar fortune. Sun is the 16th crypto patron to be included in the prestigious list. The richest person in the crypto world, Changpeng Zhao (CZ), remains at the top of the list with a 62.9 billion dollar fortune. CZ, the former CEO of Binance, increased his wealth by nearly doubling it in a year, despite paying fines and serving four months in prison. The total wealth of the crypto sector representatives on the list exceeds 164 billion dollars. Giancarlo Devasini, the Director of Tether Finance, comes in second with a 22.4 billion dollar fortune, followed by the Gemini co-founders, Cameron and Tyler Winklevoss, who each have a 3.2 billion dollar fortune. Coinbase co-founders Brian Armstrong and Fred Ehrsam also made the list, with Armstrong ranking 311th with a 9.2 billion dollar fortune and Ehrsam ranking 1362nd with a 2.7 billion dollar fortune. Michael Saylor, the President of Strategy, increased his wealth by 3 billion dollars to 7.4 billion dollars, ranking 430th on the list. The company, which changed its name from MicroStrategy to Strategy in February, is the largest institutional Bitcoin holder with approximately 45 billion dollars in investments and 528,185 Bitcoins.\nOriginal language: tr\nPublish date: April 02, 2025 05:07 PM\nSource:[Haberler](https://www.haberler.com/kripto-para/paraya-para-demiyorlar-kripto-para-zenginleri-18490846-haberi/)\n\n**Tether Founders Devasini and Ardoino Enter Italian Billionaires List**\nTether, a cryptocurrency company, has acquired a minority stake in Juventus, with CEO Paolo Ardoino confirming that the stake exceeds 5% of voting rights. The company's founders, Paolo Ardoino and Giancarlo Devasini, have entered the Forbes list of Italian billionaires, with Devasini ranking 5th in Italy and 306th globally with a net worth of $9.2 billion, and Ardoino ranking 24th in Italy and 886th globally with a net worth of $3.9 billion. The two have a combined net worth of $13.1 billion, making them one of the wealthiest individuals in Italy. As stated by Devasini, 'We are proud to have achieved this milestone and look forward to continuing our growth and success.' \nOriginal language: it\nPublish date: February 15, 2025 11:45 AM\nSource:[Calcio e Finanza](https://www.calcioefinanza.it/2025/02/15/patrimonio-paolo-ardoino-giancarlo-devasini/)\n\n**Number of Billionaires in Italy Increases to 71, with a Total Wealth of 272.5 Billion Euros**\nAccording to Ener2Crowd, a platform for green investments, there are 71 billionaires in Italy, with a total wealth of 272.5 billion euros. This is an increase of 61.1 billion euros from 2023, which is equivalent to 166 million euros per day. The list includes new entries such as the children of Silvio Berlusconi, who have entered the ranking after the redistribution of their father's wealth. Other new entries include Andrea Pignataro, founder and CEO of Ion Group, and Giancarlo Devasini and Paolo Ardoino, directors of Tether, a leading issuer of cryptocurrencies. Ugo Gussalli Beretta and his two sons, Pietro and Franco, who run Beretta Holding, the oldest firearms manufacturer in the world, have a total wealth of 2.9 billion dollars. Alessandro Rosano, founder of HeyDude, a shoe company that was sold to Crocs for 2.5 billion dollars in 2022, has a personal wealth of 1.4 billion dollars. Luigi Cremonini, a meat supplier to McDonald's and Burger King, has also returned to the list with a personal wealth of 1 billion dollars.\nOriginal language: it\nPublish date: February 02, 2025 06:25 PM\nSource:[DAGOSPIA](http://www.dagospia.com/cronache/aumenta-numero-miliardari-in-italia-71-patrimonio-complessivo-di-423273)\n\n**Italy's Richest List: 71 Billionaires and Growing**\nAccording to Ener2Crowd, there are 2,300 Italians with a net worth of over 100 million euros, placing Italy 10th in the world in terms of countries with the most billionaires. The number of Italian billionaires has increased to 71, with 5 of them being the children of the late Forza Italia leader Silvio Berlusconi. The total wealth of Italian billionaires has grown by 61.1 billion euros since 2023, reaching 272.5 billion euros in 2024. The top 10 list of Italian billionaires includes Giovanni Ferrero, who remains at the top with a net worth of 43.8 billion euros. Andrea Pignataro, founder and CEO of Ion Group, has entered the list at number 2 with a net worth of 27.5 billion euros. Giancarlo Devasini and Paolo Ardoini, director and CEO of Tether, have also made their debut in the list, ranking 4th and 26th respectively.\nOriginal language: it\nPublish date: February 02, 2025 06:03 AM\nSource:[QuiFinanza](https://quifinanza.it/attualita/miliardari-italia-classifica-2025/879316/)\n\n**Italian Billionaires See Sudden Surge: Berlusconi's Children Make the Cut**\nAccording to a study by Ener2Crowd, there are 71 billionaires in Italy, with a total of 71 individuals possessing a fortune above 1 billion euros. The Forbes list reveals several new entries, including the children of Berlusconi, who have inherited their father's vast fortune. Marina, Pier Silvio, Barbara, Eleonora, and Luigi Berlusconi have all entered the list of Italian and global billionaires, with Marina and Pier Silvio ranking 42nd in Italy and 1545th globally with a combined fortune of $2.1 billion each. The top spot remains Giovanni Ferrero, with a fortune of $40 billion, followed by Andrea Pignataro, founder and CEO of Ion Group, with $27.5 billion. Other notable billionaires include Giancarlo Devasini and Paolo Ardoino, director of finance and CEO of Tether, with fortunes of $9.2 billion and $3.9 billion respectively.\nOriginal language: it\nPublish date: February 01, 2025 06:48 PM\nSource:[Quotidiano Libero](https://www.liberoquotidiano.it/news/economia/41510666/miliardari-una-crescita-sconvolgente-in-italia-chi-c-e-in-classifica.html)\n\n**Italy's Billionaire List Grows to 71, with 10 New Entries**\nThe number of billionaires in Italy has increased to 71, with 10 new entries. Among them are 5 children of Silvio Berlusconi. Other notable new entries include Giancarlo Devasini, director and largest shareholder of Tether, a leading cryptocurrency issuer, with a net worth of $9.2 billion, and Paolo Ardoino, CEO of Tether, with a net worth of $3.9 billion. Tether has issued over 100 billion tokens and reported a net profit of $13.7 billion in 2024. Other new entries include Ugo Gussalli Beretta and his two sons, Pietro and Franco, who run Bertta Holding, the world's oldest firearms manufacturer, with a net worth of $2.9 billion. Alessandro Rosano, founder of HeyDude, a comfortable and affordable shoe company, sold to Crocs for $2.5 billion in 2022, has a net worth of $1.4 billion. Luigi Cremonini, a meat supplier to McDonald's and Burger King, has a net worth of $1 billion and is the 68th and last billionaire on the list.\nOriginal language: it\nPublish date: February 01, 2025 01:38 PM\nSource:[Corriere della Sera](https://www.corriere.it/economia/consumi/25_febbraio_01/crescono-i-miliardari-in-italia-sono-71-con-10-new-entry-5-sono-i-figli-di-berlusconi-gli-altri-sono-meno-noti-518d4506-2136-4c87-8f16-c3dadc4a2xlk.shtml)\n\n**Forbes Releases List of World's Richest People**\nThe world's richest people have been revealed by Forbes, with Bernard Arnault, CEO of LVMH, taking the top spot with a net worth of $209.4 billion. He surpassed Elon Musk, who has a net worth of $266.6 billion, and has maintained his position since January 2024. Musk's net worth has increased due to the success of his companies, including Tesla and SpaceX. Jeff Bezos, founder of Amazon, has a net worth of $202.6 billion and has been ranked as the third richest person in the world. Mark Zuckerberg, co-founder of Facebook, has a net worth of $198.8 billion and has returned to the top 10 list after a significant increase in the value of Meta's shares. Larry Ellison, co-founder of Oracle, has a net worth of $175 billion and has been ranked as the fourth richest person in the world. Sergey Brin, co-founder of Google, has a net worth of $132.4 billion and has increased his wealth by $7 billion in May 2024. Bill Gates, co-founder of Microsoft, has a net worth of $137.2 billion and has been ranked as the seventh richest person in the world. Steve Ballmer, former CEO of Microsoft, has a net worth of $122.5 billion and has increased his wealth by $6 billion in May 2024. The list of the world's richest people is dominated by tech moguls, with many of the top 10 individuals having made their fortunes in the tech industry.\nOriginal language: pt\nPublish date: May 01, 2024 04:50 PM\nSource:[forbes.com.br](https://forbes.com.br/forbes-money/2024/05/bilionarios-2024-quem-sao-as-dez-pessoas-mais-ricas-do-mundo-em-maio/)\n\n",
    "date": "2025-05-29T08:27:17.500349",
    "summary": "Forecasters are divided on whether the median person (250th-ranked) on Bloomberg's Billionaires Index will be from the United States on July 1, 2025. Those favoring a 'Yes' outcome (final probabilities 68-80%) emphasize the historical and statistical dominance of US billionaires, strong US equity market performance, and the sheer size and stability of the US billionaire class. They argue that recent non-US surges (notably Italian, crypto-based, and inheritance-driven fortunes) at the 250th rank are likely temporary, with the US likely to revert to the median spot due to base rates and market churn in the coming month.\n\nConversely, forecasters favoring a 'No' outcome (final probabilities 27-41%, with one at 77%) highlight the recent surge of non-US billionaires—especially from Italy and the crypto sector—pushing a non-American (Giancarlo Devasini) to the median as of April 30. They note that internationalization is accelerating, with base rates for US dominance at the median less secure than before. The short time horizon (about a month) and the volatility and continued entry of non-US billionaires (particularly from Europe and emerging markets) suggest this new dynamic could persist through July 1, 2025, unless there is a significant US market rally or a major drop in non-US fortunes.\n\nMost forecasters agree the outcome will be close and driven by late-breaking market or crypto volatility. Some argue the historical US base rate edge still gives the US the advantage, while others believe current trends point to a non-US billionaire remaining at the median by July 1. The median probability estimate across all experts is near 50%, but the consensus clusters into two camps: one moderately confident in a US outcome, the other moderately confident in continued non-US representation at the 250th slot."
}