{
    "deliberation_results": {
        "FinancialServicesComplianceCftcRegulation": {
            "time_to_resolution": "Approximately 1 month (forecast date: May 31, 2025; question resolves June 30, 2025).",
            "perspective_relevance": "As an expert in CFTC Regulation and Financial Services Compliance, I am uniquely positioned to evaluate Kalshi’s legal/regulatory risks, operational continuity prospects, and to parse the nuanced battle between state gaming authorities and federal commodity regulation. My experience allows for an evidence-based assessment of compliance, likelihood of ongoing enforcement actions, and the practicalities of exchange operation under legal uncertainty.",
            "status_quo": "As of late May 2025, Kalshi is actively offering daily MLB markets, has recently won a preliminary injunction in Nevada, and is continuing to operate in other states despite ongoing litigation and regulatory scrutiny.",
            "perspective_derived_factors": [
                {
                    "factor": "Federal vs. State Regulatory Precedent",
                    "effect": "Positive — Kalshi's partial legal victory and the willingness of federal courts to allow ongoing operation under CFTC oversight, even in the face of state resistance, increases the probability that their MLB markets will remain up for the next month. The Nevada federal court’s injunction is particularly salient; it establishes Kalshi can operate during legal proceedings."
                },
                {
                    "factor": "Ongoing Legal Disputes and Cease-and-Desist Orders",
                    "effect": "Negative — Active disputes in Nevada, New Jersey, Illinois, and other states represent real operational risk. If a negative court ruling (permanent injunction, federal reversal, CFTC action compelled by political pressure, etc.) occurs in June, Kalshi might cease baseball contracts, especially if court intervention is unanticipated or emergency in nature."
                },
                {
                    "factor": "CFTC Leadership and Federal Political Winds",
                    "effect": "Positive — The CFTC has not shut Kalshi down, and the elevation of a Trump-supported CFTC chair and previous Kalshi board member suggest a regulator unlikely to intervene harshly in June, increasing the platform’s safety in the short term."
                },
                {
                    "factor": "Industry and Political Pushback (NBA, MLB, Casinos)",
                    "effect": "Negative — While casino and league opposition is fierce and could contribute to emergencies (league lawsuits, pressure generating new federal/state action), these efforts typically move slowly and have not yet stopped Kalshi, suggesting only moderate risk in June."
                },
                {
                    "factor": "Kalshi’s Operational Continuity and Business Incentives",
                    "effect": "Positive — Kalshi’s aggressive strategy, business success, and ongoing major partnerships (e.g., Robinhood) imply they will fight hard to avoid interrupting MLB markets, particularly during a period of peak sports betting interest."
                },
                {
                    "factor": "Possible CFTC Roundtable/Federal Action in Response to Heightened Scrutiny",
                    "effect": "Slight Negative — A sudden adverse CFTC action prompted by regulatory roundtables or increased Congressional pressure could force Kalshi to halt sports markets, but this is unlikely to move quickly enough to interrupt daily MLB markets in June."
                }
            ],
            "no_scenario": "A major, unforeseen legal ruling—such as a reversal of the Nevada federal injunction, a nationwide restraining order, or CFTC emergency action—forces Kalshi to halt all sports markets, including daily MLB contracts, at any point in June. Alternatively, a compliance or technical failure temporarily stops the offering of baseball markets for a full day or more.",
            "yes_scenario": "Kalshi continues to aggressively defend its right to operate under federal regulation and no court or agency acts with sufficient speed or authority in June to halt or materially disrupt its daily MLB markets. All MLB game days see at least one market listed, continuously, throughout June 2025.",
            "final_reasoning": "Base rate for similar disruptions in the fast-moving world of legal technology platforms facing regulatory threats is low—platforms often continue operating through lengthy litigation. Kalshi has already shown legal resilience (Nevada injunction), and the current CFTC regime is supportive, with no sign of imminent federal shutdown. However, substantial state and industry pressure and ongoing litigation create a persistent, if moderate, risk of judicial or regulatory intervention disrupting operations on short notice. Given the short time to resolution, Kalshi's risk-tolerant business posture, and the inertia of the judiciary/regulatory process, I judge the probability of Kalshi offering at least one MLB market every single day in June 2025 as high, but short of certainty due to ever-present 'black swan' legal risk or unexpected technical/operational failures. This justifies an 85% forecast.",
            "final_probability": 85
        },
        "FinancialServicesComplianceKycAmlStandards": {
            "time_to_resolution": "31 days until June 2025 begins; 61 days until question resolution (June 30, 2025).",
            "perspective_relevance": "As an expert in Financial Services Compliance (KYC/AML Standards), I have deep insight into how evolving regulatory, licensing, and federal-state conflicts affect the operational continuity and risk calculus for novel financial platforms like Kalshi. My expertise specifically informs the ability of Kalshi to navigate anti-money laundering, customer verification, and cross-border/state compliance pitfalls, which are all factors that could cause abrupt disruptions to their daily market operations.",
            "status_quo": "Kalshi has, for the past several months, actively offered sports prediction markets, in particular for baseball games, nationwide despite facing vigorous state-level legal challenges and federal regulatory scrutiny. As of end-May 2025, Kalshi is operational and still offering daily MLB markets amid ongoing litigation.",
            "perspective_derived_factors": [
                {
                    "factor": "Legal Injunctions and Pending Court Rulings",
                    "effect": "Decreases probability. The ongoing federal case in Nevada and the possibility of adverse new rulings or emergency injunctions present significant operational risks throughout June."
                },
                {
                    "factor": "Federal Regulatory Stance (CFTC)",
                    "effect": "Slightly increases probability. The CFTC has permitted Kalshi to offer their markets to date and has not imposed shut-down orders, but ongoing public roundtables and regulatory debate could create sudden changes."
                },
                {
                    "factor": "Kalshi's Aggressive Legal/Operational Strategy",
                    "effect": "Increases probability. Kalshi has consistently ignored state-level cease-and-desists on the grounds of federal preemption, and so far, courts have allowed them to proceed."
                },
                {
                    "factor": "State Enforcement Capabilities and Political Pressure",
                    "effect": "Decreases probability. Recent events show a coordinated pushback from powerful state regulators (Nevada, Illinois, New Jersey), and a concerted effort including emergency legal maneuvers or direct DOJ involvement could force a nationwide halt."
                },
                {
                    "factor": "Compliance Infrastructure (KYC/AML, Responsible Gaming)",
                    "effect": "Slightly decreases probability. Concerns from the NBA, state regulators, and FinCrime professionals about insufficient customer protections could trigger action by either the CFTC or DOJ leading to a temporary or permanent pullback."
                },
                {
                    "factor": "Platform Resiliency and Market Demand",
                    "effect": "Increases probability. Kalshi’s proven technical ability to keep markets running, coupled with massive trading volumes and public investor backing, suggests a high capacity to withstand legal maneuvering and continue daily operations."
                }
            ],
            "no_scenario": "On or before one day in June 2025, a federal judge rules for a preliminary injunction (e.g., after NRA's intervention), or the CFTC issues a new directive/temporary halt for sports contracts, or Kalshi voluntarily pulls MLB markets for remediation in response to a regulatory review or technical compliance investigation (e.g., a KYC/AML failure, or underage access issue flagged by media or regulators). This leads Kalshi to skip offering at least one market on a day with major league baseball games.",
            "yes_scenario": "Kalshi’s legal team continues to prevail in delaying state enforcement; no new CFTC or federal emergency order is issued; Kalshi’s compliance controls pass muster against ongoing scrutiny; and technical or operational errors do not disrupt service. For every day of June 2025 with an MLB game played, at least one relevant market is posted before the day ends and there are no regulatory interruptions.",
            "final_reasoning": "The baseline is that Kalshi has thus far successfully withstood state-level legal attacks by leveraging federal oversight (CFTC), securing recent court victories (notably, the federal injunction in Nevada), and maintaining continuous daily markets (including sizable ones during March Madness and regular MLB games). The platform has considerable financial and political backing, and the current federal regulatory environment under Trump is relatively favorable. However, ongoing state opposition is intensifying (e.g., NRA intervention in Nevada, NBA and MLB vocalizing concerns, Illinois sending cease-and-desist orders), and there is a credible risk of an emergency legal event—such as a temporary injunction or sudden CFTC policy shift—triggered by mounting criticism, especially over compliance shortcomings or consumer risk. Concretely, offering daily markets for every single day in June is difficult for any challenger platform under aggressive regulatory fire, since the barrier is absolute (a single-day interruption resolves this as No). I assign a base estimate of 60% given Kalshi’s recent track record, but subtract for the real chance of sudden legal interruption typical in compliance-driven industries, then add back for the Trump administration/CFTC’s permissive posture. Factoring in all angles and the fact that Kalshi is operational as of May 31, 2025, I forecast this outcome at 67%—leaning Yes, but allowing a significant (one in three) chance that a court or regulator causes a temporary suspension for at least one day.",
            "final_probability": 67
        },
        "UsGamingLawFederalGamblingLaw": {
            "time_to_resolution": "Approximately 1 month and 0 days until the end of June 2025",
            "perspective_relevance": "As an expert in US Gaming Law, specializing in federal-state relations and the statutory distinctions between commodity trading and sports betting, I bring specialized knowledge of the legal foundations Kalshi relies upon, the scope and limits of CFTC jurisdiction over prediction markets, and the ways in which ongoing federal court cases and state enforcement actions shape what prediction markets can lawfully offer. This expertise allows for an informed assessment of the operational and legal risks to Kalshi offering daily MLB markets nationwide in the face of both federal and state legal contestation.",
            "status_quo": "As of late May 2025, Kalshi continues to offer sports markets (including MLB games) nationally, using its status as a federally regulated designated contract market under the Commodity Futures Trading Commission (CFTC). However, it faces aggressive legal challenges from multiple states and ongoing litigation about the legality of its product in various jurisdictions.",
            "perspective_derived_factors": [
                {
                    "factor": "Federal preemption and CFTC regulatory authority",
                    "effect": "Increases probability: Kalshi's operations are currently justified by their CFTC regulatory status. Federal courts have, for now, allowed Kalshi to continue operating, even in Nevada—suggesting a strong, if not yet definitive, presumption that federal commodity regulations preempt state gambling laws. This supports continued daily market offerings."
                },
                {
                    "factor": "Active state-level enforcement and litigation",
                    "effect": "Decreases probability: States such as Nevada, New Jersey, and Illinois have issued cease-and-desist orders, and some are pursuing court intervention. If any court issues a nationwide injunction (not limited to those states), or if Kalshi is compelled by the CFTC to suspend or alter their MLB market products, they may halt daily offerings."
                },
                {
                    "factor": "Ongoing judicial proceedings and recent legal victories",
                    "effect": "Increases probability (slightly): As of May 2025, Kalshi has won significant interim rulings, including temporary restraining orders and preliminary injunctions permitting continued operation in Nevada. This suggests the federal courts are, in the short term, more willing to allow Kalshi's business model to continue pending ultimate resolution."
                },
                {
                    "factor": "Political and regulatory headwinds",
                    "effect": "Neutral/Decreases probability: The increasing scrutiny by sports leagues (NBA/MLB), federal agencies, and state officials create an environment where regulatory risk is high—if enough political pressure mounts (especially with the CFTC’s leadership partially recused/connected to Kalshi), the Commission could reverse course or issue emergency relief curtailing Kalshi’s operations."
                },
                {
                    "factor": "Business incentives for Kalshi & resilience to legal threats",
                    "effect": "Increases probability: Kalshi has signaled an intention to fight all state actions and continue operation unless directly enjoined/ordered by the CFTC to stop. Their recent statements and historical behavior suggest they will maintain daily MLB markets unless forced to halt entirely."
                },
                {
                    "factor": "Scope of question—'every day in June 2025' requires no break in service",
                    "effect": "Decreases probability slightly: If Kalshi suspends MLB markets for a single day (due to an adverse court order, technical issue, or preemptive legal strategy), the question resolves NO. The operational risk is heightened by ongoing, fast-moving litigation."
                }
            ],
            "no_scenario": "A federal judge or the CFTC, in response to mounting state complaints or evidence of regulatory non-compliance, issues an order (injunction or emergency action) requiring Kalshi to halt all or specific MLB prediction markets even temporarily during June 2025. Alternatively, Kalshi decides to voluntarily suspend MLB markets for even a day to avoid contempt, appease regulators, or implement technical/legal changes.",
            "yes_scenario": "Kalshi, emboldened by its ongoing federal legal victories and the lack of compelling new adverse regulatory action, continues to offer at least one MLB market every single day in June 2025, regardless of fluctuations in volume or public controversy. No court or federal/state authority successfully compels a pause or shutdown during that month.",
            "final_reasoning": "The legal environment is highly dynamic but currently favors Kalshi: federal courts have upheld Kalshi's right to operate pending expedited litigation, and the CFTC has not yet acted to halt operations. Kalshi’s leadership signals a willingness to persist unless forcibly stopped. However, the risk that a court, regulator, or Kalshi’s legal department precipitates even a single-day halt remains real, especially if anti-Kalshi factions obtain a new injunction or if a technical or legal misstep (e.g., position limits, complaints about underage betting) occurs. Historically, federal litigation over gaming and jurisdiction rarely produces sudden nationwide shutdowns unless severe fraud or criminality is found, which is not evident here. Operational risk is more likely than sudden regulatory defeat in June 2025. Accordingly, while the balance of probabilities is on continued operation, the fragility of a 'perfect' 30/30 daily record means the risk of a NO event is non-trivial, though less than 30%. Thus, I assess the chance that Kalshi offers MLB markets every day in June 2025 at 76%.",
            "final_probability": 76
        },
        "UsGamingLawStateGamblingLaw": {
            "time_to_resolution": "About 1 month (the question resolves July 1, 2025; today is May 31, 2025).",
            "perspective_relevance": "As an expert in US Gaming Law—specifically state gambling law—I bring in-depth understanding of: (a) the interaction and conflict between federal and state gaming regulatory regimes; (b) how prediction markets are classified legally; (c) base rates and current events related to regulator-market litigation; and (d) the operational realities for platforms facing ongoing legal dispute. This allows a focused assessment of Kalshi's likely legal and business posture in June 2025 under contested regulatory circumstances.",
            "status_quo": "As of late May 2025, Kalshi continues to offer daily markets on MLB games nationwide, operating under federal CFTC regulation, defying cease-and-desist letters from several states but buoyed by recent favorable federal court rulings (including a preliminary injunction against Nevada regulators). Kalshi has been aggressive, signaling intent to operate unless explicitly stopped by a federal directive.",
            "perspective_derived_factors": [
                {
                    "factor": "Federal Regulatory Momentum and Recent Court Rulings",
                    "effect": "Increases probability. Recent federal injunctions (e.g., in Nevada) allow Kalshi to continue business as usual during litigation and set a precedent for continuing to operate in the face of state orders, barring a federal change-of-heart or negative ruling."
                },
                {
                    "factor": "Cease-and-Desist Actions and State Enforcement Practicalities",
                    "effect": "Slightly decreases probability. Multiple states (Nevada, Illinois, New Jersey, Ohio) have issued cease-and-desist letters to Kalshi, signaling strong opposition, but practical enforcement (blocking access, prosecuting executives, freezing accounts) is logistically difficult and, so far, not pursued with real teeth, lessening day-by-day market disruption risk."
                },
                {
                    "factor": "CFTC Position and Leadership/Policy Flux",
                    "effect": "Slightly increases probability. There is no current indication of the CFTC aggressively moving to halt Kalshi's sports markets. Trump administration ties and the CFTC closing a recent Super Bowl investigation without penalties point toward a permissive or at least ambiguous federal stance for the next month."
                },
                {
                    "factor": "Political and Industry Pressure (Leagues, NRA, AGA)",
                    "effect": "Slightly decreases probability. The MLB, NBA, and casino lobbies are pushing hard for federal and state crackdowns, highlighting integrity and consumer protection risks, and could secure a last-minute injunction or legislative action—but courts move slowly, and there's no clear sign of imminent decisive action before July."
                },
                {
                    "factor": "Platform Track Record and Statements of Intent",
                    "effect": "Increases probability. Kalshi's executives have been explicit that they will continue unless the CFTC or a higher federal court explicitly orders them to stop, and they have followed through after multiple state regulatory rebukes. The company's aggressive posture and risk tolerance make interruption less likely barring seismic legal development."
                },
                {
                    "factor": "Operational/Technical Risks (Not Legal)",
                    "effect": "Neutral. There is no evidence of technical or market-access risk (e.g., being deplatformed by banks/processors or broadband ISPs) that would be likely to disrupt daily market posting."
                }
            ],
            "no_scenario": "A No outcome would occur if, on any day in June 2025, Kalshi fails to offer at least one real-money MLB market (e.g., due to a last-minute court-ordered nationwide injunction, emergency CFTC suspension, or unexpected platform outage/withdrawal). Most plausibly, a sudden adverse court decision or proactive federal crackdown could force immediate market suspension, or Kalshi could preemptively halt to avoid enhanced enforcement risk.",
            "yes_scenario": "A Yes outcome occurs if Kalshi maintains its current posture and continues to list at least one MLB market every day in June, regardless of ongoing state litigation and cease-and-desist orders. Court processes, regulatory roundtables, and political maneuvers fail to produce an immediate operational shutdown before July 1, allowing uninterrupted markets through June.",
            "final_reasoning": "The balance of legal, regulatory, and business incentives strongly favor Kalshi continuing to operate daily MLB markets throughout June 2025. Federal court rulings have explicitly permitted operation, and the CFTC has not moved against Kalshi. State attempts at enforcement, while loud, have so far been unenforceable in practice—and federal courts have sided with Kalshi's right to operate pending outcome of broader legal disputes. Politically, while pressure is mounting from gaming and sports lobbies, the likelihood of a new nationwide injunction or regulatory order within 30 days is low given legal timelines. The only plausible disruption would come from a federal court or CFTC surprise action—an increasingly unlikely development given the company's high-profile legal wins and ongoing market activity. Base rates for similar markets facing lengthy legal threats (e.g., PredictIt, Polymarket) also favor continued operation during contested periods, not sudden interruption. Therefore, the only significant tail risk arises from a last-minute preemptive Kalshi shutdown or drastic judicial action, which is not currently signaled in the news flow or legal docket.",
            "final_probability": 94
        },
        "UsMarketExchangesExchangeOperations": {
            "time_to_resolution": "June 2025 is 1 day away (forecast date is May 31, 2025); question resolves at end of June 30, so exactly one month (30 days) to go.",
            "perspective_relevance": "As an expert in US market exchanges (exchange operations), I have deep knowledge of regulatory friction points, CFTC-market structure, state vs. federal jurisdiction, and operational factors for offering regulated event contracts in the US. This expertise informs my analysis regarding Kalshi’s ability to withstand regulatory pushback, meet exchange obligations, and systematically offer daily MLB markets.",
            "status_quo": "As of May 31, 2025, Kalshi is actively offering daily MLB prediction markets (see their sports page), has withstood or is contesting cease-and-desist orders from individual states, and has federal approval under CFTC supervision to operate as a DCM (designated contract market). Kalshi is actively prioritizing sports, with MLB and NBA products accounting for most sports contract volume.",
            "perspective_derived_factors": [
                {
                    "factor": "Federal Legal/Regulatory Environment",
                    "effect": "Increases probability: CFTC oversight is a strong shield and Kalshi has so far received favorable treatment. Court cases in key states are pending, but federal precedent is increasingly in Kalshi’s favor (recent legal wins and no CFTC shutdown)."
                },
                {
                    "factor": "State Enforcement/Backlash",
                    "effect": "Decreases probability: Several large states (Nevada, New Jersey, Illinois, Ohio) have issued cease-and-desist letters and are actively seeking to keep Kalshi out of their markets. While Kalshi is contesting this in court and has injunctions to operate in Nevada, a coordinated multi-state action or court injunction could disrupt operations or cause Kalshi to voluntarily suspend daily markets."
                },
                {
                    "factor": "Operational/Business Incentives",
                    "effect": "Increases probability: MLB is a major anchor for Kalshi’s sports contracts, driving substantial volume. Business incentives are aligned for Kalshi to continue daily MLB markets, particularly in June (mid-season, high fan engagement). They have the operational infrastructure to run daily markets, as shown by NCAA and NBA volume."
                },
                {
                    "factor": "Judicial/Political Developments",
                    "effect": "Slightly decreases probability: While judges have ruled in Kalshi’s favor so far, these are preliminary decisions (e.g., injunctions) and not final rulings. Any adverse, immediate court order (possible if the Nevada Resort Association appeal goes through, or a court finds Kalshi in violation of state law) could halt some or all MLB markets on short notice."
                },
                {
                    "factor": "Exchange Compliance & CFTC Relations",
                    "effect": "Increases probability: Kalshi’s status as a regulated DCM and willingness to follow federal directives (\"If the CFTC tells us to stop, we will absolutely stop, but if they don't, then we won't.\") means only a direct federal action would cause a pullback, which is unlikely in June barring unforeseen scandal or manipulation."
                },
                {
                    "factor": "Negative PR/Pushback From Sports Leagues",
                    "effect": "Marginal decrease: MLB/NBA have expressed 'integrity' concerns, but these are not (yet) leading to direct legal action. If a major scandal broke or league forced a CFTC review, Kalshi might pull or pause contracts — but no evidence of imminent moves."
                }
            ],
            "no_scenario": "A state or coalition of states obtains a temporary restraining order (TRO) or nationwide injunction (possibly through a federal circuit with broad jurisdiction) requiring Kalshi to halt MLB markets until legal issues are resolved, or the CFTC, under pressure, issues emergency guidance suspending all sports event contracts. Operationally, Kalshi could also pull daily MLB markets due to sudden negative legal advice or a technical failure, though latter is less likely.",
            "yes_scenario": "Kalshi, backed by federal injunctive relief and regulatory ambiguity, continues to offer at least one real-money prediction market on every MLB game, every day in June 2025. Cease-and-desist actions remain pending or are constrained to specific states, with no successful national or broad-based injunctions. Status quo persists and operational incentives keep all MLB markets open.",
            "final_reasoning": "Kalshi is running daily MLB markets, secured a recent partial legal win in Nevada, and has not been stopped by state-level C&Ds to date. Operational capacity, incentives, and lack of imminent federal action all support continued daily market offerings. Key risk is legal — courts or CFTC could act, spurred by state pressure or league outrage, but such action (especially one that would affect all daily offerings in June) seems unlikely to occur so suddenly. The strongest base rate is ongoing operation despite months of state opposition and legal wrangling. The biggest tail risk is a rapid adverse legal or regulatory event. No evidence of one is likely in next 30 days; CFTC has not indicated new action, recent legal moves are slow-moving, and the climate is tilting in Kalshi’s favor with federal decision-makers supportive. Thus, the chance of uninterrupted daily MLB markets on Kalshi through June 2025 is high, though not 100%.",
            "final_probability": 91
        },
        "EconomicsMarketMicrostructureTheory": {
            "time_to_resolution": "About 1 month (forecast date: May 31, 2025; question resolves on June 30, 2025)",
            "perspective_relevance": "As an expert in Market Microstructure Theory, I can analyze incentives, order flow, regulatory frictions, and the operational feasibility of maintaining continuous markets. This perspective helps assess the likelihood that Kalshi will manage daily baseball markets against the backdrop of legal, liquidity, and strategic considerations that impact microstructure choices.",
            "status_quo": "Kalshi has pushed aggressively into event contracts on sports (including baseball), operating at scale due to federal CFTC oversight, but faces active opposition from state-level regulators (notably Nevada, Illinois, New Jersey) and US sports leagues. Recently, Kalshi has secured a preliminary legal victory enabling continued operations in Nevada pending further adjudication.",
            "perspective_derived_factors": [
                {
                    "factor": "Federal vs. State Regulatory Environment",
                    "effect": "Decreases probability: State challenges (cease-and-desist orders, legal threats) may force Kalshi to pull markets—even if temporarily—in some states or nationwide if the outcome of ongoing litigation/appeals changes rapidly, particularly as the question requires daily continuity."
                },
                {
                    "factor": "Microstructure Constraints and Liquidity Management",
                    "effect": "Slightly decreases probability: Operating daily MLB markets entails significant continuous liquidity provision and technological/market-making overhead. If legal headwinds intensify or liquidity dries up (perhaps due to fear among liquidity providers or market-makers), Kalshi may skip some days or offerings to mitigate risk."
                },
                {
                    "factor": "Political Backdrop and CFTC Stance",
                    "effect": "Increases probability: The Trump administration’s deregulatory posture and appointments of allies to CFTC have made the agency more permissive, thus emboldening Kalshi. Unless there is a sharp reversal or explicit CFTC intervention, Kalshi is incentivized to press its federal license aggressively."
                },
                {
                    "factor": "Strategic Incentives for Market Coverage",
                    "effect": "Increases probability: To demonstrate resilience and strengthen its precedent-setting legal case, Kalshi has strong incentives to maintain daily baseball markets as a show of both capability and regulatory defiance. Any lapse would undermine this narrative and could be damaging in litigation and PR."
                },
                {
                    "factor": "Sports Leagues’ Opposition and Operational Integrity",
                    "effect": "Moderately decreases probability: Major League Baseball and other leagues have voiced concerns about integrity and want a role in regulating markets. Unexpected legal maneuvering, injunctions, or league-prompted disruptions could force Kalshi to implement a sudden pause or temporary halt on daily markets."
                },
                {
                    "factor": "Recent Precedents/Legal Victories",
                    "effect": "Slightly increases probability: The preliminary ruling letting Kalshi continue in Nevada and federal court signals a higher tolerance for continued operations, at least in the short run."
                }
            ],
            "no_scenario": "In mid-to-late June, a court grants an emergency injunction in response to state action or a league challenge, or Kalshi faces new CFTC limits or enforcement, forcing it to halt MLB trading for a day or more while reviewing compliance or liquidity. Alternatively, a technical or operational disruption (possibly as a result of legal uncertainty or liquidity gaps) leads Kalshi to miss offering a market for a day.",
            "yes_scenario": "Kalshi leverages its current legal victories and the CFTC’s federal regulatory umbrella to operate uninterrupted—either nationwide or by geo-blocking restricted states—offering at least one MLB market every single day in June 2025, regardless of new challenges, due to robust legal risk management and strategic determination to set a precedent.",
            "final_reasoning": "While Kalshi's aggressive regulatory strategy is supported by recent legal wins and a permissive CFTC, its operational continuity for every day in June 2025 is nontrivial, given the number of active adversaries (states, leagues) and the fragility of legal victories pending appeal. The key microstructure risk is that a single lapse (from an adverse legal ruling, injunction, or sharp drop in liquidity) would resolve the question No. However, the underlying incentives, recent victories, and federal regulatory momentum lean in favor of Yes, and Kalshi's narrative is to run through June as a stress test and demonstration. Base rates for uninterrupted daily markets under such regulatory threat are low, but Kalshi appears unusually incentivized and resourced. On balance, I assign a moderate-to-high probability—tempered by a real risk of a legal or liquidity shock closing the market for even one day.",
            "final_probability": 71
        },
        "EconomicsIndustrialOrganization": {
            "time_to_resolution": "Approximately 30 days (June 1-30, 2025); question resolves at the end of June 2025.",
            "perspective_relevance": "As an industrial organization economist, my expertise is directly applicable because this question involves competition between regulatory frameworks (federal vs. state), market structure, strategic firm behavior in the face of legal uncertainty, and the incentives for platform operators when market entry is contested. The economics of two-sided platforms, market contestability, and regulatory arbitrage are all key to understanding whether Kalshi will risk or be able to maintain daily MLB markets, even under regulatory headwinds.",
            "status_quo": "Kalshi is currently offering real-money prediction markets on daily MLB games and other sports, despite cease-and-desist actions from some states. It is regulated federally by the CFTC and is asserting that this preempts state prohibitions. Kalshi recently won a significant, though preliminary, federal court victory permitting continued operation in Nevada during ongoing litigation. No definitive resolution or ban is currently enforced at the national level.",
            "perspective_derived_factors": [
                {
                    "factor": "Regulatory Legal Precedent and Ongoing Cases",
                    "effect": "Decreases probability slightly. Active lawsuits (particularly in Nevada and other states) could result in a sudden injunction, especially if a federal court or the CFTC reverses its favorable stance or delays explicit approval."
                },
                {
                    "factor": "Kalshi's Aggressive Expansion and Federal Backing",
                    "effect": "Increases probability. Kalshi has demonstrated strong will to operate in the face of legal ambiguity, significant financial resources, and influential political allies (e.g., Trump Jr., CFTC connections)."
                },
                {
                    "factor": "Platform Incentives and Engagement (Industrial Org View)",
                    "effect": "Increases probability. Given MLB markets' dominance in Kalshi's trading volume, there are strong profit and network-effect incentives to maintain uninterrupted daily MLB offerings, especially amid rivals and customer retention needs."
                },
                {
                    "factor": "Practical Enforcement Capabilities of State Regulators",
                    "effect": "Increases probability. Even if some states attempt enforcement, Kalshi's argument (and initial court wins) that federal CFTC pre-empts state law means practical ability to force a shutdown is limited until final court decisions."
                },
                {
                    "factor": "Stakeholder Upside/Downside and PR Considerations",
                    "effect": "Slightly increases probability. A sudden mid-season market outage would harm Kalshi's credibility and customer trust, which they are incentivized to avoid unless absolutely compelled by legal orders."
                },
                {
                    "factor": "MLB Calendar and Scheduling",
                    "effect": "Neutral. MLB has a full schedule throughout June, so there are games every day, giving Kalshi no excuse to skip a day besides legal reasons."
                },
                {
                    "factor": "Potential for New CFTC or Court Action in June 2025",
                    "effect": "Decreases probability moderately. If the CFTC is pressured, or a federal judge issues an emergency order, Kalshi could be ordered to halt daily baseball markets even temporarily—historically, sudden regulatory actions can trump corporate intent."
                }
            ],
            "no_scenario": "Federal court, the CFTC, or a state/federal coalition wins or issues an injunction in June forcing Kalshi to immediately halt all or sports-related prediction markets, including daily MLB contests, before June 30th—or Kalshi, anticipating a high risk of prosecution/fines, self-suspends markets on some days as a safeguard. Even a single missed day (due to technical issues, cautious compliance, or legal uncertainty) resolves as No.",
            "yes_scenario": "Kalshi continues current operations, leveraging its legal victories and regulatory ambiguity, and is not forced by any court, regulatory body, or other legal process to stop offering daily real-money prediction markets on at least one MLB game every day in June (i.e., the status quo persists and no disruption occurs—all regulatory or legal action is either unsuccessful or not implemented in June).",
            "final_reasoning": "The base rate for platforms continuing to operate between initial legal wins and final rulings is reasonably high, especially with signs of federal regulatory backing (CFTC and political allies). Kalshi is highly incentivized to continue offering daily MLB markets, with MLB and NBA markets representing a large share of their volume and thus revenue. The most acute downside risk is a sudden court or CFTC action, but available news as of May 31, 2025, suggests that no such action is imminent—the federal judge has promised to move quickly, but unless an emergency order is issued in the next few weeks, Kalshi will almost certainly maintain offerings through June. Historically, legal resolutions in such high-profile, complex cases often lag by months, not weeks, and courts usually avoid disrupting ongoing business in the absence of demonstrated consumer harm. Thus, the probability is not quite at the threshold for an extreme prediction, but is solidly high—the combination of Kalshi's aggressive legal stance, the lack of immediate regulatory clampdown, and economic incentives to avoid any market gaps substantially outweighs the already-factored legal risk for June 2025.",
            "final_probability": 88
        },
        "RegulatoryStudiesAdministrativeLaw": {
            "time_to_resolution": "Just under 1 month (question resolves after June 30, 2025; today is May 31, 2025)",
            "perspective_relevance": "As an expert in Regulatory Studies (Administrative Law), my expertise is directly relevant because the core issue is whether Kalshi can continue to operate daily MLB markets in June 2025 in the face of ongoing federal/state jurisdictional tensions. I bring knowledge of the dynamic between the Commodity Futures Trading Commission (CFTC) as Kalshi’s federal regulator, state gambling laws, legal precedents regarding federal preemption, the power and pace of administrative enforcement, and how injunctions or regulatory action play out procedurally in U.S. courts. A key factor is how legal ambiguity, regulatory inertia, and recent court actions may affect Kalshi’s operations day-by-day.",
            "status_quo": "At present, Kalshi is actively offering daily MLB markets in most states, having secured a preliminary legal victory against Nevada’s cease-and-desist. However, its status is contested by several states and under ongoing court scrutiny.",
            "perspective_derived_factors": [
                {
                    "factor": "Federal Regulatory Shield (CFTC and Commodity Exchange Act)",
                    "effect": "Increases probability. Kalshi currently operates under a federal license as a designated contract market, and recent court rulings have allowed it to continue trading pending final outcomes. Federal regulators have not issued new limitations, and there is a legal argument for federal preemption."
                },
                {
                    "factor": "Active and Escalating State Resistance (Cease & Desist Orders, Legal Challenges)",
                    "effect": "Decreases probability. States including Nevada, New Jersey, Illinois, and others continue to issue cease-and-desist orders, arguing Kalshi is offering unlicensed sports betting. If a new injunction is granted by a state or federal court (possibly influenced by industry groups), Kalshi could be forced to suspend markets abruptly."
                },
                {
                    "factor": "Judicial and Administrative Timelines (Injunctions Not Imminent)",
                    "effect": "Increases probability. Although judges are pledging to 'move quickly,' the wheels of justice tend to turn slowly, and even an expedited timeline likely means any ban or adverse final ruling won't arrive and be enforced before the end of June."
                },
                {
                    "factor": "Political Winds (Trump Administration Deregulation and CFTC Leadership Sympathies)",
                    "effect": "Increases probability, slightly. The Trump administration is portrayed as supportive or at least tolerant of Kalshi-type innovation, and the incoming or current CFTC chair is reportedly a former Kalshi board member, indicating a supportive regulatory environment at the federal level."
                },
                {
                    "factor": "Industry Pushback (Casino and Sportsbook Lobby, Major Leagues)",
                    "effect": "Decreases probability, but not acutely. Stakeholders including the Nevada Resort Association, NBA, MLB, and major sportsbooks are increasing pressure, arguing consumer harm and loss of state tax revenue. Their legal and political influence is high, but immediate effect on Kalshi’s daily operations is limited unless they secure emergency relief."
                },
                {
                    "factor": "Technical/Operational Risk",
                    "effect": "Negligible. Kalshi has demonstrated technical and operational resilience and ample market demand. Technical, not legal, risks are minimal over a 30-day horizon."
                }
            ],
            "no_scenario": "A plausible No scenario involves a court (state or federal) granting an emergency restraining order or preliminary injunction in June 2025—potentially after new, highly publicized incidents, regulatory findings, or lobbying by the casino/gambling industry—forcing Kalshi to halt all or certain sports markets, including MLB, for at least one day in June. Alternatively, the CFTC could issue an emergency administrative action suspending Kalshi’s authority to run daily sports contracts due to mounting pressure or evidence of public harm.",
            "yes_scenario": "In the most likely Yes scenario, Kalshi continues to offer MLB markets every day in June 2025, operating under its current legal shield provided by ongoing litigation and the CFTC’s ongoing acquiescence. The legal environment remains unsettled, but no enforceable order or regulatory change prevents Kalshi from running its markets until after June 30. Even if there is a negative legal ruling, it is not immediately implemented (e.g., stays, appeals, or implementation timelines push a shutdown past June).",
            "final_reasoning": "Kalshi’s ongoing ability to offer MLB markets is under heavy legal contestation but is bolstered by (a) its strong, federally granted regulatory shield, (b) recent favorable injunctions and no direct new CFTC prohibition, (c) the slow pace of final court rulings even with judges promising to 'move quickly,' and (d) federal political conditions conducive to regulatory experimentation. While industry and state resistance is intense and could spike, the immediate probability of a legally enforceable, market-halting order taking effect and being implemented within the next 30 days is modest. The largest risks are 'lightning strike' adverse court actions, which base rates (few analogous interventions have happened so swiftly in the past) and current news suggest are somewhat unlikely. On balance, using a historical base rate of short-term regulatory disruptions in ongoing, high-profile interstate markets—rare, especially when courts have already shown willingness to grant Kalshi continued operation—this all supports a high but not absolute probability for uninterrupted daily MLB markets through June.",
            "final_probability": 89
        },
        "RegulatoryStudiesRegulatoryImpactAnalysis": {
            "time_to_resolution": "Approximately 1 month until resolution (question resolves after June 30, 2025).",
            "perspective_relevance": "As an expert in Regulatory Studies (Regulatory Impact Analysis), I am well-positioned to understand the interplay between federal and state regulation, the implications of recent legal victories for Kalshi, the inertia of regulatory uncertainty, and how enforcement dynamics may impact the ability of a novel market provider like Kalshi to operate without disruption. My expertise allows me to evaluate both the legal precedents and the practical implementation challenges faced by Kalshi as it navigates the complex US regulatory system for prediction and betting markets.",
            "status_quo": "Unless there is a significant new regulatory or judicial intervention, Kalshi continues to offer daily markets on Major League Baseball (MLB) games nationwide by utilizing its federal license; however, it does so against a backdrop of active legal threats and partial (but not full) judicial victories.",
            "perspective_derived_factors": [
                {
                    "factor": "Federal Preemption and Recent Legal Victories",
                    "effect": "Increases probability. Kalshi has secured a temporary injunction/court victories allowing continued sports contracts even in Nevada, and courts have been willing to allow federal CFTC jurisdiction to prevail, at least temporarily."
                },
                {
                    "factor": "Active and Ongoing State Enforcement Actions",
                    "effect": "Decreases probability. Multiple states (Nevada, Illinois, New Jersey, Ohio, potentially others) have issued cease-and-desist orders, and litigation remains ongoing. While Kalshi is currently operating, a negative outcome—particularly a more sweeping injunction or final order—could force a nationwide halt, even if temporary."
                },
                {
                    "factor": "Changing Political and Regulatory Climate",
                    "effect": "Mildly increases probability. With a Trump administration and a CFTC chair sympathetic to prediction markets, the current regulatory window appears more friendly toward Kalshi’s existence. However, this does not neutralize state-based actions in the very near term."
                },
                {
                    "factor": "Operational Resilience and Platform Incentives",
                    "effect": "Increases probability. Kalshi faces strong business incentives to keep markets running and has demonstrated technical and legal agility in keeping service available even amid regulatory headwinds."
                },
                {
                    "factor": "Risk of Orderly or Disorderly Shutdown (Force Majeure Event)",
                    "effect": "Decreases probability. The most significant threat to a full 'Yes' resolution is a sudden interim order/decision causing an emergency, even if only momentarily disrupting service, which would break the required continuity for the resolution criteria."
                },
                {
                    "factor": "Base Rates for Regulator-Induced Suspensions",
                    "effect": "Decreases probability. Historical base rates suggest attempts at running disruptive federally-licensed financial products across 'gray zones' of state-federal regulation often result in at least one temporary interruption, even when ultimate legality is vindicated."
                }
            ],
            "no_scenario": "A judge in an ongoing lawsuit grants a temporary nationwide injunction—possibly in response to arguments made by state regulators, the Nevada Resort Association, or an aligned group—requiring Kalshi to halt all sports-related markets while jurisdiction is clarified. Alternatively, a technical or compliance-related issue (like a CFTC update or significant settlement-related action) causes Kalshi to fail to post a market for a day or more in June, perhaps due to abundance of caution after a regulatory threat.",
            "yes_scenario": "Kalshi, leveraging current judicial protections and federal oversight, maintains uninterrupted daily MLB game markets throughout June 2025, successfully resisting or staying enforcement of any adverse state-level actions, and continues to operate aggressively in the legal gray area while pushing for a final judicial or regulatory framework.",
            "final_reasoning": "Weighing the evidence, Kalshi is currently resilient and has recently won significant temporary relief allowing it to operate, even in the face of aggressive state-level opposition. The shifting regulatory landscape is, at this moment, notably less hostile under the Trump administration's CFTC appointees. However, a key risk for a 'No' outcome is not ultimate legal defeat (which seems unlikely in the next month given the pace of US courts), but rather an interim order or a technical/operational misstep causing a gap in daily market coverage. The requirement is strict: 'every day in June.' Even a brief halt—forced by a new lawsuit, a new regulator's emergency power, or Kalshi's own recalculations around risk—would resolve this as 'No.' On balance, given Kalshi’s aggressive posture, track record of fighting back, and recent temporary victories, I estimate a high but not absolute probability of successful daily offering for all of June. Still, the cumulative risk of a single point failure remains non-trivial, especially in a period of active litigation and evolving case law. Factoring in the base rate of 'gray zone' service interruptions, I judge the chance of a clean, unbroken yes at 82%.",
            "final_probability": 82
        },
        "SportsManagementSportsBettingRegulation": {
            "time_to_resolution": "about 1 month (June 1 to June 30, 2025; forecast date is May 31, 2025)",
            "perspective_relevance": "As an expert in sports management and betting regulation, my insight comes from an understanding of the dynamics between state and federal regulatory regimes, historical parallels in US sports betting liberalization, and the technical, legal, and operational requirements for a platform like Kalshi to continuously offer MLB prediction contracts amidst evolving challenges. The expertise is crucial in grasping obstacles to uninterrupted market offerings (cease-and-desist orders, platform self-censorship, regulatory whiplash, and industry backlash) as well as in evaluating Kalshi's capabilities based on compliance frameworks and its regulatory brinkmanship.",
            "status_quo": "Kalshi is actively offering sports contracts—especially MLB daily contracts, which are among their most traded products—and doing so even as regulatory battles persist in several high-stakes states.",
            "perspective_derived_factors": [
                {
                    "factor": "Legal Precedents and Injunctions Favoring Kalshi",
                    "effect": "Increases probability—recent partial legal victories (e.g., injunctions against Nevada, federal judge siding, CFTC not issuing penalties) allow continued operation in key markets for now."
                },
                {
                    "factor": "Outstanding and Escalating State-Level Legal Risks",
                    "effect": "Decreases probability—multiple states (NV, NJ, IL, OH) have active cease-and-desist orders or legal actions; states could pursue new legal avenues or victories that force Kalshi to suspend sports contracts, especially if coordinated."
                },
                {
                    "factor": "Federal Regulator (CFTC) Position and Uncertainty",
                    "effect": "Somewhat increases and stabilizes probability—CFTC leadership seems favorable (Trump-appointed, ex-Kalshi board member), and the CFTC closed recent cases without penalties; however, the lack of an unequivocal green light leaves geopolitical risk."
                },
                {
                    "factor": "Industry Resistance and Media/Public Backlash",
                    "effect": "Marginally decreases probability—increasing attention from major sports leagues (MLB, NBA), who are stepping up alarms about integrity risk and lack of safeguards, could sway policymakers or prompt public pressure for short-term restrictions."
                },
                {
                    "factor": "Technical/Operational Capability to Offer Daily Markets",
                    "effect": "Increases probability—Kalshi has shown the operational ability and volume to run daily game markets, with significant demand and trading volume, especially with the Robinhood partnership and coverage during March Madness and MLB season."
                },
                {
                    "factor": "Political Climate for Federal Deregulation",
                    "effect": "Increases probability—the current Republican administration, industry champions, and major investors are pushing deregulatory moves and financial innovation, supporting Kalshi's legal strategy."
                }
            ],
            "no_scenario": "A court ruling (possibly via appeal or a state-federal dispute) or a CFTC emergency action compels Kalshi to suspend offering daily MLB markets nationwide, or Kalshi opts for a partial/tactical retreat (e.g., pulling down daily MLB games for select days while legal strategy is reassessed, or technology/geofencing fails to keep state regulators at bay, thus breaking the 'offered every day' resolution criteria). Alternatively, overwhelming pressure from sports leagues or sudden enforcement (possibly coordinated by several states at once) tips Kalshi into over-compliance for risk mitigation.",
            "yes_scenario": "Kalshi continues offering MLB daily markets each day in June 2025, either because ongoing legal proceedings allow status quo operations or because favorable court/CFTC rulings embolden Kalshi to persevere, with technical and regulatory workarounds keeping states at bay, and no decisive new enforcement or adverse development forces a break in daily offerings. Demand and trading volumes remain high, partners (e.g., Robinhood) keep supporting, and reputational risk does not outweigh revenues.",
            "final_reasoning": "Base rates for disruptive platforms surviving legal onslaughts in the US are not high, but Kalshi has already demonstrated substantial legal durability and won several preliminary rounds (Nevada and CFTC). The current regulatory and political signals are favorable: the Trump administration is deregulatory, and state/industry resistance is robust but has not forced a shutdown. However, the window remains open for a legal or enforcement event to force at least a temporary pause in daily MLB game offerings—meaning a single day missed breaks the criteria. Kalshi seems to view the legal risk as worth taking and appears unlikely to proactively self-censor except under direct legal requirement. Given the injured but still prevailing status quo, Kalshi's capacity and risk appetite, the current lack of new news signaling imminent shutdown, and the CFTC's recent quasi-endorsement, the balance of probability is that Kalshi will offer at least one daily MLB market every day in June. But ongoing, high-profile litigation with multiple states and industry resistance means the risk of sudden interruption cannot be dismissed. I conservatively estimate a probability above even odds, but short of certainty.",
            "final_probability": 74
        },
        "SportsManagementEventManagement": {
            "time_to_resolution": "Approximately 1 month until end of June 2025 (forecast date is May 31, 2025)",
            "perspective_relevance": "As an expert in Sports Management (Event Management), I am acutely attuned to the operational requirements, regulatory risks, and industry factors that dictate the consistent, safe, and profitable execution of sports prediction markets. MLB games are routine fixtures in the sports calendar, and ensuring market continuity is core to user trust and business growth. My insight into event planning, regulatory compliance, market demand, and competition provides a practical foundation for evaluating both the ambition and the barriers to Kalshi offering uninterrupted baseball markets.",
            "status_quo": "As of now, Kalshi is actively offering daily sports prediction markets including MLB games and has won preliminary legal victories allowing continued operation, despite ongoing lawsuits and regulatory challenges.",
            "perspective_derived_factors": [
                {
                    "factor": "Active and Growing Demand for MLB Prediction Markets",
                    "effect": "Increases probability. The steady popularity of MLB games, as evidenced by trading volumes on major sports (Super Bowl, March Madness), strengthens the commercial rationale for continuing daily markets. Event continuity is an essential user expectation, and Kalshi’s partnership with Robinhood boosts awareness and accessibility."
                },
                {
                    "factor": "Ongoing and Escalating Regulatory Scrutiny",
                    "effect": "Decreases probability. Multiple states (Nevada, New Jersey, Illinois) have issued cease-and-desist orders; while Kalshi argues federal supremacy, there remains risk of sudden injunctions or operational barriers. The fast-moving Nevada case (with a judge promising expedited action) could disrupt availability at any point, including a full shutdown or pause pending resolution, potentially breaking the 'every day' clause."
                },
                {
                    "factor": "Federal/State Legal Ambiguity and Precedents",
                    "effect": "Decreases probability. While recent legal victories allow operation, these are preliminary, not final. Federal regulators could also intervene (given NBA/MLB objections and CFTC deliberations), creating a non-zero risk of abrupt contractual or policy changes."
                },
                {
                    "factor": "Technical/Operational Reliability",
                    "effect": "Slightly decreases probability. Event management expertise confirms that achieving unbroken market continuity for 30 consecutive days requires robust internal processes and reliable sports schedules. Historically, platforms occasionally experience outages, mis-listings, or other issues causing a missed day."
                },
                {
                    "factor": "Event Calendaring (MLB Schedule)",
                    "effect": "Neutral to slightly positive. MLB is well known for its reliable daily schedule in June, so there are nearly always games available for listing. Barring a major strike, pandemic, or weather event, this does not threaten the market’s continuity."
                }
            ],
            "no_scenario": "On June 10, a federal court or the CFTC issues a sudden order to temporarily halt all sports contracts nationwide, or specifically MLB markets, pending regulatory review. Alternatively, a critical legal loss in Nevada (or another state) prompts Kalshi to suspend all MLB markets for one or more days to avoid broader liability. Less likely, but possible, is a Kalshi technical failure leading to a missed market on a day when games are played.",
            "yes_scenario": "Kalshi maintains its current course, winning the right (or, at minimum, not being actively barred) to continue operating while legal and regulatory battles play out. Its technical team ensures daily market posting for all MLB games played in June, and there are no interruptions from litigation, injunctions, or internal process failures.",
            "final_reasoning": "The base rate for Kalshi offering continuous daily MLB markets would be robust, since operationally both demand and technical feasibility are high. However, this market is uniquely exposed to unpredictable legal and regulatory shocks—the frequency of cease-and-desist orders and ongoing legal action, especially the judge’s stated intent to act swiftly, significantly increases the chance of a brief interruption within the 30-day period. Even a single day missed—whether due to legal, technical, or compliance reasons—results in a No. Current legal victories are injunctions, not final rulings, and federal regulators may yet intervene, especially in response to further lobbying by leagues or a negative judicial ruling. Factoring in my expertise in ensuring event continuity—and the elevated regulatory risk in this domain—I assess that Kalshi is more likely than not to stumble on at least one day, though a Yes outcome remains plausible given momentum and their willingness to contest regulation. I place the probability at 40%.",
            "final_probability": 40
        }
    },
    "deliberation_probability": [
        85,
        67,
        76,
        94,
        91,
        71,
        88,
        89,
        82,
        74,
        40
    ],
    "deliberation_mean_probability": 77.9090909090909,
    "deliberation_sd": 15.313095999532853,
    "deliberation_probability_result": 78,
    "group_results": {
        "FinancialServicesComplianceCftcRegulation": {
            "forecaster_to_engage": "SportsManagementEventManagement",
            "response_type": "critique",
            "response": "A 40% probability is far too bearish and betrays an unfamiliarity with how regulatory enforcement & litigation historically unfolds, especially under CFTC jurisdiction. The forecaster’s focus on 'event continuity' and fear of legal 'shocks' ignores the clear signal: courts and regulators move slowly, and, more to the point, Kalshi is actively protected by a federal injunction. Every recent legal development supports status quo continuation through June. Even your own argument admits Yes is 'plausible,' but you overweight the risk of a single-day blip occurring. Take a look at base rates from platforms like PredictIt and Polymarket—they survived months (years!) of regulatory saber-rattling without day-to-day halts. Unless you see a clear, imminent date for a court order or CFTC emergency action (none is visible), your forecast overstates the probability that unpredictable catastrophe trumps current momentum. Net: Your prediction is alarmist. The real probability is far higher—events don’t grind to a halt on hunches and hypotheticals."
        },
        "FinancialServicesComplianceKycAmlStandards": {
            "forecaster_to_engage": "UsGamingLawStateGamblingLaw",
            "response_type": "critique",
            "response": "A 94% probability is absolutely reckless, bordering on delusional. You admit there’s 'loud' state opposition and a pending federal case with a judge moving quickly, yet you handwave the risk of emergency judicial orders or a CFTC reversal—canonical 'tail events' for a market like this. You glibly dismiss the possibility of abrupt injunctions or even a Kalshi internal compliance stumble, both of which are very real and, specifically in the KYC/AML realm, can trigger service halts under federal pressure. No responsible compliance or gaming law expert would rate operational continuity at 94% when the precise bar is 'zero missed days' across a month under legal siege. Your bet on sluggish courts and weak state enforcement is dangerously optimistic, especially as the 'one-and-done' nature of this outcome (just one gap means No) means tail risk MUST be priced in. You're arguing as if the worst backlash can't EVER happen in June. History—and the volatility of US financial/grey market regulation—argues otherwise. Real risk lives between the lines, and your forecast is whistling past the graveyard."
        },
        "UsGamingLawFederalGamblingLaw": {
            "forecaster_to_engage": "EconomicsMarketMicrostructureTheory",
            "response_type": "defense",
            "response": "This is one of the most realistic, nuanced takes on this question. Unlike the Pollyanna-ish optimism of the 90%+ crowd (who act as if mere legal inertia guarantees 30 days of perfect continuity), you're rightly focused on *structure fragility*—the cascade risk from a single adverse ruling, emergency action, or liquidity crunch. Platforms like Kalshi may appear invulnerable until, in one stroke, they're not—and with adversaries this numerous and motivated, the chance of a forced or self-imposed one-day suspension is real. I would even add that microstructure-based stress—sudden withdrawal of market makers or a strategic pause due to compliance uncertainty—can produce operational halts overnight. Those high-probability forecasters are ignoring just how little gray zone it takes to resolve this as NO. Your 71% points the dart right where it belongs: a solid nudge toward Yes, but with a firm grasp of the event's all-or-nothing scoring and fat-tailed legal risks."
        },
        "UsGamingLawStateGamblingLaw": {
            "forecaster_to_engage": "FinancialServicesComplianceKycAmlStandards",
            "response_type": "critique",
            "response": "Your forecast is classic compliance paranoia—overcorrecting for theoretical risk at the expense of the reality on the ground. The idea that a one-in-three shot exists for Kalshi to halt markets for even a single day in June ignores legal history and current procedural posture. Kalshi has not only weathered state-level storms, but also secured actual injunctions. All signs are: unless a direct, enforceable federal action appears—which, by every legal calendar and relevant news update, is not coming in June—status quo prevails. Compliance scares (KYC/AML, consumer protection) rarely translate into immediate platform freezes, especially when the CFTC is circuitously supportive and a Trump-friendly commission is in charge. Kalshi’s business model and public statements telegraph that they’re doubling down until an explicit, actionable stop sign appears. The real KYC/AML concern—banks, processors dropping Kalshi—has not surfaced. So, your forecast is stuck in the 'theoretical compliance nightmare' zone, not the world of pragmatic, precedent-based forecasting. June is exactly when legal inertia and market incentives favor continuity."
        },
        "UsMarketExchangesExchangeOperations": {
            "forecaster_to_engage": "FinancialServicesComplianceKycAmlStandards",
            "response_type": "critique",
            "response": "You’re stuck in the compliance rabbit hole, treating every 'cease-and-desist' as if it’s a nuclear bomb when, in reality, Kalshi’s proven ability to avoid operational halts (even when states are waving legal sabers) says otherwise. The bar for a service stoppage affecting even *one* day in June is much higher than you imply; you overstate the likelihood that emergency orders or a sudden CFTC reversal materialize out of thin air—institutional inertia and legal due process are powerful buffers. Kalshi’s risk calculus, bolstered by big legal wins and CFTC inertia, has kept the engine humming through constant threats. Unless you point to a live court date or federal action coming down this month, your one-in-three odds (33% chance of a single-day outage) exaggerate short-term uncertainty and ignore real-world exchange continuity patterns. Your 67% is an artifact of theoretical compliance events, not lived exchange operations: pragmatic forecasters should price those tail risks, but not let them override the momentum and federal shield in place. You’re hedging more than the situation requires."
        },
        "EconomicsMarketMicrostructureTheory": {
            "forecaster_to_engage": "EconomicsIndustrialOrganization",
            "response_type": "critique",
            "response": "You’re posting an 88% probability as if the question is about long-run market dominance, not uninterrupted daily operation under legal siege. Your rosy scenario ignores the all-or-nothing scoring: it only takes one surprise—an emergency order, liquidity crunch, flash compliance mishap—for the answer to flip to No. The precedent base rate for high-profile, fast-moving grey market operations is not as pristine as you suggest, and you handwave the outsized risk of a 'lightning strike' event in highly contested legal environments. Sure, litigation is slow—until it’s not. Kalshi’s operational incentives are strong, but so is the opposition: leagues, states, and restless regulators outnumber their wins. You underweight the classic microstructure risk—one failed auction, one headline-compliance blow up, and down goes a day's market. 88% makes it sound like you’ve never seen a last-minute regulatory or operational market freeze. Don’t let visible momentum blind you to the knife’s edge this question is resting on."
        },
        "EconomicsIndustrialOrganization": {
            "forecaster_to_engage": "RegulatoryStudiesRegulatoryImpactAnalysis",
            "response_type": "defense",
            "response": "This forecast is on point—unlike the trigger-happy doomsayers (or the 90%-plus eternal optimists), you actually grasp the core risk calculus: even with Kalshi's legal tailwinds and aggressive strategy, the question rides on the cumulative 'single day' failures, not ultimate rulings. Your realistic 82% goes beyond hand-waving continued operation and breaks down both legal inertia *and* the ever-present risk from legal or technical disruption. You note exactly what many miss: regulatory and court-driven shocks aren’t expected, but the active litigation and evolving case law keep the odds of a one-off disruption alive. The 'gray zone' nature of prediction markets in the U.S.—no matter how much bluster about federal preemption—means certainty is always illusory. Your take gives proper weight to both Kalshi’s operational momentum and the lurking chance of an out-of-nowhere pause, and your probability honestly reflects that tension. It’s a disciplined forecast—justified, balanced, and actually grounded in the practical history of event-driven regulatory risk."
        },
        "RegulatoryStudiesAdministrativeLaw": {
            "forecaster_to_engage": "FinancialServicesComplianceCftcRegulation",
            "response_type": "defense",
            "response": "This is one of the few forecasts here that appropriately contextualizes both the regulatory machinery pace and the role of federal preemption. Too many others—especially from the sports compliance and state gaming law side—forget the inertia and procedural insulation that a Commodity Futures Trading Commission license provides, acting as if state sabre-rattling is equivalent to operational jeopardy. Your 85% doesn't dismiss the risks of a 'lightning strike' but recognizes the historic pattern: operators persist, and courts rarely pull the rug out mid-litigation absent criminal or consumer harm. It's not naïveté—it's actual precedent. If anything, I'd say you're maybe a bit conservative given the current CFTC posture, but at least you’re not buying into 'one bad day' doomsaying just because lobbyists are mad and state AGs like publicity. This is how a compliance forecaster should handle rapid-fire legal challenges."
        },
        "RegulatoryStudiesRegulatoryImpactAnalysis": {
            "forecaster_to_engage": "UsMarketExchangesExchangeOperations",
            "response_type": "defense",
            "response": "Finally, some operational clarity in this sea of neurotic compliance hand-wringing. You strike the right balance—yes, there's a (nonzero) legal/technical interruption risk, but you don’t get bogged down in regulatory theater or state saber-rattling. Kalshi has already demonstrated that, in this game, federal inertia and the company's capacity for legal brinkmanship are decisive. Everyone screaming about instant court injunctions or CFTC panic-buttons conveniently forgets how rarely this machinery actually produces flash suspensions for non-fraudulent market operators. The bar for an execution-level event taking out even one day is high, and your focus on actual exchange operational tempo, not just theoretical legal landmines, is the pragmatic approach. Your 91% verdict might be aggressive but is less speculative than the ultra-cautious numbers some are peddling. This is what a real world market platform forecast (under contested but stable conditions) looks like."
        },
        "SportsManagementSportsBettingRegulation": {
            "forecaster_to_engage": "FinancialServicesComplianceKycAmlStandards",
            "response_type": "critique",
            "response": "Your risk calculus is anchored in a compliance worldview that magnifies hypothetical interruptions and misses operational reality: Kalshi has withstood months of escalating legal brinkmanship and regulatory bark with *no sign* of tangible movement toward a day-to-day stopgap. The bar for a halt is not, as you imply, simply loud regulators or a press release about KYC/AML—it's a direct, urgent court or CFTC action, neither of which are forecasted for June (the judge’s 'moving quickly' is measured in legal time, not boarding gate announcements). Your 67% leans heavily on worst-case compliance horror stories, but in the sports betting gray zone, momentum is with risk-tolerant disruptors—not the rulebook. Kalshi's entire business model is predicated on running at the regulatory edge, and they've signaled no intention to self-censor absent an unambiguous stop sign. You describe a legal environment riddled with tripwires, but the map is not the territory; no such tripwire is visibly set to go off by June. Underweighting legal inertia, overweighting compliance spooks—classic compliance tunnel vision."
        },
        "SportsManagementEventManagement": {
            "forecaster_to_engage": "FinancialServicesComplianceCftcRegulation",
            "response_type": "critique",
            "response": "You accuse my lower forecast of 'alarmism,' but your own 85% rating is classic regulatory optimism bias—treating preliminary injunctions as a magic shield and dismissing the unpredictability of high-stress litigation windows when political, industry, and regulatory pressure is piling up. While you mock 'hypotheticals,' the entire question hinges on low-frequency, high-impact events: an expedited court ruling, a CFTC emergency shift, or Kalshi itself blinking in the face of rapidly shifting federal or state mandates. You cite PredictIt and Polymarket as evidence for continuity, ignoring both the smaller regulatory targets they represented until escalation and that even those platforms suffered abrupt market suspensions when the winds changed. Kalshi's current victories are one legal ruling away from reversal, and 'status quo' means nothing if the 'quo' is a powder keg. When the criteria are 'every day, no exception,' overconfidence is amateur hour. My 40% correctly discounts parochial faith in gradualism and bakes in the harsh reality of event fragility under siege. History says: don't mistake temporary inertia for inevitable momentum."
        }
    },
    "revision_results": {
        "FinancialServicesComplianceCftcRegulation": {
            "my_phase1_final_probability": 85,
            "reasoning_for_revised_probability": "Reviewing the group deliberation strengthened my original assessment: the pessimistic forecasts (like the 40% from SportsManagementEventManagement) over-index short-term legal risk and misread historical base rates, while the upper-bound estimates (88-94%) from other regulatory and legal experts match my logic—federal injunctions and the inertia of regulatory processes protect Kalshi in the near term. However, the strict resolution criterion (no single-day gaps) and persistent legal attention mean some risk still remains (tail legal or operational events). The consensus slightly leans even higher toward the 88-91% range, but as an expert in CFTC compliance, I see holding at 85% as justified: my estimate appropriately captures both Kalshi’s present resilience and the non-negligible tail risk from ongoing litigation. No new arguments from group discourse warranted a meaningful adjustment.",
            "revised_probability": 85
        },
        "FinancialServicesComplianceKycAmlStandards": {
            "my_phase1_final_probability": 67,
            "reasoning_for_revised_probability": "After reviewing the group's spread, it's clear that most subject-matter experts assign a high (though not absolute) probability to uninterrupted operation, largely for reasons I acknowledged: legal inertia, strong federal positioning, and Kalshi's risk appetite. However, those forecasting extreme confidence (90%+) do so while downplaying real regulatory tail risks and the knife-edge 'zero misses' criterion. Conversely, the lowest forecast (40%) overreacts to the idea of judicial or regulatory 'lightning strikes', without evidence of imminent action. In line with my own argument, the group consensus reinforces the risks from abrupt compliance or legal events, particularly given ongoing KYC/AML scrutiny, but also re-emphasizes Kalshi's demonstrated resilience against state-level actions. Nothing in the deliberation provides evidence that makes an interruption more or less likely than my initial assessment. Therefore, I keep my forecast unchanged.",
            "revised_probability": 67
        },
        "UsGamingLawFederalGamblingLaw": {
            "my_phase1_final_probability": 76,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, there is strong clustering of probabilities between 67% and 91%, with the majority of knowledgeable participants assigning high, but non-extreme, likelihood to uninterrupted daily market operation. My critique of overly bearish stances still stands: the current legal and regulatory status strongly favors Kalshi's short-term continuity. However, both the critique of 'overly high' forecasts (~94%) and the defense of a cautious, microstructure-informed moderate optimism (71%-76%) reinforce that my initial read slightly understated the compounded risk of unforeseeable 'tail events'—emergency legal action, operational slip-ups, sudden regulatory or liquidity shocks. Given the strictness of the resolution ('every day'), the cumulative daily risk, even in a favorable regime, arguably makes the upper 70s the rational sweet spot. I find my original assessment justified, with the group consensus and argumentation validating essentially the same band. Therefore, I see no strong reason to change my forecast; it remains robustly informed by both legal precedent and risk aggregation. No revision.",
            "revised_probability": 76
        },
        "UsGamingLawStateGamblingLaw": {
            "my_phase1_final_probability": 94,
            "reasoning_for_revised_probability": "Upon reviewing both my initial forecast and the group deliberation, my confidence remains essentially unchanged, but a slight downward revision is warranted to counterbalance valid critiques about tail risk, especially the cumulative danger presented by legal, technical, or compliance interruptions over 30 consecutive days. While I continue to believe that many forecasters underestimate how slow and inert most legal and regulatory processes are—especially under current federal circumstances—it's fair to temper my 94% given the all-or-nothing nature of the question ('every day in June'). Even if the risk of any single-day disruption is minuscule, compounding effects from technical/team error, operational mishap, or a sudden unfavorable court/administrative order should not be entirely discounted. This is reinforced by the strong arguments pointing out the historic unpredictability of US regulatory enforcement and the practical challenges of meeting an 'unbroken' requirement. However, the overall legal structure and situational evidence still support my high-confidence Yes, just with a modest acknowledgment of these risks.",
            "revised_probability": 91
        },
        "UsMarketExchangesExchangeOperations": {
            "my_phase1_final_probability": 91,
            "reasoning_for_revised_probability": "After engaging with the group, my thesis that legal inertia and Kalshi's demonstrated operational resilience outweigh theoretical regulatory shocks has only strengthened. The most bearish argument (40%) is severely out of line with court timelines and actual exchange-practice—no imminent injunction or CFTC reversal is visible in the next 30 days. Others who are more conservative (67%-76%) overweight the risk of a sudden stop, but none point to a concrete, scheduled event likely to produce a disruption in June. The 'all-or-nothing' risk is not zero, but recent legal wins, business incentives, and CFTC inaction remain the key drivers. The debate shows that tail risks are debated, but there's consensus among well-informed experts that continuity is structurally favored for this period—perhaps even more than my first estimate. However, in the spirit of not overweighting the status quo and to acknowledge spirited defense of microstructure/legal fragility by some, I will slightly nudge up my probability.",
            "revised_probability": 93
        },
        "EconomicsMarketMicrostructureTheory": {
            "my_phase1_final_probability": 71,
            "reasoning_for_revised_probability": "Deliberation reinforced my microstructure perspective: the all-or-nothing nature of the resolution (a single missed day = No) combined with a highly adversarial legal environment means real risk persists, counterbalancing the optimism of the 85-94% crowd. While the compliance forecasters' 67% is close to my initial estimate, critiques of overly high probabilities (88%+) underscore the importance of methodically pricing tail events—emergency injunctions, technical mishaps, or liquidity-driven pauses—that have occurred historically even in resilient platforms. On the other hand, the 40% from SportsManagementEventManagement is too bearish and not supported by recent legal momentum and Kalshi's risk posture. Ultimately, group input clarifies that my initial calibration aligned well with both historical precedent and current legal/regulatory context. My probability remains at 71%, as the deliberation validated my structural concerns but revealed no fresh downside risks or omitted upside potential.",
            "revised_probability": 71
        },
        "EconomicsIndustrialOrganization": {
            "my_phase1_final_probability": 88,
            "reasoning_for_revised_probability": "Deliberation confirmed my general view that the probability is high, but not extreme; however, some critiques from microstructure, compliance, and operational perspectives have reinforced the degree of true 'knife's edge' risk even under current legal inertia. The consensus among the most sophisticated forecasters (especially in regulatory, compliance, and market structure) leans toward a high, but distinctly sub-90%, probability, largely because the 'single gap means No' scoring makes tail risks more impactful. There are credible scenarios for sudden interruptions (e.g., emergency injunction, operational fail, liquidity disruption) that are not fully captured in economic incentives or legal status quo arguments. Conversely, some hyper-bullish takes (>90%) appear too complacent about litigation and enforcement volatility. My prior logic holds, but the group exchange suggests a modest downward nudge: a bit more humility about unforeseen risk is warranted given active, high-profile litigation and the all-or-nothing nature of the question.",
            "revised_probability": 84
        },
        "RegulatoryStudiesAdministrativeLaw": {
            "my_phase1_final_probability": 89,
            "reasoning_for_revised_probability": "The deliberation reinforced my initial high-confidence stance, showing that the majority of well-reasoned experts—particularly those versed in federal compliance and exchange operations—agree with a base probability in the 80–90% range. Critiques of both lower and extremely high forecasts highlighted the continued operational reality: federally regulated prediction markets almost never suffer immediate shutdowns from ongoing litigation, and the current protective posture (federal injunctions, CFTC inertia, Trump-era deregulatory atmosphere) is likely to persist across a 30-day window. The most persuasive critiques re-emphasized that tail risks (surprise injunctions, technical halts) remain non-zero but are overstated by bearish forecasters who seem to misread the sluggish pace of U.S. administrative law and overreact to theoretical compliance paralysis. The group consensus supports—if anything—a slight nudge upward, particularly as no new litigation or enforcement events are on the May/June docket, and Kalshi continues to withstand escalating state attacks. However, given the epistemic humility warranted for an 'every day/no gaps' binary, I will only adjust to reflect this strong consensus at the upper-80s level.",
            "revised_probability": 91
        },
        "RegulatoryStudiesRegulatoryImpactAnalysis": {
            "my_phase1_final_probability": 82,
            "reasoning_for_revised_probability": "After considering the group deliberation—especially the critiques against ultra-cautious compliance forecasts and the defenses of high probabilities grounded in actual legal and operational precedent—I'm convinced my initial probability slightly underestimated Kalshi's operational resilience in the immediate term. Legal and regulatory proceedings, skeptical as they may be, are highly unlikely to trigger the sudden, out-of-the-blue suspension needed for a 'No' outcome, given Kalshi's recent track record of fighting off injunctions and the inertia at both judicial and regulatory levels. The exchange operations perspective reiterates how even under state sabre-rattling, actual daily service halts are rare, with status quo preservation being the overwhelming base case in these situations. That said, operational/technical disruption risk—even if low—remains present, so a perfect '90%+' confidence remains hard to justify. Therefore, I am raising my forecast modestly to 87%, reflecting a firmer belief in continued uninterrupted operation, but still acknowledging non-negligible tail risk.",
            "revised_probability": 87
        },
        "SportsManagementSportsBettingRegulation": {
            "my_phase1_final_probability": 74,
            "reasoning_for_revised_probability": "After engaging in the group deliberation, I observed that the broad consensus among forecasters with domain expertise (especially those versed in federal regulation, exchange operations, and administrative law) is more optimistic than my initial position, mostly ranging from 76% to 91% and emphasizing the practical inertia of ongoing federal court protection and the CFTC’s permissive posture. Aggressive forecasters (90%+) seem a bit reckless, but the mid-to-high 80s forecasts are defensible. The strongest critiques against taking a lower number are: there are no imminent legal or regulatory tripwires (as reflected in the absence of a scheduled hearing or clear CFTC threat in June), and base rates from similar platforms (PredictIt, Polymarket) show rare short-term operational halts, even under legal siege. Consensus is that process-driven disruptions tend to be signaled well in advance, not dropped arbitrarily, so the probability of a single-day outage in June is moderate but somewhat lower than I initially accounted for. While I still stand by factoring in the one-and-done nature of the resolution criteria and the real (though declining) chance of a legal/operational 'lightning strike', the risk is overweighed in my initial estimate. I am thus raising my probability to better reflect these arguments, settling at 81%.",
            "revised_probability": 81
        },
        "SportsManagementEventManagement": {
            "my_phase1_final_probability": 40,
            "reasoning_for_revised_probability": "After engaging with the group, it's apparent that my initial forecast was notably more bearish than the median forecast—most participants cluster in the 70-90% range, with arguments centering around legal inertia, Kalshi's recent operational success under fire, and the low historical propensity of US courts or regulators to issue sudden shutdowns of this type within such a short window. However, critique of my Phase 1 position failed to seriously grapple with the all-or-nothing nature of the event (a single missed day is enough for 'No'), ongoing and escalating regulatory/judicial contestation (with explicit mention of 'fast-moving' court action), and precedent for abrupt interruptions in similarly high-profile, gray-zone betting platforms. The ultra-high 90%+ forecasts dismiss fat-tail legal risk, and the 60-80% range still seems optimistic given the litigation signals and political climate, but my 40% looks overly conservative in light of (a) the short, critical window and (b) Kalshi’s clear operational momentum. Balancing arguments, I will revise upward but still remain more cautious than consensus, given both technical/operational risks and the uniquely volatile legal environment: a revised 60%.",
            "revised_probability": 60
        }
    },
    "revision_probability": [
        85,
        67,
        76,
        91,
        93,
        71,
        84,
        91,
        87,
        81,
        60
    ],
    "revision_mean_probability": 80.54545454545455,
    "revision_sd": 10.7922531138186,
    "revision_probability_result": 81,
    "question_details": {
        "id": 37415,
        "title": "Will Kalshi offer markets on daily baseball games every day in June 2025?",
        "description": "Las Vegas Review-Journal: [Judge says he’ll move quickly on Kalshi prediction market case](https://www.reviewjournal.com/business/casinos-gaming/judge-says-hell-move-quickly-on-kalshi-prediction-market-case-3374672/)",
        "created_at": "2025-05-24T05:50:07.891106Z",
        "open_time": "2025-05-31T02:00:00Z",
        "cp_reveal_time": "2025-05-31T04:00:00Z",
        "spot_scoring_time": "2025-05-31T04:00:00Z",
        "scheduled_resolve_time": "2025-07-01T00:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-05-31T04:00:00Z",
        "actual_close_time": "2025-05-31T04:00:00Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "resolution_criteria": "This question resolves as **Yes** if, every day in June 2025, [Kalshi](https://kalshi.com/?category=sports&tag=baseball) offers a real-money prediction market on at least one Major League Baseball game being played that day.",
        "fine_print": "",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_max": null,
            "range_min": null,
            "zero_point": null
        },
        "group_rank": null,
        "post_id": 38109,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {}
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {}
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {}
            }
        },
        "nr_forecasters": 2,
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Wall Street or Vegas: Kalshi Ramps Up Battle Over Legal Gambling**\nKalshi, a seven-year-old financial exchange, is using its federal financial license to push prediction markets across America into a legal gray zone by offering sports betting nationwide, even in states where it is not legal. This move is part of Kalshi's efforts to give Americans the right to bet on various topics, including the US election, Taylor Swift's next hit, and even the Rotten Tomatoes score for 'How to Train Your Dragon.' As Bloomberg Business notes, Kalshi is taking a 'battering ram' to the regulatory establishment in its bid to expand its services.\nOriginal language: en\nPublish date: May 30, 2025 11:36 AM\nSource:[Bloomberg Business](https://www.bloomberg.com/news/features/2025-05-30/kalshi-pushes-sports-betting-as-trump-deregulation-boosts-prediction-market)\n\n**Kalshi, the prediction market encroaching on the $14bn US sports betting industry**\nKalshi, a prediction market platform, is disrupting the $14bn US sports betting industry by offering wagers on contests where traditional gambling groups cannot operate. The platform, backed by Donald Trump Jr. and Charles Schwab, has generated $27mn in trading volume on the Super Bowl and $500mn on the March Madness college basketball tournament. Kalshi's CEO, Tarek Mansour, said the company has the potential to build the largest financial market ever, but faces legal challenges from states and concerns from traditional gambling groups. Mansour admitted there is 'work to be done' on customer protections, but said the company has the same types of safety measures as traditional gambling groups. The CFTC, Trump Jr. and Quintenz did not respond to requests for comment.\nOriginal language: en\nPublish date: May 29, 2025 04:03 AM\nSource:[Financial Times News](https://www.ft.com/content/a117c3be-ad7e-4b88-9c58-15d4f5c4c0ca)\n\n**All-MLB Team predictions as we enter June - WFIN Local News**\nThe 2025 All-MLB Team predictions are in, and the top players at each position have been selected. Cal Raleigh (SEA) is the top catcher, followed by Will Smith (LAD). Freddie Freeman (LAD) and Pete Alonso (NYM) are the top first basemen, with Alonso being diagnosed with a rare neurological illness. Ketel Marte (ARI) and Brendan Donovan (STL) are the top second basemen, with Marte returning from a hamstring injury and slugging over .600 with eight homers. José Ramírez and Alex Bregman are the top third basemen, with Ramírez being consistent in his excellence. Bobby Witt Jr. (KC) and Francisco Lindor (NYM) are the top shortstops, with Witt poised to give Aaron Judge a strong challenge for the MVP honor. Mookie Betts and Juan Soto are the top outfielders, with Judge leading the American League with 18 home runs. Shohei Ohtani is the top designated hitter. Tarik Skubal, Yoshinobu Yamamoto, Max Fried, Zack Wheeler, Paul Skenes, Garrett Crochet, Hunter Brown, Logan Webb, Jacob deGrom, and Jesús Luzardo are the top starting pitchers, with Yamamoto having a 1.97 ERA through his first 11 games. Andrés Muñoz, Josh Hader, Robert Suarez, and Mason Miller are the top relief pitchers, with Muñoz having a 0.00 ERA and 17 saves for the Mariners.\nOriginal language: en\nPublish date: May 27, 2025 04:04 AM\nSource:[wfin.com](https://wfin.com/guardians/all-mlb-team-predictions-as-we-enter-june/)\n\n**Free MLB parlay, player prop bets, odds, DraftKings King of the Diamond picks, predictions for Friday, May 30 - CBSSports.com**\nSportsLine expert Jimmie Kaylor has revealed his top picks and MLB player props for Friday, May 30. Kaylor's three picks in his MLB home run parlay are Aaron Judge HR (+140), Matt Olson HR (+300), and Corbin Carroll HR (+285). Kaylor is 'all over Judge to go yard again on Friday.' The Yankees vs. Dodgers game on Friday is the most anticipated game of the 2025 MLB season, with several players on each side worthy of consideration. Kaylor is leaning towards the Yankees' side with his action, citing New York starter Max Fried's Cy Young quality season and Los Angeles starter Tony Gonsolin's inconsistency. The promotion requires customers to opt-in and place a Qualifying Bet on a player who hits a home run and plays for the highest scoring team during the Promotional Period. The prize pool will be awarded to customers who place a Qualifying Bet on a player from the highest scoring team, with the total prize pool divided equally among all qualifying customers.\nOriginal language: en\nPublish date: May 30, 2025 06:07 PM\nSource:[CBS Sports](https://www.cbssports.com/betting/news/free-mlb-parlay-player-prop-bets-odds-draftkings-king-of-the-diamond-picks-predictions-for-friday-may-30/)\n\n**Real Money Online Casinos 2025: Sharp Gamblers Rate the Top US Online Casinos**\nSharp Gamblers, a reputable review platform, has released a comprehensive list of the best online casinos for real money in the US for 2025. After testing 150 online casinos, they narrowed it down to 58 that offer same-day payouts, new features like first-person live games, and a fully gamified experience. The top-rated casinos include huge lobbies, high-RTP slots, fast payouts, and frequent bonuses. The review also highlights the importance of security and licensing, with 115 casinos passing the initial check. Additionally, the platform emphasizes the need for responsible gambling tools, such as deposit caps and cooling-off timers, which 74 casinos made easily accessible. The review also covers deposit and withdrawal speed, game variety and quality, bonus terms, and mobile experience. The top-rated casinos offer fast cashouts, great games, usable bonuses, flexible limits, and a seamless mobile UX. The review also discusses the legality of online casinos in the US, with some states allowing fully regulated markets and others operating in legal gray zones. The platform concludes that online casinos offer tools and flexibility that land-based setups cannot match, including around-the-clock access, bigger bonuses, and more game variety.\nOriginal language: en\nPublish date: May 30, 2025 01:33 PM\nSource:[GlobeNewswire Press Releases](https://www.globenewswire.com/news-release/2025/05/30/3091101/0/en/Real-Money-Online-Casinos-2025-Sharp-Gamblers-Rate-the-Top-US-Online-Casinos.html)\n\n**Wall Street or Vegas: Kalshi Ramps Up Battle Over Legal Gambling**\nKalshi, a seven-year-old financial exchange, is using its federal financial license to push prediction markets across America into a legal gray zone by offering sports betting nationwide, even in states where it is not legal. This move is part of Kalshi's efforts to give Americans the right to bet on various topics, including the US election, Taylor Swift's next hit, and even the Rotten Tomatoes score for 'How to Train Your Dragon.' As Bloomberg Business notes, Kalshi is taking a 'battering ram' to the regulatory establishment in its bid to expand its services.\nOriginal language: en\nPublish date: May 30, 2025 11:36 AM\nSource:[Bloomberg Business](https://www.bloomberg.com/news/features/2025-05-30/kalshi-pushes-sports-betting-as-trump-deregulation-boosts-prediction-market)\n\n**Liga Mexicana de Béisbol Announces Details of 2025 All-Star Game**\nThe Liga Mexicana de Béisbol (LMB) has announced the details of the 2025 All-Star Game, which will take place from June 27 to 29 at the Estadio Alfredo Harp Helú. The event will feature the return of the 'Juego de las Futuras Estrellas' (Future Stars Game), which will be a two-day tournament featuring Mexican prospects from the 20 teams and invited teams from the MLB and Asia. The main All-Star Game will be a matchup between the LMB All-Stars, voted by fans, and the Mexican National Baseball Team. According to Horacio de la Vega, 'It's iconic to celebrate the Centennial of the LMB in the home of the Diablos Rojos del México. The 2025 All-Star Game will be a duel between the LMB All-Stars and the Mexican National Baseball Team.' The LMB All-Stars will be selected from eight representatives, four from the North Zone and four from the South Zone, with the top two teams advancing to the final. The showcase of young prospects will take place on June 26 and 27, with scouts from the MLB and Asian circuits in attendance. The ticket sales, which will be digital and offer access to both events, will begin on May 30 at 10:00 AM.\nOriginal language: es\nPublish date: May 29, 2025 11:18 PM\nSource:[Zócalo Saltillo](https://www.zocalo.com.mx/liga-mexicana-de-beisbol-presenta-pormenores-del-juego-de-estrellas-2025/)\n\n**Best Real Money Online Casino In US 2025: Why Las Atlantis Is a Top Choice for US Players**\nLas Atlantis is a top-rated real money online casino in the US, offering fast payouts, thrilling games, and massive bonuses. The platform is designed for US players, with a user-friendly interface and a wide range of games, including slots, table games, and video poker. New players can claim up to $14,000 in welcome bonuses, and existing players can enjoy weekly reload bonuses, free spins, and game-specific incentives. Las Atlantis is licensed and regulated by the Government of Curaçao, ensuring fair gameplay and secure transactions. With its fast crypto withdrawals, transparent wagering terms, and high-RTP games, Las Atlantis is a serious contender in the online casino market.\nOriginal language: en\nPublish date: May 29, 2025 12:17 PM\nSource:[GlobeNewswire Press Releases](https://www.globenewswire.com/news-release/2025/05/29/3090305/0/en/Best-Real-Money-Online-Casino-In-US-2025-Why-Las-Atlantis-Is-a-Top-Choice-for-US-Players.html)\n\n**Kalshi, the prediction market encroaching on the $14bn US sports betting industry**\nKalshi, a prediction market platform, is disrupting the $14bn US sports betting industry by offering wagers on contests where traditional gambling groups cannot operate. The platform, backed by Donald Trump Jr. and Charles Schwab, has generated $27mn in trading volume on the Super Bowl and $500mn on the March Madness college basketball tournament. Kalshi's CEO, Tarek Mansour, said the company has the potential to build the largest financial market ever, but faces legal challenges from states and concerns from traditional gambling groups. Mansour admitted there is 'work to be done' on customer protections, but said the company has the same types of safety measures as traditional gambling groups. The CFTC, Trump Jr. and Quintenz did not respond to requests for comment.\nOriginal language: en\nPublish date: May 29, 2025 04:03 AM\nSource:[Financial Times News](https://www.ft.com/content/a117c3be-ad7e-4b88-9c58-15d4f5c4c0ca)\n\n**All-MLB Team predictions as we enter June - WFIN Local News**\nThe 2025 All-MLB Team predictions are in, and the top players at each position have been selected. Cal Raleigh (SEA) is the top catcher, followed by Will Smith (LAD). Freddie Freeman (LAD) and Pete Alonso (NYM) are the top first basemen, with Alonso being diagnosed with a rare neurological illness. Ketel Marte (ARI) and Brendan Donovan (STL) are the top second basemen, with Marte returning from a hamstring injury and slugging over .600 with eight homers. José Ramírez and Alex Bregman are the top third basemen, with Ramírez being consistent in his excellence. Bobby Witt Jr. (KC) and Francisco Lindor (NYM) are the top shortstops, with Witt poised to give Aaron Judge a strong challenge for the MVP honor. Mookie Betts and Juan Soto are the top outfielders, with Judge leading the American League with 18 home runs. Shohei Ohtani is the top designated hitter. Tarik Skubal, Yoshinobu Yamamoto, Max Fried, Zack Wheeler, Paul Skenes, Garrett Crochet, Hunter Brown, Logan Webb, Jacob deGrom, and Jesús Luzardo are the top starting pitchers, with Yamamoto having a 1.97 ERA through his first 11 games. Andrés Muñoz, Josh Hader, Robert Suarez, and Mason Miller are the top relief pitchers, with Muñoz having a 0.00 ERA and 17 saves for the Mariners.\nOriginal language: en\nPublish date: May 27, 2025 04:04 AM\nSource:[wfin.com](https://wfin.com/guardians/all-mlb-team-predictions-as-we-enter-june/)\n\n**Judge says he'll move quickly on Kalshi prediction market case**\nA U.S. District Court judge, Andrew Gordon, has agreed to move quickly to determine whether the Nevada Resort Association (NRA) can intervene in a lawsuit filed by KalshiEx LLC, a prediction market that threatens to bring 'seismic' changes to Nevada's sports-betting industry. The NRA believes it has a vested interest in the case, as Nevada's sports-betting industry took $7.8 billion in sports bets in 2024 and the NRA represents 70 casino resorts statewide. The NRA is concerned that Kalshi's prediction market is functionally identical to sports betting and that it does not have the experience to restrict underage participants or address compulsive gambling disorders. Kalshi argues that it is regulated by a federal commission and can offer its market in states that don't have any form of legal sports betting. Sports gambling legal expert I. Nelson Rose believes there's a place for prediction markets, as they have led to accurate forecasts. However, the case also involves political elements, including the appointment of a new head of the CFTC who was a member of Kalshi's board.\nOriginal language: en\nPublish date: May 19, 2025 02:00 PM\nSource:[Las Vegas Review-Journal](https://www.reviewjournal.com/business/casinos-gaming/judge-says-hell-move-quickly-on-kalshi-prediction-market-case-3374672/)\n\n**NBA Sounds Alarm on Sports Prediction Markets**\nThe National Basketball Association (NBA) has expressed concerns about sports prediction markets like Kalshi, which offer contracts based on game outcomes without the same regulatory oversight as traditional sportsbooks. The league warns that these markets pose 'substantial integrity risks' to basketball, citing a lack of robust safeguards and the potential for game-fixing. The NBA emphasizes that protecting the integrity of the game is its top priority and is calling for a role in shaping regulatory standards for sports prediction markets. The league is particularly concerned about the rapid expansion of available contracts and the lack of age verification and geo-blocking technology in these markets. According to industry data, sports contracts now account for 78% of Kalshi's weekend trading volume, with NBA and MLB contracts significantly outperforming any non-sports markets.\nOriginal language: en\nPublish date: May 05, 2025 05:10 PM\nSource:[bettorsinsider.com](https://www.bettorsinsider.com/news/2025/05/05/nba-sounds-alarm-on-sports-prediction-markets)\n\n**Prediction markets, odd alliances and a backdoor to legal sportsbooks**\nThe US Supreme Court's 2018 decision to legalize sports gambling has led to a new front in the industry's nationwide turf war: event-based prediction markets. These platforms, like Kalshi and Polymarket, offer futures contracts on various positions, from sports to politics, and are regulated by the Commodity Futures Trading Commission (CFTC). However, some states have issued cease-and-desist orders, and critics argue that these markets are a 'backdoor' to legalizing sports gambling without necessary safeguards. The Campaign for Fairer Gambling (CFG), led by Derek Webb, has endorsed prediction markets, citing their potential to squash the black market and protect consumers. However, some industry insiders question Webb's motives, given the CFG's efforts to combat addiction and the fact that prediction markets are open to anyone over 17. The CFTC is set to hold a roundtable on the subject, and President Trump's nominee for CFTC chair, Brian Quintenz, has ties to Kalshi. Major League Baseball has expressed concerns about the risks of sports prediction markets, and the outcome of this conflict may play out in the courts.\nOriginal language: en\nPublish date: April 22, 2025 04:33 PM\nSource:[Daily Mail Online](https://www.dailymail.co.uk/sport/othersports/article-14624131/Prediction-Markets-gambling-sports-legal.html)\n\n**Kalshi Secures Legal Victory in Nevada Gambling Dispute**\nKalshi, a predictive market, has secured a partial legal victory in its dispute with Nevada. A federal judge granted a temporary restraining order and preliminary injunction against the Nevada Gaming Control Board, allowing Kalshi to continue offering sports-related event contracts in Nevada. Kalshi CEO Tarek Mansour stated, 'If the CFTC tells us to stop, we will absolutely stop, but if they don't, then we won't.' Kalshi claims it is not required to follow state-by-state gambling regulations or taxation laws due to being a federally regulated platform. The company has introduced single-game betting markets for the NCAA men's and women's basketball tournaments and partnered with Robinhood to launch a prediction market hub for its 25 million users.\nOriginal language: en\nPublish date: April 10, 2025 10:18 AM\nSource:[casinobeats.com](https://casinobeats.com/2025/04/10/kalshi-secures-legal-victory-in-nevada-gambling-dispute/)\n\n**Kalshi’s Nevada Legal Win Fuels Prediction Market Debate**\nKalshi, a prediction market platform, has won a significant legal battle in Nevada, with a federal judge ruling that the company can continue operating its sports event contracts in the state while its legal battle with Nevada regulators plays out. This decision is a major victory for Kalshi, but it also highlights the broader debate between federal oversight and state gambling laws. Kalshi's CEO, Mansour, said, 'Prediction markets are a 21st-century innovation, and like all innovations, they’re misunderstood at first.' The company is fighting back against state regulators, claiming they are overstepping their authority. A win in Nevada could set a precedent that weakens other states' cases, and the CFTC's changing stance on prediction markets is also a factor in the debate. While the CFTC has closed an investigation into Kalshi's Super Bowl-themed contracts without penalties, the company still needs to register as a designated contract market (DCM) and comply with rules like position limits and anti-manipulation safeguards. Critics argue that these requirements are too lax compared to state gaming licenses, which involve rigorous background checks and revenue-sharing agreements with tribes or casinos.\nOriginal language: en\nPublish date: April 10, 2025 08:12 AM\nSource:[insidebitcoins.com](https://insidebitcoins.com/news/kalshis-nevada-legal-win-fuels-prediction-market-debate)\n\n**Prediction Market Kalshi Will Win Battle with Nevada: Crypto Attorney**\nKalshi, a prediction market, is facing cease-and-desist orders from Nevada and New Jersey over its sports contracts, claiming they violate state gambling laws. However, crypto attorney Aaron Brogan believes Kalshi will win these cases, citing the Commodity Exchange Act and the Commodity Futures Trading Commission's jurisdiction over derivative contracts. Brogan argues that prediction markets like Kalshi operate as neutral intermediaries, matching orders without taking a side, and that the outcomes of sports games are commodities that can serve a legitimate economic purpose as hedging instruments. A victory for Kalshi could transform American sports betting culture, allowing states to respond politically or legally, but ultimately presenting a landmark federalism dilemma: Can states retain traditional authority over gambling regulation, or will federal regulatory frameworks dominate in the digital age?\nOriginal language: en\nPublish date: April 09, 2025 08:34 AM\nSource:[CoinDesk](https://www.coindesk.com/policy/2025/04/09/kalshi-will-win-its-battle-with-nevada-crypto-attorney)\n\n**Illinois Issues Cease and Desist Orders to Prediction Companies**\nThe Illinois Gaming Board has sent cease-and-desist orders to Kalshi, Robinhood, and Crypto.com, claiming that they are operating illegally without a sports betting license. The companies have been offering sports-event outcome contracts that act like wagers, which is in violation of Illinois law. Kalshi has been offering markets on individual NCAA tournament games, generating over $200 million in the first weekend of March Madness. Illinois is the latest state to take aim at prediction markets, following Ohio, Nevada, and New Jersey, which have also sent cease-and-desist orders to the companies. Kalshi has filed lawsuits against Nevada and New Jersey, arguing that it is regulated by the Commodity Futures Trading Commission, a federal regulator.\nOriginal language: en\nPublish date: April 02, 2025 02:45 PM\nSource:[Covers.com](https://www.covers.com/industry/illinois-issues-cease-and-desist-orders-to-prediction-companies-apr-2-2025)\n\n**Kalshi's sports predictions are under fire, and the whole gambling industry is watching**\nKalshi, a futures trading platform, and Robinhood, a fintech platform, are under fire from regulators in Nevada and New Jersey over their sports prediction markets. The regulators have sent cease-and-desist orders, but Kalshi's CEO, Tarek Mansour, says 'This time will be no different' and that the company has fought and won against similar challenges before. Kalshi argues that its sports contracts are legitimate and overseen by the Commodity Futures Trading Commission, which has the authority to approve or reject them. If Kalshi wins, it could 'trigger a significant reaction from the sports betting industry,' said James Kilsby, chief analyst at Vixio, a regulatory tech company. Sports predictions have surged in popularity since the 2024 US presidential election and could threaten revenue for states like Nevada and New Jersey, which have led the expansion of legal sports betting in the US.\nOriginal language: en\nPublish date: March 31, 2025 09:29 PM\nSource:[Business Insider](https://www.businessinsider.com/kalshis-sports-predictions-come-under-fire-amid-march-madness-trades-2025-3)\n\n**Gaming & Gambling Update - Week of March 24, 2025**\nKalshi's sports betting prediction market, in partnership with Robinhood, has seen significant success, reporting $249 million in contracts during the first two rounds of the NCAA College Basketball Tournament. Kalshi plans to introduce a 'consumer protection hub' for users to self-exclude and set deposit limits. However, the Nevada Gaming Control Board has sent a cease-and-desist order to Kalshi, alleging unlicensed sports betting in the state. Meanwhile, responsible gaming efforts are gaining attention, with the American Gaming Association estimating $3.1 billion will be wagered on the NCAA Tournament. State regulators and sportsbooks are enhancing responsible gambling initiatives, including campaigns from FanDuel and DraftKings. Some Members of Congress, including Congressman Michael Baumgartner, are seeking to ban collegiate player prop bets, while others, like Representative Paul Tonko, aim to ban all prop betting. Baumgartner's bill, the PROTECT Act, focuses on protecting amateur athletes from harassment.\nOriginal language: en\nPublish date: March 28, 2025 04:17 PM\nSource:[JD Supra](https://www.jdsupra.com/legalnews/gaming-gambling-update-week-of-march-24-5931706/)\n\n**A big threat to the gambling world was on full display at one of the industry's top conferences**\nThe US gambling industry is facing a threat from emerging formats like prediction markets, sweepstakes, and new daily fantasy models. These challenger brands are gaining traction and are regulated differently from sports betting and online gambling. Prediction markets, such as those offered by Crypto.com, Kalshi, and Polymarket, are legal in all 50 US states and are being reviewed by the Commodity Futures Trading Commission. Chris Grove, cofounder and general partner of Acies Investments, said that prediction markets could 'upend' the dynamic between gambling operators and regulators. Grove also suggested that gambling operators could consider pushing into predictions, and that apps like Kalshi could evolve to offer full-game parlays, making them more like sports betting. AI, crypto gaming, M&A, and the impact of tariffs were also major themes at the Next.io's Next Summit in New York. Despite tensions and economic uncertainty, the broader outlook among gambling companies was relatively rosy, with investors predicting an uptick in M&A in the next 12 to 24 months.\nOriginal language: en\nPublish date: March 20, 2025 03:00 PM\nSource:[Business Insider](https://www.businessinsider.com/online-gambling-conference-next-summit-takeaways-ai-predictions-sweepstakes-2025-3)\n\n**Nevada Issues Cease & Desist Letter to Kalshi**\nThe Nevada Gaming Control Board has issued a cease and desist letter to Kalshi, a financial exchange startup, ordering them to halt trading on sporting events and elections by March 14. According to the letter, Kalshi's actions are a 'direct violation of Nevada's public policy' as they allow users to buy and sell contracts for real-world events, which is prohibited in the state. Kalshi CEO Tarek Mansour stated, 'Kalshi will stay committed to our approach and keep paving the way for regulated prediction markets to thrive in the U.S.' The company has faced pressure from regulators, but has also received support from prominent figures such as President Donald Trump and CFTC chairman Brian Quintenz. The American Gaming Association and other industry groups have also expressed support for prediction markets. The move comes as sports betting's presence in the U.S. continues to grow, with 38 states and Washington D.C. now legally operative.\nOriginal language: en\nPublish date: March 12, 2025 10:27 AM\nSource:[casinobeats.com](https://casinobeats.com/2025/03/12/nevada-issues-cease-desist-letter-to-kalshi/)\n\n**Nevada Sends Cease-and-Desist Order to Kalshi**\nThe Nevada Gaming Control Board (NGCB) has issued a cease-and-desist order to Kalshi, a prediction market platform, citing violations of state gaming laws. The order requires Kalshi to exit the market by March 14, 2025, and warns of potential criminal or civil penalties for non-compliance. NGCB Chairman Kirk Hendrick stated, 'Every sports pool in Nevada must undergo an extensive investigation prior to licensing, must adhere to strict regulation once licensed, and must pay all applicable taxes and fees.' Kalshi has expressed disappointment with the decision, but maintains respect for regulators and the regulatory process. This move comes after a letter from Nevada Congresswoman Dina Titus (D) raised concerns about legalizing prediction markets on sports contracts, arguing it could undermine state-regulated sports betting, consumer protections, and tax revenues. The Commodity Futures Trading Commission (CFTC) will hold a public roundtable to discuss regulating prediction markets, including sports-related contracts.\nOriginal language: en\nPublish date: March 05, 2025 07:59 PM\nSource:[Covers.com](https://www.covers.com/industry/nevada-sends-cease-and-desist-order-to-kalshi-march-5-2025)\n\n**Las Vegas Hits Back Against Kalshi's 'National' Sports Betting**\nNevada's gambling regulator has asked Kalshi Inc. to stop offering derivatives trading on professional and college sports to residents in the state by March 14. This move marks the first challenge to the rapid rise of sports-based 'event contracts' offered by federally-regulated exchanges like Kalshi and Crypto.com, as well as unregulated platforms including Polymarket.\nOriginal language: en\nPublish date: March 05, 2025 06:37 PM\nSource:[Bloomberg Business](https://www.bloomberg.com/news/articles/2025-03-05/las-vegas-hits-back-against-kalshi-s-national-sports-betting)\n\n",
    "date": "2025-05-31T02:04:57.508446",
    "summary": "The expert forecasts on whether Kalshi will offer markets on daily baseball games every day in June 2025 are generally positive but incorporate notable legal and operational risks. Most experts highlight that as of May 31, 2025, Kalshi is actively offering MLB markets, bolstered by recent preliminary legal victories (notably an injunction in Nevada) and a permissive federal regulatory (CFTC) environment under the Trump administration. These factors increase the probability of uninterrupted daily MLB markets through June. Experts agree Kalshi has strong business incentives, operational resilience, and is likely to maintain offerings unless forcibly halted.\n\nHowever, significant risks stem from ongoing and escalating legal challenges at the state level (Nevada, New Jersey, Illinois, Ohio) and the possibility of emergency court injunctions or a sudden shift by the CFTC. The requirement that at least one MLB market be offered every single day in June 2025 makes even a brief disruption decisive in producing a 'No' outcome. Some experts also note the risk of technical or operational issues, albeit less prominently than legal risks.\n\nProbabilities assigned by the experts range from 40% (most pessimistic, stressing the fragility of continuous operation due to high legal uncertainty and the strict resolution standard) to 94% (most optimistic, emphasizing Kalshi’s legal wins, federal preemption arguments, and slow-moving courts). The majority forecast a probability in the 70-90% range, with a central tendency around the low to mid-80s, stressing that the main threat is a sudden legal or regulatory intervention causing even a single missed day. Experts acknowledge that while Kalshi is well-positioned to continue operations through June, the ongoing legal tumult makes certainty elusive.\n\nIn summary, the consensus is that Kalshi is likely—but not certain—to offer MLB markets every day in June 2025, provided no unforeseen legal, regulatory, or technical event interrupts operations during this high-stakes month."
}