{
    "deliberation_results": {
        "IntelligenceAnalysis (IndicatorsAndWarningAnalysis)": {
            "time_to_resolution": "Approximately 1.5 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in IntelligenceAnalysis (IndicatorsAndWarningAnalysis), my approach emphasizes identifying early warning signals of coups, assessing the resilience of state security, monitoring elite fractures, and contextualizing events with historical coup base rates. I consider not only immediate unrest but also underlying structural factors (elite loyalty, military grievances, regime legitimacy, and international dynamics) that historically precede successful coups.",
            "status_quo": "Paul Biya remains in power through 2025, having secured an eighth term amid heavy repression of opposition and civil protest, as he has for over four decades. Despite widespread unrest after the disputed election, the regime's security apparatus retains control and the government continues to function.",
            "perspective_derived_factors": [
                {
                    "factor": "Elite and Military Loyalty",
                    "effect": "Decreases probability—Biya has maintained power for 43 years with a proven track record of keeping the military and political elites loyal through patronage, selective repression, and careful management of succession ambiguity. There are no credible reports of significant defections or splits among senior security or military figures, which are typical precursors to coups."
                },
                {
                    "factor": "Post-Election Unrest and Repression",
                    "effect": "Increases probability—The scale and intensity of post-election violence, mass arrests, and open opposition calls for resistance raise coup risk. These conditions sometimes catalyze military intervention, especially if the regime is seen as losing legitimacy or capacity to govern."
                },
                {
                    "factor": "Historical Coup Base Rate (African/French Colonial Context)",
                    "effect": "Increases probability slightly—Recent years have seen a spike in coups in former French colonies (Niger, Burkina Faso, Gabon, Mali). Cameroon shares some risk factors (long-serving ruler, aging autocrat, weak institutions), but its coup base rate is historically low: last major coup attempt was in 1984. Still, regional contagion raises risk somewhat."
                },
                {
                    "factor": "Security Force Capacity and Willingness",
                    "effect": "Decreases probability—Reports indicate security forces remain effective, loyal, and willing to use deadly force to suppress dissent. Mass arrests, routine torture, and quick clampdowns on protests suggest the apparatus for regime defense is intact."
                },
                {
                    "factor": "Regime Cohesion vs. Fragmentation",
                    "effect": "Decreases probability—Despite opposition claims and calls for civil disobedience, the ruling party and state institutions show no public signs of fragmentation. The opposition is vocal but lacks clear channels to penetrate or subvert the regime’s core power structures."
                },
                {
                    "factor": "Leader Age and Succession Uncertainty",
                    "effect": "Increases probability—Biya’s advanced age (92) and lack of a named successor create latent risk: sudden illness or death could trigger elite infighting or an opportunistic coup, especially if succession is contested."
                },
                {
                    "factor": "International/Regional Dynamics",
                    "effect": "Neutral to slightly decreases probability—While international partners have criticized repression, no major external actor is signaling support for regime change. Nigeria, a key neighbor, appears to be restraining opposition exiles rather than facilitating their efforts."
                }
            ],
            "no_scenario": "Despite ongoing unrest, Biya’s regime continues to suppress protests through force and arrests. The military and elite remain loyal, opposition remains fragmented and largely externalized, and no armed group is able to seize and hold power for the required 7 days. International actors do not intervene, and the state apparatus continues to function through the resolution period.",
            "yes_scenario": "A significant split emerges within the military or ruling elite, possibly triggered by a health crisis, economic shock, or escalating violence. Dissident officers or a coalition of military and opposition figures move to depose Biya, successfully seize government institutions, and maintain control for at least 7 days, with credible sources confirming the new power structure.",
            "final_reasoning": "While Cameroon is experiencing its most severe post-electoral crisis in decades, the indicators for an imminent successful coup remain below the actionable warning threshold. The regime’s security forces are cohesive, loyal, and capable, with no evidence of military or elite defection. The government has demonstrated the will and capacity to suppress unrest, and the opposition—though energized—lacks the organizational base and internal alliances historically necessary for coup success. Regional contagion and Biya’s advanced age are meaningful risk factors, but the tightly controlled state apparatus, ongoing elite cohesion, and a lack of credible reports of coup-plotting all point toward regime resilience in the near term. The historical base rate for coups in Cameroon is low, and the window until resolution is very short (less than two months), further reducing the likelihood. Thus, the probability of a successful coup (as defined by the question) before January 1, 2026, is low but not zero, reflecting heightened but not critical risk.",
            "final_probability": 7
        },
        "IntelligenceAnalysis (PoliticalRiskAssessment)": {
            "time_to_resolution": "Approximately 1.5 months (from November 14, 2025 until January 1, 2026)",
            "perspective_relevance": "As an expert in Intelligence Analysis (Political Risk Assessment), my perspective is critical for evaluating coup risk because it involves systematically weighing structural, proximate, and trigger factors—such as regime durability, elite cohesion, security force loyalty, and societal pressures. I also draw on historical base rates for coups in analogous African contexts, consider regional contagion effects, and evaluate the relative strength of state versus opposition capabilities.",
            "status_quo": "President Paul Biya remains in power through a mixture of repression, patronage, and institutional control, as he has for over four decades. Despite election-related unrest, his security apparatus continues to suppress dissent, and no armed group has seized control for a period of seven days or more.",
            "perspective_derived_factors": [
                {
                    "factor": "Regime Durability and Security Force Loyalty",
                    "effect": "Significantly decreases probability. The Biya regime has demonstrated extraordinary resilience, with a proven ability to suppress opposition through both institutional and coercive means. The military and police remain under tight control, and there are no credible defections reported among top brass."
                },
                {
                    "factor": "Elite Cohesion and Patronage Networks",
                    "effect": "Decreases probability. Biya's rule is characterized by a carefully managed elite network and a lack of visible, organized opposition within the military or political elite capable of orchestrating a coup."
                },
                {
                    "factor": "Public Unrest and Opposition Mobilization",
                    "effect": "Slightly increases probability. The 2025 election triggered widespread protests, some violent, and created significant societal discontent. However, the opposition lacks the organizational capacity or armed wing needed to translate unrest into a coup."
                },
                {
                    "factor": "Regional Coup Contagion",
                    "effect": "Marginally increases probability. Neighboring Francophone African countries have seen coups, which could inspire actors in Cameroon, but Cameroon’s specific risk profile differs due to its regime’s deep institutionalization and control."
                },
                {
                    "factor": "Leader’s Age and Succession Risk",
                    "effect": "Moderately increases probability. Biya’s advanced age (92) raises the risk of sudden health crises, which could destabilize elite consensus and create a window for coup attempts, but this is mitigated by the regime's succession planning and institutional inertia."
                },
                {
                    "factor": "Base Rate of Coups in Cameroon and Similar Regimes",
                    "effect": "Decreases probability. Cameroon has not experienced a successful coup since Biya assumed power, despite numerous triggers that have led to coups elsewhere in Africa. The historical base rate for coups in entrenched autocracies with loyal security forces is low on a short time scale."
                }
            ],
            "no_scenario": "Despite ongoing protests and international condemnation of repression, the security forces remain unified behind Biya, opposition efforts are fragmented and lack armed support, and no significant faction within the military attempts or sustains a takeover. Biya completes the remainder of 2025 in power, and the regime weathers the post-election crisis through a mix of force and managed concessions.",
            "yes_scenario": "A sudden health crisis incapacitates or removes Biya, triggering elite fragmentation. A mid-level military faction—possibly motivated by regime fatigue, regional coup contagion, or popular pressure—moves to seize key institutions. Loyalist forces are either divided or stand down, and the coup-plotters control the capital and state media for more than seven days, with credible sources confirming the transfer of power outside constitutional processes.",
            "final_reasoning": "The post-election unrest is severe and marks Cameroon’s most intense post-electoral crisis in decades, but the regime’s repressive apparatus remains firmly in control. Although Biya’s age presents a non-negligible succession risk, there is no current evidence of elite or military fracturing. The opposition is mobilized but lacks the capacity for armed insurrection or to penetrate the security elite. The recent wave of coups in West and Central Africa marginally raises risk via contagion, but Cameroon’s regime characteristics (deep institutionalization, absence of strong military opposition, and history of regime survival) align more with coup-resistant cases. Given the short time left until the question resolves (about six weeks), the window for a coup is closing rapidly unless a major shock occurs. The base rate for coups in similar entrenched African regimes is <2% per year, and the structural context in Cameroon does not suggest an imminent breakdown. Therefore, while the probability is not zero due to Biya’s health and regional instability, it remains low.",
            "final_probability": 7
        },
        "DiplomaticServices (CountryPoliticalReporting)": {
            "time_to_resolution": "Approximately 1.5 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Diplomatic Services with a focus on Country Political Reporting, my perspective is grounded in close monitoring of political-military dynamics, elite cohesion, security force loyalty, and the mechanics of regime stability and upheaval. This includes analyzing indicators of potential coups—such as military discontent, elite fragmentation, regime legitimacy crises, and the behavior of security services—while weighing both historical base rates and current context.",
            "status_quo": "The status quo is that President Paul Biya remains in power through repression, elite control, and security service loyalty, despite recurring protests, allegations of fraud, and limited opposition mobilization. No successful coup has occurred in Cameroon since the 1984 failed attempt; the regime has demonstrated resilience against both popular unrest and elite plots.",
            "perspective_derived_factors": [
                {
                    "factor": "Base Rate of Coups in Cameroon and Similar Regimes",
                    "effect": "Decreases probability. Cameroon has not experienced a successful coup since Biya took office in 1982, and the 1984 coup attempt failed. Highly personalized autocracies with long-serving leaders and strong security apparatuses have a low annual coup success rate, especially at the tail end of an old leader's rule."
                },
                {
                    "factor": "Recent Regional Coup Wave in Former French Colonies",
                    "effect": "Increases probability modestly. The 'coup contagion' in West and Central Africa (Burkina Faso, Niger, Gabon, Mali, etc.) demonstrates regional precedent, and international condemnation has been relatively muted, potentially lowering deterrence."
                },
                {
                    "factor": "Elite Cohesion and Security Service Loyalty",
                    "effect": "Decreases probability. Biya's regime has maintained tight control over the military and security forces, relying on patronage, ethnic balancing, and periodic purges. Recent reporting indicates continued crackdown and loyalty, with no signs of senior defection."
                },
                {
                    "factor": "Scale and Organization of Popular Protest",
                    "effect": "Minimal effect. While post-election protests have been widespread, they lack sustained organization and have been met with effective repression. The opposition is fragmented, and key figures are exiled, limiting their capacity to coordinate with potential putschists."
                },
                {
                    "factor": "Regime Legitimacy Crisis and Biya's Age/Health",
                    "effect": "Slightly increases probability. At 92, Biya's advanced age and persistent rumors about his health raise succession uncertainty. However, so far, the regime has managed the transition risk, and no alternative power center has clearly emerged."
                },
                {
                    "factor": "Reported Frustrations among Younger Population and within Lower Ranks",
                    "effect": "Slightly increases probability. Grievances among youth and potential frustrations within lower/mid-level security ranks could, in theory, create fertile ground for a coup, but there is no strong evidence of organized plotting or mutiny at this time."
                },
                {
                    "factor": "International Response and Incentives",
                    "effect": "Decreases probability. The international community, while critical of repression, has not encouraged a coup. Cameroon is geopolitically important (counter-terrorism, regional stability), and major partners prefer continuity to disruption."
                }
            ],
            "no_scenario": "The Cameroonian regime, led by Biya and his inner circle, continues to repress protests and detain opposition. The security forces remain loyal, and no credible reports emerge of a sustained armed takeover or power transfer by force. The opposition, while vocal, fails to translate unrest into a coordinated elite or military challenge. The situation remains tense but stable, with Biya or his chosen successor in control through the end of 2025.",
            "yes_scenario": "A faction within the military or security services, perhaps prompted by frustration over economic mismanagement, elite succession wrangling, or a sudden health crisis for Biya, orchestrates a rapid armed takeover of state institutions (presidential palace, state media, key ministries). They announce a new governing council and are able to hold power for at least seven days without being dislodged by loyalist forces or international intervention. This would require significant elite and at least partial military defection, none of which is currently visibly underway.",
            "final_reasoning": "Despite significant unrest, repression, and evident legitimacy crisis following the disputed 2025 election, there is little concrete evidence of elite fragmentation or imminent military defection. Biya's security apparatus remains highly effective at both intelligence and coercion; the opposition is fragmented and largely outside the country or under arrest. While the regional coup trend is notable, Cameroon’s internal regime mechanics, elite management, and coup-proofing remain robust. The advanced age and potential health issues of Biya do introduce some risk of a succession crisis, which could be an opening for a coup, but such transitions usually require longer lead times, signs of elite jockeying, or leaks of military plotting, none of which are present in current reporting. Given the short window remaining (about 1.5 months), the probability of a successful coup—defined as regime seizure for 7+ days before January 1, 2026—remains low, though not zero, as sudden shocks are possible. I estimate the probability at 6%.",
            "final_probability": 6
        },
        "MilitaryStrategy (CounterinsurgencyStabilityOperations)": {
            "time_to_resolution": "Approximately 1.5 months (question closes January 1, 2026).",
            "perspective_relevance": "As a MilitaryStrategy (CounterinsurgencyStabilityOperations) expert, I focus on regime durability, civil-military relations, elite cohesion, and the structural incentives for coups in autocratic, security-state contexts. I emphasize historical coup base rates, patterns of repression, and the operational environment for potential coup plotters.",
            "status_quo": "The status quo is that there is no successful coup in Cameroon. Paul Biya has maintained power for over 43 years, through repression, elite patronage, and security force loyalty. Despite recent unrest, the regime has weathered previous crises without a coup.",
            "perspective_derived_factors": [
                {
                    "factor": "Elite Cohesion and Security Force Control",
                    "effect": "Decreases probability. Biya's regime has a long history of maintaining elite cohesion through patronage, frequent reshuffles, and keeping rival centers of power divided. The security forces (military, gendarmerie, police) remain under tight regime control, with senior leadership benefiting materially from Biya's rule. No credible reports suggest acute fissures or mutinies at the top command level."
                },
                {
                    "factor": "Level and Nature of Civil Unrest",
                    "effect": "Slightly increases probability. The 2025 election aftermath has led to the most severe post-electoral crisis in Cameroon's history, with dozens killed, thousands arrested, and an opposition leader (Tchiroma) in exile calling for escalation. However, these protests, while widespread and occasionally violent, have been met with overwhelming repression rather than security force defections or split loyalties."
                },
                {
                    "factor": "Historical Coup Base Rate in Cameroon and Regional Trends",
                    "effect": "Slightly increases probability. Cameroon has not seen a successful coup since Biya took power in 1982, but the regional coup rate (Sahel/Francophone Africa) has surged since 2020. Even so, Cameroon's military is not known to be as politically independent or ambitious as those in Mali, Niger, or Burkina Faso."
                },
                {
                    "factor": "Regime Aging and Succession Uncertainty",
                    "effect": "Increases probability modestly. At age 92, Biya's rule is vulnerable to sudden health events, which could precipitate a power vacuum and scramble elite incentives. However, the regime's immediate post-election actions—swift repression, continuity messaging, and lack of elite defections—suggest that even if Biya were incapacitated, the system is primed for continuity over sudden rupture."
                },
                {
                    "factor": "Separatist and Insurgency Pressures",
                    "effect": "Neutral to slightly increases probability. While the Anglophone crisis and Boko Haram presence in the north stretch security forces thin, these are chronic rather than acute destabilizing factors. No evidence currently points to these conflicts creating a unified threat capable of tipping military elites toward a coup."
                },
                {
                    "factor": "International Reaction and Norms",
                    "effect": "Decreases probability. While international condemnation of repression is pronounced (HRW, UN), key foreign partners (France, US) have not signaled support for a coup. The regime is skilled at managing international optics and sanction risks."
                }
            ],
            "no_scenario": "Despite ongoing protests, mass arrests, and some violence, Biya's regime maintains cohesion at the top. Security forces remain loyal, opposition efforts are fragmented or exiled, and no credible reports emerge of mutinies or coup attempts. The regime weathers the unrest, possibly offering token reforms or reshuffles, and the question closes with Biya still in power.",
            "yes_scenario": "A sudden health crisis incapacitates or kills Biya, leading to confusion and contestation among elite factions. A military or elite group, sensing opportunity, seizes control of Yaoundé and key institutions, holding power for at least a week. Alternatively, a dramatic escalation in violence triggers key security leaders to overthrow Biya to prevent state collapse or protect their own interests.",
            "final_reasoning": "The current situation in Cameroon is tense and volatile, with the post-election crackdown representing a peak of popular frustration, but not yet elite division. The base rate for successful coups in Cameroon is very low in recent decades; the regime's repression apparatus and patronage networks remain intact. The opposition is highly mobilized but lacks the means to fracture the security forces. While Biya's advanced age introduces increased risk of sudden instability, all available evidence suggests the regime has, for now, managed to absorb the shock. There is little sign of a coup plot reaching the point of seizing state power and holding it for 7 days before January 1, 2026. Therefore, while the risk is higher than in most years, it is still well below 10%.",
            "final_probability": 7
        },
        "Political Science (CivilMilitaryRelationsTheory)": {
            "time_to_resolution": "Approximately 1.5 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Civil-Military Relations Theory, my analysis focuses on the balance of power between civilian leadership and the armed forces, patterns of coup-proofing, the cohesion and interests of the military, and the structural factors that historically drive coup attempts and their success in authoritarian and semi-authoritarian regimes. This perspective is crucial, as successful coups are rarely spontaneous; they depend on civil-military relations, regime stability, elite incentives, and the military's willingness or reluctance to intervene in politics.",
            "status_quo": "No successful coup has occurred in Cameroon since the early 1980s. Paul Biya, despite advanced age and recent post-election unrest, has retained power through highly centralized, personalized rule, extensive security apparatus control, and systematic repression of dissent.",
            "perspective_derived_factors": [
                {
                    "factor": "Regime Coup-Proofing and Security Apparatus Control",
                    "effect": "Decreases probability. Biya’s long tenure has allowed him to embed loyalists in command positions, create parallel security services, and structure the military to minimize the risk of unified action. There is no sign in current reporting that the security services have fractured or gone beyond the regime’s control."
                },
                {
                    "factor": "Military and Elite Cohesion",
                    "effect": "Decreases probability. Civil-military theorists stress that coup risk rises when the officer corps is divided or the top brass is alienated. Despite popular unrest, available news suggests the military and security leadership remain loyal, with no public defections or signs of collective discontent."
                },
                {
                    "factor": "Recent Patterns of Coup Activity in Africa (Regional Contagion)",
                    "effect": "Slightly increases probability. The past few years have seen a regional uptick in coups in Francophone Africa, especially in Sahelian states. However, Cameroon’s context is distinct: Biya’s regime is older, more deeply embedded, and the military is less politicized compared to recent coup-prone states."
                },
                {
                    "factor": "Elite and Popular Discontent, Regime Aging",
                    "effect": "Increases probability. Biya is 92 and there is notable public unrest, elite defection (Bakary), and violent post-election repression. Advanced age raises succession risk, and a sudden health crisis could create a power vacuum. However, so far, the regime has managed to contain unrest and elite splits have not translated into military action."
                },
                {
                    "factor": "International Response and Legitimacy",
                    "effect": "Decreases probability. Despite criticism from HRW and Western states, there is little evidence of international actors signaling support for a transition or for a coup, reducing external incentives for military action."
                }
            ],
            "no_scenario": "The security services remain loyal to Biya, protests are suppressed, and the opposition is unable to build a sufficient coalition to fracture the regime. The military, despite possible grumbling or individual dissatisfaction, does not attempt to seize power or, if it does, fails to hold it for 7 days. Biya (or his chosen successor in the event of sudden incapacity) continues to preside over a repressive but stable regime until at least January 1, 2026.",
            "yes_scenario": "A sudden health crisis or death of Biya creates a succession vacuum, leading to a split within the elite or security apparatus. A faction of the military or presidential guard seizes power, possibly in the guise of restoring order amid mass protests or elite infighting, and maintains control for at least 7 days. Alternatively, extreme post-election unrest catalyzes a breakdown in regime control, with the military stepping in and deposing the president.",
            "final_reasoning": "The base rate for successful coups in Cameroon is very low, with no successful attempts in over 40 years, despite periodic unrest. The recent wave of coups in Francophone Africa is noteworthy, but Cameroon’s regime is more coup-proofed and the military more tightly controlled than in states like Niger or Burkina Faso. The news shows severe repression, elite split (Bakary), and public unrest, but no direct evidence of military dissent or coup plotting. Biya’s advanced age and the volatile post-election context marginally raise coup risk, especially if he were incapacitated, but there is no indication of imminent military intervention. The regime, for now, appears to have contained unrest and preserved elite/military cohesion. With only about 1.5 months left, the window for a successful coup is closing. Therefore, while the risk is somewhat elevated compared to a completely stable regime, the probability remains low.",
            "final_probability": 8
        },
        "Political Science (CoupTrapHypothesis)": {
            "time_to_resolution": "Approximately 1.5 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Political Science with specialization in the Coup Trap Hypothesis, I focus on the interplay between regime longevity, repression, elite fragmentation, and the risks of military intervention. The Coup Trap Hypothesis suggests that autocratic regimes with declining legitimacy, aging leadership, and high levels of repression become increasingly vulnerable to coups, especially when the regime's survival appears to depend solely on coercion and elite loyalty. My perspective also incorporates recent African coup trends and the durability of personalist authoritarian regimes.",
            "status_quo": "Despite severe post-election violence, mass arrests, and disputed legitimacy, Paul Biya's regime remains firmly in control. Historically, Cameroon has not experienced a successful coup during Biya's four-decade rule, and the security apparatus has reliably suppressed dissent.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent Trend of Coups in Francophone Africa",
                    "effect": "Increases probability moderately; the wave of coups since 2020 in Mali, Burkina Faso, Niger, Gabon, and Guinea has signaled a breakdown of longstanding taboos against coups, especially in former French colonies with aging autocrats."
                },
                {
                    "factor": "Regime Repression and Elite Cohesion",
                    "effect": "Decreases probability; Biya’s regime has shown continued capacity for violent repression, mass arrests, and effective use of the security services to prevent organized opposition and dissent within the military or elite, limiting coup prospects in the short term."
                },
                {
                    "factor": "Aging, Isolated Leadership and Succession Uncertainty",
                    "effect": "Increases probability; Biya is 92, with persistent rumors about his health and no clear successor, which historically increases coup risk in personalist regimes nearing a generational transition."
                },
                {
                    "factor": "Opposition Weakness and Disunity",
                    "effect": "Decreases probability; while the opposition is mobilized and contesting the election, they lack unity, resources, and—critically—military backing, which is necessary for a successful coup."
                },
                {
                    "factor": "Recent Severe Crackdown and Prompt Regime Response",
                    "effect": "Decreases probability; the regime’s swift and brutal crackdown, including mass arrests and killings, has a chilling effect on further mobilization, reducing the short-term risk of a coup by demoralizing dissidents and deterring elite defection."
                },
                {
                    "factor": "Base Rate of Successful Coups in Cameroon and Similar Regimes",
                    "effect": "Decreases probability; base rates for successful coups in Cameroon's context (personalist autocracies, strong security services, history of coup-proofing) are very low, with no successful coups since 1982."
                },
                {
                    "factor": "International Context and Pressure",
                    "effect": "Neutral to slightly decreasing; while some Western partners are critical, there is no strong international push for regime change, and neighboring Nigeria has shown willingness to cooperate with Biya against exiled opposition."
                }
            ],
            "no_scenario": "The regime remains cohesive, with the military and security services loyal to Biya. The crackdown succeeds in deterring further opposition activity. Although the political crisis persists, international actors refrain from significant intervention, and no major elite or military faction attempts to seize power before January 1, 2026.",
            "yes_scenario": "A sudden health crisis incapacitates Biya, triggering elite panic and a split within the military or security services. A faction, possibly motivated by fears of post-Biya instability or to preempt a power grab by rivals, seizes control of state institutions and holds power for at least seven days, with credible reporting confirming the coup.",
            "final_reasoning": "While the post-election violence and deep regime unpopularity increase theoretical coup risk, the base rates for successful coups in Cameroon remain low. The regime’s proven capacity for repression, the lack of credible signs of elite defection, and the efficient suppression of both civilian and military dissent argue strongly for the persistence of the status quo. The recent African coup trend is noteworthy, but Cameroon’s specific conditions—especially elite cohesion and the absence of credible reports of coup plotting—make a successful coup unlikely in the very short window remaining before resolution. A coup is not impossible (especially if Biya’s health suddenly fails), but without clear signs of elite or military movement, the probability remains low.",
            "final_probability": 6
        },
        "Political Science (PoliticalInstabilityTheory)": {
            "time_to_resolution": "Approximately 1.5 months (until Jan 1, 2026)",
            "perspective_relevance": "As an expert in Political Instability Theory, my perspective is especially relevant because successful coups are rare, but occur where structural risk factors align: entrenched autocracy, elite divisions, economic malaise, popular unrest, security force fragmentation, and weak international deterrence. The present moment in Cameroon is marked by post-election violence, deepening repression, and a very aged incumbent. Political science offers empirically grounded ways to assess the probability of a coup, weighing both base rates across similar regimes and acute triggers.",
            "status_quo": "Paul Biya, in power since 1982, has survived multiple crises and coup rumors, relying on a loyal security apparatus and fragmented opposition. Cameroon has not experienced a successful coup since independence, despite chronic unrest. The regime has historically managed dissent with repression, co-optation, and institutional control. The default expectation is regime continuity through 2026.",
            "perspective_derived_factors": [
                {
                    "factor": "Base Rate of Coups in Africa/Francophone Africa",
                    "effect": "Increases probability modestly. The recent wave of coups in West and Central Africa, particularly in former French colonies (Niger, Burkina Faso, Mali, Gabon), raises the regional baseline. However, Cameroon has been historically more coup-resistant."
                },
                {
                    "factor": "Regime Entrenchment and Security Apparatus Loyalty",
                    "effect": "Decreases probability. Biya’s long tenure has enabled deep institutionalization of loyalists in security forces and elite circles, making coordinated military action against him difficult. The repression after the 2025 election reaffirms regime control."
                },
                {
                    "factor": "Elite Fragmentation and Opposition Mobilization",
                    "effect": "Increases probability. The prominent opposition figure (Tchiroma) is in exile, but continues to mobilize support and challenge legitimacy. The opposition is more unified than in some previous cycles, but still lacks clear access to state levers."
                },
                {
                    "factor": "Mass Unrest and State Crackdown",
                    "effect": "Mixed effect. Violent repression and mass arrests can catalyze elite discontent or provoke mutiny if security forces become demoralized or see themselves as scapegoats. However, so far the crackdown appears effective."
                },
                {
                    "factor": "Biya's Age and Uncertainty Over Succession",
                    "effect": "Increases probability slightly. At 92, Biya’s frailty is a structural vulnerability—should he die or become incapacitated, a power vacuum could trigger a coup or palace putsch."
                },
                {
                    "factor": "International Constraints and Attention",
                    "effect": "Decreases probability. While France and other partners are less willing/able to intervene, there is still some international deterrence, especially given the negative attention to regional instability."
                },
                {
                    "factor": "Economic Strain and Separatist Conflict",
                    "effect": "Increases probability slightly. Ongoing economic woes and conflict in Anglophone regions create stress on the regime and security sector, increasing risk of fractures."
                }
            ],
            "no_scenario": "Biya’s security forces maintain discipline and loyalty. The opposition is contained by repression, its leaders remain in exile or under threat. Popular unrest is managed through force and selective concessions. No credible military faction attempts, or is able to sustain, a coup for seven days. Biya survives until 2026 with the status quo intact.",
            "yes_scenario": "A faction within the military, possibly catalyzed by elite discontent, mass protests, or a sudden health crisis for Biya, seizes power in Yaoundé and holds control for at least seven days. This could follow a failed repression order, a breakdown in the capital, or a rapid succession struggle after Biya’s incapacitation or death. The coup-plotters quickly consolidate and are acknowledged as de facto rulers by credible sources.",
            "final_reasoning": "While the post-election crisis in Cameroon is the most severe in recent history—marked by dozens of deaths, thousands of arrests, and an aging autocrat facing increasingly organized dissent—the regime’s default mode of survival has held. The military and police have proven loyal and effective in suppressing unrest. The base rate for successful coups in countries like Cameroon (entrenched autocracy, history of repression, but no recent coups) is low—typically under 5% per year, and even lower as the time window shrinks. The acute factors—Biya's age, economic malaise, and regional coup contagion—do elevate risk, especially if Biya dies or is incapacitated. However, with just six weeks left until 2026, and the regime showing no signs of elite defection or loss of control, the probability of a successful coup (one that seizes power for 7 days, not just an attempt or mutiny) before Jan 1, 2026 remains low. My estimate is higher than the base rate due to current instability, but not dramatically so, as the regime’s control remains robust and the time window is short.",
            "final_probability": 7
        },
        "African Studies (PostcolonialStateDynamics)": {
            "time_to_resolution": "Approximately 7 weeks (until January 1, 2026)",
            "perspective_relevance": "As an African Studies (PostcolonialStateDynamics) expert, my perspective is grounded in the study of African state formation, the enduring legacies of colonial rule, patterns of neopatrimonial governance, and the empirical record of coups and regime change in Francophone Africa. I bring a focus on institutional resilience, elite bargaining, the logic of military intervention, and how postcolonial state structures shape coup likelihood.",
            "status_quo": "Paul Biya, in power since 1982, remains president after a disputed 2025 election marred by violence, repression, and opposition protests. Despite significant unrest, the regime has so far maintained control through coercion, elite co-optation, and centralized authority. Historically, Cameroon has demonstrated high regime durability and state capacity compared to many regional peers.",
            "perspective_derived_factors": [
                {
                    "factor": "Regime Durability and Elite Control",
                    "effect": "Decreases probability. Biya's regime has a long history of surviving crises, employing elite patronage, and maintaining tight control over security forces and key institutions. The ruling party and military have been largely loyal, and opposition fragmentation has limited broad-based threats."
                },
                {
                    "factor": "Recent Coup Wave in Francophone Africa",
                    "effect": "Increases probability. The regional environment has seen a surge in coups (Niger, Burkina Faso, Gabon, Mali), especially in former French colonies with aging autocrats. This may inspire or embolden military actors in Cameroon, especially amid post-election instability."
                },
                {
                    "factor": "Post-Election Crisis and Repression",
                    "effect": "Slightly increases probability. The scale of violence, mass arrests, and visible opposition to Biya's continued rule demonstrate regime brittleness. However, the state response has so far been effective in containing unrest, and the opposition lacks military backing."
                },
                {
                    "factor": "Health and Succession Uncertainty",
                    "effect": "Increases probability. Biya's advanced age (92) and health rumors introduce succession uncertainty. Such periods have historically increased coup risk in strongman regimes, as elites or military actors may move to preempt a chaotic transition."
                },
                {
                    "factor": "Security Apparatus Loyalty and Structure",
                    "effect": "Decreases probability. Cameroon’s security sector is tightly controlled, with overlapping agencies (military, presidential guard, gendarmerie) designed to prevent a single faction from acting independently. No credible reports suggest a major split."
                },
                {
                    "factor": "International Response and Incentives",
                    "effect": "Decreases probability. The international community, especially France and the US, have vested interests in Cameroon's stability and have not signaled support or acquiescence to a coup. Recent regional coups have led to sanctions/isolation, possibly deterring military adventurism."
                },
                {
                    "factor": "Base Rate of Coups in Cameroon",
                    "effect": "Decreases probability. Cameroon has not experienced a successful coup since the early 1980s and is not regarded as especially coup-prone, especially compared to neighbors."
                }
            ],
            "no_scenario": "Despite deepening repression and post-election unrest, the military and regime elites remain loyal to Biya, who manages to weather the crisis through patronage, targeted repression, and perhaps cosmetic concessions. The opposition continues protests and civil disobedience but fails to mobilize the security apparatus or provoke a large-scale mutiny. The regime’s control over key institutions and international backing ensure no group seizes power for a week or more.",
            "yes_scenario": "The ongoing crisis worsens, with further violence or a major event (e.g., Biya's sudden incapacitation/death, massacre of protesters, or a failed crackdown) causing a rift within the security forces. A faction of the military, frustrated by the regime’s handling of the crisis and uncertain succession, seizes control in Yaoundé, detains key regime figures, and holds power for more than seven days—either with or without civilian opposition support.",
            "final_reasoning": "The base rate for successful coups in Cameroon is low, with the last successful one over 40 years ago. While the regional environment is highly coup-prone, Cameroon’s regime has proven resilient, with strong elite-military ties and effective repression. The current post-election crisis is severe, but there is little evidence of a split or wavering in the core security apparatus. Succession uncertainty due to Biya’s age is a risk factor, but the regime has managed similar crises before. The opposition, while emboldened, lacks military backing and remains fragmented. International actors have not signaled support for a coup, and recent African coups have met with negative repercussions. Given all these factors, the probability is higher than the historical average for Cameroon but still below 1-in-5: the regime is under real pressure, but institutional inertia, security sector loyalty, and the absence of clear military defections support the status quo.",
            "final_probability": 15
        },
        "African Studies (PatrimonialismInAfricanPolitics)": {
            "time_to_resolution": "Approximately 1.5 months until January 1, 2026.",
            "perspective_relevance": "As an expert in African Studies with a focus on patrimonialism in African politics, I bring knowledge of how personal rule, patronage networks, civil-military relations, and elite bargaining shape regime stability and coup risk in Africa. Cameroon is a textbook case of deeply entrenched patrimonialism, where Biya’s long rule has relied on personalized control of the military, co-optation of elites, and manipulation of institutions, all of which are critical to assessing coup likelihood.",
            "status_quo": "Paul Biya remains in power through a combination of repression, elite co-optation, and highly centralized control over the security apparatus. Despite recurrent unrest, no successful coup has occurred in Cameroon since Biya took office in 1982.",
            "perspective_derived_factors": [
                {
                    "factor": "Patrimonial Control of Security Forces",
                    "effect": "Decreases probability; Biya’s decades-long, personalized management of the military and security sector, including frequent reshuffles and promotion of loyalists, reduces the likelihood of coordinated action against him."
                },
                {
                    "factor": "Elite Fragmentation and Buyoff",
                    "effect": "Decreases probability; Competing elites are co-opted via patronage and threats, limiting the emergence of a united anti-Biya coalition necessary for a successful coup."
                },
                {
                    "factor": "Repression and Surveillance",
                    "effect": "Decreases probability; The use of arbitrary arrests, mass detentions, and intelligence networks makes coup plotting risky and difficult."
                },
                {
                    "factor": "Popular Discontent and Post-Election Unrest",
                    "effect": "Increases probability slightly; The scale of opposition-led protests and violent state response in late 2025 creates underlying instability, which in some contexts can open windows for military intervention, especially if elite confidence in the regime wavers."
                },
                {
                    "factor": "Biya’s Age and Succession Uncertainty",
                    "effect": "Increases probability marginally; Biya’s advanced age (92) and lack of a clear succession plan could lead to increased coup risk if the president’s health suddenly declines or elite rivalries intensify, but so far, there is no sign of imminent collapse."
                },
                {
                    "factor": "Regional Coup Epidemic",
                    "effect": "Increases probability slightly; The recent spate of coups in Francophone Africa (e.g., Niger, Burkina Faso, Gabon) weakens the norm against coups and may embolden would-be plotters, though Cameroon’s internal dynamics are distinct."
                },
                {
                    "factor": "Anglophone Insurgency and Separatist Threat",
                    "effect": "Neutral to slightly decreasing probability; While persistent violence in the Anglophone regions destabilizes the country, it has not translated into military disloyalty or coup plotting, and the regime has successfully instrumentalized the threat to justify repression."
                }
            ],
            "no_scenario": "The military and security apparatus remain loyal to Biya, opposition protests are suppressed through a mix of force and strategic concessions, and elite factions are managed through patronage and promises of future succession. Despite unrest and international criticism, Biya stays in control through January 1, 2026, with no credible or sustained attempt by armed forces to seize power.",
            "yes_scenario": "A combination of escalating unrest, elite dissatisfaction (possibly triggered by Biya’s health crisis or a botched crackdown), and loss of confidence in the regime leads to a faction of the military, possibly mid-level officers, seizing key installations in Yaoundé and declaring a new government. The group maintains effective control for at least seven days, with credible international reporting confirming the transfer of power outside normal constitutional means.",
            "final_reasoning": "Cameroon’s post-election environment is tense, with significant violence, repression, and opposition mobilization. However, the critical variables for coup success—elite unity against the regime, military disaffection, and breakdown of patrimonial control—are not strongly present. Biya’s regime shows the hallmarks of deeply institutionalized patrimonialism: overlapping patronage networks, personalized surveillance, and a history of neutralizing threats through both repression and co-optation. The military remains tightly controlled; even amid regional coup contagion, Cameroon’s internal dynamics (including the regime’s proven crisis management and the population’s historical resignation) suggest inertia. The most likely scenario is continued harsh repression rather than regime overthrow. While the probability of a coup is higher than in a fully stable democracy, it remains well below 10% for the short remaining period. The base rate for coups in entrenched autocracies like Biya’s, particularly so late in an electoral cycle and with a regime adept at crisis management, is very low.",
            "final_probability": 4
        },
        "Security Studies (SecuritySectorGovernance)": {
            "time_to_resolution": "Approximately 1.5 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Security Studies with a focus on Security Sector Governance (SSG), I analyze the internal cohesion and professionalism of Cameroon's security forces, the robustness of civil-military relations, the historical coup propensity, and the government's capacity to manage dissent. This perspective allows for a nuanced assessment of coup risk, particularly in the context of recent post-election unrest, regional coup contagion, and the durability of Biya's regime.",
            "status_quo": "Paul Biya remains in power, having survived disputed elections and widespread protests through repression and security sector loyalty. No coup has occurred, and the government maintains effective control despite civil unrest.",
            "perspective_derived_factors": [
                {
                    "factor": "Security Force Cohesion and Loyalty",
                    "effect": "Decreases probability. Cameroon’s military and police have historically remained loyal to Biya, benefiting from patronage and a lack of significant factionalism. Despite documented abuses, there is no credible reporting of splintering or coup plotting within the ranks."
                },
                {
                    "factor": "Scale and Structure of Unrest",
                    "effect": "Marginally increases probability. The post-election protests are large, deadly, and sustained, with some calls for civil disobedience and open confrontation. However, unrest is predominantly civilian-driven and has not translated into armed insurrection or military defection."
                },
                {
                    "factor": "Regional Coup Contagion",
                    "effect": "Slightly increases probability. Recent coups in neighboring former French colonies (Burkina Faso, Niger, Gabon) demonstrate that elite dissatisfaction can lead to regime change. However, Cameroon’s military institution is more tightly controlled, and Biya has managed to avoid the specific conditions (e.g., severe military grievances, external pressures) that triggered coups elsewhere."
                },
                {
                    "factor": "Age and Health of the President",
                    "effect": "Marginally increases probability. Biya’s advanced age (92) and rumors of poor health could create uncertainty or succession struggles within the regime, a known trigger for coups in personalized authoritarian systems. However, there is no sign of acute incapacitation or elite moves against him."
                },
                {
                    "factor": "International Pressure and Legitimacy",
                    "effect": "Minimal impact. Although human rights abuses and electoral fraud have been widely condemned, there is little indication of international actors supporting or tolerating a coup, and Biya still enjoys some external legitimacy."
                },
                {
                    "factor": "Civil-Military Relations and Patronage Networks",
                    "effect": "Decreases probability. Biya has historically distributed patronage and maintained close personal ties with senior military commanders, a key coup-proofing strategy. There is no evidence this system has broken down."
                },
                {
                    "factor": "Historical Base Rate of Coups in Cameroon",
                    "effect": "Decreases probability. Cameroon has not experienced a successful coup since Biya took power in 1982. While the regional base rate of coups has risen, Cameroon's specific history remains comparatively stable."
                }
            ],
            "no_scenario": "Despite ongoing protests and international criticism, the security sector remains loyal to Biya. The regime maintains control through repression, selective concessions, and perhaps minor cabinet reshuffles. Opposition leaders are marginalized or exiled, and the unrest gradually subsides or is contained without sparking a power seizure by the military or any armed group.",
            "yes_scenario": "A sudden deterioration in Biya’s health or a significant split within the upper echelons of the military (possibly triggered by succession uncertainty, targeted international sanctions, or an escalation in violence) leads to a faction seizing power. The government is overtaken by an armed group—likely elements of the military or gendarmerie—which holds control of the capital and key institutions for at least seven days, fulfilling the coup definition.",
            "final_reasoning": "The base rate for successful coups in Cameroon is extremely low, with the last occurring before Biya’s rule. While the regional coup wave and post-election violence provide a modest uptick in risk, there is no credible reporting of military unrest, coup plotting, or cracks in elite cohesion. The security sector remains tightly bound to the president through patronage, and the opposition’s mobilization, though intense, is civilian-led and lacks armed backing. The regime has weathered past unrest with similar tactics—repression and selective engagement—without triggering a military takeover. Biya’s age and health are risk factors but do not, in isolation, create coup conditions. With only six weeks until the question’s resolution and absent any signals of elite defection or armed mutiny, the probability of a successful coup by January 1, 2026 remains low but not zero, given the current volatility and regional context.",
            "final_probability": 7
        },
        "Security Studies (FragileStatesIndex)": {
            "time_to_resolution": "Approximately 1.5 months (until January 1, 2026)",
            "perspective_relevance": "My expertise in Security Studies and familiarity with the Fragile States Index (FSI) is highly relevant because the risk of coups is closely tied to state fragility, legitimacy, security apparatus loyalty, and patterns seen in similar regimes. Cameroon rates as 'High Warning' on the FSI, with chronic human rights abuses, state repression, and a history of contested elections—key coup risk factors. However, coups are rare events even in fragile states; understanding which specific risk factors are present or missing is crucial for accuracy.",
            "status_quo": "Paul Biya remains in power, using security forces to suppress dissent, as he has for 43 years. There has not been a successful coup in Cameroon since he took office in 1982. Despite protests and repression, the regime has repeatedly weathered political crises through elite cohesion and force.",
            "perspective_derived_factors": [
                {
                    "factor": "Elite Cohesion and Security Apparatus Loyalty",
                    "effect": "Decreases probability. Biya's long rule is underpinned by a loyal military and security sector, with strategic appointments and patronage. No evidence from the news or history of significant splits or defections among top brass."
                },
                {
                    "factor": "Level of State Repression and Institutional Control",
                    "effect": "Decreases probability. The government is responding to unrest with brutal, coordinated, and systematic repression—signaling that the regime retains control over the coercive apparatus and has capacity to deter plotters."
                },
                {
                    "factor": "Recent Regional Coup Wave",
                    "effect": "Increases probability. Cameroon is a former French colony in a region that has seen multiple coups (Gabon, Niger, Burkina Faso, Mali) since 2021, showing that elite actors may be more willing to break norms in the current environment."
                },
                {
                    "factor": "Leader's Age and Succession Uncertainty",
                    "effect": "Increases probability. Biya is 92, with frequent health concerns and no clear succession plan, which can create windows of uncertainty or elite maneuvering, especially upon his sudden incapacitation or death."
                },
                {
                    "factor": "Intensity and Organization of Opposition",
                    "effect": "Neutral to slightly increases probability. The opposition is energized, claiming fraud and calling for mass protest, but it remains divided and lacks clear armed backing or penetration into the security apparatus."
                },
                {
                    "factor": "Economic and Social Stress",
                    "effect": "Increases probability modestly. Cameroon is facing economic challenges, youth unemployment, and regional conflicts (Anglophone separatism, Boko Haram threat), which can undercut regime legitimacy and, in theory, incentivize coups."
                },
                {
                    "factor": "Base Rate of Successful Coups in Cameroon",
                    "effect": "Decreases probability. The last coup attempt was in 1984, but it failed. Biya's regime has proven resilient, and successful coups in countries with such entrenched autocracies are rare without clear military disaffection."
                }
            ],
            "no_scenario": "Biya, despite his age and the post-election unrest, continues to rule. The security forces suppress opposition protests, arrest leaders, and maintain discipline. No major factional split emerges within the military or ruling party. Even if Biya's health fails, the regime manages a controlled transition, perhaps to a designated successor or family member, without an armed seizure of power.",
            "yes_scenario": "A sudden deterioration in Biya's health or death creates a power vacuum. Factions within the military or ruling party, dissatisfied with the prospect of a dynastic or unpopular successor, launch an armed intervention. A group seizes the presidential palace, detains key regime figures, and assumes control of the government, maintaining power for more than 7 days while credible international sources recognize the event as a coup.",
            "final_reasoning": "Coups are rare, even in fragile states facing unrest. The base rate for a successful coup in Cameroon within a 2-year window is low, given the regime's historical resilience. Current unrest is serious, with deadly repression and mass arrests, but the opposition is not (yet) reported to have significant support within the armed forces. There is no sign of elite splits or mutiny—Biya's system of patronage and careful management of the security apparatus appears intact, and the violent crackdown demonstrates regime capacity. The regional coup wave and Biya's advanced age do elevate risk above the background rate, as do succession uncertainties. However, with only about 1.5 months left in the forecast window and no sign of an imminent rupture in elite cohesion, the probability remains low, though not negligible. I adjust slightly upward from the historical base rate (which would be around 2-3%) to account for regional contagion and Biya's age, but the overall chance remains in the single digits.",
            "final_probability": 6
        }
    },
    "deliberation_probability": [
        7,
        7,
        6,
        7,
        8,
        6,
        7,
        15,
        4,
        7,
        6
    ],
    "deliberation_mean_probability": 7.2727272727272725,
    "deliberation_sd": 2.76010539983201,
    "deliberation_probability_result": 7
}