{
    "deliberation_results": {
        "Shipping and Maritime Operations (Risk Management ISO31000)": {
            "time_to_resolution": "Approximately 2 months and 3 weeks (until December 31, 2025)",
            "perspective_relevance": "As an expert in Shipping and Maritime Operations (Risk Management ISO31000), I bring a structured approach to analyzing risk tolerance, threat mitigation, corporate policy, international coordination, and insurance market dynamics. I can assess how Maersk, as a leading global carrier, weighs operational risks, insurance requirements, and compliance with international safety and security norms, as well as how risk appetite might shift given evolving threat levels and naval protection.",
            "status_quo": "As of early October 2025, Maersk has not resumed Red Sea transits. Its official policy remains an indefinite pause, citing persistent and severe Houthi threats. The most recent weeks have seen high-profile attacks, including the disabling of the MV Minerva Grahat. Naval operations are ongoing but have not restored trade to pre-crisis levels.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent and severe Houthi attacks (e.g., missile strikes on merchant vessels)",
                    "effect": "Decreases probability. The attacks demonstrate continued high risk for commercial shipping, especially high-profile operators like Maersk."
                },
                {
                    "factor": "International naval protection (EU ASPIDES, US-led operations extended to 2026)",
                    "effect": "Slightly increases probability. These missions show international commitment, but their efficacy is limited by numbers and rules of engagement, as highlighted in recent analysis."
                },
                {
                    "factor": "Maersk's risk management and insurance constraints",
                    "effect": "Decreases probability. The scale and nature of recent attacks, including loss of vessels and crew, will keep war risk premiums high and may make insurance coverage for Red Sea transits unavailable or prohibitively expensive, deterring resumption."
                },
                {
                    "factor": "Houthi targeting criteria (focus on Israeli-linked vessels)",
                    "effect": "Slightly increases probability. If Maersk can credibly demonstrate cargoes and vessels have no connection to Israel, and this is accepted by insurers and the Houthis, there is a narrow window for limited resumption."
                },
                {
                    "factor": "Geopolitical developments (Trump peace plan, Gaza ceasefires)",
                    "effect": "Mixed, but currently neutral to negative. While peace talks are ongoing, the Houthis and Iran seem intent on maintaining pressure. The link between Red Sea attacks and Gaza conflict resolution is tenuous and unreliable for risk planning."
                },
                {
                    "factor": "Shipping industry base rates for route resumptions post-conflict",
                    "effect": "Decreases probability. Historically, route resumptions follow not just de-escalation, but sustained periods of low risk and clear, credible guarantees—neither of which are present."
                }
            ],
            "no_scenario": "Maersk maintains its current policy through 2025, as attacks or credible threats persist, insurance markets refuse to underwrite Red Sea passages, and international naval operations fail to provide sufficiently robust protection. Maersk continues to route vessels via the Cape of Good Hope, prioritizing crew safety and cost predictability over time savings.",
            "yes_scenario": "A marked, sustained reduction in Houthi attacks—perhaps due to a verified ceasefire, major geopolitical shift, or overwhelming international naval presence—leads to a public change in Maersk policy. Maersk resumes limited, possibly escorted, transits, perhaps only for non-Israeli-linked cargoes, with a formal announcement or evidence of several vessels transiting by year's end.",
            "final_reasoning": "The base rate for shipping resumption after major security disruptions is low, often requiring months of proven stability—something not currently present. The past three months have seen continued, even escalated, attacks. Maersk is a highly risk-averse operator with global reputation and regulatory obligations. The insurance market remains hostile to Red Sea transits, and even with extended naval missions, their limited scope and difficulties in guaranteeing safety (as repeatedly evidenced since June 2025) mean no robust risk mitigation is in place. The only plausible path to resumption would be a sudden and dramatic de-escalation, which current indicators do not support. Given the recency and severity of attacks, the cautious nature of Maersk’s risk management, and the lack of compelling evidence for imminent de-escalation, the probability of Maersk resuming Red Sea shipping in 2025 is very low.",
            "final_probability": 8
        },
        "Shipping and Maritime Operations (International Maritime Law UNCLOS)": {
            "time_to_resolution": "Approximately 85 days (question resolves January 1, 2026; today is October 7, 2025)",
            "perspective_relevance": "As an expert in Shipping and Maritime Operations under international law (UNCLOS), my perspective is crucial for understanding the risk landscape, insurance decisions, flag state responsibilities, maritime security operations, and the behavior of large shipping firms like Maersk. I can also assess the impact of military and diplomatic developments on commercial shipping decisions and weigh the effectiveness of international protection efforts.",
            "status_quo": "Maersk has paused all Red Sea transit since January 2024 and has not yet resumed. As of October 2025, major attacks continue, and the Red Sea remains highly insecure, with military naval escorts insufficient to prevent frequent, deadly attacks. Maersk continues to reroute ships around the Cape of Good Hope.",
            "perspective_derived_factors": [
                {
                    "factor": "Intensity and Frequency of Houthi Attacks",
                    "effect": "Decreases probability. Recent news confirms persistent, deadly missile attacks (as late as September 2025), ship sinkings, and explicit targeting of vessels with only tenuous links to Israel. The risk has not abated, and Maersk's risk tolerance is low."
                },
                {
                    "factor": "Effectiveness of International Naval Protection (EU ASPIDES, US-led Operations)",
                    "effect": "Slightly increases probability, but currently insufficient. While hundreds of ships have been escorted, coverage is thin, and attacks still occur—often on unescorted vessels. The limited availability of naval escorts means most commercial vessels cannot reliably count on protection."
                },
                {
                    "factor": "Maersk’s Corporate Policy and Insurance Constraints",
                    "effect": "Strongly decreases probability. Maersk is a risk-averse, publicly traded company. Insurance for Red Sea transits is extremely expensive or unavailable for non-escorted transits, especially after recent fatal attacks. Any resumption would require a substantial, well-publicized change in risk assessment or security guarantees."
                },
                {
                    "factor": "Diplomatic and Political Developments (Gaza Ceasefire, Trump Peace Plan, Houthi Messaging)",
                    "effect": "Neutral to slightly negative. While there are ongoing peace talks and mentions of Hamas signaling acceptance of a US peace plan, no durable ceasefire or resolution has been reached. Houthis have explicitly stated attacks will continue as long as Israeli action in Gaza persists. Recent escalation (missile strikes on Israel) shows the conflict is not winding down."
                },
                {
                    "factor": "Shipping Traffic Trends and Base Rates",
                    "effect": "Slightly increases probability. There was a reported 60% increase in shipping since August 2024, but volumes remain far below pre-crisis levels and are largely limited to ships not associated with Israel. The base rate for Maersk specifically resuming in the context of continued violence is very low, as seen with past disruptions (e.g. Somali piracy), where major lines only returned after clear, sustained security improvements."
                },
                {
                    "factor": "Precedents and Fine Print (Partial Resumption, Announcements)",
                    "effect": "Slightly increases probability. The resolution allows for a partial or announced resumption. If Maersk even partially resumes, or announces a plan and follows through, the question would resolve as Yes. However, as of now, there is no public indication of such plans."
                }
            ],
            "no_scenario": "Maersk maintains its Red Sea suspension through the end of 2025, as attacks continue sporadically but with enough severity and unpredictability to keep insurance unavailable and risk unacceptable. No major diplomatic breakthrough is achieved, and international naval presence remains insufficient to guarantee safety for routine commercial operations.",
            "yes_scenario": "A significant diplomatic breakthrough occurs (e.g., a durable ceasefire in Gaza and an explicit, verifiable halt to Houthi attacks is reached), or international naval operations are greatly expanded, providing reliable military escort to all vessels, leading Maersk to announce a phased or trial resumption of Red Sea transits before the end of 2025.",
            "final_reasoning": "The base rate for Maersk resuming Red Sea transits in the context of ongoing, frequent, and deadly Houthi attacks is extremely low. Despite some increase in traffic, the recent missile attack on the 'MV Minerva Grahat' (late September 2025) and ongoing deadly incidents show the situation remains highly volatile and dangerous. Naval escorts are insufficient and coverage is limited, while Maersk’s own public statements have set a high bar for resumption. No new announcements from Maersk or credible indications of imminent change are present in recent reporting. Even partial resumption would require a sharp, observable improvement in security or a major change in the strategic context, neither of which have materialized. Barring a sudden and unlikely breakthrough in Gaza or a massive international military surge, Maersk is highly likely to keep its suspension in place for the remainder of 2025.",
            "final_probability": 8
        },
        "Shipping and Maritime Operations (ISPS Code Compliance)": {
            "time_to_resolution": "Approximately 3 months, until December 31, 2025",
            "perspective_relevance": "As an expert in Shipping and Maritime Operations with a focus on ISPS Code compliance, I bring an understanding of how security risks, regulatory requirements, and insurance market conditions influence major line operators like Maersk. My experience allows me to assess not just the direct military and political drivers, but also the risk tolerances, operational policies, and compliance frameworks that must be satisfied before a company like Maersk resumes operations in a high-risk region such as the Red Sea.",
            "status_quo": "Maersk has indefinitely paused Red Sea transits since January 2024 due to Houthi attacks. As of October 2025, there is no public announcement of a resumption, and attacks have continued, including deadly recent incidents.",
            "perspective_derived_factors": [
                {
                    "factor": "Persistent Houthi threat and attack capability",
                    "effect": "Decreases probability. Repeated missile, drone, and boat attacks—including recent fatal incidents and claims of hundreds of attacks—mean the threat environment remains acute and unpredictable."
                },
                {
                    "factor": "Effectiveness and coverage of naval protection (EU Operation Aspides/US-led coalitions)",
                    "effect": "Slightly increases probability, but weakly. Naval escorts have provided some protection and reduced attacks in certain periods, but coverage is insufficient, and there are delays/waiting times for escorts. Large-scale, sustained protection for all commercial ships remains unachieved."
                },
                {
                    "factor": "Maersk's risk tolerance, insurance requirements, and ISPS Code compliance",
                    "effect": "Decreases probability. Maersk's public position is conservative, requiring a demonstrably secure environment for resumption. The ISPS Code and insurance underwriters demand a risk profile far lower than present, especially after recent deadly attacks and kidnappings."
                },
                {
                    "factor": "Geopolitical negotiations and Gaza ceasefire prospects",
                    "effect": "Mixed, but presently neutral to negative. While there are peace negotiations ongoing and a US-led push for a ceasefire, the Houthis explicitly link attacks to the Gaza blockade, and even during negotiation periods, they have escalated attacks. No definitive ceasefire or policy change yet."
                },
                {
                    "factor": "Change in Houthi targeting policy (focus on Israeli-linked shipping)",
                    "effect": "Slightly increases probability. There were periods when Houthis stated attacks focused only on Israeli-linked ships, but in practice, targeting remains broad and ambiguous, and Maersk cannot guarantee its ships would never be targeted on mistaken or misattributed grounds."
                },
                {
                    "factor": "Industry precedent and base rates of resumption after similar threats (e.g., Somali piracy)",
                    "effect": "Decreases probability. Historically, major line operators only resumed full operations after a sustained reduction in threat, robust international naval presence, and insurance market normalization. The Red Sea situation shows less progress than those precedents."
                }
            ],
            "no_scenario": "Maersk continues to avoid the Red Sea throughout 2025, citing continued Houthi attacks, lack of reliable naval protection, prohibitive insurance costs, and ISPS Code risk assessments that deem the area non-compliant for safe passage. No official announcement of resumption is made, and any limited increases in shipping are from smaller or regional carriers, not Maersk.",
            "yes_scenario": "A material ceasefire or reduction in hostilities occurs in Gaza, leading to a significant drop in Houthi attacks or a clear shift in their targeting policy. This is accompanied by a robust, credible multinational naval protection framework, insurance market relaxation, and public Maersk announcement of even partial route resumption through the Red Sea before year-end 2025.",
            "final_reasoning": "The base rate for rapid resumption of major container shipping in the face of active, unpredictable insurgent attacks is low. Maersk, as a global leader and bellwether, has a particularly low risk tolerance and must comply with both ISPS Code and insurance requirements, which currently cannot be satisfied given recent fatal attacks, kidnappings, and ongoing missile/drone activity. The international naval missions (EU ASPIDES, US-led) have not been able to fully secure the region, and recent news details attacks as recently as September-October 2025, some with deadly results. Even though attacks have, at times, focused on Israel-linked shipping, ambiguity and operational uncertainty remain too high for a company of Maersk's profile to resume—even partially—without a clear, demonstrable, and sustained reduction in threat, which is not in evidence as of October 2025. Peace negotiations are ongoing, but no breakthrough has occurred, and the Houthis remain both capable and willing to escalate. Therefore, the probability of Maersk announcing or being credibly reported as resuming Red Sea shipping before January 1, 2026, is low.",
            "final_probability": 15
        },
        "Security Risk Assessment (Maritime Threat Assessment)": {
            "time_to_resolution": "Less than 3 months (question resolves on Jan 1, 2026; today is Oct 7, 2025)",
            "perspective_relevance": "As an expert in maritime threat assessment, I bring a structured analysis of the security environment in the Red Sea, including patterns of non-state actor attacks, international naval response effectiveness, shipping risk tolerance, and Maersk's operational safety protocols. I can incorporate both the technical and geopolitical drivers of maritime risk, as well as how large shipping companies translate these into resumption/cessation decisions.",
            "status_quo": "Maersk has not resumed shipping in the Red Sea as of October 2025, following its indefinite pause in January 2024 due to persistent Houthi attacks. The operational environment remains high-risk, with major shipping companies still largely avoiding the area or only transiting with heavy naval escort.",
            "perspective_derived_factors": [
                {
                    "factor": "Current threat environment (Houthi attacks)",
                    "effect": "Decreases probability. The Houthis have conducted multiple high-profile attacks, including sinkings and crew casualties as recently as late September 2025. Their targeting criteria remain broad and sometimes ambiguous, affecting operator confidence."
                },
                {
                    "factor": "International naval protection (EU ASPIDES, US/UK/India navies)",
                    "effect": "Slightly increases probability. These operations have provided some deterrence and escorted hundreds of vessels, but recent attacks on unescorted ships and persistent resource constraints undermine confidence in protection for all commercial shipping."
                },
                {
                    "factor": "Maersk’s risk tolerance and corporate policy",
                    "effect": "Decreases probability. Maersk has been highly risk-averse, pausing all Red Sea transits despite partial naval coverage and only resuming when the threat is clearly reduced to an acceptable threshold. CEO guidance in early 2024 suggested a conservative posture."
                },
                {
                    "factor": "Ceasefire/peace progress in Gaza and regional de-escalation",
                    "effect": "Slightly increases probability. There is some diplomatic movement, with a Trump peace plan and Hamas’s announced acceptance, but major attacks and Houthi statements indicate that these developments have not yet translated into operational security improvements."
                },
                {
                    "factor": "Shipping pattern trends and risk segmentation",
                    "effect": "Neutral to slightly positive. There are reports of increased overall shipping activity since August 2024, but still well below pre-crisis levels and mainly limited to ships not linked to Israel. Maersk’s resumption would likely be slow and partial, if at all."
                },
                {
                    "factor": "Houthis’ strategic calculus and Iranian influence",
                    "effect": "Decreases probability. The Houthis’ attacks are described as tools of leverage for both the Gaza conflict and Iran’s regional ambitions, and their willingness to escalate or de-escalate is not purely local. With Iran under renewed sanctions and seeking leverage, further escalation is possible."
                }
            ],
            "no_scenario": "Despite some diplomatic progress in Gaza, Houthi attacks continue sporadically, targeting vessels with ambiguous or minimal links to Israel. Maersk maintains its risk-averse stance, citing unacceptable risks to crew and cargo. International naval protection remains limited and reactive, unable to guarantee safe passage for all shipping. Maersk does not announce or implement a resumption of any Red Sea transits by the end of 2025.",
            "yes_scenario": "A sustained reduction in attacks occurs, potentially due to an Israeli-Hamas ceasefire that holds for several months, and/or a new international agreement or enhanced naval effort that provides credible, consistent protection. Maersk, possibly in cooperation with naval escorts, announces a partial resumption of carefully controlled Red Sea transits before Jan 1, 2026, perhaps initially for vessels with no Israel connection or under explicit naval convoy.",
            "final_reasoning": "The base rate for major shipping lines resuming operations after a sustained campaign of targeted non-state attacks is low, especially when the threat is ongoing and attacks are both lethal and unpredictable. While there is some evidence of increased shipping through the Red Sea in the last few months, the risk remains high, with recent fatal attacks on commercial vessels. The Houthis show no signs of ceasing attacks unilaterally and explicitly tie their operations to both the Gaza conflict and broader Iranian objectives. International naval operations are active but not comprehensive, and resource limitations mean that not all ships can be protected at all times. Maersk’s posture has been consistently conservative, and there is no evidence from reporting or industry statements that Maersk is preparing for an imminent resumption. The fine print allows for partial resumption to resolve 'Yes', but even this seems unlikely before the end of 2025 given the present threat tempo, the recency of deadly attacks, and Maersk’s past statements. My estimate, reflecting the persistent high threat, Maersk’s risk aversion, and the lack of a decisive diplomatic or military shift, is that the probability Maersk resumes Red Sea shipping in 2025 is low.",
            "final_probability": 10
        },
        "Security Risk Assessment (Critical Infrastructure Protection Standards)": {
            "time_to_resolution": "About 3 months (until December 31, 2025)",
            "perspective_relevance": "As an expert in Security Risk Assessment (Critical Infrastructure Protection Standards), I focus on organizational risk tolerances, threat likelihoods, escalation/de-escalation indicators, and the interplay between geopolitics and the operational risk calculus for major shipping lines like Maersk. My analysis weighs not just the raw frequency of attacks, but the broader risk environment, the efficacy of existing security measures, and the incentives/disincentives for resuming operations.",
            "status_quo": "Maersk has indefinitely suspended Red Sea shipping due to Houthi attacks and has not resumed as of October 2025, with recent severe attacks and no public announcements indicating imminent policy change.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent escalation of Houthi attacks",
                    "effect": "Decreases probability. The attacks have increased in both severity and frequency in recent weeks, including missile strikes on merchant vessels and hypersonic missile attacks on Israel, showing that the threat to shipping is not diminishing."
                },
                {
                    "factor": "International naval protection efforts (EU Operation Aspides, US-led coalitions)",
                    "effect": "Slightly increases probability but not enough to offset the threat. These have protected hundreds of ships but have not deterred major attacks or prevented casualties, and the number of naval escorts is insufficient for large-scale commercial resumption."
                },
                {
                    "factor": "Maersk’s risk tolerance and public statements",
                    "effect": "Decreases probability. Maersk has a very low tolerance for risk to its crews and vessels, given reputational and insurance costs. The CEO previously said not to expect resumption until well into 2025, and no change in public posture is evident."
                },
                {
                    "factor": "Base rates/historical precedent",
                    "effect": "Decreases probability. In similar cases (e.g., Somali piracy), major shipping lines did not resume operations until the risk environment improved substantially and consistently over months, not weeks."
                },
                {
                    "factor": "Geopolitical dynamics and negotiations",
                    "effect": "Neutral to slightly negative. While there are ongoing peace negotiations for Gaza, the Houthis have explicitly linked their attacks to Israeli actions. Unless a durable ceasefire and Gaza blockade relief are achieved and hold, the risk remains high."
                },
                {
                    "factor": "Narrowing of Houthi targeting criteria",
                    "effect": "Slightly increases probability. Some reports suggest Houthis are focusing attacks on Israeli-linked ships, but ambiguity and past errors (attacks on ships with tenuous links) mean Maersk will remain cautious."
                },
                {
                    "factor": "Insurance and regulatory environment",
                    "effect": "Decreases probability. Insurers are unlikely to cover Red Sea transits without dramatic security improvements; Maersk will not resume without insurance."
                }
            ],
            "no_scenario": "The status quo holds: Houthi attacks continue at a high or unpredictable rate, international naval protection remains insufficient, and there is no significant, durable reduction in threat perception. Maersk, prioritizing crew safety and insurance constraints, maintains its suspension through 2025. Even if some other lines resume, Maersk waits for more robust improvement or a political breakthrough.",
            "yes_scenario": "A durable, widely recognized ceasefire is achieved in Gaza, the Houthis announce a halt to attacks (and this is demonstrated over several months), and international naval protection is significantly boosted—enough to convince insurers and Maersk’s risk managers that the threat has dropped to acceptable levels. Maersk announces a (possibly partial, escorted, or conditional) resumption of Red Sea sailings before the end of 2025.",
            "final_reasoning": "The base rate for rapid resumption of shipping after sustained maritime attacks is low. The recent news shows ongoing, even escalating, Houthi attacks—including the disabling of a Dutch merchant vessel and continued missile/drone attacks on Israel and Red Sea shipping. Despite international naval efforts, the number of ships attacked and the intensity of violence (including deaths and hostage-taking) have not meaningfully abated. Maersk's risk posture is historically conservative; there is no indication from public statements or market moves that it is preparing to resume, and insurance markets remain extremely wary. Even if some improvement occurs (e.g., a Gaza ceasefire), there is little time left in 2025 to demonstrate a sustained reduction in risk sufficient for Maersk to change its policy. The fine print allows for partial or conditional resumption, but with only ~3 months to go, the combination of persistent threat, insurance obstacles, and Maersk's risk aversion make resumption unlikely. Therefore, my initial forecast is strongly negative but not absolute, accounting for a slim chance of a rapid positive geopolitical breakthrough.",
            "final_probability": 10
        },
        "International Relations (Security Dilemma Theory)": {
            "time_to_resolution": "Approximately 2 months and 3 weeks (until December 31, 2025)",
            "perspective_relevance": "As an International Relations (IR) expert specializing in Security Dilemma Theory, my perspective is critical for assessing the Red Sea’s shipping crisis. Security Dilemma Theory highlights how defensive actions by states or non-state actors (e.g., Houthi missile attacks, Western naval deployments) can inadvertently escalate tensions, generate arms races, or create spirals of insecurity, making de-escalation and the restoration of commercial norms (like Maersk’s Red Sea routes) difficult. This lens helps to understand the persistent threats and the reciprocal reactions inhibiting a return to status quo commercial activity.",
            "status_quo": "As of early October 2025, Maersk has not resumed Red Sea shipping. The company’s pause, initiated in January 2024, remains in effect due to ongoing Houthi attacks, attempted ship sinkings, and persistent regional instability, despite naval protection efforts.",
            "perspective_derived_factors": [
                {
                    "factor": "Continued Houthi missile and drone attacks (October 2025 incidents)",
                    "effect": "Decreases probability. The very recent attacks on merchant vessels, including the Dutch-flagged MV Minerva Grahat, and the use of ballistic/hypersonic missiles, indicate an unabated threat. Maersk, as a risk-averse commercial actor, is unlikely to resume without evidence of sustained security improvements."
                },
                {
                    "factor": "International naval protection (EU Operation Aspides, US, UK, Indian presence)",
                    "effect": "Slightly increases probability. While naval escorts and monitoring have helped some ships, coverage is limited (only 2-3 ships at a time). The lack of robust, proactive engagement (cf. Somali piracy response) means the deterrence effect is weak. Maersk may not be sufficiently reassured."
                },
                {
                    "factor": "Narrowing of Houthi target criteria",
                    "effect": "Marginally increases probability. Houthi spokespeople have reiterated targeting only ships linked to Israel or Israeli ports; however, the definition remains broad and ambiguous, and accidental or misidentified targeting remains likely. Major shippers may still see risk as too high."
                },
                {
                    "factor": "Recent escalation and regional spillover (missile launches on Israel, ongoing Gaza conflict)",
                    "effect": "Decreases probability. The ongoing missile attacks on Israel and escalatory rhetoric from both Israel and the Houthis suggest instability will persist. With each side leveraging maritime insecurity for bargaining, incentives for de-escalation are low."
                },
                {
                    "factor": "Ceasefire and diplomatic developments (Trump plan, peace talks)",
                    "effect": "Slightly increases probability. If peace talks yield a durable reduction in hostilities (especially in Gaza), this could indirectly reduce Houthi attacks and encourage Maersk to reassess. However, as of early October, the situation is fluid and attacks continue."
                },
                {
                    "factor": "Base rate for resumption after piracy/terror in major sea lanes",
                    "effect": "Strongly decreases probability in short term. Historically, after major piracy/terror waves (e.g., Somali piracy), it took several years, robust international responses, and a clear drop in attacks before shipping fully resumed. Given the higher intensity and politicization of this crisis, the base rate for rapid resumption is low."
                }
            ],
            "no_scenario": "Maersk does not announce or resume any Red Sea shipping in 2025. Houthi attacks continue sporadically, with occasional high-profile incidents (missile/drone strikes, ship sinkings). Naval protection remains partial and risk-averse commercial actors (especially Maersk) opt to reroute vessels around the Cape of Good Hope until there is a sustained period (months) of zero attacks, which does not occur before December 31, 2025. Ongoing Israel-Gaza conflict and Iran’s proxy posture prevent meaningful de-escalation.",
            "yes_scenario": "A ceasefire in Gaza is reached and holds, resulting in a sharp reduction or cessation of Houthi attacks on commercial shipping. International efforts (EU, US, GCC) either ramp up naval protection or broker a separate maritime security deal with the Houthis, perhaps involving guarantees or incentives. Maersk, responding to improved security conditions, makes a formal announcement of at least partial resumption of Red Sea routes before December 31, 2025.",
            "final_reasoning": "Recent news (October 2025) shows the Red Sea remains highly insecure, with fresh Houthi missile attacks on commercial vessels and on Israel itself. While some diplomatic overtures are underway (Gaza peace talks, Trump plan), the Houthis explicitly position their attacks as leverage, with no sign of de-escalation. International naval protection exists but is insufficiently robust or comprehensive to reassure a major risk-averse shipper like Maersk, especially given the base rate of slow recovery after maritime terror campaigns. The Security Dilemma dynamic—where defensive measures (naval presence, retaliatory strikes) provoke further Houthi escalation—remains unresolved. The narrow definition of Houthi targets is ambiguous and, combined with recent deadly attacks, keeps insurance rates and perceived risk high for global shipping. Considering the status quo, recent escalation, and historical precedent for slow recovery, the probability Maersk will resume Red Sea shipping in 2025 is low, but not zero, allowing for a modest chance of a breakthrough if peace talks succeed. However, as of now, there is no clear evidence of imminent de-escalation or security improvement sufficient to induce Maersk to change policy.",
            "final_probability": 13
        },
        "International Relations (Maritime Security Studies)": {
            "time_to_resolution": "Almost 3 months (until December 31, 2025)",
            "perspective_relevance": "As an international relations and maritime security studies expert, I bring a deep understanding of the strategic interests of major shipping lines, the operational calculus of non-state actors like the Houthis, the effectiveness of multinational naval protection measures, and the impact of geopolitical events (such as Gaza ceasefire negotiations or the Iran nuclear situation) on maritime risk assessments. I also have insight into how insurance, risk, and business incentives interact with real-world naval security and policy shifts.",
            "status_quo": "As of early October 2025, Maersk has not resumed Red Sea shipping after its January 2024 suspension. Houthi attacks remain frequent and severe, targeting a broad set of vessels, including those only tenuously linked to Israel. International naval operations (EU's Aspides, US-led efforts) have failed to fully deter attacks. Most major shipping companies, including Maersk, are still rerouting via the Cape of Good Hope, despite higher costs.",
            "perspective_derived_factors": [
                {
                    "factor": "Intensity and Frequency of Houthi Attacks",
                    "effect": "Decreases probability. Recent attacks (e.g., October 2025 missile strike on MV Minerva Grahat) show the Houthis retain capability and intent to target commercial shipping. There are new types of attacks (hypersonic missiles) and a willingness to strike ships with weak or indirect Israel ties, raising operational risk to unacceptable levels for Maersk."
                },
                {
                    "factor": "Effectiveness and Credibility of Naval Protection",
                    "effect": "Decreases probability. EU Operation Aspides has extended its mandate but is overstretched and only partially effective. US-led operations remain largely defensive. Reports note the missions have 'very few naval units' and cannot guarantee ship safety, especially given the sophistication and frequency of Houthi attacks."
                },
                {
                    "factor": "Maersk's Corporate Risk Appetite and Insurance Constraints",
                    "effect": "Decreases probability. Maersk has historically been highly risk-averse regarding crew safety, insurance liability, and reputational risk. Insurers have denied coverage to vessels in the Red Sea, and the recent deadly attacks (crew deaths, kidnappings) reinforce Maersk's incentives to avoid the route."
                },
                {
                    "factor": "Geopolitical Developments: Israel-Gaza and Iran",
                    "effect": "Neutral to slightly increases probability. There is some movement towards ceasefires and a potential peace plan for Gaza, with Trump’s plan seeing tentative acceptance by Hamas and some Israeli negotiation. However, attacks have not ceased with negotiations; the Houthis explicitly tie attacks to both Gaza and broader Iranian strategic interests."
                },
                {
                    "factor": "Houthi Targeting Policy",
                    "effect": "Decreases probability. Despite claims that only Israel-linked ships are targeted, in practice, the Houthis have attacked vessels with weak or ambiguous links, making it difficult for Maersk to assess and mitigate exposure. Recent attacks on non-Israeli-flagged ships (e.g., Dutch, Greek) show the risk remains high for all major shippers."
                },
                {
                    "factor": "Base Rate/Historical Precedent for Resumption after Pirate/Insurgent Threats",
                    "effect": "Slightly increases probability. Historically, major shipping companies have resumed routes after effective international suppression of threats (e.g., Somali piracy), but only after a clear and sustained drop in attacks and robust risk mitigation. As of October 2025, such a drop is not evident."
                }
            ],
            "no_scenario": "Ceasefire negotiations in Gaza stall or produce only a tenuous agreement, and the Houthis continue (or escalate) their attacks on Red Sea shipping, including vessels with only marginal ties to Israel. International naval operations continue to be stretched thin, failing to provide adequate protection or deterrence. Maersk, facing insurer refusals and unacceptable risk to crew and cargo, maintains its suspension through 2025. Even if some shipping resumes with smaller operators or under military escort, Maersk’s official policy remains unchanged.",
            "yes_scenario": "A durable ceasefire or peace agreement is reached for Gaza, with significant de-escalation in the region. Under international (US/EU/Gulf) pressure, the Houthis halt attacks, either as part of a broader Iran-West settlement or due to internal constraints. The level of attacks drops to near-zero for several months, insurers begin offering coverage, and Maersk, possibly after a public risk review and in coordination with naval escort missions, announces a partial or trial resumption of Red Sea shipping before December 31, 2025.",
            "final_reasoning": "The situation as of October 2025 is highly unfavorable for a Maersk resumption. The past few months have seen a return to high-intensity Houthi attacks, including the sinking of ships, crew deaths, and use of advanced weaponry. International naval protection is acknowledged as inadequate, with persistent risk even for ships with minimal Israel ties. Insurance coverage remains problematic, and Maersk has historically prioritized safety and liability above route efficiency. Geopolitical negotiations offer some hope, but the direct linkage of Houthi attacks to both Gaza and broader Iranian regional objectives means that even a peace deal may not immediately translate into reduced risk. The base rate for rapid resumption after such a persistent and lethal threat is low, especially when the threat has not abated and the actors involved are not easily deterred. A partial or symbolic resumption is possible if there is a dramatic and rapid de-escalation, but as of now, all indicators point toward continued suspension. I assess the probability that Maersk will resume shipping in the Red Sea in 2025 at 15%.",
            "final_probability": 15
        },
        "Political Science (Conflict Resolution Theory)": {
            "time_to_resolution": "Approximately 3 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Political Science with a focus on Conflict Resolution Theory, I analyze the incentives, signaling, and bargaining behaviors of both state and non-state actors, as well as the role of third-party intervention, security dilemmas, and the impact of ongoing conflict on commercial decisions. I am attuned to how escalation, de-escalation, and credible commitments affect the risk calculus for companies like Maersk and the effectiveness of international security operations.",
            "status_quo": "Maersk has indefinitely suspended shipping through the Red Sea due to persistent Houthi attacks and has not yet resumed operations as of early October 2025. International naval protection has not restored sufficient safety to allow a return to normal operations.",
            "perspective_derived_factors": [
                {
                    "factor": "Intensity and Frequency of Houthi Attacks",
                    "effect": "Recent news shows continued and even escalated Houthi attacks, including deadly incidents and hypersonic missile launches. This increases the probability that Maersk will not resume shipping in 2025."
                },
                {
                    "factor": "Effectiveness of International Naval Operations",
                    "effect": "EU and US-led naval missions (Operation Aspides, Operation Prosperity Guardian) have had limited success, with attacks continuing and coverage stretched thin. This lowers the probability of resumption."
                },
                {
                    "factor": "Ceasefire and Peace Negotiations in Gaza",
                    "effect": "While there are ongoing negotiations and a US-backed Trump peace plan, there is no durable ceasefire or resolution yet. Houthi attacks are closely tied to the Gaza situation; absent a stable peace, risk remains high. This decreases the probability."
                },
                {
                    "factor": "Houthi Target Selection and Signaling",
                    "effect": "The Houthis claim to target only Israeli-linked ships, but in practice, their definitions are broad and attacks have hit non-Israeli vessels. The risk calculus for Maersk, a global operator, remains unfavorable. This decreases the probability."
                },
                {
                    "factor": "Base Rate of Shipping Resumption after Maritime Security Crises",
                    "effect": "Historically (e.g., Somali piracy), full resumption by major carriers required a combination of robust international intervention and a clear decline in attacks. The current international response is less effective, and the threat is more persistent. This decreases the probability."
                },
                {
                    "factor": "Insurance and Commercial Risk Calculations",
                    "effect": "Insurance costs remain high, and recent deadly attacks have worsened risk perception. Maersk is unlikely to resume unless the risk is clearly reduced both in frequency and lethality. This decreases the probability."
                },
                {
                    "factor": "Potential for Partial/Token Resumption",
                    "effect": "The resolution criteria allow for a partial or announced resumption to count as 'Yes'. Maersk could theoretically announce a limited or trial resumption under heavily protected convoys, but there is no evidence in the news or signaling from Maersk or the market that this is imminent. This slightly increases the probability (but is outweighed by risk factors)."
                }
            ],
            "no_scenario": "The Houthis continue or escalate attacks on commercial shipping, including non-Israeli-linked vessels. No durable Gaza ceasefire is reached, and the Red Sea remains a high-risk zone. Maersk, citing employee safety and insurance costs, does not resume any Red Sea operations in 2025. International naval missions continue but do not provide sufficient coverage or deterrence, and there is no credible, public Maersk announcement of resumption.",
            "yes_scenario": "A major diplomatic breakthrough leads to a durable ceasefire in Gaza, resulting in a sharp reduction in Houthi attacks. International naval operations are reinforced, insurance costs drop, and Maersk announces even a limited or trial resumption of Red Sea transits before the end of 2025. Alternatively, a partial resumption for a specific route or under military convoy is publicly announced and enacted.",
            "final_reasoning": "The news as of early October 2025 points to continued and even intensified Houthi attacks on shipping, including high-profile missile attacks, deadly incidents, and the sinking of vessels. International naval operations are ongoing but not sufficient to deter or prevent attacks, and the coverage is described as thin and stretched. The Gaza conflict remains unresolved, and the Houthis continue to link their attacks to developments there, signaling an intent to maintain pressure. Maersk, as a risk-averse global carrier, has not indicated any intent to resume routes, and market conditions (insurance, crew safety) remain unfavorable. While the resolution criteria only require a partial or announced resumption, there is no evidence suggesting such a move is likely absent dramatic improvement in the security situation. Historically, resumption requires more robust interventions and a clear, sustained decline in threats. Given all these factors, the probability of Maersk resuming shipping in the Red Sea in 2025 is low.",
            "final_probability": 10
        },
        "Political Science (Regime Stability Analysis)": {
            "time_to_resolution": "Approximately 3 months (until December 31, 2025)",
            "perspective_relevance": "As a political scientist specializing in regime stability analysis, I focus on the intersection of armed non-state actor capabilities, state (and international) responses, and the political incentives underlying their actions. For this question, understanding the Houthis' motivations, escalation/de-escalation signals, and the effectiveness of international security responses is crucial. Shipping company decision-making is also tightly linked to perceptions of risk, regime stability in Yemen, and the credibility of international military protection.",
            "status_quo": "Maersk is not operating in the Red Sea, and there has been no official resumption of Red Sea shipping as of October 2025. The company paused Red Sea transits in January 2024 due to Houthi attacks, and the threat environment remains high, with recent attacks and continued international naval operations. Partial resumptions by some competitors have occurred, but Maersk has maintained its halt.",
            "perspective_derived_factors": [
                {
                    "factor": "Houthi Operational Tempo and Targeting Policy",
                    "effect": "Decreases probability. The Houthis have recently resumed and intensified attacks, including deadly incidents and attacks on ships with tenuous or indirect Israeli links. Their stated policy is to continue attacks as long as the Gaza siege/aggression continues, and their operational tempo remains significant."
                },
                {
                    "factor": "Peace Process and Gaza Ceasefire Prospects",
                    "effect": "Small increase in probability. There is movement toward a peace process (Trump Plan, possible acceptance by Israel and Hamas), which could, if successful, provide a political off-ramp for the Houthis to halt attacks, as they have previously tied attacks to Gaza events."
                },
                {
                    "factor": "International Naval Protection and Security Regimes",
                    "effect": "Small increase in probability. The EU's Operation Aspides, US-led efforts, and others have provided some protection, but coverage is limited, and recent attacks have occurred on unescorted ships. The international response remains largely defensive and insufficient to guarantee security, but expanded naval presence could marginally improve the risk calculus for shippers."
                },
                {
                    "factor": "Maersk Corporate Risk Appetite and Precedent",
                    "effect": "Decreases probability. Maersk has historically been conservative in its risk assessments, pulling out early and waiting for sustained periods of security before resuming. The CEO has previously stated no resumption until 'well into 2025.' The company is unlikely to resume unless there is a major sustained improvement in security or a clear political settlement."
                },
                {
                    "factor": "Base Rates for Rapid Resumption after Maritime Crisis",
                    "effect": "Decreases probability. In similar cases (Somali piracy, Gulf of Guinea, previous Red Sea incidents), major carriers have only resumed routes after a substantial and sustained reduction in attacks and credible assurances of safety, usually following a clear international security regime or political resolution. Base rates for resumption within a year of peak violence are low."
                },
                {
                    "factor": "Potential for Sudden Political Breakthrough",
                    "effect": "Small increase in probability. If the Gaza ceasefire or a two-state negotiation proceeds, Houthis could declare victory and halt attacks as a face-saving move. However, the link between their actions and actual events in Gaza is mediated by Iran and their independent incentives."
                },
                {
                    "factor": "Continued Attacks and Insurance/Legal Constraints",
                    "effect": "Decreases probability. The recent attacks in September-October 2025, including missile hits and deadly incidents, will reinforce insurers' reluctance to underwrite Red Sea crossings, and Maersk may face prohibitive insurance premiums or legal constraints from crewing unions."
                }
            ],
            "no_scenario": "Ongoing or sporadic Houthi attacks (even if less frequent), continued instability in Yemen, and/or no comprehensive political breakthrough in Gaza mean Maersk keeps its suspension in place. International naval efforts remain insufficient to deter attacks, and insurance premiums remain too high for Maersk to risk even a partial resumption. By December 31, 2025, Maersk has not officially resumed Red Sea shipping according to Metaculus criteria.",
            "yes_scenario": "A breakthrough Gaza settlement is reached and publicly accepted by both Israel and Hamas, leading the Houthis to announce a halt to Red Sea attacks. International naval operations are expanded and succeed in deterring further incidents. Maersk, seeing a multi-week period of security and lower insurance premiums, announces a partial resumption of Red Sea transits or is observed to begin transiting the Red Sea before December 31, 2025.",
            "final_reasoning": "The base rate for rapid resumption of shipping after a major maritime security crisis is low, especially for risk-averse companies like Maersk. The Houthis have recently escalated attacks—sinking ships, killing crew, and launching advanced missiles. Their attacks remain explicitly tied to the Gaza conflict, and while there are encouraging signs of a possible peace process, the situation remains fluid and fragile. International naval protection remains insufficient to guarantee safety for unescorted vessels. Maersk's past behavior and public statements indicate a high bar for resumption. Unless a sudden and robust political breakthrough occurs, accompanied by a sustained cessation of attacks and improved insurance/escort regimes, a resumption by Maersk in 2025 is unlikely. However, the possibility of a late-year breakthrough tied to the peace process cannot be entirely discounted. Weighing all factors, with an emphasis on the status quo and base rates, the probability of Maersk resuming Red Sea shipping in 2025 is low, but not zero.",
            "final_probability": 15
        },
        "Regional Studies Middle East (Gulf Security Complex)": {
            "time_to_resolution": "Approximately 3 months (question closes January 1, 2026; today is October 7, 2025)",
            "perspective_relevance": "As a Regional Studies Middle East (Gulf Security Complex) expert, I can contextualize Maersk's risk calculus within the broader security architecture, including the balance of regional power (Iran-Saudi rivalry), proxy dynamics (Houthi-Iran ties), maritime chokepoint politics, and the military and diplomatic responses by global and regional actors. This perspective is crucial for understanding both the persistence of threats and the thresholds for commercial resumption in volatile environments.",
            "status_quo": "Maersk is not currently operating in the Red Sea, having suspended all transits since January 2024 due to persistent Houthi attacks. As of October 2025, the security environment remains highly unstable, with near-weekly attacks on merchant shipping, and no public indication that Maersk is preparing to resume operations.",
            "perspective_derived_factors": [
                {
                    "factor": "Sustained Houthi Threat Level (Attacks, Targeting, Capabilities)",
                    "effect": "Decreases probability. The Houthis have demonstrated continued ability and intent to strike commercial vessels (including non-Israeli-linked ships) with advanced weapons. There is no sign of degradation of their capabilities or strategic shift away from maritime disruption."
                },
                {
                    "factor": "International Naval Response (Operation Aspides, US-led efforts)",
                    "effect": "Slightly increases probability. Escort missions and defensive operations provide some protection, but coverage is thin, and recent attacks (even on unescorted ships) reveal the limits of these missions. The naval presence is extended but not expanded, and deterrence remains incomplete."
                },
                {
                    "factor": "Political Trajectory of Gaza Conflict and Israel-Hamas Talks",
                    "effect": "Neutral to slightly decreases probability. While peace talks and a Trump-brokered plan are underway, the Houthis have explicitly linked their attacks to the ongoing state of siege and violence in Gaza. Unless there is a clear, durable ceasefire and lifting of the Gaza blockade, Houthi attacks are likely to continue."
                },
                {
                    "factor": "Maersk's Corporate Risk Appetite and Insurance Environment",
                    "effect": "Decreases probability. Maersk, as a global leader with significant brand and asset exposure, is highly risk-averse. Insurance premiums for the Red Sea remain prohibitive, and recent deadly attacks (with loss of life and ships sunk) reinforce insurers’ reluctance. Maersk's CEO has signaled expectation of no resumption before late 2025 or beyond."
                },
                {
                    "factor": "Base Rate of Resumption After Similar Maritime Security Crises",
                    "effect": "Decreases probability. Looking at Somali piracy (2008–2013), resumption of normal shipping by major lines only occurred once attacks dramatically fell and robust international naval patrolling (with direct offensive action) was in place. The Red Sea response remains less robust and the threat more sophisticated than Somali piracy."
                },
                {
                    "factor": "Houthi/Iran Strategic Calculus and Triggers for De-escalation",
                    "effect": "Decreases probability. The Houthis' attacks serve both local (Gaza solidarity) and regional (Iranian signaling) objectives. With Iran under renewed sanctions and increased pressure, the incentive to project power through the Red Sea and maintain leverage remains high. There is no indication of a major shift in Tehran’s posture."
                }
            ],
            "no_scenario": "Despite ongoing peace talks for Gaza, Houthi attacks continue intermittently through Q4 2025, with several high-profile incidents (including at least one involving a Western-owned vessel). Maersk maintains its suspension, citing unacceptable risk and lack of adequate naval protection. Insurance premiums remain exorbitant, and no official announcement or credible reporting emerges of Maersk ships resuming Red Sea passages before the end of 2025.",
            "yes_scenario": "A breakthrough in Gaza—e.g., a durable ceasefire and significant easing of the blockade—leads to a public Houthi announcement of a moratorium on Red Sea attacks. This is corroborated by a rapid and sustained decline in attack frequency (zero or near-zero incidents for 6+ weeks), and insurance markets respond positively. Maersk, seeking to regain market share, announces a partial resumption of Red Sea activity (e.g., limited convoys with naval escort, or a pilot run), or credible sources report Maersk vessels transiting the Red Sea under new protocols.",
            "final_reasoning": "The status quo remains deeply unfavorable to Maersk resuming Red Sea operations in 2025. The past quarter has seen a significant escalation in Houthi attacks (multiple ships attacked/sunk, crew killed or taken hostage, including non-Israeli-linked vessels), and there is no evidence of a sustained reduction in threat or a major change in Houthi or Iranian posture. Naval protection is present but not comprehensive, and coverage gaps persist. The base rate for resumption in comparable crises (e.g., Somali piracy) suggests that shipping giants require a significant, sustained improvement in security and insurance conditions, neither of which are present. Maersk's own statements and the current insurance environment reinforce their risk aversion. While ongoing Gaza talks could theoretically shift the situation, the linkage between Houthi attacks and Gaza remains strong, and any peace remains tentative. The most likely scenario is continued suspension by Maersk through the end of 2025, absent a dramatic, near-term de-escalation that is not currently visible in the news or diplomatic trajectory.",
            "final_probability": 15
        }
    },
    "deliberation_probability": [
        8,
        8,
        15,
        10,
        10,
        13,
        15,
        10,
        15,
        15
    ],
    "deliberation_mean_probability": 11.9,
    "deliberation_sd": 2.9981475762358474,
    "deliberation_probability_result": 12
}