{
    "deliberation_results": {
        "Peace Negotiation Practitioner (UN Peacemaking Principles)": {
            "time_to_resolution": "Approximately 2.5 months (question closes on December 31, 2025; today is October 15, 2025).",
            "perspective_relevance": "As a Peace Negotiation Practitioner rooted in UN Peacemaking Principles, my perspective is highly relevant. I focus on the necessary preconditions, incentives, and institutional dynamics for convening meaningful, in-person negotiations between high-conflict parties. This expertise highlights both the opportunities and obstacles inherent in transforming international pressure and humanitarian crises into actual face-to-face dialogue, and understands how the legitimacy, composition, and sequencing of negotiation tracks affect the willingness of belligerent parties to attend the same negotiation venue.",
            "status_quo": "SAF and RSF have not physically attended the same venue for peace negotiations since the outbreak of war in April 2023. Multiple high-profile diplomatic efforts (Geneva, Jeddah, New York) have failed to bring both delegations together in person, with each side either refusing or setting preconditions. The most recent Geneva talks in August 2024 saw only the RSF attend in person. The status quo is thus persistent avoidance of direct, physical negotiation.",
            "perspective_derived_factors": [
                {
                    "factor": "Escalating International and Regional Pressure",
                    "effect": "Increases probability. There is unprecedented diplomatic convergence (US, EU, AU, Quad, UN) and open statements urging direct, in-person negotiations. The humanitarian catastrophe is motivating higher-level engagement and the public messaging now consistently calls for both sides to meet physically."
                },
                {
                    "factor": "Entrenched Mutual Distrust and Preconditions",
                    "effect": "Decreases probability. SAF continues to publicly reject parity with RSF and has recently reaffirmed 'no conciliation' with RSF under any terms preserving its separate status. Both parties are consolidating rival administrations, deepening the zero-sum perception and making face-to-face talks politically costly."
                },
                {
                    "factor": "Proxy Dynamics and External Spoilers",
                    "effect": "Decreases probability. The conflict is heavily internationalized; rival regional powers (Egypt, UAE, Saudi Arabia, etc.) are backing opposing sides. Mediation tracks are fragmented and suffer from conflicting agendas. External sponsors can serve as spoilers, emboldening parties to hold out for better terms and avoid risky direct engagement."
                },
                {
                    "factor": "Humanitarian Catastrophe and Urgency",
                    "effect": "Increases probability. The scale of displacement, starvation, and civilian suffering is now on the agenda of major powers and institutions. The crisis is so acute that some actors may be willing to pressure or incentivize both parties into at least symbolic attendance at a negotiation venue, if only to stem reputational damage."
                },
                {
                    "factor": "Track Record of Failed Initiatives and Political Will",
                    "effect": "Decreases probability. Despite new diplomatic energy (Quad, New York meetings), all previous attempts at direct talks over two years have failed, often at the last moment, due to lack of genuine will and continued escalation. The leadership on both sides faces hardliner factions and existential threats if seen as capitulating."
                },
                {
                    "factor": "Short Time Horizon (2.5 months)",
                    "effect": "Decreases probability. While momentum may be building, the window for organizing and convening a physical, high-level negotiation involving both SAF and RSF, under the required criteria, is extremely narrow."
                },
                {
                    "factor": "Civil Society and International Mediation Leverage",
                    "effect": "Slightly increases probability. There is growing recognition that civilian actors and inclusive mediation tracks may be essential for success. If external actors can offer sufficient guarantees or incentives (e.g., humanitarian corridors, phased security arrangements), it may unlock minimal face-to-face engagement."
                }
            ],
            "no_scenario": "Despite mounting pressure, SAF and RSF continue to refuse direct engagement. Each side cites security, legitimacy, or preconditions as obstacles. Diplomatic initiatives either stall or are downgraded to indirect or virtual formats. External actors fail to coordinate, and spoilers (regional patrons or hardliners) veto attendance. The acute crisis continues, but the status quo of avoidance and mutual delegitimization persists through December 2025.",
            "yes_scenario": "A major humanitarian or military development (e.g., famine tipping point, international threat of sanctions, or a dramatic battlefield stalemate) creates overwhelming pressure for both parties to attend a peace venue. External actors orchestrate a high-profile, internationally guaranteed negotiation (perhaps in Jeddah or Cairo), with both delegations present—possibly under heavy security and with face-saving protocols. Attendance is motivated less by substantive breakthrough than by the need to unlock aid or avoid reputational catastrophe.",
            "final_reasoning": "While momentum for direct talks is stronger than at any previous point (as noted by multiple analysts and envoys), the deeply entrenched mutual distrust, public rejection of reconciliation (especially by SAF), and the continued formation of rival governments make even symbolic face-to-face negotiation extremely difficult. The short time frame is a major limiting factor. However, the scale of the humanitarian disaster and the unprecedented international diplomatic convergence provide a non-negligible chance that both sides could be pressured or incentivized into at least a brief, simultaneous presence at a negotiation venue, especially if the format is crafted to allow face-saving or is driven by an acute external shock. Base rates for such breakthroughs in similar civil wars with heavy external involvement are low, but not zero—especially under crisis conditions. Weighing all factors, the probability is above 'very unlikely,' but still low.",
            "final_probability": 18
        },
        "Peace Negotiation Practitioner (Mediation Support Unit Best Practices)": {
            "time_to_resolution": "About 2.5 months (question resolves December 31, 2025; today is October 15, 2025)",
            "perspective_relevance": "As a Peace Negotiation Practitioner with Mediation Support Unit (MSU) experience, my expertise is in assessing the likelihood of direct, physical negotiations between hostile parties. I can draw on deep knowledge of base rates for face-to-face peace talks in high-intensity, fragmented civil conflicts, as well as best practices and pitfalls in international mediation and the dynamics that influence parties’ willingness to meet. My assessment is grounded in empirical data, process design, and the observable incentives and disincentives for belligerents to accept joint negotiation venues.",
            "status_quo": "Since the start of the war in April 2023, SAF and RSF delegations have never physically attended the same peace negotiation venue. Even during the most significant mediation efforts (Jeddah 2023, Geneva 2024), only one party attended in person at a time, with the other absent or participating virtually, if at all. Status quo is 'no face-to-face, same-venue negotiations.'",
            "perspective_derived_factors": [
                {
                    "factor": "Mutual Hostility and Deep Distrust",
                    "effect": "Strongly decreases probability. Both SAF and RSF see the other as existential enemies. Al-Burhan has repeatedly and recently (August 2025) rejected any form of reconciliation or negotiation that recognizes RSF as an equal or legitimate actor. This is reinforced by public speeches and official statements."
                },
                {
                    "factor": "Recent International Pressure and Quad Initiative",
                    "effect": "Moderately increases probability. There is now unprecedented regional and international consensus for direct talks, with strong coordinated pressure from the US, Egypt, Saudi Arabia, UAE, and the EU. Such alignment is rare and could create the external leverage necessary for at least a symbolic face-to-face meeting."
                },
                {
                    "factor": "Status of War and Territorial Control",
                    "effect": "Slightly decreases probability. The war remains highly active. Both sides are setting up parallel governments and seeking military solutions. Neither is currently desperate enough to feel compelled to negotiate, and both believe they have a plausible path to strengthen their hand militarily."
                },
                {
                    "factor": "Base Rate of Direct Negotiations in Analogous Conflicts",
                    "effect": "Decreases probability. In comparable African civil wars (South Sudan, Libya, Ethiopia Tigray), face-to-face negotiations happen, but usually only after years of exhaustion or a clear military stalemate. Sudan is not yet at that point: both sides retain external backers and resources."
                },
                {
                    "factor": "Mediation Logistics and Security Concerns",
                    "effect": "Slightly decreases probability. Given the extreme mutual suspicion, SAF and RSF delegations are unlikely to feel safe attending the same venue, especially outside Sudan. This has been a repeated stumbling block in past attempts."
                },
                {
                    "factor": "Internal and External Spoilers",
                    "effect": "Decreases probability. The presence of powerful spoilers—such as the Islamist old guard, hardline elements in both factions, and competing regional powers—means any move toward direct negotiation is easily derailed."
                },
                {
                    "factor": "Humanitarian Catastrophe and Famine Risk",
                    "effect": "Slightly increases probability. The scale of the crisis is creating real pressure, including from within Sudanese civil society and among international donors. This could tip the balance if one side begins to fear complete loss of legitimacy or a humanitarian collapse."
                }
            ],
            "no_scenario": "Despite ongoing mediation efforts, the SAF and RSF continue to refuse direct negotiations. Each attends talks only if the other is absent, or sends only technical representatives to coordination meetings that are not officially political negotiations. Security concerns, lack of trust, and continued outside backing sustain the deadlock. External pressures fall short, and the war drags on with no in-person peace negotiation before 2026.",
            "yes_scenario": "Facing mounting international pressure, the threat of sanctions, and catastrophic humanitarian fallout, one or both factions calculate that a symbolic face-to-face meeting would gain them leverage or legitimacy. A carefully choreographed, externally guaranteed negotiation is organized—perhaps in Jeddah, Geneva, or Cairo—where both delegations are physically present, possibly just for a photo opportunity or as a prelude to substantive talks. This is announced as a peace negotiation, with credible media and official confirmation.",
            "final_reasoning": "The base rate for direct, same-venue negotiations in civil wars with this degree of fragmentation, mutual hatred, and external interference is low, especially within such a short time horizon. The status quo (no face-to-face talks) has persisted for over two years, and the recent record shows even high-profile international efforts have failed to bridge the gap. The new Quad roadmap has created more external pressure and coordination than before, but both parties retain hardline positions, and recent statements by al-Burhan explicitly reject conciliation. The humanitarian disaster is acute, but this has not yet translated into concessions. The window to organize, convene, and hold a physical meeting is tight (less than three months), and mediation logistics remain daunting. On balance, while the probability of some negotiation process has increased compared to earlier in 2025, the probability of both delegations physically attending the same venue for political talks before December 31, 2025, remains low—though not negligible, given the rising external pressure and the desperate humanitarian context. My estimate is somewhat above the historical base rate (which would be ~5-10%) but remains under 20%.",
            "final_probability": 15
        },
        "Diplomatic Mediation (Oslo Process Model)": {
            "time_to_resolution": "About 2.5 months (until December 31, 2025)",
            "perspective_relevance": "As an expert in Diplomatic Mediation, especially the Oslo Process Model, I am attuned to the interplay between international pressure, the structure and credibility of mediation frameworks, the psychology of spoilers, and the vital role of face-to-face negotiation venues in overcoming deadlock. The Oslo model highlights the need for secret, high-level direct encounters to break impasses and build trust, but also warns that successful convening at the same venue requires both the right mediation environment and willingness by elites to risk internal backlash. My perspective stresses: (a) the critical importance of the mediation format and international coalition coherence, (b) the necessity for both warring parties to perceive talks as preferable to continued conflict, and (c) the difficulty of translating indirect or shuttle diplomacy into actual, physical co-presence, especially amid deep mutual distrust and zero-sum calculations.",
            "status_quo": "The status quo is: No direct, physical, simultaneous attendance by both SAF and RSF delegations at a peace negotiation venue. All previous attempts have resulted in either only one side appearing in person, or in indirect/virtual participation, or the meetings falling under humanitarian coordination rather than political/ceasefire negotiations.",
            "perspective_derived_factors": [
                {
                    "factor": "Escalating Humanitarian Catastrophe and International Pressure",
                    "effect": "Increases probability: The massive scale of the crisis (millions displaced, famine, atrocities, global attention) is driving unprecedented international and regional pressure—including from the Quad, UN, AU, EU, and key Arab states—for direct negotiations. This level of pressure historically can sometimes shift elite calculations about the costs of continued war versus talks."
                },
                {
                    "factor": "Entrenched Mutual Distrust and Precondition Setting",
                    "effect": "Decreases probability: SAF and RSF have repeatedly set conditions the other cannot accept, with public statements (as recently as August) by SAF leader al-Burhan explicitly rejecting any form of conciliation/peace with the RSF. RSF is consolidating parallel governance, and both sides fear that face-to-face talks confer legitimacy on the other."
                },
                {
                    "factor": "International Mediation Cohesion and Spoiler Problems",
                    "effect": "Decreases probability: The international mediation landscape is fragmented—UAE and Egypt back opposite sides, the U.S. is less engaged, and the AU/IGAD lack enforcement power. Spoilers (notably former regime elements, regional rivals, and hardliners on both sides) have strong incentives to disrupt any move towards direct talks, as seen in the repeated collapse of previous initiatives."
                },
                {
                    "factor": "Recent Diplomatic Momentum (Quad Roadmap, New York Meetings)",
                    "effect": "Increases probability: The September-October 2025 period has seen an upsurge in diplomatic activity, with the Quad, AU, EU, and others calling for direct talks and suggesting high-level contacts. Some sources claim both parties now face unparalleled international isolation and pressure, and that ground is being prepared for high-level negotiations (potentially in Jeddah)."
                },
                {
                    "factor": "Military Balance and War Fatigue",
                    "effect": "Slightly increases probability: Neither side appears able to win outright; both are suffering losses and are under pressure from their external backers to negotiate. This historically can create a window for talks, though it does not ensure both sides will physically show up at the same venue."
                },
                {
                    "factor": "Track Record of Physical Co-Presence in Past Sudanese and Regional Talks",
                    "effect": "Decreases probability: The historical base rate for deeply divided, zero-sum conflicts in Africa reaching the stage of physical, simultaneous delegation attendance is low within a short time frame, especially when prior attempts have repeatedly failed and each side fears loss of face or security."
                }
            ],
            "no_scenario": "Despite mounting international pressure, the SAF and RSF continue to refuse face-to-face engagement, citing irreconcilable preconditions. The SAF, in particular, maintains its public stance that it will not legitimate the RSF with direct talks, and the RSF is unwilling to accept military subordination. Mediation attempts continue through shuttle diplomacy, indirect channels, virtual meetings, or staggered attendance, but no meeting occurs where both delegations are physically present at the same venue for political/peace negotiations before the deadline. Spoilers and regional backers sabotage attempts to bring both sides together out of fear of losing influence or legitimacy.",
            "yes_scenario": "Under extraordinary humanitarian and diplomatic pressure, and possibly punitive measures or incentives from the Quad and regional powers, both the SAF and RSF agree—perhaps reluctantly—to send official delegations to a high-profile negotiation venue (e.g., Jeddah, Geneva, or a neutral AU/UN site). The format is carefully structured with heavy security guarantees and face-saving measures, and both sides are present physically, possibly for a brief opening session or for talks mediated by an international coalition. Media and/or official statements confirm their simultaneous presence at the venue for peace negotiations before December 31, 2025.",
            "final_reasoning": "The status quo—no in-person, direct peace talks—remains robust, with a long track record of failure and deep-seated mutual animosity. The SAF, in particular, has recently and repeatedly rejected direct engagement, and both sides have set preconditions that seem incompatible. The mediation environment is fragmented, with external powers' interests not fully aligned and regional spoilers incentivized to block any process that threatens their proxies. However, there is a marked uptick in international pressure, coordination, and rhetorical momentum as of September-October 2025, with multiple credible sources suggesting groundwork for negotiations and an emerging consensus that neither party can win militarily. The humanitarian catastrophe is at such a scale that key actors may force at least a symbolic co-presence at the negotiation table as a political necessity. The base rate for such breakthroughs in similar conflicts is low, but not negligible when diplomatic pressure becomes overwhelming and both sides are exhausted. Weighing the base rate (~10-15% in comparable cases), the unique severity of the current crisis, the specific new diplomatic activity, but also the persistent obstacles, I assess the probability at 23%. This reflects a modest but real increase over the base rate, but still recognizes the structural barriers and spoiler risks that dominate Sudan's peace process.",
            "final_probability": 23
        },
        "Diplomatic Mediation (African Union Mediation Guidelines)": {
            "time_to_resolution": "About 2.5 months (until December 31, 2025)",
            "perspective_relevance": "As an expert in Diplomatic Mediation, particularly drawing on African Union (AU) Mediation Guidelines, I bring an understanding of African-led conflict resolution, the dynamics of regional organizations, and the practical obstacles and enablers for face-to-face peace talks in high-intensity African conflicts. This perspective is especially relevant given the AU's historical role, the regionalization of Sudan's conflict, and the particular stipulations of the question (i.e., both SAF and RSF must be physically present at the same venue for official peace talks).",
            "status_quo": "Since the start of the war, the SAF and RSF have not both physically attended the same peace negotiation venue. All prior mediation attempts (Geneva, Jeddah, etc.) have failed to bring the two sides together in person for official negotiations; at best, one side attends while the other abstains or sends only virtual/indirect representation.",
            "perspective_derived_factors": [
                {
                    "factor": "Deep Mutual Distrust and Refusal of Equivalence",
                    "effect": "Decreases probability. Both SAF and RSF publicly reject the legitimacy of the other as a negotiating partner and set preconditions (e.g., SAF refuses talks recognizing RSF as equal; RSF demands international recognition and inclusion). This mutual delegitimization has blocked face-to-face meetings."
                },
                {
                    "factor": "Intensified International and Regional Pressure",
                    "effect": "Increases probability. Recent months have seen unprecedented coordinated pressure from the AU, UN, EU, Quad, and neighboring states for direct negotiations, including explicit calls for both parties to attend the same venue. International fatigue with the humanitarian crisis is mounting."
                },
                {
                    "factor": "AU and IGAD Mediation Paralysis",
                    "effect": "Decreases probability. Despite strong mandates, both AU and IGAD have been sidelined or paralyzed by external actors and internal divisions. Their lack of decisive leadership reduces the likelihood of a breakthrough African-led event."
                },
                {
                    "factor": "External Spoilers and Proxy Interests",
                    "effect": "Decreases probability. Egypt, UAE, Saudi Arabia, and others have vested interests in the conflict outcome and have supported opposing sides, undermining unified mediation."
                },
                {
                    "factor": "Escalating Humanitarian Catastrophe",
                    "effect": "Slightly increases probability. The sheer scale of the crisis (starvation, displacement, siege of El Fasher) is increasing pressure on both parties and their patrons to at least appear at talks, but desperation does not always translate to cooperation."
                },
                {
                    "factor": "Base Rate for Face-to-Face Negotiations in African Civil Wars",
                    "effect": "Decreases probability. In similar high-intensity, multi-actor civil conflicts (e.g., Ethiopia, Libya, South Sudan), in-person talks with all belligerents typically only occur after clear military stalemates or external coercion, and even then, are rare within short timeframes."
                },
                {
                    "factor": "Recent Signals and Roadmaps",
                    "effect": "Increases probability. There are credible reports (from US, Quad, civil society) that direct/indirect contacts are ongoing and that both parties are under pressure to attend negotiations, with some suggesting the two sides are 'closer than ever' to face-to-face talks."
                },
                {
                    "factor": "Entrenchment of Parallel Governments",
                    "effect": "Decreases probability. Both SAF and RSF are establishing rival civilian administrations, increasing their incentives to avoid direct talks that could undermine claims to legitimacy."
                }
            ],
            "no_scenario": "Despite ongoing international pressure and worsening humanitarian conditions, both SAF and RSF continue to refuse to meet in person, insisting on preconditions or refusing to recognize the other's legitimacy. External spoilers (especially Egypt or UAE, depending on their client) block any venue that would accommodate both sides. Mediated talks occur, but only sequentially, virtually, or with one party refusing to attend. Any 'negotiations' are indirect, with civilian or third-party representation, falling short of the resolution criteria.",
            "yes_scenario": "Mounting humanitarian disaster, combined with coordinated international and regional pressure (especially if the US, AU, and Quad align and threaten sanctions or aid leverage), forces both SAF and RSF to attend a high-profile, internationally convened peace negotiation (possibly in Jeddah, Addis Ababa, or Geneva). Both delegations are physically present at the same venue, perhaps under heavy diplomatic escort, and the event is widely reported as a breakthrough, even if substantive agreement is lacking.",
            "final_reasoning": "The base rate for face-to-face negotiations between two uncompromising, externally-backed belligerents in African civil wars within a short time window is low. The mutual delegitimization, entrenchment of parallel governments, and repeated failed mediation attempts weigh heavily against a breakthrough. However, the current moment is unique: unprecedented international and regional pressure, a catastrophic humanitarian context, and signals from credible sources (US, Quad, civil society) that direct talks are 'closer than ever.' The African Union's paralysis is a negative, but not necessarily fatal, factor given the coordination of external mediation (Quad, UN, etc.). The risk remains high that one party will refuse to attend, or that talks will fall short of the formal, simultaneous, in-person criteria. Still, the mounting pressure and desperation, plus the short time window, slightly raise the odds above the historical base rate. Overall, while the trend is toward indirect or sequential negotiations, I judge the probability of both SAF and RSF delegations physically attending the same official peace negotiation venue before December 31, 2025, as low but not negligible.",
            "final_probability": 19
        },
        "International Relations (Ripeness Theory)": {
            "time_to_resolution": "2.5 months (forecast date: 2025-10-15, resolution date: 2025-12-31)",
            "perspective_relevance": "As an expert in International Relations, specifically Ripeness Theory, my perspective is highly relevant: Ripeness Theory posits that meaningful negotiations between warring parties only occur when both perceive a mutually hurting stalemate and see a way out, typically through mediation. The persistent absence of direct, co-located negotiations between SAF and RSF, despite catastrophic humanitarian conditions and strong international pressure, suggests the conflict's 'ripeness' for negotiation is still in question. My analysis will focus on whether the necessary preconditions for ripeness—mutual stalemate, a way out, and credible mediation—are present before the question closes.",
            "status_quo": "Since the war began in April 2023, all peace initiatives have failed to bring SAF and RSF delegations physically together for direct negotiations. The last several rounds (Jeddah, Geneva, etc.) have consistently seen one or both sides refuse to attend or only send representatives sequentially or virtually. The status quo is continuing violence, deep mistrust, and no direct, in-person negotiations.",
            "perspective_derived_factors": [
                {
                    "factor": "Mutually Hurting Stalemate",
                    "effect": "Mildly increases probability. The war has produced catastrophic humanitarian consequences and neither side has achieved decisive victory, which should, per Ripeness Theory, increase readiness for talks. However, both still perceive potential for gains, and the stalemate is not yet fully acknowledged."
                },
                {
                    "factor": "Leadership Intransigence and Zero-Sum Demands",
                    "effect": "Strongly decreases probability. Both SAF (al-Burhan) and RSF (Hemedti) have articulated maximalist, zero-sum positions (e.g., refusing to recognize each other's legitimacy or accept a ceasefire that preserves the other's autonomy), with public statements as recently as August 2025 rejecting conciliation or shared transition."
                },
                {
                    "factor": "International and Regional Pressure",
                    "effect": "Moderately increases probability. There is an unprecedented level of international and regional consensus (Quad, AU, UN, EU, etc.) for direct negotiations, including new incentives and threats. However, external actors are also divided, with some backing each side militarily and diplomatically, which blunts the effectiveness of pressure."
                },
                {
                    "factor": "Fragmented and Conflicting External Interests",
                    "effect": "Strongly decreases probability. External actors (UAE, Egypt, Saudi Arabia, US, etc.) have conflicting interests and are arming both sides. This prolongs the war and undermines mediation, as highlighted in several sources (e.g., Foreign Affairs, IOL, rightsreporter.org)."
                },
                {
                    "factor": "Civilian and Humanitarian Catastrophe",
                    "effect": "Mildly increases probability. The scale of humanitarian disaster and risk of famine create strong incentives for both sides to be seen as responsive to external pressure, possibly agreeing to talks for international legitimacy or aid."
                },
                {
                    "factor": "Track Record of Spoiler Behavior and Track-Two Diplomacy",
                    "effect": "Moderately decreases probability. Both sides have a history of using negotiations for tactical advantage or international legitimacy without making real concessions. Past 'negotiations' have either failed to bring both delegations to the table physically or have been derailed at the last moment."
                },
                {
                    "factor": "Time Horizon and Political Deadlines",
                    "effect": "Mildly increases probability. The short window until December 31, 2025, means that new initiatives must coalesce quickly. The mounting international urgency may prompt a symbolic, in-person meeting even if not leading to substantive progress."
                }
            ],
            "no_scenario": "Despite ongoing diplomatic initiatives and catastrophic humanitarian conditions, the SAF and RSF continue fighting, each seeking advantage and refusing to grant the other legitimacy. International mediators fail to align external pressure or incentives effectively. Both sides attend parallel or sequential meetings in Jeddah, Geneva, or elsewhere, but never overlap in person. Any track-two or indirect contacts fail to meet the resolution criteria for simultaneous, in-person, official peace negotiations.",
            "yes_scenario": "A new round of Quad- or AU/UN-sponsored talks is scheduled under intense international pressure, with credible threats or incentives (e.g., sanctions, aid access, security guarantees). Facing internal exhaustion, possible battlefield stalemate, and growing delegitimization, both SAF and RSF send official delegations to a neutral venue (e.g., Jeddah, Geneva) and are physically present for opening sessions of peace, ceasefire, or political transition negotiations. The in-person meeting is widely reported by credible international media and official statements.",
            "final_reasoning": "While there is a notable uptick in international and regional pressure and some signs of increased willingness to talk, several key factors weigh heavily against a YES outcome. Historically, direct, in-person negotiations between such deeply antagonistic, externally backed factions are rare without a clear, mutually acknowledged stalemate and a credible guarantee of security and status for both. Statements from SAF as recent as August/September 2025 explicitly reject conciliation, and both sides appear to retain hope for battlefield advantage or at least refuse to grant each other status as legitimate negotiating partners. The international system is mobilized but divided, with external actors (notably the UAE and Egypt) still providing support to their proxies and undercutting unified pressure. Humanitarian catastrophe and international opprobrium have not yet translated into the kind of coercive leverage or internal exhaustion that would force both sides to the same table in person. There is some momentum for symbolic or procedural progress (e.g., setting up talks), and last-minute surprises are possible, but the historical base rate for such direct, in-person meetings in similar contexts remains very low. Given all this, the most probable outcome is that no qualifying, simultaneous, in-person meeting will occur before December 31, 2025. However, due to the short time frame and high international urgency, I assign some probability mass to a last-minute, face-saving symbolic meeting under pressure. Therefore, I set my initial probability at 18%.",
            "final_probability": 18
        },
        "International Relations (Third Party Mediation)": {
            "time_to_resolution": "About 2.5 months (until December 31, 2025)",
            "perspective_relevance": "As an expert in International Relations with a focus on third party mediation, I analyze the effectiveness and constraints of external mediation efforts in intrastate conflicts. My expertise helps to assess not just the surface-level diplomatic signaling, but also the structural and behavioral obstacles to face-to-face negotiations given entrenched belligerence, spoiler dynamics, and the interplay of international actors with competing interests.",
            "status_quo": "Since the outbreak of the Sudan war in April 2023, there has not been a single instance where both SAF and RSF delegations have physically attended the same peace negotiation venue. Previous rounds (Jeddah, Geneva, etc.) were either sequential or attended by only one party in person, with the other absent or participating virtually.",
            "perspective_derived_factors": [
                {
                    "factor": "Intensified International and Regional Pressure",
                    "effect": "Slightly increases probability. The Quad (U.S., Saudi Arabia, Egypt, UAE) and multilateral actors (AU, EU, UK, etc.) are exerting stronger pressure than at any time since 2023, with coordinated statements and diplomatic signaling that negotiations are the only way out."
                },
                {
                    "factor": "Entrenched Mutual Distrust and Maximalist Preconditions",
                    "effect": "Strongly decreases probability. Both sides, especially SAF, continue to reject the legitimacy of the other as a negotiating partner. Al-Burhan’s rejection of any settlement with the RSF, and both sides forming rival governments, makes face-to-face talks highly unlikely."
                },
                {
                    "factor": "Proxy Dynamics and Competing External Interests",
                    "effect": "Decreases probability. Egypt, UAE, Saudi Arabia, and others back different sides, often with contradictory objectives. This fragmentation undermines mediation and makes coordinated pressure or incentives for both parties to show up in person less credible."
                },
                {
                    "factor": "Unprecedented Humanitarian Catastrophe",
                    "effect": "Marginally increases probability. The scale of displacement, famine, and civilian deaths is creating an urgent imperative for talks, and this could force both parties to respond to international and domestic pressure—though this effect is dampened by their desire to avoid direct negotiation."
                },
                {
                    "factor": "Recent Mediation Failures and Spoiler Behavior",
                    "effect": "Decreases probability. Multiple news articles detail failed recent attempts (US, AU, IGAD, Geneva, Jeddah) with last-minute withdrawals, precondition disputes, and external spoilers (e.g., UAE, Egypt)."
                },
                {
                    "factor": "Short Time Frame",
                    "effect": "Decreases probability. The window to December 31, 2025, is less than three months, and no direct talks are even scheduled; it would require not just agreement, but rapid, public, physical participation—something not seen in the last 2.5 years."
                },
                {
                    "factor": "Base Rate of Similar Conflict Negotiation Patterns",
                    "effect": "Strongly decreases probability. In high-intensity, externally backed civil wars with deep personal/organizational animosity, it is rare for both sides to physically meet for formal negotiations before a clear military stalemate or external imposition—which is not yet apparent in Sudan."
                }
            ],
            "no_scenario": "The status quo persists: Both SAF and RSF either refuse to attend talks in person, set preconditions the other rejects, or participate only in parallel, sequential, or virtual formats. Third parties, unable to bridge the gap, continue shuttle diplomacy and indirect contacts. No credible media report emerges of both delegations being physically present at the same venue for peace negotiations before December 31, 2025.",
            "yes_scenario": "A major shift—either a dramatic, unsustainable escalation of the humanitarian crisis, or a sudden external threat to the interests of both parties (such as the threat of international sanctions, withdrawal of crucial support, or loss of control to a third actor)—forces both SAF and RSF to send official delegations to the same physical venue, likely under intense international pressure (e.g., Jeddah or Geneva). Both are reported by credible international media to be physically present in the same negotiation space for at least the opening session.",
            "final_reasoning": "Base rates, the entrenched pattern of failed face-to-face negotiation attempts, and the deep mutual delegitimization between SAF and RSF are overwhelming obstacles. Despite unprecedented international pressure and humanitarian need, there is no evidence of a scheduled or even imminent meeting with both delegations physically present, and the most recent news makes clear that both sides remain far apart on even basic preconditions (e.g., SAF refuses to negotiate with RSF as equals; RSF pursues a parallel government). Proxy dynamics and the lack of a credible, unified external enforcement mechanism further reduce the likelihood of last-minute direct talks. While there is slightly more international alignment and urgency now, this falls short of what is historically required to bring such belligerents together in person in the absence of a mutually hurting stalemate or external imposition. With less than three months remaining, the probability of a YES outcome is extremely low—this is a high bar question and the status quo is robust.",
            "final_probability": 5
        },
        "Conflict Resolution (Track One Diplomacy)": {
            "time_to_resolution": "Approximately 2.5 months (until December 31, 2025)",
            "perspective_relevance": "As an expert in Conflict Resolution (Track One Diplomacy), my perspective is vital for interpreting the likelihood of direct, officially mandated, in-person negotiations between the SAF and RSF. Track One diplomacy focuses on formal, state-sanctioned negotiations and the incentives and obstacles faced by official actors, as opposed to informal contacts or Track Two civil society efforts. This expertise enables me to assess the impact of international mediation, preconditions, mutual distrust, domestic legitimacy, and the role of external actors in facilitating or impeding direct talks.",
            "status_quo": "Since the war’s outbreak in April 2023, SAF and RSF have repeatedly refused to physically meet for official peace negotiations. All recent peace efforts—Jeddah, Geneva, and New York initiatives—have failed to bring both delegations physically together under the same roof. The status quo is thus continued non-engagement in direct, face-to-face negotiations.",
            "perspective_derived_factors": [
                {
                    "factor": "International Mediation Pressure",
                    "effect": "Increases probability. Recent joint statements by the AU, UN, EU, Quad, and several regional powers have explicitly called for direct negotiations, and there is unprecedented coordination and diplomatic pressure. This increases the chance of at least a symbolic joint appearance to appease donors and mediators."
                },
                {
                    "factor": "Entrenched Mutual Distrust and Preconditions",
                    "effect": "Decreases probability. Both SAF and RSF have set strict preconditions for talks, refuse to recognize each other as equals, and are building rival governments. Al-Burhan (SAF) has repeatedly, and as recently as August-September 2025, rejected all 'conciliation' and refuses to accept a settlement that legitimizes the RSF. The RSF is similarly uncompromising regarding its control in Darfur and parallel governance."
                },
                {
                    "factor": "External Actors' Conflicting Interests",
                    "effect": "Decreases probability. Key external sponsors (Egypt, UAE, Saudi Arabia) back opposing sides and have not reached a true consensus. Their support enables continued fighting and undermines the credibility of peace initiatives, making it harder to compel both parties to the table."
                },
                {
                    "factor": "Severity of Humanitarian Crisis",
                    "effect": "Slightly increases probability. The catastrophic situation (millions displaced, famine, El Fasher siege) creates immense international pressure for at least a symbolic negotiation event. However, past humanitarian emergencies have not forced direct talks, so the effect is limited."
                },
                {
                    "factor": "Base Rate of Similar Conflicts",
                    "effect": "Decreases probability. In African civil wars with rival military governments, the median time to direct, in-person negotiation (with both delegations present) is several years, and is frequently delayed by cycles of failed mediation. Sudan’s own history (Darfur, North-South) shows years of failed indirect talks before joint meetings, and most never occurred while both sides were militarily strong and unwilling to concede."
                },
                {
                    "factor": "Event-Driven Diplomatic Leverage (e.g., UN, donor conferences, symbolic venues)",
                    "effect": "Slightly increases probability. Sometimes, international mediators are able to engineer a joint appearance for the sake of optics (e.g., at a major summit), particularly if one side faces extreme diplomatic isolation or conditionality for aid. However, the current statements and prior failed attempts suggest the parties are still not compelled."
                },
                {
                    "factor": "Time Pressure (Short Window to Resolution)",
                    "effect": "Decreases probability. With only 2.5 months left, it is less likely that breakthroughs in logistics, security guarantees, and mutual recognition can be achieved, especially after a long record of failed attempts."
                }
            ],
            "no_scenario": "Despite ongoing international mediation efforts and mounting humanitarian catastrophe, SAF and RSF maintain their mutual preconditions and refuse to recognize each other as legitimate interlocutors. Indirect talks, parallel attendance at international events, and virtual contacts may occur, but both delegations do not physically appear together at any venue designated as a peace negotiation before December 31, 2025. International pressure is insufficient to overcome deep distrust, external backers remain divided, and the war continues unabated.",
            "yes_scenario": "A major diplomatic breakthrough occurs—possibly due to a dramatic escalation of the humanitarian crisis, or as a precondition for a large-scale donor conference or sanctions relief. International mediators (e.g., the Quad, AU, UN) extract face-saving compromises, and both delegations reluctantly agree to appear at the same venue, possibly in a neutral location such as Jeddah, Geneva, or Addis Ababa. Both SAF and RSF delegations are physically present at the same time, even if only for a brief, symbolic opening session, before talks break down or devolve into shuttle diplomacy.",
            "final_reasoning": "The base rate for warring military factions in Africa engaging in direct, in-person negotiations within three years of intense civil conflict is low—typically requiring either mutual exhaustion, a clear battlefield stalemate, or overwhelming external coercion. While news articles report an uptick in international coordination and pressure, and analysts describe the current moment as 'closer than ever' to negotiations, the actual record is one of repeated failure: both delegations have so far refused to appear together, and the latest official statements from SAF (al-Burhan) remain uncompromising. External sponsors are not unified; the UAE and Egypt continue to back opposing sides, and mediation initiatives are fragmented. The humanitarian crisis, while severe, has not yet shifted the strategic calculus of either side, and as of early October 2025, no concrete date or venue has been announced, nor have the parties softened their demands. With only 2.5 months to go, the logistical and political barriers to arranging an official, in-person, Track One negotiation are substantial. The status quo is likely to persist, and last-minute breakthroughs are rare in such contexts unless precipitated by a dramatic shift (e.g., total military collapse of one side, or a major external ultimatum). I therefore assign a low—but not negligible—probability, reflecting a slight increase due to mounting international pressure but weighed down by hard base rates, entrenched distrust, and the short time horizon.",
            "final_probability": 17
        },
        "Conflict Resolution (Conflict Transformation)": {
            "time_to_resolution": "About 2.5 months (until December 31, 2025).",
            "perspective_relevance": "As a conflict resolution and transformation expert, my focus is on the structural, relational, and psychological dimensions that enable or block direct peace negotiations. I assess not just the tactical and diplomatic surface, but also the deeper drivers—mutual trust, identity, spoilers, and international alignment—that determine the likelihood of face-to-face engagement in high-stakes civil wars. My approach incorporates the importance of mediation architecture, third-party leverage, and the dynamics of ripeness for negotiation.",
            "status_quo": "Since the war’s outbreak in April 2023, the SAF and RSF have not physically attended the same peace negotiation venue. Multiple international efforts (Jeddah, Geneva, etc.) have failed to bring both delegations together in-person, with each side often sending representatives separately or refusing to participate if the other is present.",
            "perspective_derived_factors": [
                {
                    "factor": "Deep mutual distrust and zero-sum perceptions",
                    "effect": "Decreases probability: Both sides see direct talks as legitimizing the other, especially given recent statements by al-Burhan rejecting peace or reconciliation with the RSF, and the RSF’s moves to establish a parallel government. This entrenched mistrust is a key barrier to simultaneous physical attendance at negotiations."
                },
                {
                    "factor": "Intense and escalating humanitarian crisis",
                    "effect": "Increases probability (slightly): The scale of the humanitarian catastrophe (30 million in need, famine, mass displacement) creates unprecedented international and domestic pressure for negotiations. At times, acute suffering has created windows for direct talks in other conflicts."
                },
                {
                    "factor": "Robust and unified international pressure",
                    "effect": "Increases probability: The recent synchronized push by the Quad (US, Saudi Arabia, Egypt, UAE), the African Union, EU, UN, and key regional actors is more coordinated than in previous periods. The joint statement from major powers and the UN General Assembly focus may create an unusual moment of leverage—if only for a symbolic, high-profile meeting."
                },
                {
                    "factor": "Divergent/competing external backers and proxy dynamics",
                    "effect": "Decreases probability: External sponsors (Egypt, Saudi, UAE, etc.) have conflicting agendas and remain deeply involved militarily and diplomatically. This fragmentation undercuts the enforcement of any peace process and can incentivize obstruction or conditional attendance."
                },
                {
                    "factor": "Spoilers and internal fragmentation",
                    "effect": "Decreases probability: The presence of powerful spoilers—Islamist factions within the SAF, hardliners in RSF, and civilian groups opposing both—raises the risk that even if a negotiation is scheduled, one side will withdraw or sabotage at the last minute."
                },
                {
                    "factor": "Track record (base rate) of such meetings in similar contexts",
                    "effect": "Decreases probability: In recent high-intensity civil wars with strong external involvement and leadership contestation, it is rare to see both armed delegations physically at the same table within a short time frame post-escalation. Previous Sudan rounds (Jeddah, Geneva) failed to achieve this."
                },
                {
                    "factor": "Signs of new diplomatic momentum",
                    "effect": "Increases probability (modestly): Recent reporting cites multiple analysts and diplomats who believe the chances for in-person negotiation are the highest since the war began, with direct and indirect contacts underway, and both sides facing unprecedented isolation."
                }
            ],
            "no_scenario": "Despite mounting pressure and catastrophic humanitarian conditions, one or both parties refuse to physically attend a negotiation venue if the other is present. For example, the SAF insists on preconditions (e.g., RSF disarmament or status as non-equals), or the RSF refuses symbolic parity, and/or spoilers (e.g., Islamist factions, external actors) intervene to block or delay any meeting. A summit is scheduled, but at the last minute, one side sends only virtual or low-level representatives or withdraws, as occurred at Geneva in 2024. Alternatively, both sides attend staggered or parallel meetings (not qualifying under the criteria).",
            "yes_scenario": "International and domestic crises intensify to the point that neither side can afford further isolation or blame for humanitarian disaster. Under heavy diplomatic coordination (e.g., Quad+UN+AU), both SAF and RSF delegations are pressured or incentivized to attend a symbolic, high-profile negotiation venue—likely in Jeddah, Geneva, or a regional capital. Attendance is framed as a necessary step for humanitarian access or a truce, with both sides sending official delegations simultaneously for at least a ceremonial session, even if substantive negotiation remains limited. This could be facilitated by civilian actors or third-party mediation, with strong guarantees and face-saving formulas.",
            "final_reasoning": "The base rate for face-to-face, simultaneous attendance by warring factions in high-intensity, externally sponsored civil wars is low—especially when both sides have set hard preconditions and failed repeatedly to attend together over years of mediation. The most recent round in Geneva (August 2024) saw the SAF refuse to attend in person, even as international pressure peaked. The current context features some new elements: international coordination is unusually robust, and the humanitarian crisis is at its apex, which in theory could create a fleeting window for symbolic direct engagement. Analysts and diplomats cited in October 2025 view the prospects for negotiation as higher than ever, yet the structural obstacles—entrenched mutual delegitimization, spoilers, and fragmented external backers—remain formidable. Given the short time window (2.5 months), the threshold is high: not just a scheduled event but confirmed physical, overlapping presence at a negotiation venue. Given all factors, a Yes is possible but unlikely. I weigh the status quo outcome most heavily but nudge the probability upward (from a base rate of ~10%) to account for unique current pressure and slight uptick in optimism, yielding:",
            "final_probability": 17
        },
        "African Studies (African Regional Security Complex)": {
            "time_to_resolution": "Approximately 2.5 months (forecast date: 2025-10-15; resolution deadline: 2025-12-31)",
            "perspective_relevance": "As an expert in African Studies with a focus on regional security complexes, I bring deep knowledge of the interaction between internal Sudanese dynamics and the broader Horn of Africa security environment. This perspective is crucial for interpreting the incentives and constraints on both the SAF and RSF, the influences of external actors (Egypt, UAE, Saudi Arabia, US, etc.), and the historical patterns of negotiation and mediation in similar African conflicts. My understanding of the African Union, IGAD, and regional rivalries allows a more granular assessment of whether the necessary conditions for in-person, simultaneous peace negotiations are likely to materialize within the deadline.",
            "status_quo": "Since the war began in April 2023, SAF and RSF have not both physically attended the same venue for peace negotiations. All prior attempts at direct, in-person talks have failed or been avoided by at least one side. Both parties have preferred indirect, shuttle, or virtual formats, and have set preconditions for talks that the other rejects.",
            "perspective_derived_factors": [
                {
                    "factor": "Intensity of international and regional pressure",
                    "effect": "Increases probability. The latest statements from the Quad (US, Saudi Arabia, Egypt, UAE), the UN, AU, and EU show unprecedented alignment and increased urgency, with overt calls for direct negotiations and humanitarian ceasefires. Multiple news items highlight this pressure as reaching new levels."
                },
                {
                    "factor": "Entrenched mutual distrust and irreconcilable preconditions",
                    "effect": "Decreases probability. Both sides continue to refuse legitimacy to the other, with the SAF recently and publicly rejecting parity or conciliation, and the RSF announcing parallel government structures. Historical base rate for warring parties in similar African civil conflicts coming together in-person for negotiations within short, defined timeframes is low."
                },
                {
                    "factor": "Proxy dynamics and external spoilers",
                    "effect": "Decreases probability. UAE (allegedly arming RSF), Egypt (backing SAF), and other regional actors have divergent interests. The competition among middle powers (UAE, Saudi Arabia, Turkey, etc.) creates additional veto points and incentives for spoilers. The AU’s paralysis and the US’s limited bandwidth reduce the chance of a single effective mediator."
                },
                {
                    "factor": "Humanitarian catastrophe and risk of famine",
                    "effect": "Increases probability. The scale of hunger, displacement, and civilian suffering is now so extreme that it is beginning to shift the calculus on both sides and among external sponsors, increasing the reputational and political cost of continued intransigence. However, this effect is partially offset by both sides’ willingness to weaponize humanitarian suffering."
                },
                {
                    "factor": "Base rate of similar negotiations in ongoing African civil wars",
                    "effect": "Decreases probability. In cases like South Sudan, Ethiopia (Tigray), and earlier Sudanese conflicts, in-person peace talks between rival armed parties often occur only after military stalemate or exhaustion, or with strong external guarantees. With both sides still seeking gains on the battlefield and attempting rival governments, the historical base rate for imminent in-person negotiations remains low."
                },
                {
                    "factor": "Recent diplomatic activity and diplomatic 'momentum'",
                    "effect": "Slightly increases probability. There is some evidence of indirect contacts and preparatory work for high-level negotiations (see reporting on Jeddah track, Zurich secret meetings, and renewed US engagement). However, actual movement from preparatory talks to both delegations meeting in the same venue remains a significant leap."
                }
            ],
            "no_scenario": "The SAF and RSF continue to compete militarily and politically, each seeking to consolidate their respective zones of control and legitimacy. Both attend international forums and shuttle diplomacy, but refuse to be present in the same room, citing unacceptable preconditions (e.g., SAF rejection of RSF legitimacy, RSF insistence on recognition of its authority). External sponsors remain divided or unwilling to force a showdown. All meetings remain sequential, virtual, or at sub-delegation levels not qualifying under the question’s criteria.",
            "yes_scenario": "Mounting international and regional pressure, coupled with further escalation in humanitarian crisis (e.g., confirmed famine, new atrocity, or external threat), finally pushes both parties’ external backers (e.g., UAE, Egypt, Saudi Arabia, US) to use leverage (aid, military support, recognition) to compel both SAF and RSF to send official delegations to an in-person negotiation venue (likely Jeddah, Geneva, or Cairo). The delegations may attend under strong third-party guarantees, possibly with mediation by the Quad or the AU/IGAD, and the meeting is covered by credible media and/or official statements.",
            "final_reasoning": "Taking the status quo as a baseline (no in-person, simultaneous attendance in 2.5 years), I must assign a low but non-zero probability, reflecting both the historically slow pace of change and the unprecedented—if still unproven—level of international pressure. The base rate for rapid transitions from indirect to direct in-person negotiation in active African civil wars is low, especially when both sides have strong external sponsors and unresolved legitimacy questions. The SAF’s recent categorical public rejection of conciliation with RSF is a strong negative signal. However, the scale of the humanitarian crisis and the regional/international consensus that neither side can win militarily slightly increase the odds. The next 2.5 months are a short window, though the flurry of diplomatic activity could be a precursor to a breakthrough, albeit more likely in early 2026 than before the end of 2025. Factoring all, I judge the chance of both delegations physically attending the same peace negotiation venue before December 31, 2025, to be low but not negligible.",
            "final_probability": 13
        },
        "African Studies (Postcolonial State Theory)": {
            "time_to_resolution": "2.5 months (until December 31, 2025)",
            "perspective_relevance": "As an expert in African Studies and Postcolonial State Theory, I focus on the legacies of colonial state formation, militarized competition for state power, the role of external actors in shaping African conflicts, and the way state legitimacy is constructed or eroded in war. This perspective is critical for assessing the motivations and constraints on Sudan's SAF and RSF, especially regarding legitimacy, elite survival, and the broader context of internationalized civil war. It also informs my attention to the incentives/disincentives for negotiations, the role of regional and global powers, and how war economies and governance rivalries affect peace processes.",
            "status_quo": "Since the start of the war in April 2023, no peace negotiation has featured both SAF and RSF delegations physically present at the same venue simultaneously. All attempts at mediation (Jeddah, Geneva, various AU and Quad initiatives) have failed to bring both sides to the table in person. The most recent peace initiatives have seen only one party represented at a time or only indirect/parallel talks.",
            "perspective_derived_factors": [
                {
                    "factor": "Entrenched Elite Rivalry and Zero-Sum State Power Competition",
                    "effect": "Decreases probability. The SAF and RSF are locked in a battle not only over territory but over the legitimacy of the Sudanese state itself. Both entities have established or are attempting to establish rival governments, and each regards the other as existentially illegitimate. This mirrors postcolonial state crises where control over the capital and central state apparatus is seen as winner-takes-all, reducing incentives for genuine negotiation."
                },
                {
                    "factor": "External Patronage and Proxy Dynamics",
                    "effect": "Decreases probability. The involvement of regional powers (UAE, Egypt, Saudi Arabia, etc.) with diverging interests sustains the conflict and limits the leverage of any single mediator. Reports of continued arms flows, diplomatic rivalries, and lack of unified external pressure mean neither side is forced to the table."
                },
                {
                    "factor": "International and Regional Diplomatic Pressure",
                    "effect": "Increases probability. There is a notable uptick in international pressure (Quad, UN, AU, EU, UK, etc.) and diplomatic coordination urging direct talks, with some signals of more unified messaging. The dire humanitarian crisis and public statements about the impossibility of military victory are exerting new pressures."
                },
                {
                    "factor": "Humanitarian Catastrophe and State Collapse",
                    "effect": "Increases probability (moderately). The war has produced the world's largest displacement crisis and widespread famine, which historically (but not always) can create incentive structures for at least symbolic negotiations, especially if external aid is conditioned on such gestures."
                },
                {
                    "factor": "Recent Posturing and Public Statements by Leaders",
                    "effect": "Decreases probability. Both SAF (al-Burhan) and RSF (Hemedti) have made highly antagonistic statements. Al-Burhan has explicitly rejected any 'conciliation' and any outcome that leaves the RSF as an autonomous force—statements that are hard to walk back quickly. The RSF, for its part, continues to build its own rival administration, further polarizing the context."
                },
                {
                    "factor": "Short Time Frame and Negotiation Logistics",
                    "effect": "Decreases probability. With only about 2.5 months left, the time required to build trust, agree on terms, and organize a physical, simultaneous, high-level meeting is very short, especially given the record of repeated last-minute collapses and walkouts in previous initiatives."
                },
                {
                    "factor": "Symbolic/Track-Two vs. Formal Negotiations Distinction",
                    "effect": "Decreases probability. Resolution criteria are strict: only formal delegations, at a venue, for explicitly peace/political negotiations, with simultaneous presence, qualify. Indirect contacts, humanitarian coordination, or parallel attendance do not count, and so far, all movement has been indirect or symbolic."
                }
            ],
            "no_scenario": "Despite escalating humanitarian pressure and international condemnation, both SAF and RSF continue to prioritize battlefield gains and legitimacy wars. The SAF, emboldened by support from Egypt and Saudi Arabia, refuses to attend any negotiation that treats the RSF as a co-equal. The RSF, backed by the UAE and others, maintains its siege in Darfur and expands parallel governance. Diplomatic efforts produce more statements and indirect contacts, but neither side commits to sending a delegation to a simultaneous, in-person negotiation, citing security, legitimacy, or precondition disputes. External actors remain divided, and the time runs out with only indirect or parallel meetings occurring.",
            "yes_scenario": "Mounting international and regional pressure, combined with a worsening humanitarian catastrophe (e.g., mass starvation in El Fasher or another atrocity event), forces one or both sides to reassess their positions. External patrons threaten to withhold military or financial support unless both delegations show up in person. A face-saving formula is devised, perhaps with a high-profile, multilateral venue (e.g., Jeddah, Geneva, or Addis Ababa) and heavy international presence, allowing both sides to claim they are negotiating for Sudan's future, not conceding to the other. Both delegations arrive, under pressure, and are present simultaneously, even if only for opening ceremonies or photo-ops, satisfying the resolution criteria.",
            "final_reasoning": "The historical base rate for simultaneous, in-person peace negotiations in African civil wars featuring rival governments, entrenched external backers, and zero-sum legitimacy contests is very low in the absence of clear military stalemate, unified external pressure, or a mutually hurting stalemate. Sudan’s postcolonial state logic—where the state remains a prize for total control—makes such negotiations especially rare unless both sides are exhausted or their patrons force them to the table. Although international pressure is increasing, and humanitarian catastrophe is at unprecedented levels, the preponderance of evidence shows continued hardline posturing, deepening rival administrations, and ongoing external patronage, with little sign of either side preparing to make the necessary concessions for simultaneous, in-person talks. The time frame is very short, and all recent precedents point to either sequential, indirect, or failed negotiation attempts. While a last-minute symbolic meeting cannot be entirely ruled out (especially if external backers shift tactics), the probability remains low but not impossible, given the level of outside attention and catastrophe. I assess the probability at 18%, reflecting both the weight of the status quo and the modestly increased likelihood due to external pressure and humanitarian urgency.",
            "final_probability": 18
        }
    },
    "deliberation_probability": [
        18,
        15,
        23,
        19,
        18,
        5,
        17,
        17,
        13,
        18
    ],
    "deliberation_mean_probability": 16.3,
    "deliberation_sd": 4.738729318662921,
    "deliberation_probability_result": 16
}