{
    "deliberation_results": {
        "IntelligenceAnalysis (IndicatorsAndWarningsMethod)": {
            "time_to_resolution": "Approximately 44 days (until January 1, 2026).",
            "perspective_relevance": "As an expert in Intelligence Analysis utilizing the Indicators and Warnings (I&W) method, I am trained to detect early signals of instability, coup risk, and regime vulnerability by systematically assessing structural conditions, elite cohesion, security force loyalty, external actors' influence, and public sentiment. My perspective is relevant because coups rarely happen without precursor signals, and I&W analysis excels at discriminating between background noise and genuine risk escalation. This approach also puts due weight on the inertia of political systems and the high base rate of coup attempts that fail or are preempted.",
            "status_quo": "The status quo is that, while Africa has seen a spate of coups in the last five years (especially in the Sahel), no country in Africa or Latin America is currently experiencing an active, successful coup as of November 18, 2025. Regimes in Mali, Burkina Faso, Niger, and Guinea-Bissau are under military or semi-authoritarian rule, but are currently relatively stable. Latin America has experienced recent coup attempts (e.g., Bolivia, Brazil, Peru), but none have been successful in the last 18 months.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent coup base rate",
                    "effect": "Increases probability. Africa, especially the Sahel, has had a historic surge in successful coups since 2020, making the near-term base rate higher than the historical average. Latin America’s base rate remains low but not zero."
                },
                {
                    "factor": "Elite and military cohesion in key coup-prone states",
                    "effect": "Decreases probability. Where militaries have recently seized power (e.g., Mali, Burkina Faso, Niger), elite and military leadership is focused on consolidating rule, purging dissent, and preventing counter-coups. This tends to reduce near-term coup risk, as recent regimes are more vigilant and have fresh control over levers of repression."
                },
                {
                    "factor": "Security and insurgency pressure (Sahel states, Mali in particular)",
                    "effect": "Slightly increases probability. Severe insurgency pressure, especially in Mali, could create opportunities for dissatisfied military factions or external actors to attempt power grabs if the current junta is seen as incompetent. However, high threat environments can also lead to rally-around-the-flag effects and tighter regime security."
                },
                {
                    "factor": "External actors’ involvement (Russia, Wagner/Africa Corps)",
                    "effect": "Mixed effect, slightly increases probability. External military support can stabilize regimes (as in Mali and CAR), but also introduces new actors and rivalries, raising risk of elite splits or externally-enabled coups. However, Russia’s interests currently align with maintaining partner juntas."
                },
                {
                    "factor": "Popular discontent and legitimacy crises (Guinea-Bissau, Benin, Mali, Burkina Faso)",
                    "effect": "Slightly increases probability. Widespread discontent, suppression of opposition, economic hardship, and manipulated elections raise risks, especially where security forces are dissatisfied or see regime as illegitimate. However, most regimes are actively suppressing opposition and dissent, which can delay coups."
                },
                {
                    "factor": "Recency of failed/foiled coup attempts (Nigeria, Mali, Guinea-Bissau)",
                    "effect": "Decreases probability. Recent foiled attempts usually trigger purges and increased vigilance, making a successful follow-on coup less likely in the short run."
                },
                {
                    "factor": "Upcoming political transitions/elections (Benin, Guinea-Bissau, CAR)",
                    "effect": "Slightly increases probability. Transitions can be flashpoints for coups, especially if succession is contested, opposition is excluded, or the military doubts the process. However, most upcoming transitions are tightly managed."
                }
            ],
            "no_scenario": "No country in Africa or Latin America experiences a successful coup before Jan 1, 2026. This could occur if: (a) regimes in the Sahel (Mali, Burkina Faso, Niger) maintain tight control and suppress internal dissent, (b) external support (e.g., Russia) effectively deters ambitious factions, (c) opposition and civil society in places like Benin, Guinea-Bissau, and the CAR are too weak or repressed to mobilize meaningful challenge, and (d) coup plotting in major states (e.g., Nigeria, Ethiopia, Brazil, Bolivia) is detected and preempted, as in recent cases.",
            "yes_scenario": "A successful coup occurs in at least one country in Africa or Latin America before Jan 1, 2026. Most plausible scenarios: (a) an internal split or counter-coup within a Sahel junta (e.g., Mali or Burkina Faso) where a faction seizes power and consolidates control amid insurgency chaos; (b) a security force mutiny or elite defection in a fragile democracy (e.g., Guinea-Bissau) during or after a disputed election; (c) a self-coup by an incumbent leader who refuses to leave power after a contested election (e.g., CAR, Benin, or a Latin American state with upcoming elections); or (d) an unexpected event (assassination, mutiny, or foreign intervention) quickly topples a regime in an already unstable state.",
            "final_reasoning": "The base rate for successful coups in Africa has increased dramatically since 2020, especially in the Sahel. However, most recent coups have consolidated military rule, and regimes are highly vigilant, with external support from Russia and others. Recent foiled coup attempts (Nigeria, Mali, Guinea-Bissau) also suggest that security services are on high alert. While the Sahel remains the most likely region for a coup, the window is short (~6 weeks), and there are no current signals of imminent regime collapse. Latin America’s risk is much lower, with recent coup attempts failing and most militaries remaining in barracks. Structural pressures—economic hardship, insurgencies, legitimacy crises—persist in several states (Mali, Burkina Faso, Guinea-Bissau, Benin, CAR), but the period until Jan 1, 2026, is brief, and most regimes are currently suppressing opposition and monitoring dissent. The scenario most likely to trigger a coup would be an internal military split in the Sahel or a botched transition in a fragile state. Overall, while risk is elevated compared to historical norms, the short time frame and current regime vigilance suggest a successful coup is somewhat less likely than not. I assess the probability at 32%.",
            "final_probability": 32
        },
        "IntelligenceAnalysis (PoliticalRiskAssessment)": {
            "time_to_resolution": "Approximately 43 days (until January 1, 2026)",
            "perspective_relevance": "As an intelligence analyst specializing in political risk, my perspective is rooted in evaluating structural drivers of instability, monitoring elite cohesion within militaries and political systems, tracking recent coup and coup attempt trends, and weighing the impact of external actors (notably Russia and regional organizations) on regime survival. This expertise enables me to distinguish between background instability and the specific conditions that lead to successful coups, as well as to assess the likelihood of coup contagion in the current geopolitical context.",
            "status_quo": "The status quo is that coups, while recently more frequent in Africa (especially the Sahel), remain rare events in any given 4-6 week period. Most recent coups have occurred in the Sahel/West Africa. Latin America, despite some instability, has not seen a successful military coup in over a decade, though there have been attempts and self-coup scenarios.",
            "perspective_derived_factors": [
                {
                    "factor": "High Recent Coup Activity in Africa",
                    "effect": "Increases probability: The Sahel has seen a surge in coups since 2020, with several juntas in place and failed/attempted coups even in 2024-2025, suggesting a higher baseline risk."
                },
                {
                    "factor": "Elite Fragmentation and Military Discontent",
                    "effect": "Increases probability: Reports from Nigeria, Mali, and Burkina Faso indicate ongoing internal divisions, low morale, and recent coup attempts or plots, all of which historically precede successful coups."
                },
                {
                    "factor": "External Support for Incumbent Regimes (notably Russia/Africa Corps)",
                    "effect": "Decreases probability: Russian military/security presence in Mali, Burkina Faso, Niger, and CAR helps strengthen junta control, deterring or suppressing coup attempts."
                },
                {
                    "factor": "Insurgency and Security Pressure",
                    "effect": "Mixed effect: Jihadist gains and deteriorating security in Mali and Burkina Faso create pressures that can both weaken and rally juntas; severe crises can provoke coups but also justify emergency rule."
                },
                {
                    "factor": "Regional Norms and Coup Fatigue",
                    "effect": "Decreases probability: After a wave of coups, there is often a period of consolidation or 'coup fatigue,' with militaries wary of further instability, especially as juntas entrench and opposition is suppressed."
                },
                {
                    "factor": "Latin America Coup Base Rate",
                    "effect": "Decreases probability: Successful coups in Latin America are exceedingly rare post-2000. Recent events (Peru, Brazil, Bolivia) have not met the success threshold; institutional resilience remains high."
                },
                {
                    "factor": "Short Timeframe to Resolution",
                    "effect": "Decreases probability: Only six weeks remain, which statistically reduces the likelihood even in higher-risk environments."
                }
            ],
            "no_scenario": "Despite ongoing instability, juntas in Mali, Burkina Faso, and Niger maintain power with Russian support, suppressing internal dissent. Nigeria, though experiencing coup scares, manages to contain military unrest through reshuffles and arrests. No new successful coup occurs in the Sahel, and Latin American political crises (e.g., in Bolivia, Peru, Brazil) do not escalate into successful coups. The status quo of entrenched regimes persists through January 1, 2026.",
            "yes_scenario": "A faction within Mali's military, frustrated by worsening security and leadership failures, seizes control in Bamako, ousting Goita and overcoming loyalist and Russian-backed forces. Alternatively, Burkina Faso or Niger sees a rapid palace coup as elite infighting intensifies. Less likely, but possible, an unexpected self-coup or military takeover occurs in a fragile Latin American state undergoing an electoral crisis, such as Guinea-Bissau, where exclusion of major parties and elite manipulation spark a power grab.",
            "final_reasoning": "The base rate for successful coups in Africa has risen since 2020, particularly in the Sahel, but the probability of a successful coup in any given 6-week period remains modest, even in high-risk states. Recent news highlights ongoing instability, coup attempts, and elite discontent (notably in Nigeria, Mali, Burkina Faso, Guinea-Bissau), but also shows that incumbent juntas are consolidating power with external (especially Russian) backing, making successful coups harder. The short time to resolution (43 days) further lowers odds, as successful coups often take months to percolate from unrest to action. Latin America shows no credible near-term coup threat; self-coup potential is present but unlikely to escalate to a 'successful' coup before the deadline. Overall, while risk is elevated compared to global averages, the window is short and the most vulnerable regimes have recently suppressed or survived coup plots. Therefore, the probability of a successful coup in Africa or Latin America before January 1, 2026 is higher than in most years but still below 1-in-4.",
            "final_probability": 23
        },
        "SecurityStudies (CivilMilitaryRelations)": {
            "time_to_resolution": "Approximately 44 days (from November 18, 2025 to January 1, 2026)",
            "perspective_relevance": "As an expert in Security Studies specializing in Civil-Military Relations, I bring a nuanced understanding of coup dynamics, military motivations, the impact of external actors, and the durability of post-coup regimes. My expertise enables me to distinguish between routine political turbulence and genuine coup risks, as well as to assess how changes in military cohesion, popular legitimacy, and foreign involvement interact to affect regime stability in Africa and Latin America.",
            "status_quo": "No successful coup occurs. While Africa and Latin America are both historically prone to coups, the majority of months pass without a successful coup. The recent spate of coups in Africa (Sahel in particular) has not yet produced a clear trend of increasing frequency, and Latin America remains relatively stable despite some high-profile attempts.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent coup and coup attempt base rate in Africa and Latin America",
                    "effect": "Increases probability. The Sahel has seen a wave of coups in recent years (Mali, Burkina Faso, Niger, Gabon, Guinea, Chad), with attempted coups in Nigeria and Guinea-Bissau even in 2025. Latin America has seen failed attempts, but successful coups are rare. The base rate for Africa, especially the Sahel, is elevated."
                },
                {
                    "factor": "Military regime fragility and intra-military tensions in Sahel countries",
                    "effect": "Increases probability. Sahelian juntas (Mali, Burkina Faso, Niger) face mounting internal dissent, declining legitimacy, worsening security, and economic hardship. Reports of failed coups and elite splits in Mali, mutinies in Niger, and low-ranking leadership in Burkina Faso all signal elevated risk."
                },
                {
                    "factor": "Role of external actors, especially Russian involvement",
                    "effect": "Mixed effect. Russian Wagner/Africa Corps presence may bolster incumbent military regimes' short-term security, but also fosters resentment, creates new elite rivalries, and may destabilize civil-military balances, raising medium-term coup risk."
                },
                {
                    "factor": "Jihadist insurgency and loss of state control in Mali and Burkina Faso",
                    "effect": "Increases probability. Weakening control and territorial loss to jihadists can undermine junta legitimacy or embolden rivals within the military to seize power, claiming to restore order."
                },
                {
                    "factor": "Regional and international pressure on juntas (e.g., sanctions, ECOWAS, ICC withdrawal)",
                    "effect": "Slightly increases probability. International isolation, sanctions, and loss of legitimacy may exacerbate elite disunity or provoke a preemptive coup by factions fearing personal risk."
                },
                {
                    "factor": "Recent constitutional engineering and elite consolidation in non-Sahel states (Benin, Guinea-Bissau, Central African Republic)",
                    "effect": "Decreases probability. In these cases, incumbents are preemptively consolidating power and sidelining opposition, which can suppress coup risk in the very short term."
                },
                {
                    "factor": "Religious and civil society mediation",
                    "effect": "Decreases probability. Faith leaders and civil society actors have played a stabilizing role in some Sahelian states, though their influence may be waning as regimes entrench."
                },
                {
                    "factor": "Base rate in Latin America (2020s-2025): High-profile attempts, low success",
                    "effect": "Decreases probability. While there are incidents (Brazil 2023, Bolivia 2024), Latin American militaries are less prone to intervene successfully than their African counterparts in recent years."
                }
            ],
            "no_scenario": "Despite severe instability, no successful coup occurs before January 1, 2026. Sahelian military regimes (Mali, Burkina Faso, Niger) weather internal dissent, using Russian backing and repression to keep rivals in check. Jihadist advances remain a military problem but do not prompt a palace coup. In Latin America, electoral and constitutional crises (e.g., Benin, Guinea-Bissau, Central African Republic) are managed through elite bargaining, flawed elections, or legal maneuvers, not overt military takeovers.",
            "yes_scenario": "A successful coup takes place in one of the Sahelian states (most likely Mali or Burkina Faso) as intra-military tensions boil over, possibly following a military defeat or economic crisis. A rival military faction removes the junta, seizes power, and is able to consolidate both military and governmental control, quickly suppressing resistance. Alternatively, a self-coup occurs in a state like Guinea-Bissau (president suspends institutions, dissolves parliament, and forcibly extends rule), or a sudden, successful coup materializes in a less-watched state, such as the Central African Republic or Guinea.",
            "final_reasoning": "The time window (44 days) is meaningful but short. The base rate for successful coups in both regions is historically low on a per-month basis, but Africa, and especially the Sahel, is currently at an elevated risk due to recent coup waves, intra-military fissures, and the presence of foreign mercenaries. Ongoing internal dissent in Mali, Burkina Faso, and Niger, combined with recent failed and attempted coups (Nigeria, Guinea-Bissau), signal instability. However, the presence of foreign support (Russia) may temporarily stabilize these regimes, and the short time horizon somewhat limits the likelihood of full-scale coup success, as most recent attempts have been suppressed. Latin America remains relatively stable, with the base rate of successful coups much lower than in Africa. Considering all the factors, I judge the probability of a successful coup (as defined by Metaculus) in Africa or Latin America before January 1, 2026, to be moderately above the base rate, but not extreme, due to the very short window and current regime survival strategies.",
            "final_probability": 21
        },
        "InternationalRelations (RegionalSecurityComplexTheory)": {
            "time_to_resolution": "Approximately 44 days (until January 1, 2026)",
            "perspective_relevance": "Regional Security Complex Theory (RSCT) emphasizes the interconnectedness of security dynamics within regional clusters, particularly how security challenges, such as coups, can spread through regional contagion, shared threat perceptions, and weak or failing state institutions. My expertise allows a nuanced understanding of how regional military interventions, foreign actors, and local security dilemmas catalyze or inhibit coup risk, especially given Africa and Latin America's differing coup histories and current events.",
            "status_quo": "Since August 2020, there have been at least 7 successful coups in Africa, with several failed or attempted coups. Latin America has seen coup attempts, but few have fully succeeded in recent years. The current trend is for Africa, especially the Sahel region, to remain the global epicenter of successful coups, while Latin America has lower, but nonzero, risk. If nothing changed, the base rate would suggest a 15-20% chance of a successful coup in either region within a four-month window.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent coup attempts and successful coups in Africa",
                    "effect": "Increases probability: The high base rate of coups in Africa, particularly in the Sahel, signals persistent institutional weakness and coup contagion dynamics."
                },
                {
                    "factor": "Regional security deterioration (Sahel, Mali, Burkina Faso, Niger)",
                    "effect": "Increases probability: Reports indicate worsening governance, internal dissent within militaries, and loss of popular support for current juntas, all classic pre-coup conditions."
                },
                {
                    "factor": "Foreign military presence (Russia’s Africa Corps, Wagner, Turkey, etc.)",
                    "effect": "Mixed effect: Could stabilize incumbent regimes (by deterring dissent or suppressing coup attempts), but also increases resentment, competition, and introduces additional actors who might facilitate or resist coups."
                },
                {
                    "factor": "Jihadist insurgencies and state fragility (Mali, Burkina Faso)",
                    "effect": "Increases probability: Accelerates regime delegitimization and creates opportunities for military actors or factions to justify coups on grounds of restoring order."
                },
                {
                    "factor": "Recent failed coup attempts and pre-emptive crackdowns (Nigeria, Mali, Burkina Faso)",
                    "effect": "Decreases probability: Heightened surveillance and purges make further coups riskier in the short term, but do not remove the underlying causes."
                },
                {
                    "factor": "Upcoming or contested elections and constitutional manipulations (Benin, Guinea-Bissau, Central African Republic, etc.)",
                    "effect": "Slightly increases probability: Manipulation or exclusion of opposition creates conditions for self-coups or counter-coups, particularly if elites or military factions lose faith in the process."
                },
                {
                    "factor": "Regional and international deterrence (ECOWAS, African Union, external sanctions)",
                    "effect": "Decreases probability: Active threat or use of sanctions/interventions may deter would-be coup plotters, though effectiveness is mixed based on recent evidence."
                },
                {
                    "factor": "Latin America’s recent coup attempts (Bolivia 2024, Peru 2022, Brazil 2023)",
                    "effect": "Slightly increases probability: While recent attempts failed, instability signals that some risk remains, but most militaries are less prone to overt intervention compared to Africa."
                }
            ],
            "no_scenario": "No major military or elite faction is able to organize a coup due to effective pre-emptive surveillance, crackdowns, and co-optation by incumbents (possibly aided by foreign partners). Even where regimes face domestic unrest or contestation, opposition is suppressed or channeled into managed elections or constitutional changes (e.g., Benin, Guinea-Bissau, CAR), or insurgencies remain external threats rather than triggers for coups. Latin America remains stable, with militaries hesitant to intervene directly.",
            "yes_scenario": "A faction within the military or elite in Mali, Burkina Faso, or Niger, frustrated by junta mismanagement, battlefield losses, or worsening economic crisis, executes a rapid coup, possibly with tacit or explicit support from foreign actors or rival internal networks. The coup is successful, meaning the new leadership consolidates control over the army and government within days/weeks, and significant resistance collapses. Alternatively, a self-coup occurs in the context of a manipulated or contested election (e.g., Guinea-Bissau, CAR), with the incumbent suspending constitutional order and assuming extraordinary powers, and the military falls in line.",
            "final_reasoning": "The base rate for successful coups in Africa, especially the Sahel, remains high, with 7+ coups since 2020 and several failed attempts in 2024/2025. The current news indicates ongoing instability in Mali, Burkina Faso, and Niger, with reports of internal discontent, economic crisis, and deteriorating security. Multiple sources highlight recent coup scares (Nigeria), internal purges (Mali), and the presence of foreign mercenaries (Russia, Wagner) which could either suppress or inadvertently trigger coups by alienating factions. However, successful coups are often followed by crackdowns and purges that temporarily lower immediate coup risk, and the window to January 1, 2026 is relatively short (~6 weeks). Latin America’s risk is lower, despite recent attempts. Based on the high base rate in Africa, the acute pressure on Sahel regimes, and the short but non-negligible time window, I forecast a moderately elevated probability, but not an extreme one, reflecting both the likelihood of attempted but not necessarily successful coups, and the possibility that recent purges deter further attempts until after the resolution date.",
            "final_probability": 33
        },
        "Political Science (CoupTrapTheory)": {
            "time_to_resolution": "Approximately 44 days (question resolves January 1, 2026; today is November 18, 2025)",
            "perspective_relevance": "As an expert in CoupTrapTheory—a political science framework focusing on coup risk, entrapment dynamics, and institutional decay—I bring a nuanced understanding of how repeated coups, international interventions, and regime adaptation shape the propensity for further coups. This perspective prioritizes structural factors (like coup-proofing, legitimacy cycles, and elite fragmentation) and uses base rates to calibrate coup expectations, especially in high-risk regions like the Sahel.",
            "status_quo": "No successful coup occurs. Despite instability, most recent coups (2020–2024) have already succeeded, and regimes are in a phase of consolidation, often with increased repression and external support. The baseline is for existing juntas and fragile democracies to persist, at least over short timeframes.",
            "perspective_derived_factors": [
                {
                    "factor": "High Base Rate of Coups in Africa, Especially Sahel",
                    "effect": "Increases probability. Africa (notably West Africa/Sahel) has seen a surge in coups since 2020, with several successful overthrows (Mali, Burkina Faso, Niger, Gabon, Guinea). Recent years have seen 2–4 successful coups annually in Africa alone. The base rate for the 4.5-month forecast window is roughly 0.8–1.2 coups, though clustering and regime adaptation can dampen or spike this rate."
                },
                {
                    "factor": "CoupTrap Dynamics and Regime Adaptation",
                    "effect": "Decreases probability. CoupTrapTheory posits that regimes recently born of coups often rapidly adapt by coup-proofing, purging security services, increasing repression, and seeking foreign backing (e.g., Wagner/Russia, Turkey). This creates a short-term 'trap' where further coups are less likely immediately after a successful one."
                },
                {
                    "factor": "Elite Fragmentation, Military Dissent, and Unmet Expectations",
                    "effect": "Increases probability. News of failed coup attempts (Nigeria October 2025, Mali August 2024), officer purges, and visible elite rivalries signal ongoing vulnerability—even post-coup regimes are not immune. Economic hardship, loss of legitimacy, and intra-military grievances (e.g., Burkina Faso, Mali, Niger) intensify risk."
                },
                {
                    "factor": "External Actors and Security Dilemmas",
                    "effect": "Mixed effect. The presence of Russian troops/Africa Corps and Turkish military support in Mali, Burkina Faso, and Niger bolsters current juntas, deterring coups. However, foreign alignment can also stoke factionalism, as rival elites may seek foreign sponsorship for their own power bids or react against perceived puppet regimes."
                },
                {
                    "factor": "Jihadist Insurgency and Security Collapse",
                    "effect": "Increases probability, especially in Sahel. The growing strength of Islamist groups (e.g., JNIM, ISWAP) and the collapse of state authority, particularly in Mali, can trigger coups as military leaders blame each other for failure, or as desperate elites seek scapegoats or saviors."
                },
                {
                    "factor": "Upcoming Elections and Manipulation (Self-coup Risk)",
                    "effect": "Slightly increases probability in specific cases. Guinea-Bissau, Benin, and possibly the Central African Republic are experiencing electoral manipulation, opposition exclusion, and constitutional changes. While these maneuvers can entrench incumbents, they also prompt backlash; self-coup scenarios (e.g., refusal to leave office) or military interventions are plausible, though most likely after, not before, elections."
                },
                {
                    "factor": "Regional and Global Coup Fatigue",
                    "effect": "Decreases probability. International and regional organizations (ECOWAS, AU, UN) have proven unable to reverse coups, but repeated events may lead to diminishing returns for plotters, as states become more isolated or foreign aid dries up. Fatigue and adaptation can reduce short-term risk."
                }
            ],
            "no_scenario": "The military juntas in Mali, Burkina Faso, and Niger maintain power through repression, purges, and foreign support (Russia, Turkey). Despite rumors of plots (e.g., Nigeria's failed coup), regimes swiftly crush dissent, and no group manages to seize and consolidate control over both government and military within the timeframe. In Latin America, despite polarization and recent coup attempts (Bolivia 2024, Brazil 2023, Peru 2022), security forces remain loyal and no new successful coup occurs before January 1, 2026.",
            "yes_scenario": "A faction within the military or security services in a Sahelian state (most likely Mali or Burkina Faso) successfully overthrows the sitting junta, taking advantage of internal dissent, battlefield failures, or elite rivalries. Alternatively, in Guinea-Bissau, a military or elite faction, dissatisfied with flawed elections or executive overreach, stages a successful coup. A less likely scenario is a self-coup in a Latin American country where an incumbent refuses to leave office after a manipulated election, but this is more probable after scheduled elections (which mostly fall after the forecast window).",
            "final_reasoning": "Base rates for successful coups in Africa remain historically high, especially in the Sahel, with 7+ coups since 2020 and multiple attempts in 2024–2025. However, CoupTrapTheory emphasizes that post-coup regimes are temporarily more resilient due to rapid adaptation and consolidation. The current news supports this: while there are ongoing tensions, purges, and elite conflict (Nigeria, Mali, Burkina Faso, Guinea-Bissau), there is also clear evidence of severe repression, foreign military support, and efforts to shore up regime stability. Latin America, despite some instability, has a much lower base rate, and the most likely windows for self-coups or military interventions fall outside the remaining forecast period. The next 44 days are a period of heightened—but not peak—risk: the Sahel is the clear hotspot, but most regimes have recently coup-proofed, and recent attempts have failed. Weighing the high base rate, persistent elite fragmentation, and security collapse against the short-term resilience of post-coup regimes, I assess the probability as above the historical average for any random 1.5-month period, but not extremely high due to the CoupTrap effect and lack of 'smoking gun' coup rumors. My forecast: 26%.",
            "final_probability": 26
        },
        "Political Science (ComparativeAuthoritarianism)": {
            "time_to_resolution": "Approximately 6 weeks (from November 18, 2025, to January 1, 2026).",
            "perspective_relevance": "As an expert in Comparative Authoritarianism, my perspective is crucial because successful coups are strongly shaped by regime type, elite cohesion, coup-proofing strategies, foreign patronage, and the regional diffusion of authoritarian practices. I can assess which regimes are most vulnerable and why, going beyond surface-level unrest to analyze structural and institutional determinants of coup risk in Africa and Latin America.",
            "status_quo": "The status quo is that coups are relatively frequent in Africa (especially the Sahel/West Africa), with several successful coups since 2020. Latin America has had fewer successful coups recently, with only attempted and failed coups or self-coups (e.g., Peru 2022, Bolivia 2024, Brazil 2023). At present, there has not been a successful coup since the question's open date (August 21, 2025).",
            "perspective_derived_factors": [
                {
                    "factor": "Base Rate of Coups (especially in the Sahel)",
                    "effect": "Increases probability. Africa, particularly the Sahel, has experienced a high base rate of successful coups in recent years, with at least one nearly every year since 2020. Latin America’s base rate is much lower."
                },
                {
                    "factor": "Elite Fragmentation and Regime Instability in Sahel States",
                    "effect": "Increases probability. Mali, Burkina Faso, and Niger exhibit pronounced elite divisions, declining military legitimacy, economic crisis, and intra-military tensions, all of which raise coup risk. News of failed coup attempts (e.g., Nigeria 2025, Mali 2024, Niger mutinies) suggests high underlying instability."
                },
                {
                    "factor": "Foreign Influence and Coup-Proofing",
                    "effect": "Decreases probability. The presence of Russian troops (Africa Corps/Wagner) and increased security partnerships (Turkey, China) in key Sahel states strengthens coup-proofing and regime survival, discouraging would-be plotters by increasing the costs and risks of attempting a coup."
                },
                {
                    "factor": "Jihadist Insurgency and State Collapse Risk",
                    "effect": "Ambiguous. The risk of state collapse (e.g., Mali encircled by Al-Qaeda-linked JNIM) can both increase the likelihood of a coup (as desperate officers seek to 'save' the state or their own interests) and decrease it (if the military is overstretched or regimes preemptively purge rivals)."
                },
                {
                    "factor": "Repression of Opposition and Electoral Manipulation (e.g., Benin, Guinea-Bissau)",
                    "effect": "Slightly increases probability. Where incumbents hollow out institutions and exclude opposition, regime insiders may become dissatisfied, increasing the risk of palace or military coups, especially if succession is uncertain. However, strong control can also deter immediate coups."
                },
                {
                    "factor": "Regional Diffusion and Contagion",
                    "effect": "Increases probability. The recent wave of coups in the Sahel has demonstrated that successful coups can inspire copycats, lowering the perceived risk to plotters in similar contexts."
                },
                {
                    "factor": "Short Timeframe to Resolution",
                    "effect": "Decreases probability. Only 6 weeks remain. While the base rate is high, the short window means fewer opportunities for a successful coup to occur."
                },
                {
                    "factor": "Latin America Context",
                    "effect": "Decreases probability. The region has had only failed or partially attempted coups in the last several years, and most militaries are under strong civilian control; no current flashpoints suggest imminent coup risk in the next 6 weeks."
                }
            ],
            "no_scenario": "No successful coup occurs anywhere in Africa or Latin America before January 1, 2026. Military and elite dissatisfaction in Mali, Burkina Faso, Niger, Guinea-Bissau, etc. continues to simmer but is contained through repression, foreign backing, or lack of coordination among plotters. Any coup attempts (as in Nigeria 2025 or Mali 2024) fail or are preempted by purges, and fragile regimes limp on into the new year. Latin America remains stable or limits unrest to failed or abortive attempts.",
            "yes_scenario": "A successful coup occurs in one of the high-risk Sahel states (most likely Mali, Burkina Faso, Niger, or Guinea-Bissau). This could take the form of a 'palace coup' where one faction within the military/junta removes the current leader, or a mutiny escalates into regime change, possibly amid worsening security or economic crisis. Alternatively, a self-coup or institutional power grab could occur if an incumbent refuses to honor legal constraints, but this is less likely in the near term.",
            "final_reasoning": "Historically, the base rate of successful coups in Africa (especially the Sahel) is high: since 2020, there has been at least one successful coup nearly every year, and attempted coups are even more frequent. There are clear warning signs of ongoing instability—recent failed coup attempts in Nigeria, Mali, and mutinies in Niger; elite fragmentation and declining legitimacy in the Sahel; and state collapse risk in Mali. However, the presence of Russian and other foreign military advisors raises the threshold for would-be plotters, as does active repression and surveillance. The short time window (just 6 weeks) to resolution is a major constraint—even in high-risk environments, coups are rare events on a week-to-week basis. Latin America is quiet, with no acute flashpoints. Overall, while the risk is much higher than in most other regions or historical periods, the short time window pulls the probability down from the annualized base rate. Considering all these factors, I estimate the probability of a successful coup in Africa or Latin America before January 1, 2026, at 18%.",
            "final_probability": 18
        },
        "Political Science (PoliticalInstitutionalism)": {
            "time_to_resolution": "Approximately 1.5 months (from November 18, 2025, to January 1, 2026).",
            "perspective_relevance": "As a political institutionalist, I focus on the stability, legitimacy, and performance of political institutions, the role of militaries and elites in regime change, and the incentives that drive coups. My expertise allows me to analyze the structural weaknesses and resilience within African and Latin American states, assess coup base rates, and weigh current trends in civil-military relations and external influences.",
            "status_quo": "The status quo is that coups have occurred with notable frequency in Africa in recent years (especially in West Africa/Sahel), but have been rare in Latin America since the 1990s. Currently, several African states are run by military juntas, while many others experience low-intensity instability and elite contestation but have not seen successful coups in the past year.",
            "perspective_derived_factors": [
                {
                    "factor": "Base Rate of Coups (2020-2025, Africa & Latin America)",
                    "effect": "Increases the probability moderately. Africa, particularly the Sahel, has experienced 6+ successful coups since 2020, with continued attempted coups as recently as 2025. Latin America has seen attempts but no fully successful military coups in recent years. The base rate for Africa is thus non-trivial over short windows like the next 1.5 months."
                },
                {
                    "factor": "Junta Consolidation and Coup-Proofing",
                    "effect": "Decreases the probability. Many of the most coup-prone states (Mali, Burkina Faso, Niger) are already under military rule, and current juntas have invested heavily in repression, patronage, and foreign support to prevent counter-coups. This often creates a 'coup-proofing' effect in the short-term."
                },
                {
                    "factor": "Elite Fissures and Ongoing Attempted Coups",
                    "effect": "Increases the probability. Reports of attempted coups and purges in Nigeria and Mali in the past months, as well as intra-elite tensions in Burkina Faso, indicate instability. However, most have been thwarted before success, suggesting vigilance but also fragility."
                },
                {
                    "factor": "External Actors and Mercenary Involvement (e.g., Russia/Wagner, Turkey)",
                    "effect": "Slightly increases the probability. Russian military involvement via Wagner/Africa Corps and Turkish defense ties may embolden or deter coups, but the proliferation of foreign actors creates both new incentives and risks for regime change, particularly if their interests diverge from current juntas."
                },
                {
                    "factor": "Institutional Weakness and Declining Legitimacy",
                    "effect": "Increases the probability. Many regimes (e.g., Guinea-Bissau, Mali, Burkina Faso, Niger) face declining legitimacy, democratic backsliding, and civilian disaffection, which are classic coup risk factors."
                },
                {
                    "factor": "Time Window (Only 1.5 months left)",
                    "effect": "Decreases the probability. The short time frame makes the likelihood of a successful coup (as defined by consolidation of control and cessation of major resistance) relatively low, even in high-risk environments."
                }
            ],
            "no_scenario": "Despite ongoing instability, elite purges, and attempted coups, no group is able to successfully overthrow and consolidate control of a government in Africa or Latin America before January 1, 2026. Military regimes in Mali, Burkina Faso, and Niger maintain power through repression, loyalty networks, and foreign support, while civilian governments in other at-risk states (e.g., Guinea-Bissau, Benin, Nigeria) manage to suppress coup plots or avoid overt military intervention. Latin America, with its strong anti-coup norms and civilian supremacy, sees no successful coups.",
            "yes_scenario": "A faction within the military or state elite in a high-risk African state—most likely in the Sahel, where junta legitimacy is deteriorating—executes a successful coup. This could involve a counter-coup in Mali, Burkina Faso, or Niger, where intra-military disputes and external pressures are mounting, or a first-time coup in a fragile country like Guinea-Bissau, where the 2025 presidential election lacks legitimacy and elite exclusion is acute. Alternatively, a self-coup by an incumbent refusing to step down after a contested election (e.g., Central African Republic or Guinea-Bissau) could meet the criteria. Latin America remains less likely, but a rapid breakdown in a country like Bolivia or Peru could, in theory, lead to a short-notice coup.",
            "final_reasoning": "Coups in Africa, especially in the Sahel, have been frequent in recent years, but most at-risk states are already under military rule, reducing the pool of likely new cases. However, recent news highlights ongoing elite instability, attempted coups, and declining legitimacy in several regimes (notably Mali, Burkina Faso, Guinea-Bissau, Nigeria). The short time window (1.5 months) reduces the likelihood of a successful coup consolidating control, but the high base rate, combined with ongoing elite fissures, justifies a non-trivial probability. Latin America remains structurally less vulnerable due to stronger institutions and historical trends, but is not zero. Given these factors, the probability of at least one successful coup (as per Metaculus/Thyne-Powell definition) before January 1, 2026, is best estimated at 17%. This reflects elevated risk (compared to the global average), the persistent instability in key African states, and the recent history of surprise coups, but discounts for the short window and coup-proofing by current juntas.",
            "final_probability": 17
        },
        "Sociology (SocialMovementTheory)": {
            "time_to_resolution": "Approximately 6 weeks (question closes January 1, 2026; today is November 18, 2025)",
            "perspective_relevance": "As an expert in Social Movement Theory (SMT), I focus on how collective grievances, elite competition, resource mobilization, legitimacy crises, and external support shape state instability and the likelihood of coups. SMT provides insight into how military and elite coalitions form, sustain, or fracture, how public mobilization (or demobilization) occurs, and how international actors influence regime survival or destabilization. This perspective is especially relevant in regions with repeated coups, fractured civil-military relations, and weak democratic institutions.",
            "status_quo": "The status quo is frequent but not constant successful coups in Africa (especially the Sahel and West Africa), and very rare successful coups in Latin America in the past two decades. Several African states are currently under military rule after recent coups, with weak civilian governments and ongoing elite competition.",
            "perspective_derived_factors": [
                {
                    "factor": "Elite Fracturing within Military Regimes",
                    "effect": "Increases probability. Coups often follow splits within military or ruling elites. Recent reporting indicates ongoing tensions and coup attempts within juntas in Mali, Burkina Faso, Niger, and Nigeria."
                },
                {
                    "factor": "Resource Scarcity and Public Grievances",
                    "effect": "Increases probability. Economic hardship (fuel shortages in Mali, power outages, rising prices) and severe repression can erode regime legitimacy, providing motives and opportunities for coups."
                },
                {
                    "factor": "Presence of Foreign Military Actors (Russia, Wagner/Africa Corps)",
                    "effect": "Mixed effect. External support can temporarily stabilize regimes (e.g., Mali, CAR), but can also increase internal resentment or precipitate elite backlash if perceived as foreign domination or if benefits are unevenly distributed among elites."
                },
                {
                    "factor": "Declining Legitimacy of Democratic Institutions",
                    "effect": "Increases probability. Manipulated elections (Guinea-Bissau, Benin), exclusion of opposition, and repression signal closed political opportunity structures, increasing the likelihood that rivals resort to extra-legal means (i.e., coups)."
                },
                {
                    "factor": "Jihadist Insurgency/State Collapse",
                    "effect": "Decreases probability for a traditional coup but increases risk of state collapse or proto-state emergence (Mali, Burkina Faso), which may inhibit or complicate the classic coup scenario."
                },
                {
                    "factor": "Regional Norms and External Pressures (ECOWAS, AU, ICC)",
                    "effect": "Decreases probability. Regional and international condemnation or threat of sanctions/intervention can deter coups, though the efficacy has been limited in the Sahel recently."
                },
                {
                    "factor": "Coups as Recurring Social Process (Base Rate)",
                    "effect": "Strongly increases probability. Empirically, there have been 5 successful coups in Africa since 2020, and attempted coups in 2024 and 2025. The historical annual base rate for at least one successful coup in Africa remains high compared to other regions."
                },
                {
                    "factor": "Latin America Coup Base Rate",
                    "effect": "Decreases probability. The historical frequency of successful coups in Latin America post-1990 is very low, with only failed or self-coup attempts (Peru, Bolivia, Brazil) in recent years."
                }
            ],
            "no_scenario": "Despite mounting grievances and ongoing elite competition, military regimes in Mali, Burkina Faso, Niger, and other Sahel states maintain sufficient internal cohesion and/or external support to suppress dissent and preempt coup attempts. Latin American militaries remain under civilian control, with opposition resorting to protest or legal contestation rather than armed overthrow. No group manages to establish control over both the government and military in a manner that meets the resolution criteria. State collapse in Mali or elsewhere manifests as insurgency or civil conflict, not a clear coup d'etat.",
            "yes_scenario": "A faction within the military or state apparatus in Mali, Burkina Faso, Niger, Guinea-Bissau, or another unstable African state successfully overthrows the current junta or government and establishes uncontested authority by the end of 2025. Alternatively, a self-coup occurs (e.g., an incumbent illegally suspends elections or extends power), but this is less likely in the short time frame. Latin America remains unlikely but not impossible—a successful coup in a highly unstable state (e.g., Bolivia, Venezuela) could occur if elite divisions turn violent.",
            "final_reasoning": "Given the base rate of successful coups in Africa (approximately 1–2 per year since 2020), the short 6-week time frame reduces the absolute probability, but the current context is highly volatile. Multiple reports indicate ongoing elite tension, coup attempts (notably in Nigeria and within the Sahel juntas), declining regime legitimacy, and social hardship. SMT suggests that elite fracturing and resource crises are classic preconditions for coups, and the military's role as the only credible challenger in many states remains intact. However, international presence (Russia) and some regime consolidation may dampen immediate prospects. Latin America is very unlikely due to strong norm adherence and lack of recent successful coups, despite some unrest. Overall, considering the historical base rate, acute instability in several African states, and evidence of recent coup plotting, I assess a probability moderately above the 10-year annual base rate, but below certainty due to the short window and recent preemptions. I estimate the likelihood of a successful coup in Africa or Latin America before January 1, 2026 to be 23%.",
            "final_probability": 23
        },
        "Sociology (EliteTheory)": {
            "time_to_resolution": "Approximately 44 days until January 1, 2026.",
            "perspective_relevance": "As a sociologist specializing in Elite Theory, my perspective emphasizes the actions, stability, and contestation among elite groups—such as military, political, and economic elites—as the primary drivers of coups. This lens helps evaluate not only structural weaknesses but also maneuvering among factions, legitimacy crises, and the breakdown of elite consensus that typically precede successful coups. Current events in Africa and Latin America are especially amenable to this analysis, given the visible tensions between entrenched elites (including military juntas), opposition groups, and international actors.",
            "status_quo": "In the status quo, coups remain relatively common in Africa (especially the Sahel) but rare in Latin America, with several recent coup attempts but no successful new takeovers since late 2023. The base rate for a successful coup in either continent within a 4-month window is low, but not negligible, especially in the Sahel region.",
            "perspective_derived_factors": [
                {
                    "factor": "Elite Fragmentation and Junta Instability in the Sahel",
                    "effect": "Increases probability. Multiple reports highlight internal dissent, failing legitimacy, and mutinies within military regimes in Mali, Burkina Faso, and Niger. Elite fragmentation (especially among military factions) is a historical precursor to coups, raising the odds of an intra-military putsch or elite-driven challenge."
                },
                {
                    "factor": "Entrenchment of Military Rule and Suppression of Opposition",
                    "effect": "Decreases probability. In many Sahel states, ruling juntas have purged rivals, repressed civilian opposition, and aligned closely with foreign backers (notably Russia). Such consolidation can temporarily reduce the risk of coup by neutralizing organized rivals and intimidating would-be plotters."
                },
                {
                    "factor": "External Military Presence (Russia/Africa Corps) and Counterinsurgency Failures",
                    "effect": "Slightly increases probability. While foreign troops can bolster regimes, their presence and accusations of abuses can deepen elite resentment and erode legitimacy, sometimes catalyzing coup attempts by factions excluded from new patronage networks or critical of foreign influence."
                },
                {
                    "factor": "Severe Security and Economic Deterioration",
                    "effect": "Increases probability. The worsening security situation (e.g., jihadist advances in Mali, economic crises, declining public services) increases pressure on ruling elites and raises the likelihood that disaffected factions will attempt to seize power, especially if current leaders are blamed for failures."
                },
                {
                    "factor": "International and Regional Isolation",
                    "effect": "Increases probability. The exit of Sahel juntas from ECOWAS and the ICC, and the breakdown of regional alliances, removes external checks and increases the risk of elite competition turning violent, as international deterrents are weakened."
                },
                {
                    "factor": "Declining Coup Base Rate in Latin America",
                    "effect": "Decreases probability. Despite some instability (e.g., Peru, Bolivia), recent attempts have failed or lacked military support. Elite consensus against coups remains robust in most Latin American states, excepting rare outliers."
                }
            ],
            "no_scenario": "Despite ongoing instability and elite discontent in African juntas, ruling elites maintain sufficient cohesion, loyalty, and repression to deter or quickly preempt coup plots. In Latin America, military and political elites remain committed to constitutional processes, and no faction is able to successfully challenge the status quo before January 1, 2026. The status quo of fragile but enduring elite dominance persists in both regions.",
            "yes_scenario": "A faction within a Sahelian military regime (e.g., Mali, Burkina Faso, Niger) grows dissatisfied with the current leadership due to worsening security, economic collapse, or disputes over foreign patronage, and successfully overthrows the ruling junta—either through a swift intra-elite putsch or by leveraging a security/legitimacy crisis. Alternatively, a self-coup occurs in an unstable Latin American country, but this is less likely given recent resilience of elite coalitions there.",
            "final_reasoning": "The risk of a successful coup in Africa, particularly the Sahel, remains elevated: the short time window (6 weeks), recent history of multiple coups, and current reports of elite fragmentation, mutinies, and deteriorating conditions all point to a real—though not overwhelming—danger. However, the ruling juntas have demonstrated some capacity for repression and elite management, and foreign military presence may deter some challengers even as it provokes others. In Latin America, the base rate of successful coups remains very low and recent attempts have not succeeded, reflecting stronger elite consensus and institutional norms. Overall, the probability of a successful coup before January 1, 2026, is appreciably higher than the global average—primarily due to the specific risks in the Sahel—but not high enough to warrant an extreme forecast. Given the short window and current stability in most states, but factoring in recent scares (e.g., Nigeria) and multiple risk signals, I assess the odds as moderately elevated.",
            "final_probability": 28
        },
        "AreaStudiesAfrica (AfricanStateFragility)": {
            "time_to_resolution": "Approximately 44 days (from November 18, 2025 to January 1, 2026)",
            "perspective_relevance": "As an expert in African state fragility, I bring in-depth understanding of the structural drivers of coups in Africa, including military factionalism, civil-military relations, external influences (notably Russian and Wagner/Africa Corps involvement), and the impact of jihadist insurgencies. I am also well-versed in regional coup contagion, historical base rates, and the specific vulnerabilities of states currently under military or semi-authoritarian rule. This expertise allows me to critically assess which states are at heightened risk and distinguish between destabilizing violence and successful coups that actually consolidate new regimes.",
            "status_quo": "Multiple states in Africa and Latin America remain under military or heavily personalized rule following coups since 2020, especially Mali, Burkina Faso, Niger, and Gabon. In Latin America, there have been recent coup attempts but no successful military takeovers since 2022. The status quo is that the pace of successful coups has slowed since late 2023, with recent attempts (e.g., Nigeria, Bolivia) being foiled or contained. Most recent coups have occurred in the African Sahel.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent base rate of coups (2020-2024)",
                    "effect": "Increases probability. Africa has seen a surge in coups (at least 8 since 2020), especially in the Sahel, with several states now under military rule or juntas. However, there is often a lull after a cluster of coups as regimes consolidate and opposition is repressed."
                },
                {
                    "factor": "Current regime type and fragility",
                    "effect": "Increases probability. States under junta rule (Mali, Burkina Faso, Niger, Guinea, Chad) are at risk for 'coup-proofing' failures and intra-military splits. Economic crises, insurgency, and diminishing legitimacy further destabilize these regimes, creating incentives for rival officers to seize power."
                },
                {
                    "factor": "Security situation and insurgencies",
                    "effect": "Ambiguous but overall increases probability. Mali and Burkina Faso face intensifying jihadist insurgencies and state collapse risks. While this can distract militaries, it also creates openings for rival commanders to blame failures on current leaders and attempt coups."
                },
                {
                    "factor": "External involvement (Russia, Wagner/Africa Corps)",
                    "effect": "Slightly decreases probability. The presence of Russian military backing, especially in Mali and Burkina Faso, provides regime protection and intelligence, making coups harder but not impossible. However, if Russian interests shift or a regime loses Moscow's support, this could rapidly reverse."
                },
                {
                    "factor": "Recent failed coup attempts and purges",
                    "effect": "Decreases probability in the short term. Recent foiled coup plots in Mali, Nigeria, and elsewhere typically trigger purges and heightened security, temporarily reducing coup risk as potential plotters are arrested or deterred."
                },
                {
                    "factor": "Latin American context",
                    "effect": "Decreases probability. The last successful military coup in Latin America was over a decade ago. Recent events (Peru 2022, Bolivia 2024, Brazil 2023) have fallen short of successful takeovers, reflecting a much lower regional base rate compared to Africa."
                }
            ],
            "no_scenario": "Despite ongoing instability, no military or elite faction in Africa or Latin America is able to seize and consolidate power before January 1, 2026. Recent purges in Mali and Nigeria deter would-be coup plotters. Russian/Wagner presence in the Sahel provides enough regime protection to prevent intra-military takeovers. In Latin America, political crises do not escalate to successful coups, as institutions and international pressure hold. Jihadist advances in the Sahel, while destabilizing, do not translate into military overthrows but rather state collapse or ongoing insurgency.",
            "yes_scenario": "A faction within a Sahelian junta (most likely Mali or Burkina Faso) successfully overthrows the current leadership, citing military failures or corruption, and quickly consolidates control over both the government and military. Alternatively, an emboldened officer corps in Guinea-Bissau, Guinea, or Chad seizes power amid political or electoral crises. Less likely, but possible, is a sudden breakdown in civilian-military relations in a fragile Latin American state (e.g., Guatemala, Peru) leading to a successful self-coup or military takeover.",
            "final_reasoning": "The base rate for successful coups in Africa in the last 5 years is high, with most occurring in the Sahel. However, there has been a marked decrease in successful coups since late 2023, with recent attempts being foiled (Mali 2024, Nigeria 2025). The presence of Russian forces and Wagner/Africa Corps in key Sahelian states offers some protection to existing juntas, and recent purges reduce immediate risk. Yet, the underlying drivers of coups—military factionalism, economic crisis, loss of legitimacy, insurgencies—remain acute in Mali, Burkina Faso, and Niger. Latin America's base rate is much lower, with only failed or partial coups in recent years. While the time window is short (44 days), the risk is not negligible, especially given the region's history of rapid, unexpected coups. Given these factors, the most likely scenario is no successful coup before January 1, 2026, but the probability is non-trivial given persistent fragility in the Sahel and recent coup scares. I therefore assign a probability moderately above the base rate for a typical 44-day window, reflecting both recent history and current deterrents.",
            "final_probability": 18
        },
        "AreaStudiesAfrica (NeoPatrimonialism)": {
            "time_to_resolution": "Approximately 1.5 months (question resolves January 1, 2026; today is November 18, 2025)",
            "perspective_relevance": "As an AreaStudiesAfrica (NeoPatrimonialism) expert, I focus on the persistence of personalized, informal networks of power, the fragility of formal institutions, and the strategic behavior of militaries and elites in neopatrimonial states. These insights are crucial for evaluating coup risk, especially where regime durability relies on elite bargains, external patronage, and the military's calculus in the context of elite fragmentation and popular discontent.",
            "status_quo": "There is considerable coup activity in Africa, particularly in the Sahel, but no successful coup has been reported since the last Metaculus update. Latin America has seen attempted but not successful coups. The status quo is that, while risks are elevated, the majority of regimes persist through a mix of repression, elite cooptation, and external backing.",
            "perspective_derived_factors": [
                {
                    "factor": "Base Rate of Coups (2020-2025)",
                    "effect": "Increases probability: Africa, especially the Sahel, has seen a spike in successful coups (Mali, Guinea, Burkina Faso, Niger, Gabon), and failed/attempted coups (Nigeria, Sierra Leone, Guinea-Bissau, Chad). The recent rate is much higher than the 2010s. Latin America has lower, but non-trivial, base rates (Peru, Bolivia, Brazil attempted coups/self-coups)."
                },
                {
                    "factor": "Regime Vulnerability and Elite Fragmentation",
                    "effect": "Increases probability: Several regimes (Mali, Burkina Faso, Niger, Guinea-Bissau, Central African Republic) are military-led or face elite infighting and eroding legitimacy (see recent attempted coups, purges, and opposition crackdowns). Elite splits, especially within militaries, create coup windows."
                },
                {
                    "factor": "External Military Involvement and Patronage",
                    "effect": "Increases probability: Russia's Africa Corps/Wagner, Turkish arms flows, and weakening of Western (especially French/ECOWAS) influence create both stability for installed juntas and new sources of contestation. Competition for rents and foreign patronage can incentivize palace coups."
                },
                {
                    "factor": "Jihadist and Insurgent Pressure",
                    "effect": "Ambiguous: Increases probability if military failures provoke elite blame games or scapegoating of leaders (as in previous coups). Decreases probability if regimes repress dissent and close ranks, or if external partners (Russia, Turkey) help sustain the current order."
                },
                {
                    "factor": "Neo-patrimonial Institutions and Coup-Proofing",
                    "effect": "Decreases probability: Many regimes have intensified coup-proofing—personalized elite rotation, purges (e.g., Nigeria's service chiefs), and the use of foreign mercenaries and intelligence to monitor the officer corps. This raises the bar for a successful coup."
                },
                {
                    "factor": "Impending/Disputed Elections and Manipulation",
                    "effect": "Increases probability: Guinea-Bissau, Central African Republic, DRC, and Benin are facing controversial elections or constitutional changes that could trigger instability. Exclusion of opposition (Benin, Guinea-Bissau) may provoke elite or military intervention."
                },
                {
                    "factor": "Short Timeframe (1.5 months)",
                    "effect": "Decreases probability: Even in high-risk environments, successful coups are rare events in a 6-week window. Most attempts fail or are preempted, and even signs of elite tension may not translate to overt, successful action in this period."
                }
            ],
            "no_scenario": "Despite elite tensions, economic crises, and insurgent pressure, coup-proofing and external support (notably Russia in the Sahel and Turkey in Mali) keep juntas in power. Military purges and intelligence preempt any coup plotting (as recently in Nigeria, Mali). Even where elections are rigged or manipulated (Guinea-Bissau, Benin), opposition is suppressed, and no military or elite faction is able or willing to mount a successful takeover. Latin America remains relatively stable, with elite deals preventing breakdown.",
            "yes_scenario": "A faction within a military regime (Mali, Burkina Faso, Niger, Guinea-Bissau, or even an unexpected Latin American case) seizes on elite splits, economic crisis, or a failed counter-insurgency to launch a coup. External players (either Russia or domestic actors) are unable to forestall the action, or foreign patronage shifts sides. Alternatively, a manipulated or failed election (Guinea-Bissau, Central African Republic) sparks a military or self-coup, with the perpetrators consolidating control and quelling resistance quickly.",
            "final_reasoning": "The base rate of successful coups in Africa has been unusually high since 2020, especially in the Sahel. However, most coups cluster in the context of regime transitions, recent elite splits, or failed elections—several such scenarios are possible in the next 6 weeks (notably Guinea-Bissau, Mali, Burkina Faso, Central African Republic). Multiple news items show ongoing elite purges, failed coup attempts (Nigeria, Mali), and heavy coup-proofing (purges, external mercenaries, reshuffles). Still, the short timeframe (1.5 months) sharply limits the probability, as most coup plots are detected early or fail to consolidate power. While the environment is highly unstable and a coup is more likely than in a typical year or region, the time constraint and increased external support to current regimes act as stabilizers. Latin America remains less volatile, with only sporadic coup attempts and strong international scrutiny. Weighing the high base rate, current elite instability, and the time limitation, I estimate the probability of a successful coup in Africa or Latin America before January 1, 2026 at 18%. This is considerably elevated over the long-term baseline, but remains moderate due to the short window and increased coup-proofing.",
            "final_probability": 18
        },
        "AreaStudiesLatinAmerica (LatinAmericanMilitaryIntervention)": {
            "time_to_resolution": "Approximately 1.5 months (from Nov 18, 2025 to Jan 1, 2026)",
            "perspective_relevance": "As an expert in Latin American military intervention and area studies, I bring historical knowledge of coup dynamics in both Africa and Latin America, with particular attention to base rates, risk factors, and triggers for successful coups. I am attuned to the region-specific drivers (such as military grievances, international influence, and weak institutions), and can assess the likelihood of sudden regime changes in both continents, utilizing recent data and long-term trends.",
            "status_quo": "The status quo is the continuation of existing regimes, with no successful coup in Africa or Latin America during the forecast window. Africa has experienced multiple coups in recent years, particularly in West Africa, while Latin America has seen attempted but failed coups (e.g., Bolivia 2024, Peru 2022, Brazil 2023).",
            "perspective_derived_factors": [
                {
                    "factor": "Base rate of successful coups (2020-2025) in Africa",
                    "effect": "Increases probability. Africa, especially the Sahel, has had a surge in successful coups—at least 6 since 2020—with the average being more than one per year. This base rate is much higher than the global average."
                },
                {
                    "factor": "Base rate of successful coups in Latin America",
                    "effect": "Slightly increases probability, but to a much lesser extent. Coups are rare in Latin America post-2000, with recent attempts mostly failing, but institutional stressors persist in some countries."
                },
                {
                    "factor": "Short time frame remaining (1.5 months)",
                    "effect": "Decreases probability. The shorter the period, the less likely a rare event will occur, even with elevated base rates."
                },
                {
                    "factor": "Current levels of instability and military dissatisfaction in Sahel states",
                    "effect": "Increases probability. Mali, Burkina Faso, Niger, and Guinea-Bissau all show signs of severe institutional stress, elite competition, and military dissatisfaction."
                },
                {
                    "factor": "Recent failed coup attempts and purges (e.g., Nigeria, Mali, Guinea-Bissau)",
                    "effect": "Ambiguous. Failed attempts could either deter further coups (due to crackdown) or signal ongoing instability (raising risk)."
                },
                {
                    "factor": "Presence of foreign military actors (Russia, Wagner, Turkey) in Africa",
                    "effect": "Increases probability. Foreign presence can both prop up regimes and generate resentment/factionalism within militaries, increasing coup risk."
                },
                {
                    "factor": "Erosion of democratic norms and exclusion of oppositions (Benin, Guinea-Bissau, Central African Republic)",
                    "effect": "Increases probability, especially in Africa. Political exclusion and extended terms are classic precursors to coups."
                },
                {
                    "factor": "Current intelligence on Latin America (Bolivia, Peru, Brazil)",
                    "effect": "Decreases probability. While there are tensions and polarization, no imminent coup threats are reported, and militaries appear disciplined."
                },
                {
                    "factor": "Recent international defense exercises and diplomatic activity (Mali, AES)",
                    "effect": "Decreases probability in the very immediate term. High-profile events and international attention may temporarily deter military moves."
                }
            ],
            "no_scenario": "Despite ongoing instability, military regimes in the Sahel (Mali, Burkina Faso, Niger) maintain internal discipline and suppress dissent within the ranks. Attempts at coups are preempted by purges or intelligence operations (as seen in Nigeria and Mali). In Guinea-Bissau and Benin, controversial elections and constitutional changes provoke protests but not military intervention. Latin American militaries remain in barracks, with populist or authoritarian leaders managing crises without resorting to outright illegal power grabs. No credible reports of a successful coup emerge before January 1, 2026.",
            "yes_scenario": "A faction within the military or security apparatus in one of the Sahel states (Mali, Burkina Faso, Niger, Guinea-Bissau) launches a coup, capitalizing on public frustration, elite divisions, and external influences. The coup quickly overcomes any resistance, establishes control over the executive and military, and the international community recognizes the change de facto. Alternatively, a self-coup occurs (e.g., a sitting president dissolves parliament and rules by decree, as in Guinea-Bissau or Benin), and no significant resistance emerges. In Latin America, a sudden institutional breakdown (though unlikely) enables a rapid seizure of power (most plausibly in Peru or Bolivia, but no current indicators suggest this).",
            "final_reasoning": "The base rate for successful coups in Africa over the last five years is high, especially in the Sahel, where military governments have become the new normal and intra-military tensions are occasionally surfacing as coup scares or failed attempts. The factors most strongly increasing risk are the unresolved grievances within militaries, weak civilian oversight, and ongoing elite competition in several African states. However, the short window (1.5 months) is a critical dampener: even with high annualized risk, the monthly probability is much lower. Latin America, despite some institutional stress, is not currently at elevated risk for successful coups. Considering all factors, a coup in Africa (especially Mali, Burkina Faso, Niger, Guinea-Bissau, or CAR) is plausible but not probable in so short a time, and even in those cases, regime discipline appears to be holding for now. Base rates, current signals, and the temporal window together suggest a moderately elevated but not extreme risk.",
            "final_probability": 16
        },
        "AreaStudiesLatinAmerica (DemocraticBreakdownTheory)": {
            "time_to_resolution": "Approximately 6 weeks (question resolves January 1, 2026; today is November 18, 2025).",
            "perspective_relevance": "As an expert in Area Studies Latin America (Democratic Breakdown Theory), I bring a comparative understanding of coup dynamics, institutional weaknesses, and civil-military relations in both Africa and Latin America. This includes knowledge of base rates, structural drivers, and the mechanisms by which coups succeed or fail. I also account for recent trends in democratic backsliding, elite maneuvering, and international influences, especially as they relate to the vulnerability of regimes in both regions.",
            "status_quo": "The status quo is that there are ongoing or recently established military regimes in several African countries (notably Mali, Burkina Faso, Niger), and persistent but failed coup attempts or self-coups in Latin America (Peru 2022, Brazil 2023, Bolivia 2024). However, since August 2024, there have not been any successful coups in either region documented in major news media.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent coup base rate in Africa",
                    "effect": "Increases probability; Africa, especially the Sahel, has seen a marked uptick in coups (Mali, Burkina Faso, Niger, Gabon, Guinea, Sudan, Chad) since 2020, with multiple instances per year, and ongoing instability."
                },
                {
                    "factor": "Recent coup base rate in Latin America",
                    "effect": "Slightly increases probability, but much less than Africa; while there were high-profile attempts (Peru 2022, Brazil 2023, Bolivia 2024), none succeeded. The region's base rate of successful coups remains historically low since the 1990s."
                },
                {
                    "factor": "Elite/military dissatisfaction and factionalization",
                    "effect": "Increases probability in Africa, especially in Mali, Burkina Faso, and Niger, where intra-military dissent, loss of public support, and frustration with deteriorating security and economic conditions are reported. Decreases probability in Latin America, where militaries are generally under civilian control, and institutional checks are stronger."
                },
                {
                    "factor": "International actors and external support",
                    "effect": "Mixed effect. Russian presence (Africa Corps, Wagner) in the Sahel strengthens existing juntas, making successful coups from other factions marginally less likely in the short term, but the presence of foreign mercenaries can also create resentment and elite splits. In Latin America, external actors are largely absent or act as stabilizers."
                },
                {
                    "factor": "Jihadist insurgency and state fragility",
                    "effect": "Increases probability in Africa. The growing reach of jihadist groups (e.g., JNIM in Mali, Burkina Faso, Niger) and the loss of state control can provoke preemptive or reactive coups as military elites blame incumbents for failures or seek to protect their own interests."
                },
                {
                    "factor": "Upcoming elections and authoritarian maneuvers",
                    "effect": "Increases probability somewhat. Several African countries (Guinea-Bissau, Central African Republic, Gabon) face contentious elections or constitutional changes, which can trigger coups. In Latin America, self-coup risks exist but would require major institutional breakdowns."
                },
                {
                    "factor": "Short time frame to resolution (6 weeks)",
                    "effect": "Decreases probability. Coups are rare and require coordination; the short window makes it statistically less likely that a successful coup will occur, even in high-risk settings."
                }
            ],
            "no_scenario": "Despite ongoing instability and dissatisfaction, military and elite factions in Africa and Latin America avoid overt attempts to unseat the executive, or any coup attempt is quickly suppressed or fails to consolidate control. Existing juntas in Africa maintain power through repression, elite co-optation, and foreign backing (notably Russia), and Latin American governments weather political crises without breakdown. The status quo of contested but stable (or at least stable-junta) regimes holds through the end of 2025.",
            "yes_scenario": "A faction within the military or security apparatus in an African country (most likely Mali, Burkina Faso, or Niger) successfully overthrows the sitting executive, either due to internal military splits, deteriorating security (e.g., loss of Bamako in Mali), or elite dissatisfaction with junta leadership. Alternatively, a sitting leader in Latin America (less likely, e.g., Nicaragua or Venezuela) enacts a self-coup, suspending constitutional order and forcibly consolidating power after an election, but this is less probable given current trends and institutional resilience.",
            "final_reasoning": "The probability of a successful coup in Africa or Latin America before January 1, 2026, is meaningfully above zero given the recent base rate in Africa, persistent instability, elite factionalization, and ongoing jihadist threats. Mali, Burkina Faso, and Niger remain at the highest risk, with evidence of internal dissent and failed coup attempts in the past year. However, several factors reduce the likelihood: (1) The short time window (six weeks) means that, even at high annual base rates, the per-month risk is modest; (2) Existing regimes in the Sahel have consolidated power with external (Russian) support, making internal coups riskier and more difficult; (3) No imminent Latin American case is at the threshold of a successful coup, with recent attempts failing and militaries remaining under civilian control. While the situation in Mali is precarious (jihadist encroachment, economic collapse, reported coup plots), and Burkina Faso and Niger face similar pressures, successful coups require both elite coordination and an opportunity, which is unpredictable over a short horizon. Given these considerations, and grounding in base rates (roughly 2–4 successful coups per year in Africa over the last five years, but none in Latin America), the probability for a coup in the next six weeks is moderate but not high. I estimate the risk at 20%. This is notably above pure status quo (which, for a random six-week segment, would be below 10%), but not extreme, reflecting both elevated Sahel risk and the short time to resolution.",
            "final_probability": 20
        }
    },
    "deliberation_probability": [
        32,
        23,
        21,
        33,
        26,
        18,
        17,
        23,
        28,
        18,
        18,
        16,
        20
    ],
    "deliberation_mean_probability": 22.53846153846154,
    "deliberation_sd": 5.665912468664169,
    "deliberation_probability_result": 23
}