{
    "deliberation_results": {
        "Nonprofit Operations (BoardSource Governance Model)": {
            "time_to_resolution": "About 3 months (from September 27, 2025 to January 1, 2026)",
            "perspective_relevance": "As an expert in Nonprofit Operations (BoardSource Governance Model), my perspective is particularly relevant because the question concerns the staffing trajectory of a nonprofit (Nonlinear Fund) operating in the AI safety space. The BoardSource model emphasizes strategic board oversight, resource stewardship, and executive leadership—factors critical in determining whether an organization expands or contracts staff. My knowledge allows me to assess the likely board and management decisions, fundraising climates, and operational risks that would influence the FTE count.",
            "status_quo": "As of the last available public information, the Nonlinear Fund is a small, recently launched nonprofit with a modest staff footprint. Most similar organizations do not rapidly reach 9+ FTEs within a few years of founding unless they secure sustained, significant funding and demonstrate programmatic traction.",
            "perspective_derived_factors": [
                {
                    "factor": "Nonprofit Sector Growth Base Rate",
                    "effect": "Decreases probability. Most early-stage nonprofits remain lean for years; only a minority rapidly surpass 8 FTEs, especially without a major, sustained funding catalyst."
                },
                {
                    "factor": "Recent Trends in AI/Tech Organizational Staffing",
                    "effect": "Slightly increases probability. There is a trend of aggressive hiring and high-intensity work cultures (e.g., 996), particularly in AI-related ventures, but this is less typical for nonprofits dependent on grant funding."
                },
                {
                    "factor": "BoardSource Governance Model—Prudent Resource Management",
                    "effect": "Decreases probability. Nonprofit boards following best practices hesitate to expand fixed costs (such as payroll) unless there is reliable, multi-year revenue. Expansion to >8 FTEs would likely require board sign-off and risk assessment."
                },
                {
                    "factor": "AI Safety Funding Environment",
                    "effect": "Neutral to slightly decreases probability. While there is ongoing interest in AI safety, the funding climate is volatile and competitive. Many EA-aligned and AI safety orgs have faced funding slowdowns in 2024-2025 as donor priorities shift and some scandals have rocked the field."
                },
                {
                    "factor": "Transparency and Reporting Norms",
                    "effect": "Neutral. The resolution depends on public reporting; if the Fund is not transparent or is dormant, the status quo is No."
                }
            ],
            "no_scenario": "The Fund maintains a small core staff (≤8 FTEs), relying on volunteers, consultants, or part-time contributors. Funding remains modest or uncertain, or the board elects to keep operations lean to preserve runway. Alternatively, the Fund is inactive or has been abandoned, with no public evidence of a staff increase.",
            "yes_scenario": "The Fund secures a major multi-year grant or donation, or a prominent philanthropist (e.g., Open Philanthropy, FTX Foundation, other major EA funders) backs a significant ramp-up. The board approves an aggressive hiring plan, and the organization expands to at least 9 FTEs, possibly to incubate multiple projects simultaneously or scale operations in response to external demand.",
            "final_reasoning": "Base rates for small nonprofits, especially in the effective altruism/AI safety space, strongly favor organizations remaining at ≤8 FTEs within a few years of launch. The BoardSource model would caution against rapid expansion without clear, stable funding and strategic justification. Recent macro trends (996 culture, tech hiring booms) are more applicable to for-profit startups than grant-dependent nonprofits. While a sudden windfall or alignment with a major funder could trigger a burst of hiring, there is no public evidence of such a development for Nonlinear Fund. Most news items deal with broader labor trends, not specific funding or expansion news for this organization. The status quo, therefore, is a No outcome, and I see no compelling evidence to move far from that base rate. My probability is slightly above zero to reflect the possibility of unforeseen windfalls, but strong board governance and sector norms make such a jump unlikely.",
            "final_probability": 13
        },
        "Human Resources Management (Workforce Planning)": {
            "time_to_resolution": "Approximately 3 months until January 1, 2026",
            "perspective_relevance": "As an expert in Human Resources Management (Workforce Planning), I bring a nuanced understanding of the factors that influence organizational staffing levels, including funding stability, organizational trajectory, trends in the AI safety and nonprofit sector, labor market tightness, and the operational requirements of research incubators. I am also attuned to how external labor market developments, remote/hybrid work trends, and shifts in work culture (e.g., adoption of '996' or reduced-hour workweeks) impact recruitment, retention, and FTE headcounts, especially in small, mission-driven organizations such as the Nonlinear Fund.",
            "status_quo": "The Nonlinear Fund is a small, recently-launched AI safety research incubator. As of the most recent public disclosures, there is no indication that the Fund has grown to nine or more FTEs. Historically, small AI safety nonprofits and research organizations tend to remain lean due to funding constraints, limited operational scope, or strategic focus.",
            "perspective_derived_factors": [
                {
                    "factor": "Base rate for staff growth in small AI safety nonprofits",
                    "effect": "Decreases probability. Historically, most small EA/AI safety orgs grow slowly or plateau at low FTE counts unless unusually successful at fundraising or project expansion."
                },
                {
                    "factor": "Funding environment for AI safety in late 2025",
                    "effect": "Neutral to slightly negative. While some large funders (Open Philanthropy, Survival and Flourishing Fund) remain active, the space is competitive, and recent controversies and shifting priorities may limit aggressive expansion for newer orgs."
                },
                {
                    "factor": "Operational model of the Nonlinear Fund",
                    "effect": "Decreases probability. As an incubator, it is likely to rely on grants, fellowships, or part-time contractors rather than scaling up internal full-time staff rapidly. This is common in the EA/AI safety ecosystem."
                },
                {
                    "factor": "Labor market trends and work culture shifts",
                    "effect": "Slightly increases probability. The rise of 996-style work in AI startups and a move away from reduced-hour workweeks in some sectors might marginally encourage more FTEs (as part-timers may consolidate into full-time roles), but this effect is likely muted in a nonprofit/academic context."
                },
                {
                    "factor": "Transparency and reporting",
                    "effect": "Decreases probability. If the organization is not very public about staff numbers, it may be difficult to verify FTEs for resolution, which generally biases outcomes toward the status quo or undercounting."
                },
                {
                    "factor": "Recent news or signals of expansion/contraction",
                    "effect": "Neutral. No major recent news suggests rapid expansion or contraction, and no evidence the project has been abandoned."
                }
            ],
            "no_scenario": "The Nonlinear Fund continues operating at its current scale or grows only modestly, employing fewer than nine full-time equivalent staff by January 1, 2026. It may rely primarily on a small core team, contractors, and fellows/part-timers, consistent with most EA-aligned research incubators. Alternatively, the Fund could experience funding constraints, project delays, or strategic pivots that prevent significant staff growth.",
            "yes_scenario": "The Nonlinear Fund secures a large grant or strategic partnership that enables rapid scaling. It hires several new full-time researchers, operations staff, and program managers, bringing the FTE count to nine or more. This could occur if the Fund launches an ambitious new program, becomes a central node in the AI safety ecosystem, or absorbs another project/team.",
            "final_reasoning": "The overwhelming base rate for small, new AI safety nonprofits is for slow or modest staff growth. The Nonlinear Fund's model as an incubator and the competitive, cautious funding environment both make a surge to 9+ FTEs by January 2026 unlikely. While broader labor market trends might encourage more full-time roles, these effects are marginal in such organizations. No recent evidence suggests a major expansion or contraction, and the status quo is well below the threshold. Therefore, the most likely outcome is that the Nonlinear Fund will not have more than eight full-time equivalent employees on January 1, 2026.",
            "final_probability": 18
        },
        "Organizational Sociology (Resource Dependence Theory)": {
            "time_to_resolution": "Just over 3 months (from September 27, 2025 to January 1, 2026)",
            "perspective_relevance": "As an expert in Organizational Sociology, especially Resource Dependence Theory (RDT), I focus on how organizations adapt their structure and resource strategies in response to external dependencies and environmental pressures. RDT suggests that an organization’s ability to grow and maintain staffing levels is heavily influenced by its control over critical resources (funding, legitimacy, talent) and its capacity to manage dependencies with stakeholders (funders, partners, regulators). This perspective is crucial for assessing the Nonlinear Fund’s likelihood of increasing (or even maintaining) FTE count given the current resource environment, sectoral trends, and competitive pressures in the AI safety field.",
            "status_quo": "The Nonlinear Fund is a small, relatively new organization in the AI safety field. As of its last public updates, it has generally kept a lean structure, with a limited number of full-time staff or FTEs. The default expectation (base rate for small, early-stage non-profit/EA-aligned incubators) is that they remain small unless there is clear evidence of strong fundraising, increased project capacity, or a major strategic shift.",
            "perspective_derived_factors": [
                {
                    "factor": "Resource Acquisition & Funding Stability",
                    "effect": "Decreases probability. Unless the Nonlinear Fund has secured significant new funding or multi-year commitments, expanding to >8 FTEs is risky. Most comparable organizations grow staff only after locking in multi-year resources, especially in the EA/AI safety space post-FTX. No recent public evidence suggests a windfall or sudden surge."
                },
                {
                    "factor": "Sectoral/Field Pressures (EA/AI Safety Incubator Trends)",
                    "effect": "Decreases probability. The broader EA and AI safety sectors are experiencing heightened scrutiny, a contraction in funding post-FTX, and increased demand for accountability. Most new incubators are conservative in hiring, focusing on project-based contracts, fellowships, or part-time arrangements rather than ramping up costly FTE headcount."
                },
                {
                    "factor": "Organizational Strategy and Legitimacy",
                    "effect": "Neutral to slightly decreases. RDT predicts that unless an org is under pressure to demonstrate scale for legitimacy (e.g., to win major new grants), it will avoid unnecessary fixed costs. There’s no evidence Nonlinear Fund needs to signal scale right now, and risk of overextending is high."
                },
                {
                    "factor": "Labor Market Trends",
                    "effect": "Slightly decreases probability. The news suggests a bifurcation: some tech/AI orgs are adopting extreme work expectations, but this is less typical for non-profit/EA incubators, which may have difficulty attracting and retaining staff for >8 FTEs at nonprofit salaries, especially with remote/hybrid and talent competition from higher-paying tech firms."
                },
                {
                    "factor": "Organizational Survival/Abandonment",
                    "effect": "Small increase to probability of a No outcome. If the organization has been inactive, failed to secure funding, or has no public updates by Jan 1, 2026, it may be considered 'abandoned' or at least not at the scale to have >8 FTEs."
                }
            ],
            "no_scenario": "The Nonlinear Fund maintains a small core team (≤8 FTEs), supplementing its capacity with contractors, volunteers, or part-time contributors. Funding remains tight or at least not sufficient for expansion. The organization either continues at a slow pace, shifts focus, or has insufficient public updates to prove more than 8 FTEs. Alternatively, it is inactive or abandoned.",
            "yes_scenario": "The Nonlinear Fund secures a major new grant or a set of multi-year funding commitments, leading to a strategic expansion. It publicly announces a significant hiring round, perhaps to launch a new program, and lists at least 9 FTE staff by January 1, 2026, with clear documentation (org chart, staff bios, etc.).",
            "final_reasoning": "Base rates and RDT analysis both suggest that small, early-stage non-profit incubators in the AI safety/EA space rarely scale to >8 FTEs absent a clear, public influx of resources or a strategic need to signal scale. The broader funding environment is constrained, with most organizations focusing on project-based or flexible arrangements rather than fixed FTE hiring. There is no public evidence in the news or sectoral updates that the Nonlinear Fund has secured a windfall or is expanding aggressively. Risks of reputational or operational overreach further disincentivize rapid staff expansion. Therefore, the most likely outcome is that the Nonlinear Fund will have 8 or fewer FTEs (or be inactive) on January 1, 2026.",
            "final_probability": 17
        },
        "Organizational Sociology (Population Ecology Theory)": {
            "time_to_resolution": "Approximately 3 months and 5 days (until January 1, 2026)",
            "perspective_relevance": "As an organizational sociologist specializing in Population Ecology Theory, my perspective highlights the structural and environmental constraints that shape organizational growth, survival, and staffing. Population Ecology emphasizes the inertia of organizations, niche specialization, resource partitioning, and the impact of legitimacy crises and external shocks on small, innovative ventures like the Nonlinear Fund.",
            "status_quo": "The Nonlinear Fund has typically operated as a small, agile incubator in the AI safety space. Unless there has been a major change in funding, strategy, or legitimacy, most small, mission-driven organizations in this niche maintain lean staff counts, often relying on part-time, volunteer, or project-based contributors rather than exceeding 8 full-time equivalents.",
            "perspective_derived_factors": [
                {
                    "factor": "Organizational Age and Size Inertia",
                    "effect": "Decreases probability; young organizations rarely scale headcount rapidly due to inertia, resource constraints, and the risks of overextension."
                },
                {
                    "factor": "Niche Specialization and Resource Partitioning",
                    "effect": "Decreases probability; the AI safety incubator niche is crowded and funding/attention is shared among similar organizations, limiting room for rapid expansion."
                },
                {
                    "factor": "Legitimacy and Funding Environment",
                    "effect": "Neutral to slightly positive; if the Nonlinear Fund has recently secured major new grants or resolved PR/legitimacy issues, this could enable growth, but no such evidence is present in the news provided."
                },
                {
                    "factor": "Sectoral Trends (AI and Startup Labor Norms)",
                    "effect": "Slightly increases probability; the adoption of intense '996' work cultures and tech sector growth could encourage startups to scale up, but this is more relevant for for-profits than nonprofit incubators, and could also result in higher burnout/turnover."
                },
                {
                    "factor": "Recent Publicity or Crisis Events",
                    "effect": "Decrease probability; any recent controversies, resource constraints, or organizational crises typically result in retrenchment, not expansion, for small nonprofits."
                }
            ],
            "no_scenario": "The Nonlinear Fund continues operations with a core team and a few part-time or project-based contributors, totaling 8 or fewer FTEs. No major new funding or partnerships emerge, and the organization maintains a small, focused footprint to preserve agility and minimize risks. Alternatively, the organization has experienced setbacks (e.g., loss of legitimacy, funding, or key personnel) leading to reduced staff or even effective dormancy.",
            "yes_scenario": "The Nonlinear Fund receives a significant influx of resources—such as a major grant, a high-profile partnership, or a new strategic direction—necessitating rapid hiring in late 2025. To support multiple new incubated projects or research streams, the organization expands its full-time staff to 9 or more FTEs by January 1, 2026, with public confirmation.",
            "final_reasoning": "Historical base rates for small, specialized nonprofit incubators in the effective altruism and AI safety space suggest that exceeding 8 FTEs is rare absent major new funding or legitimacy events. None of the provided news articles point to such a transformative event for the Nonlinear Fund. Sectoral trends toward intense work cultures are more relevant for for-profit AI startups and may not translate to nonprofit incubators, especially those with recent controversies (not mentioned here but plausible given sectoral turbulence since 2022). Population Ecology Theory predicts high inertia and slow scaling for organizations in crowded, high-variance niches unless a clear external shock (major new funding, high-profile endorsement, or existential threat to competitors) breaks the status quo. Absent concrete evidence of such a shock, the status quo—8 or fewer FTEs—should be weighted most heavily. Taking into account small probability of undisclosed developments, the chance of a Yes outcome is low but not negligible.",
            "final_probability": 18
        },
        "Nonprofit Management (Nonprofit Lifecycle Model)": {
            "time_to_resolution": "Approximately 3 months until January 1, 2026",
            "perspective_relevance": "As an expert in Nonprofit Management and the Nonprofit Lifecycle Model, my perspective is highly relevant because nonprofit organizations like the Nonlinear Fund undergo predictable phases (idea, start-up, growth, maturity, decline/crisis, turnaround, or closure) that directly affect hiring, staffing levels, and sustainability. The ability of such a fund to scale up to >8 FTEs depends on its lifecycle stage, funding security, leadership capacity, strategic clarity, and sector-specific trends, all of which are core to nonprofit management analysis.",
            "status_quo": "As of the last available public information, the Nonlinear Fund has remained small and has not publicly announced rapid scaling or significant new funding. Unless there has been a recent dramatic change, the status quo is that the organization has 8 or fewer full-time employees.",
            "perspective_derived_factors": [
                {
                    "factor": "Nonprofit Lifecycle Stage",
                    "effect": "Decreases probability. The Nonlinear Fund was launched in 2022, suggesting it may only now be transitioning from start-up to early growth. Most nonprofits in this phase have limited staff and only scale above 8 FTEs if they secure substantial, sustained funding and demonstrate program success."
                },
                {
                    "factor": "Funding Environment and Grant Landscape",
                    "effect": "Decreases probability. The AI safety funding landscape has become more competitive, and no major new grant announcements or public funding windfalls for Nonlinear Fund have been reported in recent months. Nonprofits rarely scale staff without secured, multi-year commitments."
                },
                {
                    "factor": "Public Controversy and Reputation",
                    "effect": "Decreases probability. The Nonlinear Fund has been subject to significant scrutiny and controversy within the AI safety and Effective Altruism (EA) communities in 2023–2024. This likely dampens both funding inflows and the ability to attract/retain top talent, making rapid staff growth unlikely."
                },
                {
                    "factor": "Sector Trend Toward Lean, Project-Based Teams",
                    "effect": "Decreases probability. The broader trend in AI safety nonprofits and EA-aligned organizations is to keep core teams lean, relying on contractors or project-based hires rather than full-time equivalents, unless there is an absolute necessity to scale."
                },
                {
                    "factor": "Potential for Sudden Strategic Pivot or Merger",
                    "effect": "Slightly increases probability. Some organizations, especially in a rapidly changing field like AI safety, may pivot or merge with larger entities, resulting in a sudden increase in FTEs. However, there's no public evidence Nonlinear Fund is in this position."
                },
                {
                    "factor": "News Environment on Work Culture and Labor Trends",
                    "effect": "Neutral to slightly negative. While the broader AI sector is experiencing a push toward intensive work cultures and, in some cases, rapid hiring, nonprofits typically lag behind for both financial and mission-alignment reasons. AI safety organizations in particular have not mirrored the hyper-scaling culture of for-profits."
                }
            ],
            "no_scenario": "The Nonlinear Fund continues in its current trajectory—remaining small, possibly with a few core staff and several contractors or volunteers. It does not secure a large new grant or partnership. Public controversies and sector skepticism limit its ability to grow. On January 1, 2026, public information shows 8 or fewer FTEs, or the organization is in stasis/decline.",
            "yes_scenario": "The Nonlinear Fund manages to secure a major funding round or institutional partnership, perhaps positioning itself as a key research or grantmaking hub in AI safety. It uses this influx to hire additional staff and professionalize operations, swelling to 9 or more FTEs by the start of 2026, with clear public documentation of this growth.",
            "final_reasoning": "Base rates for recently launched nonprofits scaling to 9+ FTEs within three years are low, especially in fields with high reputational risk, uncertain funding, and a culture of lean operations. The Nonlinear Fund's public trajectory, recent controversies, and lack of major funding news all suggest it remains in the start-up or early-growth stage. Sector trends toward lean teams and reliance on contractors further lower the probability. While the fast-moving AI sector could, in theory, produce a surprise pivot or windfall, there is no evidence to suggest this is happening for Nonlinear Fund. Therefore, the probability of the Nonlinear Fund having more than eight full-time equivalent employees on January 1, 2026, is low.",
            "final_probability": 10
        },
        "Nonprofit Management (Strategic Philanthropy)": {
            "time_to_resolution": "Just over 3 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Nonprofit Management (Strategic Philanthropy), I bring an understanding of how nonprofit organizations—especially those in emerging or specialized fields like AI safety—grow, staff up, and sustain operations. I am also attuned to sector trends such as the impact of funding cycles, reputational risk, and governance crises on staff retention and expansion. My expertise lends insight into the unique organizational risks, funding volatility, and employment practices that shape staffing trajectories for organizations like the Nonlinear Fund.",
            "status_quo": "As of recent years, the Nonlinear Fund has remained a small, high-variance nonprofit in the Effective Altruism/AI safety space with a staff count well under nine FTEs. If nothing changes, the Fund likely continues at a similar scale, given the sector’s typical slow hiring and the lack of indications of a major scale-up.",
            "perspective_derived_factors": [
                {
                    "factor": "Funding Environment",
                    "effect": "Decreases probability. Philanthropic funding for AI safety is volatile and more competitive post-2023, with major donors (Open Phil, etc.) now more risk-averse, especially after reputational crises elsewhere in the EA space."
                },
                {
                    "factor": "Reputational and Governance Issues",
                    "effect": "Decreases probability. The Nonlinear Fund has been subject to significant public criticism and controversy around its founders and governance. Nonprofits facing such crises rarely expand staff in the short term and may even contract."
                },
                {
                    "factor": "Sector Hiring Trends",
                    "effect": "Decreases probability. The broader AI safety and EA nonprofit sector has seen hiring freezes, layoffs, and slower growth, partly in response to funding and reputational headwinds."
                },
                {
                    "factor": "Operational Model",
                    "effect": "Decreases probability. The Nonlinear Fund has historically favored a lean, project-based, and founder-centric model rather than a large, salaried staff. There is no public evidence of a strategic pivot toward scaling up headcount."
                },
                {
                    "factor": "Remote/Hybrid Work and FTE Calculations",
                    "effect": "Neutral to slightly decreases probability. Even with remote or part-time contractors, the question requires 9+ full-time equivalents (35+ hours/week, not volunteers), which is a high bar for a lean, project-based nonprofit."
                },
                {
                    "factor": "Potential for Sudden Scale-Up",
                    "effect": "Slightly increases probability. There is always a nonzero risk of a surprise large grant or pivot (e.g., a major donor wanting to rapidly scale AI safety incubation), but this is not supported by recent public statements or funding trends."
                }
            ],
            "no_scenario": "The Nonlinear Fund continues operating with its core team and perhaps a handful of contractors or part-time staff, but does not expand to nine or more FTEs. Funding remains constrained, and reputational baggage makes major expansion unattractive or unviable. Public information as of Jan 1, 2026, lists at most 8 FTEs or fewer.",
            "yes_scenario": "A sudden influx of funding (e.g., a major grant from a new donor or a shift in the philanthropic landscape) enables the Nonlinear Fund to rapidly hire for new research, operations, or incubation roles. The organization publicly lists 9 or more FTEs as of Jan 1, 2026, perhaps in response to new grant requirements or a pivot to a more institutional model.",
            "final_reasoning": "Base rates for small, niche nonprofits—especially those recently embroiled in controversy—show that expansion to nine or more FTEs within a year is highly unlikely. Funding and sector trends are negative, and there is no evidence of a strategic shift or imminent windfall. While the broader startup/AI sector is experimenting with extreme work cultures and some organizations are scaling rapidly, the Nonlinear Fund’s context is distinct: its funding is philanthropic, and it faces organizational headwinds. The only plausible pathway to >8 FTEs involves a major, currently non-public funding event or strategic pivot, for which there is no evidence. Given all factors and the status quo bias, the probability of 9 or more FTEs on Jan 1, 2026 is low.",
            "final_probability": 8
        },
        "Labor Economics (Human Capital Theory)": {
            "time_to_resolution": "About three months until January 1, 2026",
            "perspective_relevance": "As a labor economist specializing in Human Capital Theory, I bring insight into how talent acquisition, retention, organizational learning, and incentives interact to shape employment dynamics in knowledge-intensive, mission-driven organizations like the Nonlinear Fund. My analysis considers how AI safety labor market trends, funding cycles, and organizational strategy affect both expansion and contraction of high-skill teams.",
            "status_quo": "The Nonlinear Fund is a small, early-stage nonprofit focused on AI safety, likely with a lean team. Historically, most such organizations have 5-10 full-time equivalent (FTE) staff, often fluctuating near this level barring major new funding or crises.",
            "perspective_derived_factors": [
                {
                    "factor": "AI Safety Sector Labor Market",
                    "effect": "Neutral to slightly positive. The AI safety field is experiencing increased attention and funding, but high competition for top talent and mission-driven retention issues persist."
                },
                {
                    "factor": "Organizational Funding Volatility",
                    "effect": "Negative. Nonprofits and grant-funded orgs face uncertain multi-year budgets, and unless the Nonlinear Fund has secured substantial new funding, expansion is unlikely."
                },
                {
                    "factor": "Adoption of High-Intensity Work Culture",
                    "effect": "Negative. The news of '996' culture adoption in AI startups may increase burnout or turnover, and makes it harder to attract/retain FTEs, especially outside lucrative for-profit environments."
                },
                {
                    "factor": "Remote/Hybrid vs. Office Trends",
                    "effect": "Neutral. The Nonlinear Fund, as a nonprofit, is less likely to mandate return-to-office and may attract remote talent, but broader sectoral friction on work arrangements could still affect hiring."
                },
                {
                    "factor": "Human Capital Retention",
                    "effect": "Negative. High turnover due to burnout, mission misalignment, or poaching by better-funded orgs is a chronic risk for small AI safety nonprofits."
                },
                {
                    "factor": "Public Reporting and Transparency",
                    "effect": "Negative. The resolution depends on public information; if the Nonlinear Fund is secretive or slow to update, ambiguity could default the resolution to 'No' if headcount is not clearly documented."
                }
            ],
            "no_scenario": "The Nonlinear Fund maintains or slightly shrinks its current team due to normal attrition, difficulty recruiting new FTEs, or insufficient new funding. Alternatively, the organization quietly winds down, or fails to publicly confirm 9+ FTEs by the resolution date, leading to a 'No' outcome.",
            "yes_scenario": "The Fund secures a significant new grant or donation, launches new projects that require scaling, and successfully recruits and publicly documents at least 9 FTEs by January 1, 2026. Alternatively, an AI safety crisis or external event dramatically increases its relevance and funding, leading to rapid staff expansion.",
            "final_reasoning": "Base rates for small, grant-driven AI safety organizations suggest it's uncommon to see headcount above 8 FTEs unless there is a major funding windfall or strategic pivot. The Nonlinear Fund has not made headlines for major expansion, and recent sector trends (intense work culture, competition for labor, funding volatility) create more headwinds than tailwinds for rapid team growth. The broader labor climate—996 culture in startups—may deter non-mission-driven talent from joining nonprofits, and there is no evidence of a sector-wide hiring boom in AI safety nonprofits. Unless there is new, public evidence of a major hiring event or funding round, the most likely outcome is status quo or minor contraction. Given the lack of specific news about expansion and the weight of negative or neutral sectoral factors, I estimate a moderately low probability of a 'Yes' resolution.",
            "final_probability": 22
        }
    },
    "deliberation_probability": [
        13,
        18,
        17,
        18,
        10,
        8,
        22
    ],
    "deliberation_mean_probability": 15.142857142857142,
    "deliberation_sd": 4.980915960897534,
    "deliberation_probability_result": 15
}