{
    "deliberation_results": {
        "Peace Negotiation Practitioner (UN Peacemaking Principles)": {
            "time_to_resolution": "Nearly 3 months (until December 31, 2025)",
            "perspective_relevance": "As a Peace Negotiation Practitioner grounded in UN Peacemaking Principles, my expertise allows me to assess the likelihood of formal, direct, and physical negotiations between warring parties based on international mediation precedents, the incentives and constraints for belligerents, and the mechanics of credible third-party facilitation. I emphasize the importance of sequencing, confidence-building, and the role of external actors in both enabling and impeding peace talks, drawing on a global base rate of civil war negotiations and UN-led processes.",
            "status_quo": "Since April 2023, there have been no face-to-face negotiations attended physically by both the SAF and RSF. Multiple mediation attempts (Jeddah, Geneva, Quad/Quartet) have failed to bring both delegations into the same room, due to mutual distrust, preconditions, and ongoing violence. Each side continues to seek military advantage and external support.",
            "perspective_derived_factors": [
                {
                    "factor": "Intense International and Regional Pressure",
                    "effect": "Increases probability. The recent Quad/Quartet push, broadening to include the AU, EU, UK, and UN, represents the highest level of coordinated pressure and consensus for direct talks since the war began. Multiple news sources mention direct and indirect contacts, and the language of recent statements has shifted toward urgency and direct negotiation."
                },
                {
                    "factor": "Entrenched Mutual Distrust and Zero-Sum Calculus",
                    "effect": "Decreases probability. Both sides continue to view the conflict existentially. SAF’s repeated public rejection of negotiations with the RSF and vice versa, as well as mutual preconditions (e.g., RSF must be dissolved; SAF’s legitimacy not recognized by RSF), have scuttled previous attempts at direct talks even when international pressure was high."
                },
                {
                    "factor": "Escalating Humanitarian Catastrophe and Legitimacy Crisis",
                    "effect": "Marginally increases probability. The sheer scale of humanitarian suffering (millions displaced, famine conditions, international outrage) has begun to threaten both parties’ legitimacy and external support. This could shift cost-benefit calculations, especially if external backers make support conditional on participation in talks."
                },
                {
                    "factor": "Fragmented Mediation and Competing External Interests",
                    "effect": "Decreases probability. The mediation landscape is fractured: the Quad/Quartet (US, Egypt, Saudi Arabia, UAE) is not always aligned with the AU or IGAD, and key backers (e.g., UAE for RSF, Egypt for SAF) have divergent objectives. This fragmentation has historically prevented unified pressure, and each patron may veto or spoil talks not aligned with their interests."
                },
                {
                    "factor": "Base Rate of In-Person Negotiations in Similar Conflicts",
                    "effect": "Decreases probability. In recent African civil wars with high-intensity violence and deep external involvement (Libya, Ethiopia, Yemen), the time from war onset to first mutually attended in-person peace negotiation has typically exceeded 2-4 years, often only occurring after a clear military stalemate or when external pressure is overwhelming. As of October 2025, Sudan is just over 2.5 years into the war."
                },
                {
                    "factor": "Recent Signs of ‘Momentum’ and Technical Engagement",
                    "effect": "Slightly increases probability. There are credible reports of indirect, technical, or preparatory contacts, and both sides have shown willingness to send delegations to international venues (albeit never simultaneously). The language from civil society, international actors, and even opposition figures suggests unprecedented pressure for direct dialogue."
                },
                {
                    "factor": "SAF and RSF Internal Factionalism",
                    "effect": "Decreases probability. Each side faces internal factions opposed to compromise, and spoilers (Islamist elements, hardline commanders, or those benefiting from war economies) remain powerful. This increases the risk that even if leadership agrees to attend, one side may pull out at the last minute or set impossible preconditions."
                }
            ],
            "no_scenario": "Despite mounting pressure and humanitarian disaster, both parties remain intransigent. External mediation continues, but last-minute disagreements, mutual non-recognition, or new battlefield developments cause one or both sides to boycott or send only low-level observers to any scheduled talks. Regional backers (e.g., UAE, Egypt) prioritize their interests over peace, and no credible, simultaneous, in-person negotiation attended by both delegations occurs by December 31, 2025.",
            "yes_scenario": "Sustained international and regional pressure, combined with deteriorating humanitarian and military situations, compels both SAF and RSF to send official, recognized delegations to a neutral venue (e.g., Jeddah, Geneva, or Addis Ababa) for negotiations explicitly characterized as peace or political talks. A face-saving formula is found (e.g., under AU/UN auspices with civilian observers), and both sides are physically present for at least the opening session before December 31, 2025. The meeting is widely reported by international media and confirmed by official statements.",
            "final_reasoning": "There is unprecedented international consensus and pressure for direct, in-person negotiations, and both parties face mounting humanitarian and legitimacy crises. However, the entrenched mutual distrust, history of failed mediation, and ongoing battlefield dynamics weigh heavily against rapid progress. The base rate for similar conflicts suggests that in-person talks often occur only after clear stalemate or exhaustion—conditions arguably not fully met in Sudan as of October 2025. While there are signals of technical preparation and indirect engagement, both sides have strong incentives (and internal spoilers) to avoid direct talks unless forced. The balance of evidence suggests a modest, but not high, likelihood of face-to-face negotiations occurring before the end of 2025—higher than at any previous point, but still less likely than not. I estimate the probability at 38%.",
            "final_probability": 38
        },
        "Peace Negotiation Practitioner (Mediation Support Unit Best Practices)": {
            "time_to_resolution": "About 2 months and 26 days (until December 31, 2025)",
            "perspective_relevance": "As a Peace Negotiation Practitioner specializing in Mediation Support Unit Best Practices, I focus on the mechanics, preconditions, sequencing, and confidence-building measures that are empirically necessary for warring parties to move from indirect to direct, face-to-face negotiations. This expertise allows for a granular evaluation of the likelihood of both the SAF and RSF physically attending the same peace negotiation venue within a set timeframe, grounded in both base rates and current process indicators.",
            "status_quo": "Since April 2023, the SAF and RSF have not physically attended the same peace negotiation venue. Mediation has been ongoing through various international and regional efforts, but direct, in-person dialogue at the negotiation table has been persistently avoided by at least one party, with mutual distrust and preconditions as key obstacles.",
            "perspective_derived_factors": [
                {
                    "factor": "Escalating International and Regional Pressure",
                    "effect": "Increases probability; unprecedented multilateral consensus (Quad, AU, EU, UN, regional powers) and joint statements now explicitly call for direct negotiations and are coordinating pressure and incentives."
                },
                {
                    "factor": "Entrenched Mutual Distrust and Zero-Sum Postures",
                    "effect": "Decreases probability; both sides, especially SAF, continue to publicly reject equivalence and direct negotiation, citing existential threats and mutual delegitimization (e.g., Burhan's public rejection of conciliation)."
                },
                {
                    "factor": "Proxy Dynamics and External Backers’ Competing Interests",
                    "effect": "Decreases probability; UAE, Egypt, and others' rivalries and continued support for each side create incentives for continued proxy warfare and diplomatic stalling, reducing space for real face-to-face talks."
                },
                {
                    "factor": "Humanitarian Catastrophe and Global Outcry",
                    "effect": "Marginally increases probability; the intensifying famine and displacement crisis is raising the cost of intransigence and raising the reputational cost to backers, producing some urgency for at least symbolic negotiation."
                },
                {
                    "factor": "Civil Society and Civilian Stakeholder Mobilization",
                    "effect": "Marginally increases probability; pressure from Sudanese civic actors and diaspora for civilian-led transition may incentivize both parties to at least appear at the table for legitimacy—even if not in good faith."
                },
                {
                    "factor": "Track Record of Failed Initiatives and Preconditions",
                    "effect": "Strongly decreases probability; both the Jeddah and Geneva tracks failed to bring both parties physically together, with credible reporting that even new Quad efforts have not resolved core preconditions (e.g., SAF's refusal to recognize RSF as legitimate or equal)."
                }
            ],
            "no_scenario": "Despite mounting global and regional pressure, both SAF and RSF continue to set non-negotiable preconditions and use indirect channels or alternating attendance at international venues. Proxy backers (UAE, Egypt, Saudi, etc.) fail to coordinate effectively, and the absence of a credible enforcement mechanism allows at least one side to boycott or send only lower-level delegates, or to appear only virtually or sequentially, thus missing the resolution criteria.",
            "yes_scenario": "Sustained, coordinated pressure from the Quad, AU, and UN, combined with mounting humanitarian disaster and reputational risk for external backers, leads both the SAF and RSF to dispatch official delegations to physically attend the same mediated venue (e.g., in Jeddah, Geneva, or a neutral site), even if only for a brief, symbolic opening session of direct peace negotiations or ceasefire talks, possibly under strong international observation and incentives.",
            "final_reasoning": "Base rates for warring parties in civil wars with similar levels of polarization, mutual delegitimization, and proxy interference physically meeting for direct negotiations within a set two-year window are low—often below 25%. However, the current context features a rare degree of international consensus and coordinated pressure (Quad, EU, AU, UN) that has not been seen previously in this conflict. News sources suggest both sides are under sustained pressure and there are credible signals of indirect contacts and increasing urgency. Still, the core obstacles remain: the SAF's public rejection of equivalence and conciliation with the RSF, deep mistrust, and the risk that either side will find pretext to boycott or downgrade their delegation. While the humanitarian crisis provides added urgency, the lack of progress in previous mediation tracks, ongoing proxy competition, and ongoing hard-line rhetoric from both sides mean the status quo remains resilient. Thus, while the probability is higher than at any previous point in the conflict, the chance that both delegations will be physically present at the same venue for official peace negotiations before December 31, 2025, remains below 50%, but above base rates—reflecting both the extraordinary pressure and entrenched obstacles.",
            "final_probability": 35
        },
        "Diplomatic Mediation (Oslo Process Model)": {
            "time_to_resolution": "About 87 days (until December 31, 2025)",
            "perspective_relevance": "As an expert in diplomatic mediation, particularly the Oslo Process Model, I focus on the prerequisites for face-to-face negotiations in entrenched conflicts. My perspective emphasizes the importance of mutual recognition, credible third-party mediation, and the sequencing of confidence-building measures. I pay particular attention to the status of track-one diplomacy, the willingness of leaders to risk political capital for engagement, and the role of external actors in creating the conditions for direct, physical meetings between belligerents.",
            "status_quo": "Since the war began in April 2023, SAF and RSF have not physically attended the same negotiation venue. All previous attempts at peace talks (e.g., Jeddah, Geneva) have failed to get both delegations in the same room, with deep mutual distrust and ongoing parallel governance structures.",
            "perspective_derived_factors": [
                {
                    "factor": "International and Regional Pressure",
                    "effect": "Increases probability. There is unprecedented international and regional consensus, as reflected by recent Quad and UN/AU/EU/IGAD statements, calling for direct negotiations. Strong diplomatic pressure can sometimes force reluctant parties to the table, especially under humanitarian catastrophe."
                },
                {
                    "factor": "Entrenched Mutual Distrust and Preconditions",
                    "effect": "Decreases probability. Both SAF and RSF have repeatedly set preconditions for talks, with SAF publicly rejecting equality between the sides and Al-Burhan recently reiterating refusal to reconcile. This makes face-to-face presence unlikely unless there is a significant shift."
                },
                {
                    "factor": "Mediation Track Record and Oslo Model Criteria",
                    "effect": "Decreases probability. The Oslo Model suggests that breakthroughs require secret, backchannel, or track-two progress before public face-to-face talks. To date, even indirect contacts have not produced enough trust or commitment signals for a joint in-person session."
                },
                {
                    "factor": "External Spoilers and Competing Agendas",
                    "effect": "Decreases probability. External actors (Egypt, UAE, Saudi Arabia, etc.) have conflicting interests. The UAE is accused of supporting RSF, Egypt backs SAF. This fragmentation undermines the enforcement of mediation outcomes and reduces the likelihood of synchronized in-person attendance."
                },
                {
                    "factor": "Humanitarian Crisis and Domestic Pressure",
                    "effect": "Increases probability. The sheer scale of humanitarian catastrophe (mass starvation, displacement, international outrage) could force a symbolic joint appearance, if only for optics, especially if international aid is conditioned on face-to-face talks."
                },
                {
                    "factor": "Recent Diplomatic Activity and Momentum",
                    "effect": "Slightly increases probability. There is evidence of increased diplomatic momentum, with the US and partners stating both sides are close to direct talks, and speculation about Jeddah as a potential venue. However, no concrete meeting is yet scheduled."
                }
            ],
            "no_scenario": "Despite mounting international pressure and worsening humanitarian conditions, both sides maintain maximalist positions. SAF continues to refuse to recognize RSF as an equal interlocutor, and RSF pushes for parallel governance. Mediation efforts stall, and any talks that occur are either sequential or virtual, or one side boycotts the venue due to security, protocol, or political reasons. The war drags on with only humanitarian coordination meetings, not formal negotiations.",
            "yes_scenario": "A major diplomatic push—possibly involving the Quad, AU, and UN—results in both parties agreeing to a symbolic, internationally monitored in-person meeting, perhaps in Jeddah or Geneva, under enormous external pressure and possibly with incentives or threats (e.g., aid, sanctions, legitimacy). The meeting is short and largely ceremonial but meets the criteria of simultaneous physical presence for peace negotiations.",
            "final_reasoning": "The base rate for face-to-face negotiations between parties in ongoing, highly personalized civil wars with parallel governments is extremely low, especially within a two-year window. The Oslo Process Model teaches that intractable conflicts rarely see direct, physical negotiation before groundwork is laid through indirect, secret, or lower-level engagement. While there is unprecedented international pressure and some signals of momentum, all recent reporting confirms that core issues (mutual recognition, sequencing, external spoilers) remain unresolved. Notably, Al-Burhan and SAF have very recently and publicly reiterated their rejection of parity with RSF, and past mediation attempts have repeatedly failed to get both parties in the same venue. However, the scale of the humanitarian crisis and the diplomatic energy behind the Quad initiative do create a non-trivial chance for a symbolic breakthrough, especially if the international community is able to link aid or sanctions to physical attendance. Overall, the status quo still strongly favors a NO outcome, but the probability is not negligible given the extraordinary context and late-breaking signals of pressure. Therefore, I assess the chance of both delegations physically attending the same negotiation venue before December 31, 2025, at 22%.",
            "final_probability": 22
        },
        "Diplomatic Mediation (African Union Mediation Guidelines)": {
            "time_to_resolution": "Approximately 12 weeks (until December 31, 2025)",
            "perspective_relevance": "As an expert in Diplomatic Mediation, particularly with reference to the African Union (AU) Mediation Guidelines, my perspective is relevant because I understand the required procedural benchmarks, incentives, and obstacles that influence whether warring parties in Africa agree to face-to-face peace talks. The AU guidelines stress inclusivity, regional ownership, credible guarantees, and sequencing (humanitarian truce, ceasefire, then political dialogue). My expertise enables me to dissect not only the declared intentions but also the likely behaviors of both internal and external actors, how mediation platforms are structured, and the historical base rate of direct negotiations in similar conflicts.",
            "status_quo": "Since the war began in April 2023, the SAF and RSF have not physically attended the same peace negotiation venue. Talks have been indirect or sequential, with one side often boycotting or refusing to grant the other equality. The most recent Geneva and Jeddah initiatives failed to bring both sides together in person.",
            "perspective_derived_factors": [
                {
                    "factor": "Intensification of international and regional pressure",
                    "effect": "Slightly increases probability. The recent Quad/Quad+ statements and involvement of the AU, IGAD, UN, and major powers indicate unprecedented unified pressure. Yet, the AU's record is mixed and leverage remains limited, and external actors have conflicting interests."
                },
                {
                    "factor": "Entrenched mutual distrust and zero-sum perceptions",
                    "effect": "Significantly decreases probability. Both Burhan (SAF) and Hemedti (RSF) have repeatedly set preconditions, rejected equality, and are establishing parallel administrations. Public statements as recent as August (and confirmed in October reporting) reiterate refusal for 'conciliation' or equal status."
                },
                {
                    "factor": "Humanitarian catastrophe and risk of famine",
                    "effect": "Marginally increases probability. Catastrophic conditions often generate pressure for at least token negotiations, sometimes under international auspices. However, both parties have previously prioritized military gains over humanitarian access."
                },
                {
                    "factor": "External sponsorship and proxy dynamics",
                    "effect": "Decreases probability. UAE, Egypt, Saudi Arabia, and other states are heavily invested, with divided loyalties and conflicting objectives. This fragmentation undermines the enforcement of negotiation attendance and allows hardliners to resist mediation."
                },
                {
                    "factor": "Base rate of face-to-face negotiations in African civil wars",
                    "effect": "Decreases probability. In similar high-intensity, multi-actor civil wars with significant external involvement (e.g., Libya, Ethiopia, South Sudan pre-2018), direct negotiations without prior military exhaustion or regime change are rare within short timeframes."
                },
                {
                    "factor": "Recent movement toward negotiations",
                    "effect": "Slightly increases probability. There are credible reports of intensified backchannel contacts and groundwork being laid for possible high-level negotiations (especially via Jeddah). However, recent direct statements from SAF and RSF leaders signal continued intransigence."
                },
                {
                    "factor": "AU and IGAD mediation approach and legitimacy",
                    "effect": "Neutral to slightly negative. The AU has lost some legitimacy due to perceived passivity and outsourcing to the Quad, weakening its ability to convene both sides. However, if there is a breakthrough, it likely will be under AU/IGAD auspices."
                }
            ],
            "no_scenario": "Despite international pressure and deepening humanitarian disaster, SAF and RSF leadership maintain hardline postures, refuse to grant each other legitimacy, and continue to pursue parallel government and military strategies. The pattern of indirect talks, shuttle diplomacy, and failed sequencing (ceasefire before talks, or vice versa) repeats. Even if one side attends a venue, the other boycotts or sends only a token observer, thus failing to meet the question's criteria.",
            "yes_scenario": "A combination of intensified international leverage (possibly involving threats of sanctions, conditional aid, or regional isolation) and a further deterioration of the humanitarian or military situation (such as a dramatic loss of territory by one party or a major atrocity) forces both sides to physically attend an AU- or Quad/UN-led negotiation in the same venue, at least briefly, before December 31, 2025. This could occur if civilian and regional actors credibly threaten to withdraw all support absent face-to-face talks.",
            "final_reasoning": "The status quo is strong: no face-to-face negotiations have occurred despite multiple international efforts, and both sides maintain maximalist demands and mutual non-recognition. While recent reports suggest increased diplomatic activity and some groundwork for possible negotiations, the AU and IGAD lack the leverage to compel attendance, and the Quad is internally divided on end goals. The humanitarian crisis, while severe, has not previously shifted the calculus of either party, which both continue to operate as rival governments with external sponsors. Public statements from both Burhan and Hemedti in the past two months reaffirm their unwillingness to grant the other side legitimacy or parity. Historically, such deep-seated mistrust, especially when both sides still believe they can achieve gains or survive as rival authorities, results in continued avoidance of direct negotiations—unless precipitated by an overwhelming external or internal shock, none of which is currently evident. The base rate for such meetings in similar African conflicts within a 3-month window after initial signals is low. Therefore, while there is more diplomatic movement than before, it is insufficient to outweigh the entrenched status quo and significant obstacles. I assign a probability of 20%.",
            "final_probability": 20
        },
        "International Relations (Ripeness Theory)": {
            "time_to_resolution": "Approximately 87 days (question resolves December 31, 2025; today is October 5, 2025)",
            "perspective_relevance": "Ripeness Theory in International Relations posits that conflicts are most likely to move toward negotiation when parties perceive a mutually hurting stalemate (MHS) and see a way out (a 'way out'). My unique perspective brings analytical clarity to the timing and likelihood of negotiation: Are conditions truly ripe for both parties to physically meet, or are obstacles still dominant? I will weigh signals of 'ripeness'—stalemate, pain, and possible solutions—against persistent barriers, and calibrate probabilities accordingly.",
            "status_quo": "Since April 2023, there have been no direct, co-located peace negotiations between SAF and RSF. To date, all peace efforts have failed to bring both sides physically together for formal talks. The status quo is continued mutual avoidance and entrenched positions.",
            "perspective_derived_factors": [
                {
                    "factor": "Mutually Hurting Stalemate (MHS)",
                    "effect": "Slightly increases probability. Both sides are suffering severe humanitarian, military, and reputational costs, and international actors are applying strong pressure. The scale of displacement, famine, and casualties suggests an MHS is approaching, if not already present, but neither side appears to believe it has exhausted its military options yet."
                },
                {
                    "factor": "Way Out / Attractive Exit Option",
                    "effect": "Ambiguous, but overall neutral to slightly negative. The international community (the Quad, AU, UN, etc.) is offering a clear process—truce, ceasefire, civilian transition. However, both parties distrust the process, and the SAF in particular rejects any outcome that treats RSF as an equal. This limits the attractiveness of the 'way out'."
                },
                {
                    "factor": "Entrenched Hostility and Preconditions",
                    "effect": "Strongly decreases probability. SAF and RSF remain unwilling to recognize each other as legitimate negotiating partners. Public statements from al-Burhan explicitly reject reconciliation. Both sides have established parallel governments, which hardens the political divide and raises the stakes of compromise."
                },
                {
                    "factor": "International and Regional Pressure",
                    "effect": "Moderately increases probability. There is unprecedented alignment among major external actors (Quad, AU, UN, EU, UK) calling for direct negotiations. However, external leverage is diluted by conflicting interests (UAE vs. Egypt, etc.), and neither belligerent appears fully dependent on any single outside patron."
                },
                {
                    "factor": "Civil Society and Domestic Political Will",
                    "effect": "Slightly increases probability. Civil society and anti-war groups demand an end to the fighting and support negotiations, but lack the power to compel armed actors. Their influence is real but indirect."
                },
                {
                    "factor": "Base Rate / Historical Precedent",
                    "effect": "Strongly decreases probability. In Sudan and similar civil wars, direct face-to-face, co-located peace talks between primary belligerents are rare and usually occur only after years of failed indirect engagement, often with more substantive stalemate and exhaustion than currently present. In the past two years, all such efforts have failed."
                },
                {
                    "factor": "Time Constraint",
                    "effect": "Slightly decreases probability. With only three months left, the window for organizing, agreeing to, and executing a co-located negotiation is short. Even if there is a breakthrough, logistical and security arrangements could take weeks to months."
                }
            ],
            "no_scenario": "Despite mounting international pressure and worsening humanitarian catastrophe, the SAF and RSF continue to fight and refuse direct talks. The SAF, led by al-Burhan, maintains its precondition that the RSF must disband or integrate unconditionally, while the RSF continues to pursue territorial gains and consolidates a parallel administration in Darfur. Multiple new mediation efforts are launched, but all are indirect, virtual, or sequential rather than face-to-face. The deadline passes without both delegations physically attending the same negotiation venue.",
            "yes_scenario": "Ongoing military stalemate and humanitarian disaster, combined with escalating international and regional pressure (e.g., threat of sanctions or withdrawal of support), finally convince both SAF and RSF that direct talks are unavoidable. A last-minute breakthrough—perhaps after a particularly devastating battle or famine report—leads to both delegations physically attending a peace negotiation in Jeddah, Geneva, or another neutral location, with credible media confirming simultaneous presence.",
            "final_reasoning": "Ripeness Theory suggests the window for negotiation opens when both parties feel trapped in a mutually hurting stalemate with no prospect of military victory and see an attractive path to exit. The evidence points to profound humanitarian suffering and mounting external pressure, but both SAF and RSF leaderships remain intransigent, prioritizing victory or survival over compromise. Al-Burhan and the SAF have explicitly rejected conciliation, and both sides are setting up rival governments, which hardens positions. International actors are unusually coordinated, but their leverage is limited by conflicting patron interests and the lack of a single dominant mediator. Civil society and popular movements are not yet strong enough to force a breakthrough. Historically, such conflicts drag on for years before direct, co-located talks occur, and with only three months left, the likelihood of a sudden reversal is low. Given these factors, the base rate for such a breakthrough remains very low, though not zero. My estimate is therefore sharply below 20%, reflecting the dominance of status quo dynamics and the persistent lack of 'ripeness'.",
            "final_probability": 12
        },
        "International Relations (Third Party Mediation)": {
            "time_to_resolution": "About 2 months and 26 days (until December 31, 2025)",
            "perspective_relevance": "As an expert in International Relations with a focus on third party mediation, I analyze not only the explicit diplomatic moves but also the underlying structural obstacles, incentives, and historical base rates for face-to-face negotiations in high-intensity civil wars. My approach integrates the effectiveness of mediation frameworks, the credibility of international and regional actors, and the internal political calculus of belligerents, all of which are highly relevant to forecasting the likelihood of both SAF and RSF attending the same negotiation venue.",
            "status_quo": "Since the outbreak of war in April 2023, SAF and RSF have not both physically attended the same peace negotiation venue. Mediation attempts have led to only separate or indirect participation, with both sides setting preconditions and mutual distrust prevailing.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent surge in coordinated international pressure",
                    "effect": "Increases probability. The Quad (US, Egypt, UAE, Saudi Arabia), UN, AU, EU, and key regional actors have issued unprecedented joint statements urging immediate talks, and there is a new sense of urgency due to the scale of the humanitarian catastrophe."
                },
                {
                    "factor": "Entrenched mutual distrust and zero-sum attitudes",
                    "effect": "Decreases probability. Both sides continue to demand maximalist preconditions (e.g., no recognition of parallel governments; SAF refusal to accept RSF as an equal; RSF building its own administration in Darfur), stalling any direct engagement."
                },
                {
                    "factor": "Mediation fatigue and lack of a credible, unified third-party enforcer",
                    "effect": "Decreases probability. Mediation efforts have been repeatedly undermined by competing external backers, regional rivalry, and the absence of a single actor with enough leverage to compel both parties to the table."
                },
                {
                    "factor": "Escalating humanitarian disaster and reputational costs",
                    "effect": "Slightly increases probability. The sheer scale of the crisis (displacement, famine, international outcry) is increasing reputational and potentially coercive costs for both sides, which might override some reluctance—if only to deflect blame."
                },
                {
                    "factor": "Proximity of international deadlines and 'window dressing' incentives",
                    "effect": "Slightly increases probability. With the end of 2025 as a symbolic deadline (e.g., extension of humanitarian crossings), there may be incentives for each party to 'show up' under international pressure, even if only for optics."
                },
                {
                    "factor": "Status quo bias and base rates in similar conflicts",
                    "effect": "Substantially decreases probability. Historically, civil wars of this intensity, fragmentation, and external involvement rarely see both sides at the same table until a major battlefield stalemate or external imposition—neither of which is clearly present."
                }
            ],
            "no_scenario": "Despite mounting international pressure, both SAF and RSF continue to avoid direct engagement. Each side either refuses to attend any negotiation labeled as a joint meeting, or they send delegations at different times to avoid overlap. Any meetings that occur remain either indirect, virtual, or involve only one party in person. External backers fail to coordinate sufficient leverage, and the war drags on past December 31, 2025, without face-to-face negotiations.",
            "yes_scenario": "In the face of overwhelming humanitarian disaster and under synchronized pressure from the Quad, AU, EU, and UN, both SAF and RSF agree—possibly reluctantly and with strong third-party guarantees—to attend a ceasefire negotiation in a neutral venue (e.g., Jeddah, Geneva, or Cairo). The event is publicly framed as the start of a new 'Sudanese-owned' process, and credible media confirm both delegations were physically present in the same venue at the same time, even if only for a symbolic opening session.",
            "final_reasoning": "The case for a YES outcome has strengthened compared to previous years: there is an upsurge in multilateral diplomatic pressure, and the scale of the humanitarian crisis is pushing external actors to coordinate more closely, with strong rhetorical support for direct talks. Some reporting suggests both sides are 'closer than ever' to negotiations and that groundwork is being laid for a meeting in Jeddah or similar venue. However, the structural obstacles remain formidable: deep-seated distrust, the SAF's continued public rejection of any parity with the RSF, ongoing external interference, and the lack of a credible enforcement mechanism. The historical base rate for both sides physically attending the same venue under these conditions is low; in similar African civil wars with strong external backers, such meetings are rare without a clear military stalemate or external imposition. On balance, while the probability is higher than a few months ago (perhaps low teens then), it remains a minority outcome. I assign a probability of 20%, reflecting a modest but real possibility of a last-minute, face-saving joint appearance under intense pressure, but with continued skepticism rooted in the status quo and historical experience.",
            "final_probability": 20
        },
        "Conflict Resolution (Track One Diplomacy)": {
            "time_to_resolution": "About 86 days (from October 5, 2025 to December 31, 2025)",
            "perspective_relevance": "As an expert in Track One Diplomacy and conflict resolution, my expertise is directly relevant to assessing the likelihood of high-level, formal negotiations between official delegations of warring parties. My background provides an understanding of the mechanics, prerequisites, and political-institutional barriers to convening in-person peace talks, especially in deeply fractured, externally-influenced civil conflicts like Sudan's. I can also better evaluate the incentives, disincentives, and structural obstacles facing both the SAF and RSF, as well as the role of international mediation and the historical base rates of belligerents in similar conflicts attending joint venues in comparable timeframes.",
            "status_quo": "For over two years, the SAF and RSF have refused to attend the same peace negotiation venue in person, with each side insisting on preconditions and mutual delegitimization. All prior attempts (Jeddah, Geneva, etc.) have failed to bring both delegations together physically, and the most recent Geneva talks (August 2024) saw only RSF attend in person. The status quo is continued avoidance of direct, in-person negotiations.",
            "perspective_derived_factors": [
                {
                    "factor": "Intensity of Mutual Distrust and Zero-Sum Framing",
                    "effect": "Decreases probability. Both SAF and RSF publicly and consistently delegitimize one another, with Burhan rejecting any settlement that keeps RSF as a separate armed entity and both sides creating parallel governments. Such entrenched positions make even symbolic coexistence at a negotiation venue politically costly and potentially destabilizing for each leader’s internal coalition."
                },
                {
                    "factor": "Escalating Humanitarian Catastrophe and International Pressure",
                    "effect": "Slightly increases probability. The dire humanitarian situation and strong, coordinated international pressure (Quad, UN, AU, EU, etc.) heighten the imperative for talks. There is mounting consensus among external actors and Sudanese civil society for direct negotiations, with new, unprecedented diplomatic pushes in September/October 2025. This can, in some cases, force parties to the table for face-saving or image reasons."
                },
                {
                    "factor": "Fragmentation of External Mediation and Proxy Dynamics",
                    "effect": "Decreases probability. The peace process is hamstrung by competing regional and international interests, with key backers (Egypt, UAE, Saudi, US) supporting opposite sides or clashing over process design. Lack of a unified external mediator and ongoing arms flows reinforce the belligerents’ belief that battlefield gains are still possible or that rival sponsors will protect their interests, reducing incentives for reciprocal face-to-face engagement."
                },
                {
                    "factor": "Recent Diplomatic Momentum and Civil Society Involvement",
                    "effect": "Slightly increases probability. There is clear movement in September/October 2025: direct and indirect contacts have begun, and there are credible reports of imminent, possibly Jeddah-based, negotiations with international and domestic legitimacy. Civil society and anti-war groups are mobilizing, and there is a narrative of 'no choice but to negotiate.'"
                },
                {
                    "factor": "SAF’s Public Rejection of Parity with RSF",
                    "effect": "Strongly decreases probability. The SAF leadership has repeatedly and recently (August–October 2025) rejected any process that places them on equal footing with the RSF, both symbolically and procedurally. Accepting a joint presence at a negotiation venue would be widely perceived domestically and by SAF’s regional backers as a concession to RSF legitimacy."
                },
                {
                    "factor": "Base Rate of Similar Civil Conflicts",
                    "effect": "Decreases probability. In the absence of a clear military stalemate or unified external pressure, the historical frequency of both sides attending formal peace venues within short timeframes is low—especially in high-intensity, fragmented, and externally fueled conflicts like Sudan."
                }
            ],
            "no_scenario": "Intense fighting continues, with each side consolidating separate territorial and administrative control. The SAF maintains its demand that the RSF disband or fully integrate before any talks, while the RSF continues its parallel governance in Darfur. International mediators organize further rounds of talks (e.g., Jeddah, Geneva), but at least one side refuses to send an official delegation in person, or attends only virtually or via observers. Any 'negotiations' are sequential or indirect, not simultaneous physical presence. No credible reports emerge of both delegations at the same venue before December 31, 2025.",
            "yes_scenario": "Under acute international and regional pressure—perhaps as the humanitarian crisis peaks or a battlefield stalemate emerges—both SAF and RSF agree, at least tactically, to send official delegations to a high-profile venue (such as Jeddah or Geneva) for peace or ceasefire negotiations. Civil society and external actors broker enough guarantees and face-saving measures (e.g., ambiguous language on parity, mediation by a trusted third party) to allow simultaneous in-person attendance, even if talks are brief or break down quickly. Credible media and official reports confirm joint presence before end-2025.",
            "final_reasoning": "While international diplomatic momentum is at its highest point in over a year and there are credible signals that both sides are under pressure to negotiate, the structural and psychological barriers remain formidable. SAF’s leadership continues to publicly reject any process that appears to legitimize the RSF, a stance reinforced by its regional patrons. The deep mutual distrust, zero-sum narratives, and parallel government structures mean that both sides still see existential risks in ceding the symbolic ground entailed by joint venue attendance. The base rate for such breakthroughs in similarly fragmented, externally-fueled civil wars is low. However, the unprecedented scale of humanitarian catastrophe, the concentrated diplomatic push by the Quad and others, and the possibility of a last-minute tactical calculation or external inducement mean that a limited, face-saving joint appearance cannot be ruled out. The probability is therefore higher than it would have been six months ago, but remains below even odds. My best estimate, reflecting these dynamics and the short time horizon, is 28%.",
            "final_probability": 28
        },
        "Conflict Resolution (Conflict Transformation)": {
            "time_to_resolution": "About 2 months and 26 days (until December 31, 2025)",
            "perspective_relevance": "As an expert in Conflict Resolution (Conflict Transformation), my perspective emphasizes not only the mechanics of negotiation but also the deep-rooted structural and relational barriers to peacemaking. I focus on the incentives/disincentives for dialogue, the role of mutual recognition, legitimacy, and the capacity of external actors to create enabling environments for face-to-face talks. I am attuned to the difference between formal, public negotiation venues and backchannel, informal, or sequential discussions, which is crucial given the question's fine print.",
            "status_quo": "Despite repeated mediation efforts, the SAF and RSF have not attended the same peace negotiation venue simultaneously since the war began in April 2023. All significant talks (e.g., Jeddah, Geneva) have failed to bring both delegations together in person. The conflict continues to escalate, with both sides forming parallel governments and engaging in intense fighting.",
            "perspective_derived_factors": [
                {
                    "factor": "Mutual Legitimacy and Existential Struggle",
                    "effect": "Decreases probability. Both SAF and RSF view each other as existential threats and question the other's legitimacy. Al-Burhan's repeated public rejection of any settlement that allows the RSF to remain a separate entity outside the military system signals a deep unwillingness to be seen as equals at the negotiation table—a core barrier to face-to-face talks."
                },
                {
                    "factor": "International and Regional Pressure",
                    "effect": "Increases probability. The latest news shows an unprecedented level of coordinated international pressure (Quad, UN, AU, EU, Arab League, etc.) for direct negotiations and a humanitarian truce. The level of humanitarian catastrophe and regional destabilization risk gives external actors greater incentive to push for high-visibility talks, including face-to-face meetings."
                },
                {
                    "factor": "Fragmented Mediation and Competing External Agendas",
                    "effect": "Decreases probability. External mediators (UAE, Saudi, Egypt, US) have conflicting interests, and the AU/IGAD lack enforcement power. The failure of past initiatives and the breakdown of recent mediation attempts (e.g., US efforts, Quad deadlock over composition of transition government) suggest limited capacity to compel both sides to the same table."
                },
                {
                    "factor": "War Fatigue and Humanitarian Crisis",
                    "effect": "Increases probability. The sheer scale of civilian suffering, famine, and displacement may eventually push both belligerents to seek negotiations to relieve international and domestic pressure, especially if their military prospects for outright victory continue to dim."
                },
                {
                    "factor": "Internal Dynamics and Factionalism",
                    "effect": "Decreases probability. Both SAF and RSF are under internal pressure from hardliners (e.g., former Islamist regime elements in SAF, RSF's own warlords), making compromise risky and potentially delegitimizing for leaders, reducing the likelihood of direct engagement."
                },
                {
                    "factor": "Base Rate of Similar Civil Wars",
                    "effect": "Decreases probability. In recent African civil wars with deep mutual delegitimization and internationalization (e.g., Libya, Yemen, Ethiopia), face-to-face negotiations between main belligerent delegations have been rare in the absence of a clear military stalemate or single dominant mediator."
                }
            ],
            "no_scenario": "Despite mounting humanitarian and diplomatic pressure, both SAF and RSF refuse to attend any venue together, each insisting on preconditions and refusing mutual recognition. External actors fail to reconcile their agendas or exert sufficient leverage. SAF leadership, in particular, continues to reject any format that treats RSF as an equal party. Negotiations, if any, proceed via shuttle diplomacy, sequential attendance, or virtual means only.",
            "yes_scenario": "A sudden escalation in humanitarian catastrophe (e.g., mass famine, cholera) or a dramatic battlefield stalemate creates overwhelming pressure. External mediators (possibly with US/AU/Arab League coordination) broker a high-profile peace conference (e.g., in Jeddah or Geneva), using threats of sanctions, aid conditionality, and regional isolation. Both parties, calculating that intransigence will lead to total loss of legitimacy or internal rebellion, agree to attend in person—if only for a photo-op and brief opening session.",
            "final_reasoning": "While recent news indicates a significant increase in international and regional pressure for direct talks and the humanitarian situation is catastrophic, the structural obstacles remain daunting: mutual delegitimization, hardline internal opposition, and fragmented mediation. Past mediation attempts have consistently failed to get both delegations physically together. The SAF (especially al-Burhan) continues to publicly reject any arrangement seen as legitimizing the RSF as a negotiating equal, and the RSF, emboldened by external backers, is unlikely to concede unless faced with imminent collapse. The time window (under 3 months) is short, and while the probability is higher than at any previous point in the conflict, the base rate for such meetings in similar contexts remains low. Absent a dramatic, unforeseen shock or a major shift among external sponsors, the status quo (no in-person, co-located negotiations) is likely to persist.",
            "final_probability": 23
        },
        "African Studies (African Regional Security Complex)": {
            "time_to_resolution": "Approximately 87 days (until December 31, 2025)",
            "perspective_relevance": "As an expert in African Studies specializing in the African Regional Security Complex, my perspective is grounded in the structural dynamics of regional conflict mediation, the impact of external (regional and extra-regional) actors, and the empirical base rates for face-to-face negotiations in ongoing African civil wars. I also draw on detailed knowledge of the Sudanese conflict's history, factional rivalries, mediation attempts, and the political economy shaping both international pressure and local incentive structures. This enables a nuanced assessment of the likelihood of both parties physically attending the same negotiation venue within the specified timeframe.",
            "status_quo": "Since the war began in April 2023, there have been no successful face-to-face peace negotiations attended physically by both SAF and RSF delegations. Mediation attempts (Jeddah, Geneva, etc.) have seen sporadic presence by one or the other, but never both at the same venue and time. The status quo is therefore a continuation of mutual mistrust, hardline rhetoric, and parallel governance structures, with each party refusing to legitimize the other through joint attendance.",
            "perspective_derived_factors": [
                {
                    "factor": "Intense International and Regional Pressure",
                    "effect": "Increases probability. There is unprecedented coordination between the Quad (US, Egypt, Saudi Arabia, UAE) and broad multilateral actors (AU, EU, UN, IGAD), with public statements calling for direct negotiations and explicit pressure for both sides to attend. This is stronger than previous cycles."
                },
                {
                    "factor": "Entrenched Mutual Distrust and Zero-Sum Logic",
                    "effect": "Decreases probability. Both SAF and RSF continue to see the other's existence as an existential threat, and recent statements by al-Burhan categorically reject conciliation or equality between the SAF and RSF. Each side is doubling down on maximalist positions."
                },
                {
                    "factor": "Proxy Dynamics and External Spoilers",
                    "effect": "Decreases probability. External support to both sides (UAE for RSF, Egypt and Saudi Arabia for SAF) is ongoing, and the conflict is deeply internationalized. This increases the risk of spoilers and reduces the incentive for compromise."
                },
                {
                    "factor": "Humanitarian Catastrophe and Domestic/International Legitimacy Crisis",
                    "effect": "Increases probability. The scale of the crisis (mass famine, millions displaced, global media attention) is generating unprecedented diplomatic urgency. Both parties could face severe legitimacy crises if perceived as obstructing talks."
                },
                {
                    "factor": "History of Failed Mediation and Process Fatigue",
                    "effect": "Decreases probability. Previous attempts (Geneva, Jeddah, Quad) have failed, and there is skepticism—especially from Sudanese civil society—about the effectiveness or sincerity of these efforts. Base rates for successful in-person negotiation in active African civil wars within such timeframes are low."
                },
                {
                    "factor": "Potential for External Leverage and Carrots/Sticks",
                    "effect": "Slightly increases probability. The US and regional actors may be able to offer strong enough incentives or credible threats (e.g., legal action, economic support, recognition) to force at least symbolic co-attendance."
                },
                {
                    "factor": "Emergence of Parallel Administrations and Internal Fragmentation",
                    "effect": "Decreases probability. Both SAF and RSF are consolidating rival administrations, making negotiation more complex and further reducing the incentive to legitimize each other through shared venue."
                }
            ],
            "no_scenario": "Despite continued international pressure and the worsening humanitarian crisis, the SAF and RSF remain locked in a mutually antagonistic dynamic. Al-Burhan and the SAF leadership continue to reject face-to-face talks, particularly as long as the RSF is seen as a legitimate negotiating partner. The RSF maintains its parallel government and consolidates territorial control in Darfur. Mediation efforts yield only indirect or sequential meetings, or are scuttled by last-minute conditions, spoilers, or security concerns. No credible reports emerge confirming both delegations at the same venue simultaneously before December 31, 2025.",
            "yes_scenario": "Mounting humanitarian catastrophe, combined with coordinated international and regional pressure (Quad, AU, UN, etc.), finally compels both SAF and RSF to send delegations to the same high-profile venue for direct negotiations—likely under intense diplomatic choreography and possibly as a precondition for further aid or recognition. This could be triggered by a dramatic escalation (e.g., mass famine, war crimes indictment) or a breakthrough in backchannel contacts. Both sides, perhaps under duress or to avoid further isolation/sanctions, agree to symbolic co-presence at a peace venue, even if only at lower delegation levels (not the top commanders). Credible media and official statements confirm simultaneous attendance.",
            "final_reasoning": "The probability of both SAF and RSF delegations physically attending the same peace negotiation venue before December 31, 2025, is higher than it has been at any point since the conflict began—owing to intensified international/regional pressure, the worsening humanitarian crisis, and some indications of groundwork for negotiations. However, the empirical base rate for such breakthroughs in deeply entrenched African civil wars with active foreign backing is quite low, especially given the explicit hardline rhetoric from SAF leadership, the existence of parallel governments, and a history of failed mediation. The status quo outcome remains 'no meeting,' but the window for a diplomatic breakthrough is open wider than before (especially if a ceasefire or humanitarian truce is achieved as a first step). Weighing the factors, I estimate a moderate but not high probability: about 30%. This reflects a significant uptick from earlier in the year, but remains cautious given the structural and historical obstacles.",
            "final_probability": 30
        },
        "African Studies (Postcolonial State Theory)": {
            "time_to_resolution": "About 2 months and 26 days until December 31, 2025.",
            "perspective_relevance": "As an expert in African Studies with a focus on Postcolonial State Theory, my analysis emphasizes the legacies of colonial state formation, persistent patterns of militarized politics, the role of external actors, and the challenges of legitimacy in postcolonial African states. This lens foregrounds the fragility of state institutions, the tendency for armed actors to claim sovereignty, and the difficulty of forging inclusive, legitimate peace processes in the face of overlapping internal and external interests. It also underscores the importance of elite incentives, the role of regional and international actors, and the deep mutual mistrust between rival factions in shaping negotiation prospects.",
            "status_quo": "Since the war began in April 2023, the SAF and RSF have not both physically attended the same peace negotiation venue. International efforts (Jeddah, Geneva, etc.) have failed to bring both parties together in person; typically, one side attends while the other boycotts or sends only virtual/indirect representation. The status quo is thus continued avoidance of direct, face-to-face negotiations.",
            "perspective_derived_factors": [
                {
                    "factor": "Elite Incentives and Regime Survival",
                    "effect": "Decreases probability. Both SAF and RSF leadership view direct negotiations as a threat to their claims of legitimacy and survival, with each side risking regime collapse or loss of leverage if seen as conceding to the other."
                },
                {
                    "factor": "External Patronage and Proxy Dynamics",
                    "effect": "Decreases probability. Both sides are heavily armed and financed by external actors (Egypt, Saudi Arabia, UAE, etc.) with divergent interests, who have so far been unable or unwilling to coordinate sufficiently to compel direct talks."
                },
                {
                    "factor": "International Pressure and Humanitarian Catastrophe",
                    "effect": "Increases probability. The scale of the humanitarian disaster and unprecedented international unity (Quad, AU, EU, UN, regional actors) is resulting in escalated calls for face-to-face negotiations, with some evidence of intensified shuttle diplomacy and groundwork for talks."
                },
                {
                    "factor": "Mutual Distrust and Preconditions",
                    "effect": "Decreases probability. Both sides have set preconditions that the other regards as unacceptable (e.g., SAF refuses any deal that leaves RSF autonomous; RSF insists on parity or recognition), making joint attendance exceptionally difficult."
                },
                {
                    "factor": "Civilian Political Pressure and Domestic Legitimacy Crisis",
                    "effect": "Marginally increases probability. Sudanese civil society and anti-war coalitions are calling for inclusive negotiations, but armed actors have so far ignored these pressures. However, the narrowing of political alternatives could make even reluctant in-person talks more likely as a last resort."
                },
                {
                    "factor": "Base Rate of Success for Similar Peace Initiatives",
                    "effect": "Decreases probability. Historically, in similar African civil wars with multiple external sponsors, physical co-attendance at peace venues is rare until one side is militarily exhausted or external pressure is overwhelming."
                }
            ],
            "no_scenario": "SAF and RSF continue to avoid direct negotiation venues, with each side either boycotting scheduled talks, sending only lower-level or virtual representation, or setting preconditions that render co-attendance impossible. External sponsors remain disunited, and the war continues with high-intensity fighting, mutual delegitimization, and parallel governance structures. International pressure proves insufficient to overcome elite survival logics and mutual distrust.",
            "yes_scenario": "A major inflection point is reached due to catastrophic humanitarian collapse, a key military stalemate, or a shift among external patrons (e.g., coordinated pressure from US, Egypt, UAE, and Saudi Arabia) that forces both SAF and RSF to physically attend a peace negotiation venue. Both sides agree to attend under heavy pressure, possibly as a prerequisite for further military or financial aid, or as part of a new, externally guaranteed process, even if only at the level of designated negotiators (not top commanders).",
            "final_reasoning": "Despite an unprecedented scale of international coordination and explicit calls for direct talks (Quad, AU, UN, etc.), the base rate for such breakthroughs in African conflicts featuring deep mutual distrust, parallel state-building, and strong external sponsorship is low. The news flow suggests some movement—intensive consultations, direct/indirect contacts, and groundwork for possible talks in Jeddah or elsewhere. However, the immediate past is characterized by failed efforts: SAF and RSF have repeatedly avoided co-attendance, and both have hardened positions (e.g., Burhan's repeated public rejection of conciliation; RSF's establishment of parallel authority). External actors remain divided on core principles, and neither side appears militarily exhausted or existentially threatened yet. The humanitarian catastrophe and international pressure could force a breakthrough, but the time window (less than three months) is short, and the status quo is powerful. In sum, while probability is higher than in early 2024, it remains under 50%. I assess a 30% chance that both delegations will physically attend the same peace negotiation venue before December 31, 2025.",
            "final_probability": 30
        }
    },
    "deliberation_probability": [
        38,
        35,
        22,
        20,
        12,
        20,
        28,
        23,
        30,
        30
    ],
    "deliberation_mean_probability": 25.8,
    "deliberation_sd": 7.842901957254795,
    "deliberation_probability_result": 26
}