{
    "deliberation_results": {
        "Legal Practice in Germany (Verfassungsrecht Litigation Procedures)": {
            "time_to_resolution": "About 2 months and 4 weeks (until January 1, 2026)",
            "perspective_relevance": "As an expert in German Verfassungsrecht litigation procedures, I have direct insight into the legal, procedural, and political complexities involved in initiating a party ban at the Federal Constitutional Court (Bundesverfassungsgericht). I can assess not only political will but also the institutional and evidentiary thresholds that must be crossed for such an application to be filed, including the likelihood of key actors (Bundestag, Bundesrat, federal government) moving from rhetoric to legal action.",
            "status_quo": "No application to ban the AfD has been filed at the Federal Constitutional Court. Despite increased calls and some preparations by political actors, the threshold for actually filing such an application has not been crossed.",
            "perspective_derived_factors": [
                {
                    "factor": "Political Momentum and SPD/Coalition Pressure",
                    "effect": "Increases probability. The SPD and allied parties have moved from mere rhetoric to coordinated action, including forming working groups and issuing formal declarations (e.g., Berlin Declaration for Democracy) to prepare the evidentiary basis for a ban. There is increasing political urgency, especially after the formal classification of AfD as extremist by the BfV."
                },
                {
                    "factor": "Legal and Evidentiary Thresholds",
                    "effect": "Decreases probability. The history of party bans in Germany is one of extreme caution. Only two parties have ever been banned, and the NPD ban failed in recent decades due to insufficient demonstration of an 'actively aggressive, combative stance' and the party's lack of real threat. The AfD is much larger and more entrenched than previous targets, making the legal bar even higher and increasing risk aversion among institutional actors."
                },
                {
                    "factor": "Public Opinion and Electoral Strength of AfD",
                    "effect": "Decreases probability. Recent surveys show a clear majority of Germans oppose a ban, and AfD is polling near or at the top nationally. A ban is likely to be perceived as anti-democratic or as an attack on millions of voters, which increases reluctance among the Bundestag, Bundesrat, or government to file an application."
                },
                {
                    "factor": "Internal Institutional Disagreement",
                    "effect": "Decreases probability. Key actors such as the Federal Interior Minister (CSU) and Chancellor Friedrich Merz (CDU) have expressed opposition to a ban, preferring to 'govern AfD out of existence.' This suggests that, even with SPD pressure, there is no unified front in the executive or legislative organs needed to initiate proceedings."
                },
                {
                    "factor": "Procedural Delays and Need for Evidentiary Review",
                    "effect": "Decreases probability. Even the SPD statements emphasize that first an evidentiary review must be conducted, and only if this review finds a realistic prospect of success will an application be filed. These reviews, especially in Germany's cautious legal culture, tend to be lengthy and methodical, reducing the chance of action before the January 1, 2026 deadline."
                },
                {
                    "factor": "Recent BfV Classification and Legal Challenge",
                    "effect": "Mixed effect. The classification of the AfD as a 'confirmed right-wing extremist' organization by the BfV is a key enabling step, but this status is currently suspended due to AfD's legal challenge. The uncertainty and lack of a final administrative judgment on extremism reduce the immediate legal basis for a ban, at least until the courts resolve the challenge."
                },
                {
                    "factor": "Recent News of SPD Preparing Application",
                    "effect": "Increases probability, but mainly signals serious intent rather than immediate action. The SPD and allied groups are moving ahead with preparations, but multiple articles clarify that this is still at the evidence-gathering and internal review phase."
                }
            ],
            "no_scenario": "Despite strong SPD and allied pressure, the evidentiary review process is not completed in time, institutional actors remain divided, and the legal uncertainties (especially the suspended BfV classification) and political risks prevent the Bundestag, Bundesrat, or federal government from officially filing an application to ban the AfD before January 1, 2026.",
            "yes_scenario": "The SPD and its allies successfully accelerate the evidentiary review, political pressure mounts amid further AfD radicalization or a provocative event, and either the Bundestag, Bundesrat, or federal government overcomes internal division and files an application to ban the AfD at the Federal Constitutional Court before the end of 2025.",
            "final_reasoning": "The status quo strongly favors no application being filed, as the German legal and political system is exceedingly cautious about party bans. The SPD and its allies have increased pressure and made notable procedural moves, but the process is still at the evidence-gathering and review stage, with explicit statements that only if this review finds a realistic prospect of success will an application be filed. Internal opposition from key government figures, strong public opposition, and the still-unresolved status of the BfV extremism classification all act as brakes. The history of Verfassungsrecht litigation in Germany shows a conservative, incremental approach, with a high bar for action and a bias toward institutional stability. While the probability of action is higher than in previous years and the SPD's preparations are non-trivial, the time remaining (less than 3 months), procedural requirements, and lack of institutional consensus make a filing before 2026 unlikely, though not impossible.",
            "final_probability": 20
        },
        "Legal Practice in Germany (Political Party Ban Process)": {
            "time_to_resolution": "Approximately 3 months (resolves January 1, 2026; forecast date October 4, 2025)",
            "perspective_relevance": "As an expert in German legal practice focusing on the political party ban process, I bring detailed knowledge of the constitutional and procedural hurdles, historical precedents (especially the NPD ban cases), and the political-legal interplay required for such a ban initiative to be formally filed at the Federal Constitutional Court.",
            "status_quo": "No application to ban the AfD has yet been filed by the Bundestag, Bundesrat, or Federal Government at the Federal Constitutional Court.",
            "perspective_derived_factors": [
                {
                    "factor": "Constitutional and procedural hurdles",
                    "effect": "Decreases probability. The German Basic Law (Art. 21) sets an intentionally high threshold for party bans, requiring evidence of active, aggressive action against the free democratic basic order and a real potential to succeed. Past attempts (e.g., with the NPD) have failed even with substantial evidence. The process requires both political consensus and robust legal preparation."
                },
                {
                    "factor": "Political momentum and SPD/left-wing push",
                    "effect": "Increases probability. The SPD and parts of the Greens and Left have clearly signaled intent to prepare an application, citing the AfD's radicalization and recent legal classification as a right-wing extremist party. Several news articles show that formal preparations are underway, including the 'Berlin Declaration for Democracy' and establishment of relevant working groups."
                },
                {
                    "factor": "Internal political division and public opposition",
                    "effect": "Decreases probability. There is strong opposition not only from AfD supporters (now a substantial part of the electorate) but also from CDU/CSU leadership (notably Interior Minister Dobrindt), who argue a ban would backfire. Polls show a majority of Germans oppose a ban, especially in eastern Germany, making it politically risky for centrist parties to align with the SPD on this issue."
                },
                {
                    "factor": "Legal status of BfV classification",
                    "effect": "Decreases probability. The classification of AfD as 'right-wing extremist' by the BfV is currently suspended pending a court challenge. This undermines the legal case and could delay or weaken the willingness to file an application, since an unresolved administrative dispute could be seen as premature for a Constitutional Court case."
                },
                {
                    "factor": "Time constraint and bureaucratic pace",
                    "effect": "Decreases probability. With only three months left in 2025, and given the German bureaucracy’s typically cautious approach, the need to compile a robust legal brief, and current reliance on working group recommendations, the timeframe is tight for a formal filing, even if preparations are advanced."
                },
                {
                    "factor": "Recent escalation and legal environment",
                    "effect": "Increases probability. The SPD legal wing is pressing for immediate action, and several reports indicate a sense of urgency; in particular, the Berlin Declaration and interior ministerial working group signal a possible move before the end of the year. The BfV’s 1000-page report provides a legal basis; if the political will solidifies, a filing could happen quickly."
                }
            ],
            "no_scenario": "Despite ongoing political and legal preparations, the SPD and allies fail to muster sufficient consensus in the Bundestag or Bundesrat, or the working group advises further delay pending the outcome of the administrative court case on the BfV classification. The CDU/CSU blocks or delays any vote, fearing political backlash and legal uncertainty. As a result, no application is officially filed before January 1, 2026.",
            "yes_scenario": "The SPD, Greens, and Left, possibly joined by enough centrist lawmakers, push a vote in the Bundestag or Bundesrat, or the Federal Government moves unilaterally. They argue that the urgency of protecting democracy outweighs the pending administrative case. A formal application is filed with the Federal Constitutional Court before year’s end, even if the legal outcome is uncertain.",
            "final_reasoning": "The legal and political environment has shifted significantly in 2025: the AfD is now officially classified as a right-wing extremist party (albeit temporarily suspended), and the SPD and its allies are clearly mobilizing for a ban. However, the legal process is complex, and there is significant resistance both within the government (notably from the CDU/CSU) and among the public. The precedent of the failed NPD ban, which took years and ultimately failed, weighs on decision-makers. The suspension of the BfV’s classification pending court review is a substantial legal obstacle; most lawyers would advise waiting for a definitive administrative ruling to strengthen the application. The time constraint is very real: while preparations are advanced, the formal step of filing is a major one that requires broad political buy-in and legal confidence. Nevertheless, the SPD’s public statements and the establishment of a working group suggest a higher-than-normal risk of a 'Yes' outcome, especially if political calculations shift in the coming weeks. Given these factors, the base rate for party ban filings in German history is extremely low, but the current situation is exceptional. My estimate, balancing all factors, is that there is a moderate chance—higher than the historical base rate but constrained by legal and political realities.",
            "final_probability": 35
        },
        "German Political Analysis (Policy Advisory on FarRight Parties)": {
            "time_to_resolution": "Just under 3 months (until December 31, 2025).",
            "perspective_relevance": "As an expert in German political analysis with a focus on far-right parties, I bring a deep understanding of the legal, historical, political, and social dynamics that inform the likelihood and mechanics of party bans in Germany. My expertise allows me to interpret not just the public discourse but also the institutional inertia, party strategies, legal precedents, and public sentiment that shape such high-stakes decisions.",
            "status_quo": "No formal application to ban the AfD has yet been filed at the Federal Constitutional Court. While there is growing political pressure and organizational groundwork, the application has not crossed the formal, legally binding threshold required for resolution as 'Yes.'",
            "perspective_derived_factors": [
                {
                    "factor": "Legal Threshold and Precedent",
                    "effect": "Decreases probability. The legal bar for party bans is extremely high: only two parties (SRP in 1952 and KPD in 1956) have ever been banned at the federal level. The NPD ban attempt failed as recently as 2017, despite clear extremist tendencies, due to the court's demand for concrete evidence of active threats to the democratic order."
                },
                {
                    "factor": "Political Will and Coalition Dynamics",
                    "effect": "Mixed to slightly increases probability. SPD and allied parties are increasingly vocal and organizationally prepared, with working groups and parliamentary initiatives. However, CDU/CSU-led government (Chancellor Merz) and key ministers remain skeptical or opposed, fearing backlash and potential martyrdom for the AfD."
                },
                {
                    "factor": "BfV Classification and Legal Challenge",
                    "effect": "Decreases probability in short term. The May 2025 BfV classification of the AfD as a 'confirmed right-wing extremist organization' is suspended pending the AfD's legal challenge. Without a final, court-backed BfV verdict, the evidentiary basis for a ban is weaker and riskier for applicants."
                },
                {
                    "factor": "Public Opinion",
                    "effect": "Decreases probability. Consistently, a majority of Germans—especially in the east—oppose a ban, with only about a quarter supporting it. Policymakers are acutely aware that a ban could backfire by fueling AfD support and perceptions of establishment overreach."
                },
                {
                    "factor": "Electoral Strength and Political Risk",
                    "effect": "Decreases probability. The AfD is at or near record polling highs (26%+), and is the second-strongest or even strongest party in some polls. This makes establishment parties wary of triggering a potential legitimacy crisis or energizing the AfD base."
                },
                {
                    "factor": "Procedural and Organizational Readiness",
                    "effect": "Increases probability. SPD-led working groups have made significant progress on evidence-gathering and legal briefs, and the 'Berlin Declaration for Democracy' outlines a concrete roadmap. A Bundestag majority, Bundesrat, or the federal government could file if enough momentum coalesces."
                },
                {
                    "factor": "International and EU Context",
                    "effect": "Slightly increases probability. There is a pattern of legal moves against far-right parties in Europe (e.g., France, Romania), and the EU establishment is under pressure to contain far-right surges. However, German legal culture is particularly risk-averse regarding bans."
                }
            ],
            "no_scenario": "Despite mounting calls and preparations, no consensus emerges in the Bundestag, Bundesrat, or federal government to formally file an application. Key center-right actors (CDU/CSU) block or slow-walk the process, citing risks of backlash and insufficient legal certainty, especially while the BfV classification remains suspended in court. Political calculations warn that a premature ban attempt could strengthen, not weaken, the AfD. The issue remains unresolved as 2025 ends.",
            "yes_scenario": "SPD and allied parties succeed in building enough parliamentary or Bundesrat support—possibly swaying wavering CDU/CSU or Green members, or leveraging a major AfD-related scandal or violent incident. The BfV's evidentiary file is deemed sufficient despite the ongoing court challenge, and a formal application is filed at the Federal Constitutional Court in November or December 2025, even if the ultimate prospects for success are uncertain.",
            "final_reasoning": "Base rates for party ban applications in Germany are extremely low, with only two successful bans in the early postwar years and one (NPD) rejected in the last decade. While political and legal groundwork for a ban on the AfD has accelerated dramatically in 2025—particularly after the BfV's extremist classification and growing SPD/left-wing mobilization—critical procedural and political hurdles remain. Key government actors (notably the CDU/CSU, who lead the federal government) remain opposed, and the evidentiary foundation is undermined by the ongoing BfV legal dispute. Public opinion is strongly against a ban, especially in eastern Germany, raising the risk of backlash and legal defeat, as in the NPD case. However, the intensity of preparations and the symbolic importance of the issue mean a late-breaking push is possible, especially if a triggering event occurs or internal CDU/CSU divisions emerge. On balance, the probability of a formal application being filed before January 2026 is higher than in any previous year, but remains substantially below 50% due to the cumulative drag of legal, political, and public opinion constraints. I estimate the probability at 35%.",
            "final_probability": 35
        },
        "Political Science (Party Systems Theory)": {
            "time_to_resolution": "Just under 3 months (question closes at end of December 2025, today is October 4, 2025).",
            "perspective_relevance": "As an expert in Political Science, specifically Party Systems Theory, my perspective is crucial for analyzing the likelihood of a party ban application because I understand the systemic implications of party bans in advanced democracies, the historical rarity of such bans, and the incentives facing both mainstream and challenger parties. I can place the current German case in comparative and historical context, assess the institutional hurdles, and weigh the pressures from both party competition and militant democracy doctrine.",
            "status_quo": "No application has yet been filed at the Federal Constitutional Court to ban the AfD. Historically, only two parties have ever been banned in Germany (SRP in 1952, KPD in 1956), and prior attempts (e.g., NPD) have failed or been rejected as unfounded or politically risky.",
            "perspective_derived_factors": [
                {
                    "factor": "Legal and Constitutional Hurdles",
                    "effect": "Decreases probability. The legal standard for banning a party is extremely high in Germany, requiring both proof of anti-constitutional aims and active efforts to subvert the democratic order. Previous attempts (e.g., NPD) failed even when evidence was strong."
                },
                {
                    "factor": "Political Will among Key Actors",
                    "effect": "Increases probability. The SPD and some Greens and Left have publicly and organizationally committed to preparing a ban application, forming working groups and issuing joint statements. However, the CDU/CSU leadership remains opposed, and there is no sign of consensus in the Bundestag/Bundesrat or government."
                },
                {
                    "factor": "Public Opinion and Electoral Calculus",
                    "effect": "Decreases probability. Polls show a clear majority (52%) of Germans oppose a ban, with even higher opposition in eastern Germany. The AfD is at record highs in polling (tied for first in some), and mainstream parties fear a ban could backfire and further legitimize the AfD as victims of establishment suppression."
                },
                {
                    "factor": "Recent Extremism Classification and Legal Proceedings",
                    "effect": "Increases probability (slightly). The BfV classified the AfD as a confirmed right-wing extremist group in May 2025, but this designation is currently suspended pending legal review. This provides some legal ammunition for a ban, but the suspension means the classification is not yet final, reducing the immediacy of action."
                },
                {
                    "factor": "Time Pressure and Political Process",
                    "effect": "Decreases probability. There is very little time left in 2025, and the process for drafting, building support, and formally submitting a ban application is lengthy, requiring extensive evidence and political consensus."
                },
                {
                    "factor": "Comparative Party System Stability",
                    "effect": "Decreases probability. Advanced democracies rarely ban major parties, especially those with strong electoral support. Party bans are more common in new democracies or in response to clear, imminent threats, not as a tool of mainstream party competition."
                }
            ],
            "no_scenario": "Despite SPD and allied calls, the Bundestag, Bundesrat, and government cannot reach sufficient consensus to formally submit an application. Legal and political obstacles, including CDU/CSU opposition, public resistance, and unresolved legal status of the BfV classification, delay any formal move. The working group continues gathering evidence, and the process is kicked into 2026 or later, possibly indefinitely.",
            "yes_scenario": "SPD, Greens, and Left successfully rally enough Bundestag deputies (5% or more) or Bundesrat state governments to push for a formal parliamentary vote. Political urgency (e.g., a new AfD scandal or escalation of extremist activity) creates momentum, overcoming CDU/CSU resistance. A last-minute application is hurriedly submitted to the Federal Constitutional Court before the end of 2025, even if the prospects for success are uncertain.",
            "final_reasoning": "The party system context, legal precedents, and public opinion all point toward extreme caution in pursuing a party ban, especially against a popular, institutionalized party like the AfD. While there is significant mobilization and preparation among SPD and some allies, the necessary political unity and legal basis are lacking. The CDU/CSU, crucial for a cross-party move, remains opposed, and the legal status of the AfD's extremist classification is suspended. The timeline is very tight, and the process for preparing a legally credible application is complex and slow. Recent history (NPD ban attempt) shows a strong tendency for delay and avoidance absent overwhelming evidence and consensus. While a last-minute push is not impossible, the base rate for such applications is near zero in comparable contexts. Thus, despite visible activism, the likelihood that an actual application will be filed before 2026 remains low but not zero, given the intensity of current debates and some institutional groundwork underway. I estimate the probability at 18%.",
            "final_probability": 18
        },
        "Political Science (Radical Right Parties Literature)": {
            "time_to_resolution": "About 3 months (resolves Jan 1, 2026; today is Oct 4, 2025)",
            "perspective_relevance": "As an expert in the Radical Right Parties Literature, I can contextualize party bans within Germany’s postwar militant democracy, analyze precedent (NPD, SRP), assess AfD’s radicalization, and evaluate the institutional/political calculus of establishment parties. I can also weigh public opinion, legal hurdles, and the strategic incentives of both mainstream and radical actors. Further, I am attuned to the ways banning attempts historically affect radical right parties’ legitimacy, support, and organizational adaptation.",
            "status_quo": "No formal application to ban the AfD has been filed at the Federal Constitutional Court by the Bundestag, Bundesrat, or Federal Government. The party is classified as right-wing extremist by the BfV, but the legal process is suspended pending the AfD’s legal challenge.",
            "perspective_derived_factors": [
                {
                    "factor": "Historical Precedent of Party Bans",
                    "effect": "Decreases probability. Only two parties have been banned since WWII, both with much weaker democratic legitimacy and less public support than the AfD; past attempts (e.g., NPD) failed at the final hurdle, cautioning actors against risky filings."
                },
                {
                    "factor": "Legal Threshold and Ongoing Litigation",
                    "effect": "Decreases probability. The Federal Constitutional Court requires not only anti-constitutional intent but also active, concrete threat. The BfV’s classification is suspended in court, so the evidentiary basis for a ban is not yet firmly established, and authorities may hesitate to file while legal uncertainty persists."
                },
                {
                    "factor": "Political Will Among Gatekeepers",
                    "effect": "Mixed, but currently increases probability. The SPD is clearly mobilizing for a ban, with formal resolutions and public pressure. However, the CDU/CSU is divided or opposed (see Interior Minister Dobrindt), and any application would require broad coalition backing—possible but not certain."
                },
                {
                    "factor": "Public Opinion",
                    "effect": "Decreases probability. Multiple recent polls show a clear majority of Germans (and especially eastern Germans) oppose banning the AfD, and believe it would not eliminate its ideology. This acts as a brake, making mainstream parties cautious about a move that could backfire."
                },
                {
                    "factor": "AfD Electoral Strength and Legitimacy",
                    "effect": "Decreases probability. AfD is now polling first or second nationally, with over 20% support and growing. This scale of democratic mandate makes a ban unprecedentedly fraught—risking perceptions of elite overreach and democratic backsliding."
                },
                {
                    "factor": "Escalating Institutional and Civil Society Pressure",
                    "effect": "Increases probability. The SPD and affiliated actors have built up a legal and public case, forming working groups, and pushing for urgent action. The classification by BfV (even if suspended) and mass mobilization by civil society (protests, church bans, etc.) keep pressure high."
                },
                {
                    "factor": "Strategic Calculus: Backfire Risk",
                    "effect": "Decreases probability. Mainstream actors must weigh potential mobilization or martyrdom effects for the AfD if a ban is attempted and fails, or even if it succeeds but the movement reconstitutes elsewhere."
                },
                {
                    "factor": "Time Constraint",
                    "effect": "Increases probability, modestly. With only about 3 months left, if gatekeepers are going to act, they must do so soon—if the SPD-led coalition can muster support, a last-minute application is plausible."
                }
            ],
            "no_scenario": "Despite SPD pressure, the governing coalition fails to reach consensus (due to CDU/CSU resistance, legal doubts, or fear of backlash). With the BfV classification still under judicial review, the necessary evidentiary threshold is seen as unmet. Public opposition, concerns about fueling the AfD, and the short time frame discourage action. No formal application is filed before January 1, 2026.",
            "yes_scenario": "SPD, potentially joined by Greens and/or Left, secures the necessary parliamentary threshold. Mounting civil society and media pressure, plus the BfV’s (even if not final) extremist classification and recent radicalization events (e.g., youth wing, scandals), convince enough lawmakers that a ban application is both legally and morally justified. An application is filed in late 2025, even if its chances of success remain uncertain.",
            "final_reasoning": "The current environment is volatile: SPD is strongly pushing for a ban, with formal resolutions and legal preparatory work. The BfV’s extremist classification gives some evidentiary support, and civil society pressure is rising. However, the CDU/CSU remains divided or opposed, and public opinion is firmly against a ban, especially in the east. The AfD’s polling strength makes a ban historically unprecedented and risky. The legal threshold is high, and the BfV’s classification is suspended pending court review, making the evidentiary basis less secure. Given the short time frame, the probability of successful political coordination and risk acceptance is not negligible, especially if the SPD is willing to force the issue for signaling reasons, but the base rate of actual party ban applications is extremely low. Overall, I assign a probability of 38%—higher than even odds due to intense SPD mobilization and institutional groundwork, but tempered by legal, political, and public opinion constraints.",
            "final_probability": 38
        },
        "German Constitutional Law (Militant Democracy Doctrine)": {
            "time_to_resolution": "Just under 3 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in German Constitutional Law, specifically the doctrine of 'streitbare Demokratie' (militant democracy), I have deep knowledge of the legal standards and political processes required for party bans under Article 21(2) of the Basic Law, the historical precedent, and the institutional dynamics between the legislature, executive, Bundesrat, and the Federal Constitutional Court. This allows for a nuanced assessment of the likelihood, timing, and feasibility of an application to ban the AfD within the specified window.",
            "status_quo": "No application to ban the AfD has been filed at the Federal Constitutional Court. Despite growing calls, no qualified actor (Federal Government, Bundestag, or Bundesrat) has formally submitted an application.",
            "perspective_derived_factors": [
                {
                    "factor": "Institutional Reluctance and Historical Precedent",
                    "effect": "Decreases probability. Only two party bans (SRP 1952, KPD 1956) have ever succeeded, and a 2017 NPD ban attempt failed despite evidence of anti-constitutional aims. The court is extremely cautious; political actors have historically hesitated to risk high-profile failure or political backlash."
                },
                {
                    "factor": "Current Momentum and Political Will",
                    "effect": "Increases probability. The SPD has unanimously resolved to prepare a ban application, and cross-party initiatives (notably the 'Berlin Declaration for Democracy') are underway, with working groups collecting evidence and some suggesting a duty to act if legal assessment is positive."
                },
                {
                    "factor": "Legal and Procedural Hurdles (Ongoing Litigation)",
                    "effect": "Decreases probability. The BfV's 'extremist' classification of the AfD is suspended pending a court challenge in Cologne. The legal foundation for a ban is thus less robust and more politically risky until a final administrative judgment is rendered."
                },
                {
                    "factor": "Public Opinion and Political Backlash Risk",
                    "effect": "Decreases probability. Polls show a clear majority of Germans (52%) oppose a ban, especially in the East. Many fear a ban would be seen as undemocratic, counterproductive, or would simply drive AfD supporters to a successor party."
                },
                {
                    "factor": "Party Political Dynamics (Bundestag Balance, Bundesrat, and Government)",
                    "effect": "Decreases probability. The CDU/CSU and FDP are opposed or very cautious, with some leaders (e.g., Dobrindt, Merz) warning a ban could strengthen the AfD. Without cross-party consensus, it is hard to pass a Bundestag or Bundesrat application; the current federal government is also divided."
                },
                {
                    "factor": "Short Timeframe",
                    "effect": "Decreases probability. With less than 3 months left and significant preparatory legal work still ongoing, there is limited time for a thorough legal review, coalition-building, and a formal vote/application."
                },
                {
                    "factor": "Militant Democracy Doctrine and Rising Extremism Evidence",
                    "effect": "Increases probability. The BfV's classification and ongoing radicalization (including the youth wing) provide a more solid legal-constitutional basis than in previous cases, making the legal argument for a ban more plausible and intensifying pressure on constitutional actors to act."
                }
            ],
            "no_scenario": "Despite SPD and allied efforts, ongoing legal review and the suspended BfV classification mean the legal case is not yet considered strong or low-risk enough. Coalition partners and opposition parties (especially CDU/CSU and FDP) oppose a ban, fearing backlash and political costs. The working group continues to collect evidence, but a consensus is not reached in time to formally move an application through the Bundestag, Bundesrat, or the federal government before the January 1, 2026, deadline. The status quo holds: no application is filed.",
            "yes_scenario": "SPD and Green factions, with possible support from some CDU/CSU or Left MPs, rapidly conclude their legal assessment in the next weeks. Political and public pressure after further radicalization or a major incident leads to unprecedented urgency. A simple majority in the Bundestag (or Bundesrat, or the Federal Government) is achieved for a formal application, and a filing at the Federal Constitutional Court is made before the deadline, even if the legal case is not yet maximally robust.",
            "final_reasoning": "The base rate for successful party ban applications in Germany is extremely low, with only two bans ever and one recent high-profile failure (NPD 2017). Despite high-profile SPD initiatives and working groups, there are major procedural, legal, and political obstacles: the BfV's extremism designation is not final; public opinion is mostly opposed; key establishment parties (CDU/CSU, FDP) are not on board; and the time window is very short for a move of this magnitude. The militant democracy doctrine supplies a legal rationale, especially with the new BfV report and ongoing radicalization, but institutional caution and the risk of failure or backlash are strong brakes. The most likely outcome is continued debate and preparation, but no actual filing before January 1, 2026. However, the probability is not negligible given the level of preparation and political will, so an estimate above the extreme low single digits is justified.",
            "final_probability": 18
        },
        "German Constitutional Law (Federal Constitutional Court Precedents)": {
            "time_to_resolution": "Just under 3 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in German Constitutional Law and the precedents of the Federal Constitutional Court (BVerfG), I can assess the legal and procedural hurdles, historical base rates of party bans, political and constitutional requirements for a ban application, and the likelihood of such an application being filed. My expertise allows me to weigh the recent legal developments, the status and effect of BfV classification, and the internal parliamentary/party calculus necessary for a formal application.",
            "status_quo": "No formal application to ban the AfD has been filed at the Federal Constitutional Court. Despite heated political debate and rising calls for a ban, the process has remained at the discussion and investigative stage.",
            "perspective_derived_factors": [
                {
                    "factor": "Base Rate of Party Ban Applications",
                    "effect": "Strongly decreases the probability. Since 1949, only a handful of party ban applications have been filed (notably KPD 1952 and SRP 1956, NPD in 2003 and 2013), with most failing to meet procedural or evidentiary thresholds. The Court is reluctant to accept such applications unless the evidence and political consensus are overwhelming."
                },
                {
                    "factor": "Recent BfV Classification and Evidence Gathering",
                    "effect": "Moderately increases the probability. The BfV's nationwide classification of AfD as a right-wing extremist party (even if temporarily suspended by court challenge) is a necessary precondition for a ban and signals a serious shift. The ongoing evidence collection and the federal-state working group show institutional momentum."
                },
                {
                    "factor": "Political Will and Parliamentary Math",
                    "effect": "Moderately increases the probability. The SPD has formally resolved to pursue a ban, and a cross-party initiative has passed the 5% Bundestag threshold for initiating a parliamentary vote. However, there is visible opposition from the CDU/CSU leadership and some within the coalition, and public support is low (most Germans oppose a ban). This could make securing the necessary majority for a Bundestag application difficult."
                },
                {
                    "factor": "Legal and Strategic Calculus",
                    "effect": "Slightly decreases the probability. Many legal experts and politicians, including some center-right figures and even some SPD/Green strategists, argue a ban would backfire politically (martyr effect) and is unlikely to succeed in court. Given the high evidentiary bar set by the NPD precedent (the party must not only be anti-constitutional but pose a concrete threat), some may prefer to delay or avoid a premature, likely-to-fail application."
                },
                {
                    "factor": "Time Constraint",
                    "effect": "Slightly decreases the probability. Less than three months remain. While preparations are advanced, and investigative steps are ongoing, the time needed to marshal evidence, secure a parliamentary majority, and file a formal application is short. Delays are possible as parties may want to avoid rushing and risking procedural defeat."
                }
            ],
            "no_scenario": "Despite SPD/Green/Left calls, a Bundestag majority is not secured, or the working group finds the evidence is not yet sufficient. The CDU/CSU and parts of the governing coalition block or delay a vote, citing strategic or legal concerns. The government decides that more time or legal clarity is needed, especially pending the outcome of the AfD's legal challenge to the BfV classification. No application is filed by the end of 2025.",
            "yes_scenario": "The SPD, Greens, and Left, possibly joined by parts of the CDU/CSU or other parties, push through a Bundestag vote (or the federal government or Bundesrat acts). The federal-state working group produces a report arguing the evidentiary threshold has been met. The political calculus shifts in favor of action, perhaps triggered by a new scandal, public unrest, or pressure from civil society. An application is formally filed at the Federal Constitutional Court before January 1, 2026.",
            "final_reasoning": "On balance, while the legal and political groundwork for a ban application is more advanced than ever before, significant hurdles remain. The historical base rate for such filings is very low, and most past attempts have either failed to reach the Court or failed on the merits. Although the BfV's classification and SPD-led initiatives increase the probability, public and political reluctance, the complexity of the legal threshold, and the short time left before the deadline weigh against a filing in 2025. However, the presence of a cross-factional group already meeting the 5% threshold, explicit work by a federal-state group, and mounting public and intra-party pressure mean that a last-minute push is possible, especially if another scandal or political crisis erupts. Overall, my forecast reflects a significant increase from base rates (which would be far below 10%), but not a majority likelihood.",
            "final_probability": 35
        },
        "Sociology (Social Movement Theory)": {
            "time_to_resolution": "About 3 months (until Jan 1, 2026)",
            "perspective_relevance": "Social Movement Theory examines how state actors respond to perceived threats from mobilized political challengers, especially those with mass support and contentious frames. This perspective is critical to understanding the political, legal, and social dynamics influencing whether an application to ban a popular but controversial party like the AfD will be filed.",
            "status_quo": "No formal application to ban the AfD has been filed at the Federal Constitutional Court. Past attempts to ban parties are rare and typically unsuccessful; only two parties have ever been banned in German history, both in the early Federal Republic era.",
            "perspective_derived_factors": [
                {
                    "factor": "Political Opportunity Structure",
                    "effect": "Increases probability. The SPD and some allied parties are actively pushing for a ban, and there is an established federal-state working group preparing the legal groundwork. The BfV has classified AfD as 'confirmed right-wing extremist' (though currently suspended), giving political actors a window of opportunity."
                },
                {
                    "factor": "Legal Precedent and Institutional Barriers",
                    "effect": "Decreases probability. The Constitutional Court has high evidentiary and procedural standards. Previous party ban efforts (e.g., NPD) failed due to insufficient evidence or procedural missteps. Many legal experts and some political leaders argue a ban is unlikely to succeed and could backfire."
                },
                {
                    "factor": "Public Opinion and Backlash Risk",
                    "effect": "Decreases probability. Multiple polls show a majority of Germans oppose a ban, especially in the east. There is widespread concern that a ban would further radicalize AfD supporters, increase their martyrdom narrative, and undermine democratic legitimacy."
                },
                {
                    "factor": "Elite Framing and Intra-Elite Divisions",
                    "effect": "Decreases probability. Key federal actors (e.g., Interior Minister Dobrindt, Chancellor Merz) oppose a ban, arguing for 'governing the AfD out of existence' instead. Without broad elite consensus, it's less likely a formal application will be filed before 2026."
                },
                {
                    "factor": "Escalating Social Mobilization and Perceived Threat",
                    "effect": "Increases probability. Large-scale protests, the radicalization of AfD youth, and high-profile incidents could create a sense of urgency among mainstream parties to move forward, especially if new revelations tie AfD to violence or anti-constitutional activity."
                },
                {
                    "factor": "Judicial and Administrative Timing",
                    "effect": "Decreases probability. The BfV's extremist classification is suspended pending a court ruling, and the fact-finding process is ongoing. The requirement for a solid evidentiary case may delay filing past the Jan 1, 2026 deadline."
                }
            ],
            "no_scenario": "The SPD and allies continue gathering evidence, but intra-elite divisions, public opposition, fear of backlash, and legal risks stall the effort. The working group determines the case is not yet strong enough, and the Bundestag or Bundesrat does not vote to file before the deadline. The BfV's classification remains suspended in court, further delaying proceedings.",
            "yes_scenario": "A major scandal, act of violence, or leaked evidence dramatically increases urgency. The SPD, Greens, and Left push a vote in the Bundestag or Bundesrat, overcoming internal resistance and achieving the required majority. An application is filed before Jan 1, 2026, even if success is uncertain, as a symbolic and preventative act.",
            "final_reasoning": "While there is unprecedented political and legal momentum toward banning the AfD, significant barriers remain. Social Movement Theory suggests state actors are most likely to repress challengers when the perceived threat is acute and elite consensus exists. Here, elite actors are divided, public support is lacking, and legal hurdles are high. The SPD and some allies are preparing the ground, but the process is slow and risk-averse. Unless a triggering event dramatically shifts the calculus, the application is unlikely to be filed before 2026. However, the current level of mobilization and preparation makes the probability non-negligible.",
            "final_probability": 25
        }
    },
    "deliberation_probability": [
        20,
        35,
        35,
        18,
        38,
        18,
        35,
        25
    ],
    "deliberation_mean_probability": 28.0,
    "deliberation_sd": 8.618916073713347,
    "deliberation_probability_result": 28
}