{
    "deliberation_results": {
        "VaticanDiplomacyHolySeeInternationalProtocol": {
            "time_to_resolution": "Less than 4 months (resolves by January 1, 2026; today is September 8, 2025)",
            "perspective_relevance": "As an expert in Vatican Diplomacy and Holy See protocol, I bring an in-depth understanding of the unique logistical, political, and symbolic factors that guide papal travel, particularly regarding pilgrimage destinations, bilateral relations, ecumenical and interfaith priorities, and regional instability in the Middle East. I am trained to look beyond general media speculation and examine the subtle cues in Vatican statements, local Church liaisons, historical precedent, and the Holy See’s risk calculus.",
            "status_quo": "The Pope is planning an official trip to Turkey for the anniversary of the Council of Nicaea in late November, with Lebanon expected to be visited—possibly as part of the same trip. There is significant media and ecclesiastical speculation regarding a Lebanon trip, but no official Vatican announcement about Israel, and the ongoing Gaza war has deeply strained Vatican-Israel relations.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent Papal Precedent (First-Year Papal Visits)",
                    "effect": "Decreases probability. Recent Popes (Francis, Benedict XVI, John Paul II) made either one or no international trips in their first year, focused on major Catholic events or home/neighboring countries. Israel is not an obvious first-year choice, especially against the current backdrop."
                },
                {
                    "factor": "Current State of Vatican-Israel Relations & Gaza War",
                    "effect": "Decreases probability. Relations are tense: repeated papal and Vatican criticism of Israel’s Gaza actions, the bombing of a Catholic parish, and intense humanitarian rhetoric suggest a visit would be diplomatically fraught and could be seen as legitimizing Israeli policy during ongoing conflict."
                },
                {
                    "factor": "Papal Commitment to Peace and Christian Minorities",
                    "effect": "Increases probability modestly. The Pope has consistently emphasized his concern for Christian communities in the Holy Land and peace in the region. A dramatic gesture—such as a papal pilgrimage for peace—cannot be wholly excluded, especially if significant diplomatic groundwork quickly improves conditions."
                },
                {
                    "factor": "Security and Logistical Constraints",
                    "effect": "Decreases probability. Large-scale public papal events in Israel would present major security challenges currently, and the Vatican is traditionally risk-averse in actively war-torn contexts (Gaza, West Bank)."
                },
                {
                    "factor": "Current Club of Rumored Destinations",
                    "effect": "Decreases probability. Vatican and media leaks, plus statements from Lebanese and Turkish Church officials, focus overwhelmingly on Turkey and Lebanon; there is no solid reporting of logistical groundwork for an Israel trip."
                },
                {
                    "factor": "Protocol and Symbolic Value of Visit",
                    "effect": "Slightly increases probability. Should the war cease, or if there were a breakthrough (e.g., large-scale hostage release, humanitarian agreement), the Pope could insert an Israel stop as an urgent peacemaking gesture or to stand in solidarity (e.g., a prayer at Jerusalem’s holy sites). But this would require extraordinary circumstance."
                }
            ],
            "no_scenario": "Pope Leo XIV completes his planned trips to Türkiye (Council of Nicaea) and Lebanon but does not set foot in Israel on an official visit. Diplomatic relations remain tense due to the ongoing Gaza war, with the Vatican continuing to press for peace through statements and high-level meetings (e.g., with Herzog in Rome), but no logistical or symbolic justification for a papal trip to Israel materializes within 2025.",
            "yes_scenario": "A sudden breakthrough in the Gaza crisis occurs: e.g., a permanent ceasefire is reached and/or large-scale release of hostages, after which the Vatican rapidly organizes an official papal visit to Israel to consolidate peace, restore Christian confidence, and affirm interfaith dialogue. The Papal visit could also be triggered if Christian holy sites are especially threatened or restored access is secured (e.g., pilgrimage to the Church of the Holy Sepulchre with Israeli and Palestinian leaders).",
            "final_reasoning": "The base rate for Papal visits to Israel, especially in the first year of a pontificate, is very low: most recent Popes have waited at least a year, if not several, and only traveled to Israel under conditions of relative peace, interfaith outreach, or major historic events (e.g., John Paul II in 2000, Francis in 2014). Current events make a visit logistically, diplomatically, and symbolically hazardous: 1) Ongoing war and humanitarian crisis in Gaza, 2) Tense Vatican-Israel relations as evidenced by direct papal criticism and the negative fall-out from the Gaza parish bombing, 3) All credible Vatican-watchers and local Church authorities point only to Turkey and Lebanon for 2025, not Israel; 4) Papal protocol prefers to avoid politicization of visits—appearing in Israel before major breakthroughs could be interpreted (by either side) as legitimizing or condemning one party, a situation Rome assiduously avoids; 5) Security concerns make an open, public apostolic visit to Israel in 2025 extremely unlikely unless the security environment rapidly improves. While the Pope has a strong interest in peace and the safety of Holy Land Christians, the probability he will visit Israel in an official state capacity before January 1, 2026 remains low and would require transformative developments in the region. Accordingly, while not zero, my probability is strongly weighted toward 'no'.",
            "final_probability": 8
        },
        "InternationalRelationsPracticeStateVisitPlanningStandards": {
            "time_to_resolution": "About 4 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in International Relations Practice (State Visit Planning Standards), I have deep understanding of the diplomatic protocols, risk assessment procedures, and geopolitical calculus that influence Papal travel. I am attuned to the extraordinary complexity of Papal visits to flashpoint regions, the behind-the-scenes planning and preconditions concerning security, host government relations, and the symbolic/pastoral impact. Analyzing official and semi-official communications and comparing historical precedent allows me to filter speculation from feasible diplomatic plans, especially in volatile conflict zones like Israel.",
            "status_quo": "No Papal visit to Israel has been announced or confirmed for 2025. Relations between the Holy See and Israel are tense due to disagreements over Gaza, attacks on Christian sites, and ongoing political instability.",
            "perspective_derived_factors": [
                {
                    "factor": "Historical base rates for first-year Papal international travel",
                    "effect": "Decreases probability. Recent Popes typically make zero or one international trips in their first year, and rarely to conflict zones or to Israel unless there's a major event or peace breakthrough."
                },
                {
                    "factor": "Current Security and Political Situation in Israel and the Holy Land",
                    "effect": "Strongly decreases probability. Active war in Gaza, attacks on Christian sites, and instability create major security risks, making a visit unlikely to receive necessary Vatican approval."
                },
                {
                    "factor": "Recent Vatican-Israel Diplomatic Engagement",
                    "effect": "Slightly increases probability. The recent high-level meeting between Pope Leo XIV and President Herzog reflects ongoing dialogue and Vatican pastoral concern, but such talks are typical and do not usually preface a Papal visit absent major new outreach or invitation."
                },
                {
                    "factor": "Public Papal Statements and Policy",
                    "effect": "Decreases probability. Pope Leo XIV has been consistently critical of Israeli actions in Gaza and is actively calling for a ceasefire. Scheduling a visit to Israel in such a context would risk misinterpretation and is diplomatically problematic."
                },
                {
                    "factor": "Papal Travel Calendar and Competing Priorities",
                    "effect": "Decreases probability. All credible reporting centers on imminent Papal visits to Turkey (Council of Nicaea) and, possibly, Lebanon, with no indications or planning evident for an Israeli leg."
                },
                {
                    "factor": "Historical Precedent of Papal Visits to Israel amid Hostilities",
                    "effect": "Strongly decreases probability. Though Popes have visited Israel before, none have done so amid an ongoing major military conflict, particularly when Christian sites are being damaged. Normally, a visit occurs post-conflict to support peace agreements."
                },
                {
                    "factor": "Symbolic and Pastoral Motivation",
                    "effect": "Does not significantly move probability. While Pope Leo XIV has a clear commitment to Middle East peace, the pastoral and interfaith symbolism would require a stabilized situation for such a visit."
                }
            ],
            "no_scenario": "Pope Leo XIV continues engaging with Israeli and Palestinian leaders through Vatican diplomatic channels and public statements. He visits Turkey for the Council of Nicaea commemoration and potentially stops in Lebanon for a show of solidarity, but does not visit Israel due to active hostilities, risks to Christian communities, and the lack of a breakthrough on peace or hostages. No preparatory Vatican or Israeli logistical moves for a state visit to Israel are made or announced.",
            "yes_scenario": "An unexpected, rapid reduction in hostilities in Gaza occurs (such as a durable ceasefire or peace deal by late 2025), with significant de-escalation in settler violence against Christians and substantive progress on Israeli-Vatican relations. Israel and the Vatican send strong signals—via official invitations and joint planning—leading the Pope to add Israel as a symbolic and reconciliatory leg to a Near East trip, possibly close to the Turkey visit or around Christmas, to encourage peace and protect Christian holy sites. Security conditions must allow for proper state visit protocol, and the Vatican must see clear pastoral and diplomatic purpose beyond mere crisis response.",
            "final_reasoning": "Base rates and precedents suggest travel to Israel by a newly elected Pope in his first year is highly unusual, particularly absent a clear peace process or symbolic event. The security/political situation is acutely unfavorable, with war ongoing in Gaza, diplomatic tensions between the Holy See and Israel, and recent attacks on Christian sites. All official indicators and leaks emphasize Turkey and Lebanon as likely destinations, with only vague Vatican watcher speculation about Israel. No preparatory actions or formal invitations have been noted. The only scenario supporting a Yes outcome is an unlikely and rapid de-escalation that dramatically shifts the diplomatic landscape. Thus, given (i) the base rate, (ii) the active military conflict, and (iii) the lack of any preparatory or official signals for an Israel visit, the chances are very low.",
            "final_probability": 5
        },
        "PoliticalScienceDiplomaticRelationsTheory": {
            "time_to_resolution": "Approximately 3 months and 3 weeks (until January 1, 2026)",
            "perspective_relevance": "As an expert in Political Science, with a specialization in Diplomatic Relations Theory, I focus on how international events, church-state dynamics, and conflict diplomacy shape the likelihood of papal state visits. Papal visits—especially to contentious regions—are deeply rooted in both diplomatic signaling and religious/pastoral motivations. My expertise allows for nuanced assessment of when such visits promote mediation, reconciliation, or are deterred by security and diplomatic risks.",
            "status_quo": "Recent Popes have made few international trips in their first year, and there is no confirmed plan or Vatican communication for a papal visit to Israel. The status quo is that the only publicly discussed trips for Pope Leo XIV are to Türkiye (for the Nicaea Council anniversary) and potentially Lebanon, not Israel.",
            "perspective_derived_factors": [
                {
                    "factor": "Ongoing Israel-Gaza war and regional instability",
                    "effect": "Decreases probability. Active conflict zones pose major security and diplomatic risks for high-profile visits, especially from the pope, who is a global religious figure and would require unprecedented protection. The situation could destabilize further, making a visit nearly impossible logistically and politically."
                },
                {
                    "factor": "Holy See–Israel diplomatic relations and recent papal diplomacy",
                    "effect": "Slightly decreases probability. Relations are strained due to the Vatican's criticism of the Israeli Gaza offensive and the bombing of a Catholic parish in Gaza. The Pope met Herzog in Rome (Vatican) instead of Jerusalem/Tel Aviv, suggesting high-level engagement is being conducted at arm’s length, not on Israeli soil."
                },
                {
                    "factor": "Precedents set by previous popes in their first year",
                    "effect": "Decreases probability. Historical base rate: Recent popes (Francis, Benedict XVI, John Paul II) made either one international trip or none in their first year, and never to a politically fraught, active conflict zone like Israel/Gaza during war."
                },
                {
                    "factor": "Papal travel priorities: ecumenical milestones and support to Christian communities",
                    "effect": "Neutral or slightly positive. Visits aligned with major Christian anniversaries (e.g., Council of Nicaea in Türkiye) and support for embattled Christian communities (e.g., possible Lebanon trip) are prioritized. Israel is the historic Holy Land, but no major Catholic anniversary coincides in 2025, and local Christian communities are primarily Orthodox or Eastern Catholic."
                },
                {
                    "factor": "International diplomatic context and personalistic papal diplomacy",
                    "effect": "Neutral or slightly negative. While Pope Leo XIV has demonstrated willingness for proactive outreach (e.g., personally inviting Herzog to the Vatican), diplomatic mediation is more commonly and safely conducted in Rome. There is no mention in international or Vatican calendars of an Israeli visit, and current climate would make such a move diplomatically explosive."
                },
                {
                    "factor": "Vatican’s stance as spiritual mediator and public calls for peace",
                    "effect": "Neutral. The Vatican’s calls for peace, two-state solution, and release of hostages generate press attention but do not necessarily translate into state visits to conflict areas, especially without a clear invitation or conditions for positive diplomatic impact."
                }
            ],
            "no_scenario": "The pope attends the Council of Nicaea anniversary in Türkiye in late November, possibly stops in Lebanon (where planning is under way and a visit is widely anticipated), and returns to Rome without any visit to Israel. The escalating Gaza situation, tense Holy See–Israel relations, and volatile security environment convince the Vatican not to include Israel in the itinerary. Diplomatic contacts with Israeli and Palestinian leaders continue in the Vatican or via special envoys, but a papal visit to Israeli territory is deemed too risky and politically fraught. The Vatican issues strong statements for peace but does not travel to Israel.",
            "yes_scenario": "Significant de-escalation of the Israel-Gaza conflict, major diplomatic overture by both the Israeli government and Palestinian Authority—perhaps tied to a breakthrough on humanitarian aid or a ceasefire—creates a fleeting window for the pope to travel to Israel for a high-profile prayer or reconciliation event. Security concerns are sufficiently mitigated and the Vatican, wanting to send a powerful signal of peace and solidarity with local Christian communities, adds a carefully controlled visit to Israel at the last minute. This would likely be highly publicized and justified on spiritual and peacebuilding grounds.",
            "final_reasoning": "All available evidence—news reporting, Vatican signals, base-rate historical precedent, and the current security and diplomatic environment—points to a very low probability that Pope Leo XIV will make a state visit to Israel before January 1, 2026. There is no official or even unofficial Vatican communication indicating planning for an Israeli trip, whereas multiple sources indicate advanced preparations for trips to Türkiye and Lebanon. Israel is an important site for world Christianity, but the extreme unrest, recent wartime church damage, and sensitive Vatican-Israel relations deter a high-profile visit. Given that recent popes have not set precedent for early, high-risk international travel, and with ongoing violence and lack of a peace breakthrough, the forecast must remain low, but not zero—allowing some room should a diplomatic or symbolic event open an unexpected, safe, and diplomatically beneficial window for a papal visit.",
            "final_probability": 6
        },
        "PoliticalScienceSoftPowerTheory": {
            "time_to_resolution": "Approximately 3 months and 3 weeks (until January 1, 2026)",
            "perspective_relevance": "As an expert in Political Science with a focus on Soft Power Theory, my forecasting approach centers on how Vatican diplomacy leverages symbolic acts—like papal state visits—as instruments of soft power to shape international perceptions, facilitate mediation, and reinforce the Church’s global moral authority, especially in conflict-affected regions such as Israel/Palestine. These visits are calculated moves, balancing pastoral outreach with the Church’s reputation, global influence, and ability to maintain constructive relations with all local communities.",
            "status_quo": "As of early September 2025, there is no official Vatican confirmation or concrete planning of a papal state visit to Israel by Pope Leo XIV. Recent papal-Vatican engagement with Israeli leadership (notably the Herzog visit to the Vatican) has been frequent and high-profile, but only rumors or suggestions, not actual trip planning, pertain to an Israel visit. The only publicly reported papal trips with strong planning signals are to Türkiye (for the Nicaea anniversary) and likely Lebanon.",
            "perspective_derived_factors": [
                {
                    "factor": "Regional Security and Political Context",
                    "effect": "Decreases probability. The ongoing Gaza war, allegations against Israeli leadership at the ICC for war crimes, and strained Holy See-Israel relations after Church-targeted violence make a visit highly controversial and logistically risky."
                },
                {
                    "factor": "Vatican Diplomatic Priorities and Track Record",
                    "effect": "Decreases probability. Recent popes rarely travel to multiple volatile areas in their first year. Both Francis and Benedict made only one major international trip early in their pontificates—neither to active conflict zones. Under current patterns, Lebanon and Türkiye are prioritized."
                },
                {
                    "factor": "Soft Power Utility of a Visit",
                    "effect": "Mixed, but net decreases probability. While a papal visit would offer a chance to signal peace-building or support embattled Christian communities, such high visibility could backfire, appearing as endorsement of a government accused of humanitarian abuses or destabilizing local Christian-Palestinian positions. The soft power payoff is questionable in the current context."
                },
                {
                    "factor": "Recent Diplomatic Engagements",
                    "effect": "Decreases probability. The Herzog visit—where the Pope invited the Israeli president to the Vatican, breaking with protocol—shows the Holy See using Rome as a neutral venue for dialogue. This may be a substitute for, not a prelude to, a papal trip to Israel."
                },
                {
                    "factor": "Christian Community Security and Pastoral Justification",
                    "effect": "Decreases probability. With recent violence against Catholic facilities in Gaza and widely acknowledged risks for Christian Palestinians, security concerns and pastoral optics are unfavorable. Local patriarchs describe dialogue as impossible and warn against overt political actions."
                },
                {
                    "factor": "International and Local Reception Cycles",
                    "effect": "Decreases probability. A papal visit to Israel could be perceived as controversial among Catholics, Muslims, and Jews globally at this tense moment, and may upset fragile diplomatic balances among Israel, Palestine, and neighboring states."
                }
            ],
            "no_scenario": "Pope Leo XIV completes the planned state visits to Türkiye and Lebanon, focusing on ecumenism, Christian unity, and support for Lebanon’s multi-confessional character. In-person engagement with Israeli and Palestinian leaders is limited to neutral venues (the Vatican, regional synods, etc.), with no official announcement, planning steps, or logistical moves toward a papal visit to Israel before January 1, 2026.",
            "yes_scenario": "Despite risks and controversy, the Vatican, under international mediation efforts or at the request of both Israeli and high-level local Church authorities, organizes a symbolic 'peace mission' or pilgrimage by Pope Leo XIV to Israel—possibly Jerusalem—before year's end. The visit is framed as neutral, focused on universal calls for peace, protection of holy sites, and support for embattled Christians. Unprecedented security guarantees are arranged, and the trip is justified as a bold soft-power initiative to catalyze negotiations or offer humanitarian relief.",
            "final_reasoning": "The combination of soft power logic, recent papal precedent, and the deteriorating situation in Israel/Palestine strongly weighs against a papal state visit to Israel in 2025. The Vatican is highly sensitive to perceptions; a visit now, amid active hostilities, ICC/ICJ proceedings, and after attacks on Catholic institutions in Gaza, risks undermining the Church’s credibility and alienating some Catholic and Muslim constituencies. All credible signals point to late-2025 visits to Türkiye (Nicaea council anniversary) and Lebanon (with broad symbolic and pastoral justification), not Israel. The Herzog meeting in Rome appears to be the Vatican’s preferred method for soft-power signaling and diplomatic engagement, replacing the need for fraught travel. Furthermore, base rates show papal state visits to Israel are infrequent, usually not during war, and not in a pope’s first year. Absent evidence of active Vatican planning, public confirmation, or direct signals—none of which currently exist—the most compelling, base-rate aligned forecast is that Pope Leo XIV will not make a state visit to Israel before January 1, 2026.",
            "final_probability": 7
        },
        "ReligiousStudiesInterfaithDialogueScholarship": {
            "time_to_resolution": "Approximately 4 months (until January 1, 2026)",
            "perspective_relevance": "As a Religious Studies expert specializing in Interfaith Dialogue Scholarship, I bring a nuanced understanding of Vatican diplomacy, ecumenical and interreligious priorities, as well as the symbolic and political risks of papal travel to conflict zones. The perspective helps interpret the signals in Catholic–Jewish relations, the Pope’s priorities for Christian communities, and the practicalities of high-profile papal visits involving Israel’s religious and political climate.",
            "status_quo": "The Pope has not (as of September 2025) announced or carried out a state visit to Israel. His scheduled and suggested trips for 2025 focus on Türkiye (confirmed) and Lebanon (highly probable/prepared). Speculation continues about Israel, with some sources noting only conjecture and no substantive Vatican or Israeli preparations for such a visit.",
            "perspective_derived_factors": [
                {
                    "factor": "Base Rate of First-Year Papal Visits to Israel (Historical Precedent)",
                    "effect": "Decreases probability. No pope in recent history has chosen Israel as a destination for their first international or even early papal trip. Recent popes averaged only one or no visits in their first year, and Israel is not a typical inaugural destination."
                },
                {
                    "factor": "Current Israel–Vatican Relations Amid Gaza War",
                    "effect": "Decreases probability. Relations are tense, characterized by the Pope’s repeated criticisms of Israel’s actions in Gaza, the July Catholic parish bombing, and heightened Vatican calls for ceasefire and humanitarian law. The diplomatic situation is highly sensitive, with both sides walking a careful line, but no sign of readiness for a state visit."
                },
                {
                    "factor": "Priority of Visits to Christian/Humanitarian Crisis Areas",
                    "effect": "Increases probability slightly. Papal visits often focus on local Christian communities under threat, and a visit could signal solidarity. However, Lebanon (with its large Maronite population and historic ties) is more typical for such outreach. Gaza and West Bank Christians are under extreme duress, but a visit to Israel would be interpreted as a major political act, not just pastoral."
                },
                {
                    "factor": "Vatican’s Ecumenical and Interfaith Agenda",
                    "effect": "Decreases probability. The November trip to Türkiye is ecumenical (anniversary of Council of Nicaea), aligning with expected papal priorities for first trips—Orthodox, Muslim-Christian dialogue. There is no clear impetus for a similar-level Jewish–Christian event in Israel in this papacy’s opening months."
                },
                {
                    "factor": "Security and Logistical Constraints of a Visit to Israel",
                    "effect": "Decreases probability. The continuing Gaza conflict, tensions on the northern borders (Lebanon/Hezbollah), and the risk to the papal entourage and pilgrims make such a trip highly unlikely on practical grounds, particularly in the current climate."
                },
                {
                    "factor": "Speculation in Media and Among 'Vatican Watchers'",
                    "effect": "Marginally increases probability, but weak signal. While speculation exists, there is no indication of diplomatic preparations, coordination, or local Church mobilization—a usual sign of actual planning."
                }
            ],
            "no_scenario": "Pope Leo XIV visits Türkiye and Lebanon as planned, focusing on ecumenical celebration with Orthodox leaders and a message of hope to Lebanon's suffering Christians. The Pope continues to speak out for peace in Israel-Palestine, meets regional leaders in Rome or through envoys, but no state visit to Israel is scheduled or undertaken in 2025.",
            "yes_scenario": "A dramatic diplomatic breakthrough occurs late in 2025: A ceasefire in Gaza holds, Israel's government signals willingness, and the Vatican leverages a window for a rapid visit to Jerusalem or Nazareth. Preparations materialize rapidly in response to momentum for direct interfaith peace appeals or protection for Christian holy sites, resulting in a state visit before January 1, 2026.",
            "final_reasoning": "All strong signals point against a state visit to Israel by Pope Leo XIV before January 2026. The base rate of early papal travel to Israel is very low, and at no point in the last several decades has a pope chosen Israel for a first-year visit. The Gaza War, ongoing casualties, strained Vatican–Israel relations, and the Vatican’s own focus on Türkiye (confirmed) and Lebanon (highly probable) further constrain the odds. Though the Pope's recent audience with President Herzog was notable, there is no evidence of concrete planning, and the logistics and optics of a visit are poor in the midst of open conflict and diplomatic tension. Small possibility remains in case of a surprising political breakthrough, but with no preparation or trail of local Church or government groundwork, it remains remote.",
            "final_probability": 5
        },
        "MiddleEastStudiesArabIsraeliConflictAnalysis": {
            "time_to_resolution": "Approximately 3.5 months (question resolves January 1, 2026; today is September 8, 2025)",
            "perspective_relevance": "As an expert in Middle East Studies and Arab-Israeli conflict analysis, I bring an understanding of the political, religious, and diplomatic factors affecting Vatican-Israel relations—especially under crisis conditions in Gaza. This expertise allows nuanced evaluation of public diplomacy, sensitivities around Jerusalem, security risks, and the impact of ongoing conflict on high-level international visits.",
            "status_quo": "No recent Pope has visited Israel within their first year, especially amidst active conflict. The default scenario is that the Pope does not make a state visit to Israel in 2025.",
            "perspective_derived_factors": [
                {
                    "factor": "Historical Papal Travel Patterns",
                    "effect": "Decreases probability. Recent Popes rarely make more than one or two foreign trips in their first year, and never more than one Middle Eastern state visit so soon after election."
                },
                {
                    "factor": "Current Gaza Conflict and Israeli Actions",
                    "effect": "Strongly decreases probability. The war in Gaza is at its peak, with fresh accusations against Israel at the ICC and ICJ, continued high civilian casualties, and severe tensions over attacks on Christian sites. It is diplomatically and practically hazardous for a papal state visit to Israel at this time."
                },
                {
                    "factor": "Recent Papal Statements and Diplomatic Engagement",
                    "effect": "Neutral to slightly increases probability. The Pope has engaged directly with President Herzog, but this dialogue is framed by critiques of Israeli policy, not by a warm or reconciliatory context ideal for a state visit. The opening of dialogue could lay groundwork, but for future, not immediate, travel."
                },
                {
                    "factor": "Precedent of High-profile Visits Amid Conflict",
                    "effect": "Decreases probability. While Popes have visited conflict regions (Iraq, Lebanon), these were during less internationally volatile moments, or after conflict abated. Past visits to Israel have generally occurred under relatively more stable conditions."
                },
                {
                    "factor": "Internal Vatican and Local Church Agendas",
                    "effect": "Neutral. Jerusalem is symbolically vital, and the Latin Patriarch and papal press are engaged with Israeli-Palestinian issues—but local Church leaders have described papal invocations as slogans not matched by action, underlining constraints."
                },
                {
                    "factor": "Security and Logistical Challenges",
                    "effect": "Strongly decreases probability. The safety of a papal visit cannot be ensured given the possibility of attacks, especially in Jerusalem and the West Bank. Israel's own government is facing instability and global opprobrium. Any visit would have to be tightly coordinated—highly unlikely under current circumstances."
                },
                {
                    "factor": "Competing Priorities: Lebanon and Türkiye",
                    "effect": "Decreases probability. All news coverage and official leaks point to Lebanon (possibly in conjunction with Türkiye) as the clear travel priorities for the papacy's first Middle East state visits."
                }
            ],
            "no_scenario": "Pope Leo XIV limits his 2025 travels to Lebanon, Türkiye, or safer third countries; his engagement with Israel remains via diplomatic channels, statements, or possible future plans once the Gaza war abates and regional security improves. The ongoing war, safety concerns, and Vatican-Israel strains preclude any official visit.",
            "yes_scenario": "A rapid and unexpected ceasefire or major diplomatic breakthrough prompts the Pope to accept or initiate a visit to Jerusalem, either after a stop in Lebanon/Türkiye or as a surprise gesture of reconciliation. Security is guaranteed, Christian leaders on the ground welcome the move, and a highly symbolic itinerary (Holy Sepulchre, Yad Vashem, official meetings in Jerusalem) is rapidly arranged to send a message of hope and dialogue. This would likely depend on major positive developments in Israeli-Palestinian relations, currently not visible.",
            "final_reasoning": "Base rates for papal state visits to Israel in a first year are extremely low, especially in wartime. Current news offers no concrete suggestion of a planned 2025 papal visit to Israel, despite the prominent diplomatic encounter with President Herzog. The context between the Vatican and Israel is diplomatically tense, security is extremely poor, and logistics daunting. Rhetorical, moral, and diplomatic engagement is at a high, but material signals (preparations, leaks, Church logistics) point to Lebanon (and Türkiye) as the only realistic regional stops for the Pope in 2025. An Israel trip would require a dramatic and unforeseen improvement in the conflict situation. My estimate, integrating all factors as a Middle East and Arab-Israel conflict expert, is that a visit to Israel by Pope Leo XIV in 2025 is exceedingly unlikely barring an abrupt and improbable diplomatic breakthrough.",
            "final_probability": 5
        }
    },
    "deliberation_probability": [
        8,
        5,
        6,
        7,
        5,
        5
    ],
    "deliberation_mean_probability": 6.0,
    "deliberation_sd": 1.2649110640673518,
    "deliberation_probability_result": 6,
    "group_results": {
        "VaticanDiplomacyHolySeeInternationalProtocol": {
            "forecaster_to_engage": "PoliticalScienceSoftPowerTheory",
            "response_type": "critique",
            "response": "Your argument about the Vatican's soft power signaling is largely sound, but you subtly overstate the extent to which papal audiences (like the Herzog meeting in Rome) are a true substitute for the unique impact and symbolic resonance of a Holy Land state visit. The simple truth is that, were a ceasefire or breakthrough to occur, no amount of prior papal meetings could rival the global shockwave of an active papal pilgrimage—even at short notice—and the Vatican would have protocol and infrastructure to move swiftly if such a moment arose. Furthermore, you downplay the capacity of the Holy See to act disruptively if it wanted to, citing the risks but not the sometimes radical nature of Catholic peacemaking. Your forecast lands in the right range, but by drawing too sharp a line under 'absent evidence of planning or public confirmation', you ignore the Vatican's long track record of sudden, high-stakes deployments when political or ecumenical opportunity knocks. Don't confuse the current Vatican preference for caution with an iron law."
        },
        "InternationalRelationsPracticeStateVisitPlanningStandards": {
            "forecaster_to_engage": "ReligiousStudiesInterfaithDialogueScholarship",
            "response_type": "defense",
            "response": "This forecast is particularly sharp on two often-neglected pillars: the deep base rate (no pope has chosen Israel for a first-year trip in the modern era) and the on-the-ground reality that the optics and practicalities of a state visit during war are prohibitive for both spiritual and political reasons. While some might waffle about symbolic breakthroughs, you correctly argue that neither Church communications nor local groundwork show any traction for even the most unusual diplomatic moves. Speculating about a surprise peace deal is little more than tail risk management—the overwhelming bulk of evidence places the odds near zero. As such, your probability estimate is more convincing than those suggesting nuance could produce a different outcome absent truly seismic change."
        },
        "PoliticalScienceDiplomaticRelationsTheory": {
            "forecaster_to_engage": "MiddleEastStudiesArabIsraeliConflictAnalysis",
            "response_type": "critique",
            "response": "Your analysis gives due emphasis to the overwhelming influence of wartime conditions and diplomatic tensions, but it needs more direct engagement with the distinct logic of papal visits—especially as a diplomatic wildcard. Security and logistics are daunting, yes, but you treat them as if they are absolute constraints, ignoring the history of papal visits to conflict-prone regions (think John Paul II to Sarajevo, Francis to Iraq). You also dismiss too easily the Vatican’s established diplomatic protocols for rapid deployment when the symbolism would serve a higher cause. Additionally, your focus on Church and government 'preparations' overlooks the Vatican’s penchant for opacity and last-minute announcements in extraordinary situations. The forecast should reflect a small but very real tail risk for disruptive papal diplomacy, not round off to practical impossibility. Don’t let regional analysis crowd out the policy unpredictability that the Vatican sometimes relishes."
        },
        "PoliticalScienceSoftPowerTheory": {
            "forecaster_to_engage": "InternationalRelationsPracticeStateVisitPlanningStandards",
            "response_type": "critique",
            "response": "You put too much faith in proceduralism and the sluggish inertia of state visit bureaucracy. Sure, papal trips normally require months of choreography, but if there’s one institution that knows how to move fast when the soft power stakes are high, it’s the Vatican. Papal precedent isn't just about base rates in staid times—it includes disruptive acts when the Church senses the world’s attention (think: John Paul II's surprise pilgrimage to Cuba, Francis’s visits to migrant camps or war zones). By writing off Israel as simply a no-go due to diplomatic and security 'unfavorability,' you miss how a sudden, staged peace gesture or a negotiated opening—even one seemingly coming from left field—could flip Church priorities overnight. The Vatican is not a ministry of foreign affairs bound by the timetable logic you impose; it is a religious-political actor that thrives on the judo of moral surprise. Your focus is too narrow, overly static, and underestimates the Vatican’s appetite for risk in rare, world-historical moments."
        },
        "ReligiousStudiesInterfaithDialogueScholarship": {
            "forecaster_to_engage": "VaticanDiplomacyHolySeeInternationalProtocol",
            "response_type": "defense",
            "response": "Your forecast stands out for grasping the complex choreography required for even a possibility of a papal state visit to Israel. You don’t get lost in romanticizing papal 'wildcards'—you recognize that the Vatican has a hard-won caution after decades of diplomatic strain, particularly with Israel, and that adjusting protocol isn’t just a matter of snapping fingers in the face of war. While others want to inflate remote 'disruptive moment' tail risks, you anchor probabilities to history: popes haven’t gone to Israel in volatile, first-year contexts, and every unofficial Vatican signal is red-light, not green. Also, you wisely factor how the Vatican avoids letting itself become a political tool or appearing to reward belligerence—scenarios where the symbolism of a visit could be as damaging as its absence. You’re right: unless we see not just a ceasefire but also a true reconciliation pivot and multilateral invitation, it’s as near to a no as any high-profile international papal trip gets."
        },
        "MiddleEastStudiesArabIsraeliConflictAnalysis": {
            "forecaster_to_engage": "PoliticalScienceDiplomaticRelationsTheory",
            "response_type": "critique",
            "response": "You do a fine job assembling the historical base rate, regional instability, and general diplomatic logic. But your framing is too 'analyst in a think tank'—heavy on incremental probabilities, not enough weight to the unique leverage a papal visit sometimes exerts or the Vatican’s appetite for world-stage drama when conditions allow. Your focus on absence of current planning is fair, but even you hedge on a 'safe and diplomatically beneficial window,' as though a papal visit is just a technocratic input/output function. In reality, the Vatican is sometimes willing to force an opening or inject itself past the normal tide of events for religious or symbolic impact—especially in the Middle East, where pilgrimages and sudden outreach moves have disproportionate resonance. You're treating the current war as a binary on-off rather than a climate in which Vatican risk calculus could shift suddenly. Yes, the odds are low, but they're defined both by practicalities and by the Vatican’s penchant for unpredictability, which your forecast gives too little credit."
        }
    },
    "revision_results": {
        "VaticanDiplomacyHolySeeInternationalProtocol": {
            "my_phase1_final_probability": 8,
            "reasoning_for_revised_probability": "Most peer forecasts align closely with my original assessment, clustering in the 5-8% range, with strong consensus across diplomacy, political science, regional, and interfaith expertise that a papal state visit to Israel in 2025 is extremely unlikely barring an exceptional, unanticipated breakthrough in the Gaza war. The only substantial challenge from deliberation—addressing the Vatican’s capacity for abrupt, disruptive peacemaking—does not sufficiently outweigh the overwhelming evidence (historical precedent, security realities, lack of signals or logistics) that such a move is profoundly improbable in the current environment. No new information from peers suggests I underweighted any plausible scenario for a visit, nor did anyone provide credible signals missing from my initial calculation. Therefore, I maintain my prior probability.",
            "revised_probability": 8
        },
        "InternationalRelationsPracticeStateVisitPlanningStandards": {
            "my_phase1_final_probability": 5,
            "reasoning_for_revised_probability": "After group deliberation and closely reviewing the arguments—especially those highlighting (1) the very low base rate of first-year papal travel to Israel under conflict conditions, (2) the total absence of evidence for groundwork or formal Vatican or Church logistical activity toward an Israel state visit, and (3) extremely unfavorable security and diplomatic environments—I see no new compelling reason to materially revise my already low estimate. Critiques from the group emphasized the Vatican's ability to act disruptively under unique circumstances, but all concur that only an extraordinarily unlikely and sudden diplomatic breakthrough would prompt such movement, and there is still absolutely no indication of it. Even generous accounting for 'tail risks' does not justify adjusting upward. My view remains that the probability is at the lowest end of plausible nonzero estimates.",
            "revised_probability": 5
        },
        "PoliticalScienceDiplomaticRelationsTheory": {
            "my_phase1_final_probability": 6,
            "reasoning_for_revised_probability": "After reviewing group deliberation—especially the strong consensus among forecasters from multiple relevant domains that base rates, security, optics, and lack of Vatican preparation all point squarely against a papal state visit to Israel in 2025—I find even my cautious allowance for tail-risk was, if anything, slightly generous. However, critiques within the group discussion highlighted the Vatican's potential, if highly unlikely, for disruptive or last-minute diplomacy in extraordinary circumstances. Still, the practical and reputational barriers have grown steeper: with no material signals for logistical groundwork, and no change in the conflict dynamic, the risk of sudden reversal remains extremely low but not zero. Most other credible estimates are clustered around 5–8%. Thus, I am not revising my probability—instead, this deliberation increases my confidence in the original forecast, as the consensus aligns closely with my own analysis, and no game-changing contrary evidence or argument emerged.",
            "revised_probability": 6
        },
        "PoliticalScienceSoftPowerTheory": {
            "my_phase1_final_probability": 7,
            "reasoning_for_revised_probability": "Upon reviewing the group deliberation, several points moderate—but do not dramatically shift—the initial 7% probability. Critiques argue that I may have underplayed both the Vatican's capacity and historic tendency for rapid, disruptive diplomacy (including sudden visits to conflict areas) and its willingness, in rare cases, to act in service of major peacemaking gestures. While security, optics, and diplomatic precedent all point overwhelmingly against a papal state visit to Israel in 2025, genuinely disruptive, tail-risk diplomacy—though deeply unlikely—cannot be entirely excluded. However, neither new evidence nor consensus argumentation drastically alters the most likely trajectory: there are still no concrete signals of preparation or intent, regional conditions remain highly unfavorable, and historical base rates support a 'No'. Allowing slightly more space for a black swan scenario, I will inch my probability up to reflect this insight, but I remain firmly in the single-digit likelihood range.",
            "revised_probability": 9
        },
        "ReligiousStudiesInterfaithDialogueScholarship": {
            "my_phase1_final_probability": 5,
            "reasoning_for_revised_probability": "After a careful review of the group deliberation, my view remains fundamentally unchanged. All participating forecasters place the probability in the ultra-low single digits, strongly emphasizing the rarity (if not near impossibility) of an inaugural-year papal state visit to Israel in a context of active war, strained Vatican-Israel relations, and clear Vatican focus on Turkey and Lebanon. While it is acknowledged (both in my argument and by informed critics/defenders in the group) that the Vatican is sometimes capable of radical and rapid diplomatic action, the absence of any planning signals, unprecedented logistical hurdles, and the lack of any movement within the Church or Israeli authorities reinforce the base rate. The debate reaffirms the tail risk is, if anything, overstated by those warning of a wildcard event. No new evidence or argument justifies moving my probability upward or even further downward. 5% accurately captures the very remote, but not absolutely zero, chance of a disruptive reconciliation scenario—but the clear bulk of probability mass is weighted firmly for 'No.'",
            "revised_probability": 5
        },
        "MiddleEastStudiesArabIsraeliConflictAnalysis": {
            "my_phase1_final_probability": 5,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I note that all forecasters converge on a very low probability, with estimates clustering between 5-8%. The critiques emphasize that while the base rate and conditions are overwhelmingly negative, we should acknowledge a small but not negligible tail risk, stemming from the Vatican's propensity for moral drama, last-minute decisions, and potentially disruptive diplomacy if the right (albeit extremely unlikely) window appears. However, no forecaster presented evidence or institutional precedent that would shift the main constraints: war, Vatican-Israel strain, and lack of preparation. I agree that security/logistics are not hard absolutes, but none of the deliberators credibly countered the fact that not only is there no momentum for such a visit, but all Vatican action and signaling point elsewhere (Turkey, Lebanon). The probability should therefore remain extremely low, with at most a marginal upward nudge for tail risk/opacity, but the difference is within the margin of error. I will slightly revise upward to reflect this, but only from 5% to 6%.",
            "revised_probability": 6
        }
    },
    "revision_probability": [
        8,
        5,
        6,
        9,
        5,
        6
    ],
    "revision_mean_probability": 6.5,
    "revision_sd": 1.6431676725154984,
    "revision_probability_result": 6,
    "question_details": {
        "id": 39101,
        "title": "Which states will Pope Leo XIV visit in 2025? (Israel)",
        "created_at": "2025-09-03T03:13:08.227303Z",
        "open_time": "2025-09-08T09:30:00Z",
        "cp_reveal_time": "2025-09-08T11:00:00Z",
        "spot_scoring_time": "2025-09-08T11:00:00Z",
        "scheduled_resolve_time": "2026-01-01T12:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-09-08T11:00:00Z",
        "actual_close_time": "2025-09-08T11:00:00Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 0.69,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "On May 8, 2025, the Papacy of [Pope Leo XIV](https://en.wikipedia.org/wiki/Pope_Leo_XIV) commenced after the passing of Pope Francis. Shortly thereafter, it was [announced](https://www.thetablet.co.uk/news/pope-leo-plans-to-visit-turkey-for-nicaea-anniversary/) that the Pope would prepare to travel to Türkiye for the 1,700th anniversary of the Council of Nicaea in late November, a trip Pope Francis had intended to make in May before his passing.\r\n\r\nThere is also speculation that the Pope may visit Lebanon:\r\n\r\n> Archbishop Paul Sayah, deputy to Lebanon’s Maronite patriarch, Mar Bechara Boutros al-Rai — the country’s top Catholic cleric — told The Washington Post on Wednesday that he is aware that “the Vatican is considering and studying a visit by Pope Leo to Lebanon.”\r\n\r\n> Sayah spoke to The Post after Rai told Al Arabiya television on Wednesday that preparations were “underway” for a visit by Leo that would occur by December. Rai told the outlet that the Vatican had yet to confirm a date. “There still needs to be a decision from the Vatican on when the visit will take place,” he said.\r\n\r\n...or perhaps Israel:\r\n\r\n> Some Vatican watchers have also wondered whether Leo might consider a visit to Israel.\r\n\r\n###### Washington Post: [Pope Leo may visit Lebanon on first major trip, Catholic officials say](https://www.washingtonpost.com/world/2025/08/20/pope-leo-lebanon-first-trip-turkey-israel-middle-east-peace/)\r\n\r\nRecent Popes have been relatively consistent in their travels, making few international visits in their first year: both [Pope Francis](https://en.wikipedia.org/wiki/List_of_pastoral_visits_of_Pope_Francis#2013) and [Pope Benedict XVI ](https://en.wikipedia.org/wiki/List_of_pastoral_visits_of_Pope_Benedict_XVI#2005)made a single visit to Brazil and Germany respectively for World Youth Day and [Pope John Paul II](https://en.wikipedia.org/wiki/List_of_pastoral_visits_of_Pope_John_Paul_II#1970s) making none.&#x20;\r\n\r\nGenerally speaking, visits to home nations and states affected by conflict, natural disasters and humanitarian crises are common.\r\n\r\n`{\"format\":\"metac_reveal_and_close_in_period\",\"info\":{\"post_id\":39305,\"question_id\":38651}}`",
        "resolution_criteria": "This question is a subquestion of a group question. This subquestion specifically targets the option 'Israel'. The resolution criteria for the parent question is below. \r\n\r\nEach subquestion will resolve as **Yes** if Pope Leo XIV makes a state visit to the listed country before January 1, 2026.",
        "fine_print": "To count as a state visit Pope Leo XIV must make an official visit to the country. Passing through the country's airspace, solely landing at an airport or otherwise making a transitory or personal visit will not count towards resolution.\r\n\r\nIf Pope Leo XIV ceases to be pope before 2026 all subquestions will be **annulled**.",
        "post_id": 39722,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Pope Leo XIV Engages in First‑Person Diplomacy Amid Gaza Crisis**\nPope Leo XIV met Israeli President Isaac Herzog on 4 September 2024 at the Vatican, a meeting that marked a rare high‑level dialogue between the Holy See and Israel after the Pope’s previous criticism of Israel’s actions in Gaza. The discussion focused on the dire situation in Gaza, the need to release hostages, end the Israeli offensive and guarantee humanitarian aid for Palestinians. No concrete progress was reported, but the Vatican continues to push for a cease‑fire that would enable negotiations and halt the ongoing massacre. The Pope’s invitation to Herzog was unprecedented; normally the Vatican grants audience requests, but here the Pope himself extended the invitation. Mateo Bruni, Director of the Vatican’s Press Office, explained that \"es práctica de la Santa Sede conceder solicitudes de audiencia con el Pontífice de los jefes de estado y de gobierno. No es habitual extenderles invitaciones\". Herzog’s visit followed a telephone call from Palestinian Authority President Mahmoud Abbas on 21 July 2024, during which the Vatican said the conversation centred on the Gaza conflict and the need for humanitarian access. No further official contacts have been announced. The article notes that Donald Trump has denied a visa to Abbas and his delegation for the UN General Assembly in New York, which will run until 29 September. Pope Leo XIV repeatedly condemned Israeli bombings in Gaza. On 23 August he stated that \"todos los pueblos, también los más pequeños y débiles, deben ser respetados por los más poderosos en su identidad y en sus derechos, y nadie puede obligarlos al exilio forzado\". Cardinal Pietro Parolin, the Vatican’s Secretary of State, expressed shock at the killing of journalists in Gaza and questioned whether the attack on a Catholic parish was intentional. Netanyahu later called Parolin to apologise. Herzog expressed gratitude for the meeting, saying he \"anhela el día en que los pueblos de Oriente Medio –los Hijos de Abraham– vivan juntos en paz, cooperación y esperanza\" and highlighted Israel’s efforts to bring hostages home. Key metrics from the article:\n- 4 September 2024: Pope‑Herzog meeting\n- 21 July 2024: Call between Pope and Abbas\n- 7 October 2023: Hamas attack that seized 251 Israelis\n- 47 hostages remain captive\n- ~60 000 Palestinians killed\n- ~2 million Gaza residents face extermination or forced displacement\n\nThe Vatican maintains its stance that the two‑state solution is the only viable path to peace. Engaging quotes:\n- \"es práctica de la Santa Sede conceder solicitudes de audiencia con el Pontífice de los jefes de estado y de gobierno.\nOriginal language: es\nPublish date: September 07, 2025 07:56 PM\nSource:[Página/12](https://www.pagina12.com.ar/855861-guerra-en-gaza-leon-xiv-se-involucra-en-primera-persona)\n\n**Pope Leo XIV urges peace in Mideast, Ukraine, worldwide**\nPope Leo XIV urged global peace during Sunday prayers at Saint Peter’s Square, saying, 'God does not want war. God wants peace!' and encouraging continued prayers for the Holy Land, Ukraine, and all war‑torn regions. He warned that 'apparent victories achieved through weapons, sowing death and destruction, are in fact defeats, and they never bring peace or security.' The Pope’s remarks came amid the 700th day of Israel’s war in Gaza, during which Israel has killed over 64,000 Palestinians and the enclave faces famine. The International Criminal Court had issued arrest warrants in November for Israeli Prime Minister Benjamin Netanyahu and former Defense Minister Yoav Gallant on war‑crimes charges, and Israel faces a genocide case at the International Court of Justice. The Vatican’s statement reflects the Pope’s call for dialogue and non‑violence, citing the need to break the spiral of hatred.\nOriginal language: en\nPublish date: September 07, 2025 02:04 PM\nSource:[Anadolu Ajansı](https://www.aa.com.tr/en/world/pope-leo-xiv-urges-peace-in-mideast-ukraine-worldwide/3680663)\n\n**Latin Patriarch of Jerusalem: 'All Red Lines Have Been Crossed in the Gaza War' | El Comercio: Diario de Asturias**\nThe interview with Pierbattista Pizaballa, the Latin Patriarch of Jerusalem, focuses on the Gaza war and the broader Israeli‑Palestinian conflict. He describes the situation as \"definitely a war\" and a \"crime,\" rejecting the use of terms such as genocide or apartheid as politically manipulated labels, stating: 'Definitivamente es una guerra. Y es un crimen.' He recalls offering himself to Hamas in October 2023 as a substitute for Israeli hostages, saying: 'Por supuesto. No entiendo por qué a la gente le sorprenden tanto estas cosas.' Pizaballa criticizes the lack of international unity, noting that the European Union is merely a collection of countries with their own agendas. He emphasizes the need for humanitarian action rather than political intervention, adding: 'Lo que creo que podemos hacer es, en primer lugar, expresar nuestra opinión y dar expresión también a la voz de nuestros pueblos.' He also comments on the role of the Vatican and Pope Leo XIV, describing the papal emphasis on peace and dialogue as \"eslóganes\" that do not translate into concrete action in the Middle East. Pizaballa stresses the importance of maintaining interreligious relations with Muslims and Jews, while acknowledging that public dialogue is currently impossible due to the trauma of the war. He concludes that hope remains, but solutions are not imminent, and that the Church must continue to provide pastoral and humanitarian support without becoming a political instrument.\nOriginal language: es\nPublish date: September 06, 2025 06:32 PM\nSource:[El Comercio](https://www.elcomercio.es/internacional/oriente-proximo/patriarca-latino-jerusalen-lineas-rojas-cruzadas-guerra-20250905203245-ntrc.html)\n\n**LGBTQ+ Catholics make Holy Year pilgrimage to Rome, acknowledging new sense of acceptance**\nHundreds of LGBTQ+ Catholics and their families joined a Holy Year pilgrimage to Rome, celebrating what they see as a new level of acceptance within the Catholic Church. Bishop Franceseco Savino celebrated Mass at the Chiesa del Gesu, receiving a standing ovation when he recalled that the Jubilee was \"the time to free the oppressed and restore dignity to those who had been denied it.\" LGBTQ+ groups such as Jonathan's Tent, DignityUSA and Outreach organized the pilgrimage, which was listed in the Vatican’s official calendar but not endorsed. DignityUSA’s Marianne Duddy Burke remembered being detained 25 years ago during a previous Holy Year. A 2020 UCLA Williams Institute study estimated 11.3 million LGBTQ adults in the U.S., 5.3 million of whom are religious and about 1.3 million Roman Catholic. Pope Leo XIV held a special Jubilee audience for all pilgrim groups but made no special mention of LGBTQ+ Catholics. Pilgrims attribute their sense of welcome to Pope Francis, who in 2013 said, \"If someone is gay and he searches for the Lord and has good will, who am I to judge?\" Francis’s inclusive tone contrasted with predecessors John Paul II and Benedict XVI, who were less accepting. Pope Leo XIV has expressed support for Francis’s policy of LGBTQ+ inclusion. Participants such as John Capozzi said Francis’s attitude helped them return to the church after years of feeling shunned.\nOriginal language: en\nPublish date: September 06, 2025 02:22 PM\nSource:[CBS News](https://www.cbsnews.com/news/lgbtq-catholics-make-holy-year-pilgrimage-to-rome/)\n\n**Pope Leo XIV to canonize two modern saints this weekend as faithful flock to Rome**\nOn September 6, 2025, Pope Leo XIV is scheduled to preside over the canonization of Carlo Acutis, a millennial computer programmer, and Pier Giorgio Frassati, an Italian student and outdoorsman, in St. Peter's Square. Fr. Charlie Gallagher, pastor of Immaculate Conception Church in Washington, D.C., travelled to Rome for the ceremony. He described the atmosphere as 'The atmosphere here is already one of expectant joy, even electric,' and said he expects a crowd of at least 250,000 worshipers on Sunday. The Vatican anticipates that over 32 million pilgrims will travel during the Jubilee year, according to the U.S. Embassy in Italy. Gallagher, who has known Frassati’s niece Wanda for 20 years, said he took Frassati as his patron and that Pope John Paul II called him the 'Man of the Beatitudes.' He also noted that Acutis, though academically challenged, devoted himself to spreading devotion to the Eucharist. Pope Francis had previously championed Acutis’s cause, and Leo XIV has highlighted technology, especially artificial intelligence, as a major challenge. The article also mentions Michel Picaud, president of Friends of Notre-Dame de Paris, who reports on the cathedral’s restoration five years after the 2019 fire. Gallagher lived in Rome for four years while a seminarian at the North American College in 2007, and he recalls that Pier Giorgio died in 1925 and his sister Luciana gave birth to Wanda in 1926.\nOriginal language: en\nPublish date: September 06, 2025 11:51 AM\nSource:[Fox News](https://www.foxnews.com/travel/pope-leo-xiv-canonize-two-modern-saints-weekend-faithful-flock-rome)\n\n**Pope and Israeli President Meet to Discuss Gaza Crisis**\nThe Vatican hosted a meeting between Pope Leo XIV and Israeli President Isaac Herzog on 5 September 2025. They discussed the 'tragic situation in Gaza', the need to guarantee a future for the Palestinian people, and the urgent need for a permanent ceasefire. The Holy See said it had 'expected a prompt resumption of negotiations' and that 'all hostages should be liberated'. Herzog thanked the Pope for the 'warm reception' but avoided speaking directly about Gaza, instead urging religious leaders to 'raise their voices to demand the release of hostages'. After the audience, Herzog met with Vatican officials Pietro Parolin and Paul R. Gallagher, where they talked about the political and social situation in the Middle East, the Palestinian future, and the two‑state solution. The Israeli president also highlighted freedom of worship and Israel's pride in its Christian community. The Vatican confirmed that it also discussed relations between state authorities and the local church. Spanish Foreign Minister José Manuel Albares said Europe must do more to address the violence in Palestine and proposed measures such as an arms embargo on Israel. Arab League Secretary General Ahmed Abulgheit condemned the US decision to revoke Palestinian diplomats' visas for the UN General Assembly. Several countries, including France, the UK, Australia and Canada, announced plans to recognize a Palestinian state at the UN General Assembly.\nOriginal language: es\nPublish date: September 05, 2025 01:55 AM\nSource:[Periódico El Día](https://eldia.com.do/el-papa-y-presidente-israeli-se-reunen-tratan-drama-de-gaza)\n\n**Pope’s Prayer to Israeli President: 'Courage Needed: Ceasefire Now'**\nOn 4 September 2025, Pope Leo XIV met Israeli President Isaac Herzog at the Holy See. The Pope urged a \"Pronta ripresa dei negoziati\", \"decisioni coraggiose\", \"liberazione di tutti gli ostaggi\", \"aiuti umanitari sicuri\" and a \"cessate il fuoco permanente\" to secure peace and stability for the legitimate aspirations of both peoples. Herzog, in a social‑media post, noted that it has been 700 days since the kidnapping of 48 of his compatriots still in Gaza, calling for the immediate release of hostages and expressing concern over rising antisemitism. He thanked the Pope for his warm reception and reaffirmed Israel’s commitment to safeguard Christian communities in the Holy Land. The Vatican’s final communiqué reiterated the two‑state solution, urged the international community to support a permanent ceasefire, safe humanitarian aid, and respect for humanitarian law, and called for the release of all hostages. Herzog may travel to London next week but no meeting with UK Prime Minister Keir Starmer is planned.\nOriginal language: it\nPublish date: September 04, 2025 09:01 PM\nSource:[QuotidianoNet](https://www.quotidiano.net/cronaca/herzog-papa-leone-c00wi09f)\n\n**Pope Meets Israeli President and Calls for Urgent Gaza Ceasefire**\nOn Thursday, September 4, 2025, Pope Leo XIV met privately with Israeli President Isaac Herzog at the Apostolic Palace in the Vatican. According to the Vatican Press Office, the meeting focused on the 'trágica situação em Gaza' and the need for negotiations that lead to a lasting solution. The Pope urged an immediate ceasefire in Gaza, safe entry of humanitarian aid, and the release of hostages still held by Hamas. He reiterated that 'Uma solução de dois Estados é a única saída para a guerra', highlighting the importance of a two‑state solution and also drawing attention to events in the West Bank and the status of Jerusalem. After the meeting, Herzog met with Cardinal Pietro Parolin, the Vatican Secretary of State, and Archbishop Paul Richard Gallagher, the Vatican’s Secretary for Relations with States and International Organizations, where the importance of Christian communities in the Middle East for social cohesion, education and regional stability was emphasized. The Vatican’s appeal comes amid growing international pressure on Israel and on Prime Minister Benjamin Netanyahu, who has been criticized by world leaders for Gaza offensives and restrictions on supplies entering the enclave. Last month, French President Emmanuel Macron announced that France would officially recognize a Palestinian state, joining 147 UN member states. Canada is expected to announce support for a Palestinian state at the next UN General Assembly, and UK Prime Minister Keir Starmer has already expressed a favourable position for the two‑state solution. This was the second meeting between Pope Leo XIV and Herzog; the first took place in May when Herzog attended the Mass that marked the start of the Pope’s pontificate.\nOriginal language: pt\nPublish date: September 04, 2025 05:22 PM\nSource:[Correio Braziliense](https://www.correiobraziliense.com.br/mundo/2025/09/7241515-papa-se-reune-com-presidente-de-israel-e-pede-cessar-fogo-urgente-em-gaza.html)\n\n**Pope Urges Resumption of Talks and Ceasefire as Only Way to End Gaza War**\nThe Pope, Pope Leo XIV, met Israeli President Isaac Hertzog at the Vatican on Thursday, urging an urgent resumption of negotiations to achieve a permanent ceasefire in Gaza. He stressed that a two‑state solution is the sole path to ending the war and restoring regional stability. According to a Vatican press release, the conflict that began on 7 October 2023 has already claimed more than 64,000 Palestinian deaths and 161,000 injuries, largely among children and women, and has left thousands missing, displaced, and starving. The Pope and his delegation, including Cardinal Pietro Barolini, the Vatican’s Secretary of State, called for respect of humanitarian law, safe delivery of aid, and the release of all hostages, asserting that the legitimate aspirations of both Palestinians and Israelis can only be met through a two‑state solution. Israeli Prime Minister Benjamin Netanyahu faces mounting domestic and international pressure to halt the war, amid accusations of delaying peace for political survival. President Hertzog, on X, said he discussed with the Pope ways to strengthen peace and that Israel is doing everything possible to free hostages held by Hamas, urging religious leaders to support immediate release as a step toward a better future for the region. The visit comes amid rising tensions between the Vatican and Israel, following Pope Francis’s criticism of the Gaza war and the Israeli strike on a Catholic church in July. Vatican observers see the Pope’s recent stance as additional diplomatic and moral pressure on Israel, potentially revitalizing the Catholic Church’s role as a spiritual mediator in the Israeli‑Palestinian conflict.\nOriginal language: ar\nPublish date: September 04, 2025 05:14 PM\nSource:[صدى البلد](https://www.elbalad.news/6687313)\n\n**Pope Leo XIV discusses Gaza, 2-state solution with Israeli president**\nOn September 4, 2025, Pope Leo XIV met privately with Israeli President Isaac Herzog at the Vatican. According to a Vatican statement, the talks focused on the political and social situation in the Middle East and the need to guarantee 'a future for the Palestinian people and peace and stability in the region', with the Holy See reiterating the two‑state solution as the only way out of the ongoing war. Herzog also met Vatican Secretary of State Cardinal Pietro Parolin and Vatican Secretary for Relations with States Archbishop Paul Gallagher. In a post on X, Herzog thanked Leo for a 'warm welcome today at the Vatican' and said he looked forward to strengthening Israel's cooperation with the Holy See 'for a better future of justice and compassion.' The Vatican communique, longer than usual, called for a resumption of negotiations, a permanent ceasefire, the release of Israeli hostages, respect for humanitarian law, and safe entry of aid into Gaza, and expressed hope that the 'legitimate aspirations' of both Israeli and Palestinian peoples could be guaranteed. It also referenced the situation in the West Bank, the city of Jerusalem, and relations between Israeli authorities and the local Church. The Vatican reiterated its call for an international status for Jerusalem, where Cardinal Pierbattista Pizzaballa serves as Latin Patriarch of Jerusalem and of the Palestinian territories. During a July visit to Taybeh, Pizzaballa and other Church leaders accused Israeli authorities of 'facilitating and enabling' attacks on Palestinian Christians by settlers. The meeting also touched on ensuring the continued presence of Christian communities throughout the Middle East. Herzog’s statement after the talks highlighted the great significance of the relationship between the Holy See, the State of Israel, and the Jewish people, and the importance of sensitive issues and challenges. A tension arose when Herzog’s office had earlier stated that the visit was at the Pope’s invitation, but the Vatican clarified that it only agrees to requests for audiences from heads of state. The article notes that Vatican‑Israel relations had been strained during Pope Francis’s pontificate, when he criticized Israel’s campaign in Gaza and called it 'terrorism' and possibly 'genocide'. Pope Leo has taken a more restrained approach, calling for ceasefires, the release of hostages, dignified humanitarian aid, and respect for law.\nOriginal language: en\nPublish date: September 04, 2025 04:14 PM\nSource:[Catholic World Report](https://www.catholicworldreport.com/2025/09/04/pope-leo-xiv-discusses-gaza-2-state-solution-with-israeli-president/)\n\n**Vatican, seminar on 'Creation, nature, environment for a world of peace' - Vatican News**\nCardinal Pietro Parolin, Secretary of State of the Holy See, will open the international seminar \"Creation, nature, environment for a world of peace\" on 11 September at 15:00 in Casina Pio IV, Vatican City. The event, organised by the Council of Higher Studies of the Pontifical Academy of Theology (PATH), will run until 12 September and will feature four thematic panels with participants from ecclesiastical, business, social and cultural sectors worldwide. The program states that \"A Igreja pergunta a si mesma e às pessoas de boa vontade quais são os caminhos a seguir para proteger e reafirmar o bem comum e a convivência, em nome da paz, do bem‑estar da humanidade e de toda a criação\", reflecting the seminar’s focus on protecting the common good and fostering peace. The sessions will reference the Pope Leo XIV message for the 10th World Day of Prayer for the Care of Creation 2025, Saint Francis of Assisi’s Canticle of the Creatures, Pope John Paul II’s encyclical *Redemptor Hominis*, Pope Benedict XVI’s reflection on human ecology, Pope Francis’s *Laudato si'* and the apostolic exhortation *Laudate Deum*. The seminar will conclude with an Eucharistic celebration presided over by Dom Antonio Staglianò, president of the Pontifical Academy of Theology, at St. Peter’s Basilica on 12 September at 17:30, followed by a papal audience on 13 September at 11:00. The detailed programme is available on www.theologia.va. The seminar is made possible by contributions from companies such as Arpinge, Polideck, Guglietta Global, His Way at Work and NTT DATA. The Pontifical Academy of Theology, with the support of these companies, carries out its activities in Italy and worldwide in accordance with the new statutes approved in 2023 through the Motu Proprio *Ad Theologiam Promovendam*.\nOriginal language: pt\nPublish date: September 04, 2025 03:17 PM\nSource:[vaticannews.va](https://www.vaticannews.va/pt/vaticano/news/2025-09/protecao-bem-comum-criacao-convivencia-paz-seminario-vaticano.html)\n\n**News from Eastern Churches – September 4, 2025 – Vatican News**\nThe article reports that priests at the Greek Orthodox Church of St. Porphyrius in Gaza have refused to evacuate despite Israeli orders, saying 'हम रूकेंगे।' (We will stop). More than 500 Gazans, including the sick, elderly and children, are sheltering in the church. Israel has been attempting to take full control of the city, which houses about 10 lakh residents, and is pushing the population toward the already crowded and poor southern enclave. On 26 August, the Latin and Greek Orthodox Patriarchs of Jerusalem issued a joint statement affirming their intent to continue caring for all people in the church. On 2 September, the Armenian Catholicos Karekin II, on the Republic of Artsakh’s Independence Day, delivered a message of remembrance and hope, recalling the 2020 and 2023 tragedies involving war, forced displacement of Armenians, and the captivity of officials and soldiers in Baku. He honored martyrs, called for the release of captives and peace, and urged protection of displaced peoples’ rights, preservation of Armenian spiritual heritage, and unity. In August, 45 Middle‑Eastern nuns stayed in France for a few weeks. Since the summer of 2023, French churches in Lebanon, Syria, Egypt and Palestine have opened their doors free of charge to these nuns, who face heavy workloads and harsh conditions in their home countries. The growing number of visits confirms the success of this initiative, and the nuns appreciate the warm welcome, bringing joy and renewal to French communities.\nOriginal language: hi\nPublish date: September 04, 2025 02:46 PM\nSource:[vaticannews.va](https://www.vaticannews.va/hi/church/news/2025-09/news-from-the-oriental-churches-sept-3-2025.html)\n\n**Pope Leo XIV: Audience with the President of the State of Israel – Vatican News**\nThe Holy See’s Press Office issued a statement on 4 September 2025 announcing that Pope Leo XIV met with the President of the State of Israel, His Excellency Isaac Herzog, in the Apostolic Palace. The meeting was followed by a discussion with Cardinal Pietro Parolin, the Vatican’s Secretary‑for‑State, and Monsignor Paul R. Gallagher, the Secretary for Relations with States and International Organizations. During the conversation the Pope and the Israeli delegation discussed the political and social situation in the Middle East, with particular emphasis on the tragic circumstances in Gaza. The Pope expressed hope for a swift return to negotiations, the release of all hostages, the cessation of hostilities, the reliable delivery of humanitarian aid to the most affected areas, and the full observance of humanitarian law and the legitimate expectations of both peoples. He reiterated the Holy See’s support for a two‑state solution as the sole way out of the ongoing war, and mentioned the situation on the West Bank and the city of Jerusalem. The parties also agreed on the historical value of relations between the Holy See and Israel, and discussed cooperation between state authorities and the local Church, highlighting the important role of Christian communities in promoting education, social cohesion, and stability across the Middle East. (Source: Vatican News, 4 September 2025)\nOriginal language: ru\nPublish date: September 04, 2025 02:12 PM\nSource:[vaticannews.va](https://www.vaticannews.va/ru/vatican-city/news/2025-09/kommunike-ob-audiencii-prezidentu-izraila.html)\n\n**Pope Leo XIV Meets Israeli President, Discusses Tragic Gaza Situation**\nThe Vatican and Israeli President Isaac Herzog met in Rome, where the Vatican said it had reached an agreement to secure the release of all hostages and to urgently pursue a permanent cease‑fire. The two sides also discussed facilitating humanitarian aid to the most affected areas, ensuring full respect for humanitarian law and the legitimate aspirations of both peoples. The Vatican reiterated that the two‑state solution is the only way to end the ongoing war, and briefly touched on the situation in the West Bank, noting Israel’s postponement of a debate on annexation amid international pressure, including a ‘red line’ from the United Arab Emirates. Herzog thanked the Pope for the warm reception and urged religious leaders to call for the release of hostages, but avoided directly addressing the Gaza situation. He affirmed Israel’s commitment to religious freedom for all confessions and to the safety of Christian communities in the Holy Land and the wider Middle East. After the audience, Herzog met with Vatican officials Pietro Parolin and Paul R. Gallagher. According to EFE, the meeting aimed to thaw diplomatic relations after the July bombing of the only Catholic parish in Gaza, where more than 400 people, including children and those with special needs, were sheltering; the attack left four dead and seven injured, including Argentine parish priest Gabriel Romanelli.\nOriginal language: es\nPublish date: September 04, 2025 01:45 PM\nSource:[RPP noticias](https://rpp.pe/mundo/actualidad/el-papa-leon-xiv-recibio-en-el-vaticano-al-presidente-de-israel-donde-abordaron-la-tragica-situacion-en-gaza-noticia-1653640)\n\n**The Pope and the Israeli President to Meet This Thursday in the Vatican After Weeks of Tension**\nThe Vatican and Israeli authorities have announced the first face‑to‑face meeting between Pope Leo XIV and Israeli President Isaac Herzog, scheduled for Thursday in the Holy See.  The meeting follows weeks of tension over Israel’s offensive in Gaza and settler attacks on Christian Palestinians in the West Bank, which the Holy See has sharply criticized.  According to official statements, the two leaders will focus on \"the efforts to secure the release of hostages, the fight against global antisemitism and the protection of Christian communities in the Middle East,\" as well as other political matters.  The Vatican’s spokesperson, Matteo Bruni, clarified that the meeting was not initiated by a papal invitation but was \"co‑ordinated jointly\" by the diplomatic services of both countries.  The meeting comes after Israel’s July bombing of the only Catholic parish in Gaza, an incident the Vatican described as a possible error and a violation of human‑rights law.  Catholic organisations such as Caritas International and Pax Christi have called for an immediate cease‑fire and have urged the Pope to visit Gaza to pressure Israeli authorities.  Pope Leo XIV has repeatedly condemned the use of starvation as a weapon of war and has urged an end to indiscriminate violence.  President Herzog will also meet with Cardinal Pietro Parolin and visit the Vatican archives during his one‑day tour.\nOriginal language: es\nPublish date: September 04, 2025 04:00 AM\nSource:[El Periódico](https://www.elperiodico.com/es/internacional/20250904/papa-presidente-israel-reunion-gaza-iglesia-121207969)\n\n**Pope Leo in Lebanon? Cardinal Bechara Boutros Rai Says It's Possible**\nAccording to an interview with the Vatican press office, the possible trip of Pope Leo XIV in late November to Turkey for the 1,700th anniversary of the Council of Nicea could include a stop in Lebanon, as stated by Maronite Patriarch Cardinal Bechara Boutros Rai on 19 August 2025 on Al‑Arabiya TV. No official statement has yet been issued by the Vatican Press Office. The trip was originally intended by Pope Francis for the end of May 2025. Pope Benedict XVI had visited Lebanon in September 2012 during a Middle‑East apostolic journey from 14 to 16 September, where he met President Michel Sleiman and highlighted inter‑religious dialogue and peace, with the theme 'Pace, custode della tua eredità'.\nOriginal language: it\nPublish date: August 21, 2025 03:00 PM\nSource:[acistampa.com](https://www.acistampa.com/story/31189/papa-leone-in-libano-per-il-cardinale-maronita-bechara-boutros-rai-e-possibile)\n\n**Pope Leo XIV to Visit Lebanon at Year’s End**\nThe article reports that Pope Leo XIV is expected to visit Lebanon later this year, most likely in December, according to Lebanese Cardinal Béchara Boutros Raï in an interview with Al Arabiya cited by Reuters. Raï, the Maronite Patriarch of Antioch, said the preparations are already underway but no concrete date has been set. Reuters confirmed the information with a Lebanese official, while a Vatican source indicated the trip is being planned and may include stops in other countries, notably Turkey, to commemorate the 1,700th anniversary of the Council of Nicaea. The article notes that Lebanon hosts about 2 million Catholics, mainly Maronites, and that the visit would carry symbolic weight amid ongoing conflicts in the Middle East, including tensions on the Israel‑Hezbollah border and the Gaza war. Archbishop Paul Sayah, another Lebanese cleric, echoed the preparations and highlighted Lebanon’s multicultural, multi‑religious character, saying it is a place where Muslims and Christians live together and respect one another and that the visit would send a message to the region. The article also mentions that a papal visit to Lebanon was considered during Pope Francis’s pontificate but was postponed due to his health. Pope Leo XIV, elected on 8 May 2025 after Pope Francis’s death, recently commemorated the 5th anniversary of the Beirut port explosion, which killed 200 people, emphasizing the “beloved and suffering Lebanon” as central to Catholic prayers.\nOriginal language: pt\nPublish date: August 21, 2025 02:50 PM\nSource:[Observador](https://observador.pt/2025/08/21/papa-leao-xiv-deve-visitar-o-libano-no-final-do-ano/)\n\n**Pope Leo XIV May Visit Lebanon Before December**\nAccording to an interview with Al‑Arabiya, the Maronite Patriarch Cardinal Boutros Raï said the date of Pope Leo XIV’s first international trip has not yet been confirmed but the pontiff will travel before December 2025, with Lebanon already in mind. The article notes that preparations are already underway. It also discusses a possible trip to Turkey to mark the 1,700th anniversary of the Council of Nicaea, which would involve a visit to the city of Iznik, 130 km from Istanbul, on 30 November, the feast of Saint Andrew, a date that would align with the Vatican’s annual delegation to Turkey. The article lists previous papal visits to Lebanon—Pope Paul VI (stop in Beirut on the way to Bombay), Pope John Paul II (1997), and Pope Benedict XVI (2022)—and highlights Lebanon’s current crises: influx of Syrian refugees, a collapsed currency, the 2020 Beirut port explosion, instability on the southern border, the Gaza war, and the 2024 assassination of Hezbollah’s leader. With a population of about six million, roughly 30 % of whom are Maronite Catholics, a visit would be a gesture of closeness and an opportunity for the pontiff to promote dialogue, hope and peace amid regional tension.\nOriginal language: es\nPublish date: August 21, 2025 02:43 PM\nSource:[ABC ﻿TU DIARIO EN ESPAÑOL](https://www.abc.es/sociedad/leon-xiv-visitar-libano-diciembre-20250821163941-nt.html)\n\n**Pope Leo XIV expected to visit Lebanon on first international trip - UPI.com**\nAccording to a UPI report, Pope Leo XIV is expected to make his first international trip to Lebanon sometime between now and December 2025, pending a Vatican decision. Cardinal Bechara Boutros Rai, patriarch of the Maronite Catholic Church, said the visit will happen after a decision from the Vatican, and preparations are underway though the exact timing is unknown. Archbishop Paul Sayah, deputy to Lebanon's highest‑ranking Catholic leader, told the BBC that the trip would be an important visit, noting Lebanon's multicultural, multi‑religious environment and that it sends a message to the region. The article notes that Pope Francis, during his 12‑year papacy, visited 68 countries on 47 foreign trips and had previously expressed a desire to visit Lebanon, but the country's political and economic crisis complicated planning. Lebanon is home to more than two million Catholics and carries symbolic weight for the Church. No official announcement has yet been made by the Vatican.\nOriginal language: en\nPublish date: August 21, 2025 01:47 PM\nSource:[UPI](https://www.upi.com/Top_News/World-News/2025/08/21/uk-pope-leo-xiv-expected-to-visit-lebanon-on-first-international-trip/1141755782965/)\n\n**Pope Leo´s first international trip could be to Lebanon, cardinal says**\nPope Leo XIV is expected to make his first foreign trip to Lebanon this year, according to Cardinal Béchara Boutros Raï, the Lebanese Maronite patriarch. The cardinal said the pope \"will visit Lebanon\" and that the visit could occur anytime from now until December, pending a Vatican agreement. The trip would follow a planned visit to Turkey at the end of November to mark the 1,700th anniversary of the Council of Nicaea. Lebanon, with a population of about 6 million and more than 1 million Syrian and Palestinian refugees, has the largest Christian community in the Middle East and is the only Arab country with a Christian head of state. The country is recovering from an economic crisis and a war with Hezbollah that ended with a ceasefire in November. Israel continues to occupy five strategic points on the Lebanese border and conduct near‑daily airstrikes. About one‑third of Lebanon’s population is Christian, with Maronites being the largest sect. Pope Leo XIV has previously called for peace in the region, and the Vatican has not yet confirmed the trip, though a local church often initiates such announcements.\nOriginal language: en\nPublish date: August 21, 2025 01:39 PM\nSource:[Daily Mail Online](https://www.dailymail.co.uk/wires/ap/article-15021519/Pope-Leo-s-international-trip-Lebanon-cardinal-says.html)\n\n**Pope Leo's first international trip could be to Lebanon, cardinal says**\nAccording to the article, Pope Leo XIV is planning his first foreign visit to Lebanon this year, with a possible date anytime from now until December, as stated by Cardinal Béchara Boutros Raï. The visit would follow a planned trip to Turkey at the end of November to mark the 1,700th anniversary of the Council of Nicaea. The cardinal said, 'It's unclear to be honest when he will visit, but he will visit anytime from now until December,' and added that an agreement from the Vatican is required. The article notes that Lebanon has a population of about 6 million, including more than 1 million Syrian and Palestinian refugees, and that roughly one‑third of its population is Christian, with Maronites being the largest sect. It also mentions that the last pope to visit Lebanon was Pope Benedict XVI in September 2012. The Vatican has not confirmed the trip, but the local church often initiates announcements. The article highlights Lebanon’s ongoing instability, citing the economic crisis, the 2023 ceasefire with Hezbollah, and Israel’s continued occupation of five strategic points along the border. Pope Leo, like his predecessor Pope Francis, has repeatedly called for peace and dialogue in the Middle East amid Israel’s offensive in Gaza.\nOriginal language: en\nPublish date: August 21, 2025 01:34 PM\nSource:[Newsday](https://www.newsday.com/news/nation/pope-vatican-lebanon-foreign-trip-q67570)\n\n**Pope León XIV to Visit Lebanon in December, According to Cardinal Bechara Boutros Rai**\nCardinal Bechara Boutros Rai, leader of the Maronite Catholic Church in Lebanon, announced on Al-Arabiya that Pope León XIV will visit the country 'in December' and preparations are already underway. CNN reported this information and confirmed that they have requested comments from the Vatican, but have not received a response yet. Rai did not specify the exact date of the visit. Pope León XIV, who was elected as pontiff on May 8, 2025, has emphasized peace and justice in his pastoral messages. This will be his first trip outside of Italy since his election. He has also expressed his intention to visit Turkey to commemorate the 1,700th anniversary of the Council of Nicaea, which took place in 325 AD. The Ecumenical Patriarch Bartolomé has stated that the visit could take place on November 30, but the Vatican has not officially announced any trips. Pope León XIV sent a message to Lebanon in early August to commemorate the fifth anniversary of the Beirut port explosion, expressing his desire to show 'compassion to all those whose hearts are hurt or who have lost everything due to this disaster'.\nOriginal language: es\nPublish date: August 21, 2025 06:38 AM\nSource:[EL IMPARCIAL | Noticias de México y el mundo](https://www.elimparcial.com/mundo/2025/08/21/leon-xiv-prepara-su-primer-viaje-fuera-de-italia/)\n\n**Pope Leo XIV to Visit Lebanon 'Until December', Says Maronite Patriarch**\nCardinal Béchara Pierre Rai, the Maronite Catholic Patriarch of Antioch, announced on Wednesday (20) that Pope Leo XIV will visit Lebanon 'until December'. The statement was made during an interview with TV al-Arabiya, in which he assured that the Vatican will announce the exact date soon. However, the Holy See has not yet confirmed the trip. Reports suggest that the visit to Lebanon may be part of the Pope's trip to Turkey in late November for the celebrations of the 1700th anniversary of the Council of Nicaea, which has not been officially confirmed. In May, Pope Leo XIV was questioned about the interrupted plan of Jorge Bergoglio to go to Nicaea, Turkey, which would have been his first international trip as Pope, and responded that he was 'preparing'. It is expected that the American Pope will resume this interrupted plan and visit Nicaea to celebrate the 1.7 million years of the first great Ecumenical Council. The visit, scheduled for May 26, was strongly desired by Bergoglio, who was preparing it with his friend and Patriarch of the Orthodox, Bartholomew, to strengthen ecumenism among Christians.\nOriginal language: pt\nPublish date: August 20, 2025 02:12 PM\nSource:[ANSA Brasil](https://ansabrasil.com.br/brasil/noticias/vaticano/2025/08/20/papa-visitara-libano-ate-dezembro-diz-patriarca-maronita_aa12b7a7-5320-42ef-b266-3c7b554f0507.html)\n\n**Pope Leo XIV's Planned Visit to Lebanon: A New Chapter in Vatican-Lebanon Relations**\nCardinal Beshara Rai, the Maronite Patriarch, announced that Pope Leo XIV plans to visit Lebanon 'before the end of December this year', which would likely be his first external move since his election on May 8th. The preparations for the visit are underway, although the official date has not been set yet. The Vatican has expressed a genuine interest in completing this visit to Lebanon, which is home to over 2 million Catholics, according to Vatican statistics. A Lebanese official, speaking to Reuters, stated that 'the consultations are ongoing regarding the visit, with the date to be set in the coming weeks.' The Vatican spokesperson declined to comment directly on Cardinal Rai's statements. The visit may be part of a broader tour that includes Turkey, where the Pope is expected to participate in the celebration of the 1700th anniversary of the Council of Nicaea in the city of İznik. Pope Leo had expressed his desire to participate in this event in July, saying, 'I hope to be able to meet you again in a few months to participate in the ecumenical celebration of the Council of Nicaea.' In a message to participants in a youth religious conference in Ankara, according to the Monitor newspaper. The Pope has expressed his deep solidarity with the Lebanese people in the fifth anniversary of the Beirut port explosion, saying, 'Lebanon, the beloved and suffering, remains in our prayers.' He added, 'The tears of Christ join our tears,' in a spiritual expression of his personal empathy with the suffering of the Lebanese people. The potential visit comes after a meeting between the Pope and Lebanese President Joseph Aoun on June 13th in the Vatican. According to church sources, the meeting was 'warm and symbolic,' and during which the commitment of the Holy See to support Lebanon's political and economic stability, and to maintain its religious diversity, which is a cornerstone of Lebanese identity, was reaffirmed. The two sides also discussed the file of reforms and ways to restore the confidence of the international community, as well as the central role of the Maronite Church in social cohesion. This meeting is seen as a preparatory step on the diplomatic level for a formal visit, which could be a turning point in the relations between the Vatican and Lebanon in the post-crisis period. Pope Leo, the first American to hold the papacy, tends to complete the spiritual and political line of his predecessor Francis, but adds a charismatic dimension to it. He has appeared in several occasions surrounded by young crowds, as happened during the 'Youth Jubilee' celebration in Rome, attended by hundreds of thousands from 146 countries. These popular events have shown that the new Pope does not limit himself to the symbolism of the papacy, but seeks to strengthen the global presence of the Church, particularly in areas experiencing crises, such as Lebanon and Turkey, which explains the deep dimensions of his upcoming tour.\nOriginal language: ar\nPublish date: August 20, 2025 12:43 PM\nSource:[@Elaph](https://elaph.com/Web/News/2025/08/1575261.html)\n\n",
    "date": "2025-09-08T09:40:55.174215",
    "summary": "All six forecasting experts converge on a very low probability that Pope Leo XIV will make a state visit to Israel before January 1, 2026. Their analyses highlight several consistent themes: (1) Historical precedent is strongly against such a visit—no recent Pope has visited Israel in their first year, particularly during times of conflict; (2) The ongoing Gaza war and strained Vatican–Israel relations, exacerbated by Vatican criticism of Israeli military actions and damage to Christian sites in Gaza, make such a visit diplomatically and logistically hazardous; (3) Official Vatican planning and news leaks focus exclusively on Turkey (for the Nicaea anniversary) and Lebanon, with no credible signs of preparatory activity for an Israel trip; (4) Security risks for a papal visit to Israel are considered prohibitive in the current context; (5) While some soft power, interfaith, or peacemaking motivations could theoretically prompt a last-minute visit if an unexpected diplomatic breakthrough occurs, experts agree this remains a remote scenario. Probability estimates among the experts range narrowly from 5% to 8%. The consensus is that unless there is a dramatic and unforeseen de-escalation of the conflict or major political development, Pope Leo XIV will not visit Israel in 2025."
}