{
    "deliberation_results": {
        "Labour Relations (Industrial Relations Practice)": {
            "time_to_resolution": "Approximately 1.5 months (until January 1, 2026)",
            "perspective_relevance": "As a Labour Relations (Industrial Relations Practice) expert, my perspective is crucial in evaluating industrial disputes, strike leverage, negotiation tactics, government fiscal and political constraints, and historical outcomes of collective bargaining. I can assess the likelihood of further pay increases for resident doctors by considering the strength of industrial action, union-government dynamics, public sentiment, pay review body recommendations, structural constraints of the NHS, and the timing and feasibility of enacting any last-minute settlements before the deadline.",
            "status_quo": "No further pay increase is scheduled before 2026; the government's most recent offer was rejected, and only non-pay benefits (training places, exam fees) have been discussed. The latest officially enacted pay rise was 5.4% for 2025–26, and the government has repeatedly emphasized that no further pay increases are affordable in the short term.",
            "perspective_derived_factors": [
                {
                    "factor": "Intensity and Frequency of Industrial Action",
                    "effect": "Increases probability — The frequency of strikes (13 walkouts since 2023 with more planned) signals sustained labour pressure, a classic indicator that industrial conflict may force the government to concede, if only to avoid NHS collapse over winter. However, diminishing public support and government toughening reduce this lever."
                },
                {
                    "factor": "Government Fiscal & Political Constraints",
                    "effect": "Decreases probability — The Labour government, especially Health Secretary Wes Streeting, has stated adamantly that further pay increases are unaffordable this year and that financial pressures on the NHS are severe. The risk of a precedent for other public sector pay claims and electoral optics constrain last-minute fiscal concessions."
                },
                {
                    "factor": "Timing (Resolution Window)",
                    "effect": "Decreases probability — With only about six weeks left in 2025, the administrative process to enact any uplift—including review, negotiation with the BMA, government and parliamentary approvals, and payroll implementation—makes it much more difficult to achieve a further pay award 'enacted' before the January 1, 2026 cutoff."
                },
                {
                    "factor": "Public Opinion and Media Pressure",
                    "effect": "Decreases probability — Public support for strikes is falling (48% oppose, 39% support). Government may judge growing strike fatigue and media criticism as reducing the necessity to concede further."
                },
                {
                    "factor": "Precedent from Past Strikes and Review Bodies",
                    "effect": "Slightly increases probability — Past prolonged strike action (2022–24) eventually resulted in improved offers, indicating that, under sufficient pressure, governments do shift. But the context in late 2025 (Labour's credibility, winter crisis, diminished public support) moderates this impact."
                },
                {
                    "factor": "Union Tactics and Mandate Duration",
                    "effect": "Increases probability — The BMA holds a legal strike mandate until January 2026 and can continue escalating. However, their maximalist demands (29% pay restoration) and refusal of non-pay packages suggest little room for last-minute compromise unless government blinks."
                },
                {
                    "factor": "NHS Operational Risk and Staffing Crisis",
                    "effect": "Slightly increases probability — Ongoing strikes threaten winter operations, especially with high flu cases and delays in service delivery. If NHS England or ministers fear an immediate crisis, emergency measures (possibly including a pay olive branch) could be pushed through quickly."
                }
            ],
            "no_scenario": "Government holds firm, resisting BMA pressure citing fiscal constraints, falling public support, and the argument that repeated, escalating strikes should not be rewarded with further concessions. No further offer or pay review recommendation is accepted or enacted. Strikes continue but NHS muddles through the winter, and government offers further non-pay benefits or talks for 2026 and beyond, but nothing 'enacted' for immediate pay uplift above 5.4% before the January 1 deadline.",
            "yes_scenario": "Worsening winter NHS crisis, mounting strike disruption, and/or a pivotal incident (e.g., mass cancellation of emergency care, increased media/political pressure) force the government to reopen pay talks. The government makes a quick, face-saving pay offer—possibly a minor additional uplift above 5.4%, or a staged/restorative element—and pushes it through Parliament and payroll in expedited fashion. The BMA accepts or the government enacts it unilaterally, and the increase is in effect before January 1, 2026.",
            "final_reasoning": "While past base rates for protracted NHS strikes suggest eventual government movement, key conditions differ now: there is a resolute new Labour government keen to maintain fiscal discipline, falling public support for strikes, and repeated, unequivocal statements ruling out further pay rises. Government's priority appears to be containing the dispute and not rewarding continued action. Administrative and bargaining timelines are now very tight. The BMA's maximalist approach, lack of willingness to accept non-pay improvements, and government's offer of only non-pay elements (training, exam fees, etc.) all point toward deadlock. However, severe winter service collapse could trigger emergency movement at the last hour, so the probability is not zero. Factoring all, there is a small chance of a 'face-saving' minor uplift being rapidly offered/enacted, but the most probable outcome is 'No' due to the reasons above.",
            "final_probability": 8
        },
        "Labour Relations (Trade Union Negotiation)": {
            "time_to_resolution": "Approximately 7 weeks (question resolves January 1, 2026; current date November 10, 2025).",
            "perspective_relevance": "As a labour relations and trade union negotiation expert, I bring a nuanced understanding of industrial action cycles, government-union bargaining processes, typical timelines for pay settlements, and the strategic levers both unions and management employ. I also pay close attention to base rates of public sector pay settlements after prolonged strikes, timing of government movement under political pressure, and the structured models through which public sector compensation is adjusted, especially in a context where prior negotiation cycles and fatigue are influencing tactics.",
            "status_quo": "Resident doctors in England have already received a 5.4% pay uplift for 2025–26, with further increases explicitly ruled out by the government, who cite severe financial constraints. Multiple offers (including training expansions and exam fee coverage) have been rejected by the BMA, which remains dissatisfied due to unresolved pay erosion since 2008. Resident doctors remain in dispute and further strikes are planned, but government officials repeatedly say that no further pay rise will be tabled before 2026.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent pay increases and government resistance",
                    "effect": "Decreases probability. Following a multi-year deal resulting in near 29% average wage increase over three years, the government—now under a Labour administration—has strongly signaled 'no further pay rises possible' for this group in this period. It would be politically and fiscally very unusual for them to back down further in the timeframe remaining."
                },
                {
                    "factor": "Strike leverage and union mandate",
                    "effect": "Slightly increases probability. The BMA retains a strike mandate into January 2026 and has shown willingness to use disruptive tactics, but diminishing public support and the government's tougher stance make a last-minute capitulation less likely than in previous cycles."
                },
                {
                    "factor": "Political and fiscal environment",
                    "effect": "Decreases probability. The government—already facing severe NHS funding constraints and growing public irritation over industrial action—has little room to offer additional pay. Labour's political capital would be lost if seen to cave after repeated, high-profile commitments to hold the line."
                },
                {
                    "factor": "Precedent and base rates after multiple strike cycles",
                    "effect": "Decreases probability. In the UK public sector, multiple rounds of industrial action usually result in some concession only when a new pay review or budget cycle begins, not in the final weeks preceding such a change. The last-minute unplanned increases above announced pay uplifts are rare, especially after prior large increases."
                },
                {
                    "factor": "Union demand inflexibility and presence of non-pay offers",
                    "effect": "Decreases probability. Unions have dug in on full 'pay restoration,' with the latest government package refusing further base pay increases but including other benefits. History shows unions sometimes accept non-pay elements when further pay increases are impossible within a budget year."
                }
            ],
            "no_scenario": "The government holds to its commitment of no further base pay increase, offering only non-pay improvements or minor job creation. Resident doctors strike as planned, isolated or mitigated by NHS contingency measures. Public support for the strike continues to erode. The BMA, facing diminishing leverage and no clear path to more pay, maintains industrial action but ultimately cannot secure an additional pay uplift before January 2026. The scheduled 5.4% uplift remains the only base salary increase enacted.",
            "yes_scenario": "Winter staffing/excess demand crises cause hospital operational collapse, public outrage builds, and/or accidents attributable to strike disruption force an emergency negotiation. Under acute pressure, the government accepts a minor further uplift (even an additional 0.1% above the existing 5.4%, targeted or general) and fast-tracks its enactment—perhaps as a face-saving compromise with the BMA. The BMA's committee or membership narrowly votes to accept and the uplift is officially enacted before January 1, 2026.",
            "final_reasoning": "All recent signals from both sides indicate maximal entrenchment: government states repeatedly (and with new Labour Ministers) that no further pay rise is possible, while the BMA is escalating, but also losing public support and political capital. The government has already made several non-pay offers to end the dispute, and past NHS pay rounds suggest that unplanned uplifts after already-enacted settlements are highly rare unless a major, system-shaking event intervenes. There are just under two months to enact any base pay uplift beyond the current 5.4%, but with a recent near-29% increase and historic budget pressures, the base rate for a further unplanned raise is extremely low—likely in the single digits. Nonetheless, there is a nonzero tail risk if a catastrophic winter crisis triggers panic measures. Assessing each factor, and given the fine print that the offer must be *enacted* through official channels, my forecast (from a labour relations perspective and current news sentiment) is:",
            "final_probability": 5
        },
        "UK Public Sector Policy (NHS Workforce Planning)": {
            "time_to_resolution": "Approximately 13 months (resolves by January 1, 2026; today is November 10, 2025)",
            "perspective_relevance": "As an expert in UK Public Sector Policy and NHS Workforce Planning, I bring insight into pay determination processes (involving the DHSC, independent pay review bodies, and government policy), strike dynamics, historical pay dispute resolutions, fiscal constraints, workforce pipeline pressures, and political trade-offs. My experience enables assessment of the true likelihood of late-breaking uplifts, especially against a backdrop of tight budgets, complex industrial relations, and workforce bottlenecks.",
            "status_quo": "No further significant pay increase for resident doctors is planned before 2026; the government position is that a 5.4% uplift for the 2025-26 year is already in place, with no announced willingness to exceed this amid claims of financial constraint and repeated public refusals for additional uplifts.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent Labour Government's Hardline Stance",
                    "effect": "Decreases probability. Multiple statements by Secretary Wes Streeting stress that no further pay increases are affordable or forthcoming, and he has adopted a tough, public-facing posture against new concessions. Messaging is consistent and public."
                },
                {
                    "factor": "Strike Fatigue and Tougher NHS England Operations",
                    "effect": "Decreases probability. NHS England leadership has signaled a shift to making strikes less 'consequence-free' and is encouraging hospitals to minimise the effect of strikes, reducing government incentive to capitulate."
                },
                {
                    "factor": "Extensive Pay Increases Already Awarded",
                    "effect": "Decreases probability. Resident doctors have received 28.9% base pay increases over three years—among the highest in the public sector—giving the government a strong argument against urgency for further uplifts."
                },
                {
                    "factor": "Political Timeline and Winter Pressures",
                    "effect": "Modestly increases probability. Winter service pressures could create political risk if prolonged strikes cause an NHS crisis, especially if public/patient safety is visibly endangered or media pressure mounts."
                },
                {
                    "factor": "BMA Strike Mandate and Industrial Action",
                    "effect": "Slightly increases probability. The BMA strike mandate runs until January 2026, and the union has not capitulated after several rounds of action, signaling continued resolve. However, public support for strikes is declining."
                },
                {
                    "factor": "Pay Review Body Process (DDR&B) Cycle",
                    "effect": "Marginal. The DDRB's next report would normally influence pay rates implemented from April 2026, not before. However, off-cycle uplifts are not impossible, especially if the political or service context deteriorates."
                },
                {
                    "factor": "Base Rates & Historical Precedent",
                    "effect": "Decreases probability. While the pattern in 2022–2024 was for eventual offers after repeated strike escalation, this has tended to happen earlier in the financial year and/or after political changes—not in the closing months with existing public, fiscal, and political headwinds."
                },
                {
                    "factor": "Public Opinion Shifting Against Strikes",
                    "effect": "Decreases probability. New polling shows more people now oppose than support doctor strikes, eroding BMA leverage and reducing the political cost to government of holding out."
                }
            ],
            "no_scenario": "The government holds fast to its current offer (5.4% uplift for 2025/26) and either the BMA ends or repeatedly pauses/reduces strike action as public opinion turns against further disruption. Any negotiations focus on non-pay elements (e.g. training places, exam fees, rota flexibility). The matter is deferred to the 2026 DDRB round (for future increases from April 2026), and no above-5.4% pay award is enacted before Jan 1, 2026.",
            "yes_scenario": "Escalating strike action, coinciding with a severe winter crisis (e.g., major A&E shutdowns and deaths reported in media), triggers a political emergency. Acute public and parliamentary pressure force the government to seek an emergency agreement before year-end, with a modest further base pay increase above 5.4% for resident doctors enacted, despite earlier resistance. The BMA accepts the offer and action is taken before Jan 1, 2026.",
            "final_reasoning": "Despite extensive ongoing industrial action and major workforce challenges, the political and fiscal context has shifted decisively toward government intransigence. The Labour government, only recently elected, has publicly staked its credibility on 'fiscal discipline,' and repeatedly, unequivocally ruled out further pay uplifts for 2025/26—even under strike threat. NHS England is now supporting a harder line against striking doctors, and polling shows declining public support for continued action. The BMA still has a strong mandate, and a winter crisis is a risk—but short of a catastrophic, clearly media-salient hospital disaster attributable to government refusal (not yet observed), all levers are set for stalemate. Historical base rates for late-year, crisis-forced concessions exist but are rare, especially against a background of high cumulative increases, low public support, and a government facing wide public sector pay demands. The most likely outcome is continued disruption without further base pay increases until April 2026 at the earliest. Probabilistically, a small (<1 in 6) chance remains that a winter crisis tips things over, or a 'face-saving' small increase is enacted, but even that would require a rapid government U-turn. The balance of evidence points toward No.",
            "final_probability": 13
        },
        "UK Public Sector Policy (UK Government Pay Review)": {
            "time_to_resolution": "Just under 14 months (question closes January 1, 2026, forecast date is November 10, 2025).",
            "perspective_relevance": "As an expert in UK Public Sector Policy, particularly government pay review mechanisms, I can draw on institutional knowledge of how DHSC, Treasury, and NHS England operate under fiscal, political, and industrial action pressures. Understanding the pay review body process, the relationship with the BMA, historical government responses to strikes, fiscal rules under Labour, and public/political tolerance for longer industrial strife are all essential for forecasting the likelihood of last-minute government movement on pay uplifts.",
            "status_quo": "The status quo is that junior/resident doctors in England have received a 28.9% uplift over three years, including a 5.4% pay rise for 2025–26 (which is the scheduled uplift). The government, led by Health Secretary Wes Streeting, is refusing to further increase pay due to claimed 'enormous financial pressures.' The BMA continues to strike for further pay restoration. Recent government offers have focused only on non-pay elements (training programs, exam fees, etc.), which the BMA has rejected.",
            "perspective_derived_factors": [
                {
                    "factor": "Labour government's fiscal and policy stance",
                    "effect": "Strongly decreases probability. New Labour government has so far taken a very hard line on pay, repeatedly and unequivocally ruling out additional pay uplifts on affordability grounds. Political messaging from Streeting and Kinnock, combined with strong Treasury discipline, is much clearer and more coordinated than previous governments faced with industrial action."
                },
                {
                    "factor": "Intensity and impact of industrial action",
                    "effect": "Moderately increases probability. The BMA retains a legal strike mandate into January 2026 and is holding long strikes even during NHS winter crises. If service disruption escalates drastically (e.g., pandemic-level harm in winter), the government could come under intense pressure."
                },
                {
                    "factor": "Historical base rate and pay review body mechanism",
                    "effect": "Weakly increases probability. Historically, significant pay uplifts have sometimes followed protracted strikes (2022–2024), especially when accompanied by public support and crisis. However, no additional offer during the 2025/26 review cycle; Labour may feel especially constrained to break the cycle after consecutive 'one-off' deals under the Conservatives, and current public support is low."
                },
                {
                    "factor": "NHS England and political/public opinion",
                    "effect": "Moderately decreases probability. NHS England management has shifted to a tougher \"consequences for strike\" posture, prioritizing cost containment. Polling now shows strike opposition outweighs support. The government is clearly prepared to ride out disruption."
                },
                {
                    "factor": "BMA resolve, unity, and escalation potential",
                    "effect": "Slightly increases probability. The BMA shows willingness to reject incremental offers and intensify action, but growing internal divisions, falling morale among doctors, and declining public support limit the effectiveness of these tactics."
                },
                {
                    "factor": "Upcoming pay review round timing and government procedural latitude",
                    "effect": "Strongly decreases probability. 2025–26 uplift is already awarded, and next formal review is after April 2026. There is no procedural window for an 'extra' uplift except as a bilateral, extraordinary intervention, which would be politically difficult and set a precedent the government wishes to avoid (as they have stated repeatedly)."
                }
            ],
            "no_scenario": "Despite ongoing BMA strikes and difficult winter pressures, the Labour government holds a hard line on pay, citing affordability. They offer more non-pay elements (e.g., jobs, exam fees) and maintain that no further pay increase is possible. The BMA eventually winds down strike actions due to declining public support, internal financial stress, and lack of traction. The scheduled 5.4% uplift remains the only pay increase before 2026.",
            "yes_scenario": "Escalation of industrial action over the winter combines with an NHS operational crisis—such as a spike in excess deaths, mass media coverage of hospital failures, and perhaps a catastrophic safety breach. Senior NHS management and Labour backbenchers begin to openly agitate for a settlement. Treasury relents and, either via a special ministerial direction or preemptive pay review body intervention, offers an additional uplift, possibly as a compromise 'one-off' payment for 2025–26, which is accepted by the BMA or imposed unilaterally.",
            "final_reasoning": "The overwhelming preponderance of evidence from government statements and recent negotiating behavior signals an unusual willingness to tolerate prolonged strikes for the sake of fiscal credibility. Labour is very aware of the precedent set in previous cycles by 'rolling back' pay settlements after disruptive action. All recent government and NHS England statements confirm that the monetary boundary is firmly set. Public support for doctors' strikes has eroded, while the government feels it has 'bought off' sympathy by pointing to the large multi-year uplift already delivered. There is almost no procedural or political appetite among the Treasury or DHSC to grant an extraordinary in-year uplift, especially with the 2026 pay round coming up; the government will point BMA towards that round for negotiations. A purely catastrophic winter crisis might force the government's hand, but not only would this require a highly visible, severe breakdown, but there is little evidence (based on precedent and polling) that even such a crisis would guarantee a last-minute climbdown. Therefore, the probability of a further base pay increase above the scheduled 5.4% before 2026 is low, but not negligible (to account for extreme tail-risk scenarios).",
            "final_probability": 11
        },
        "Political Science (Public Choice Theory)": {
            "time_to_resolution": "Approximately 1 year and 2 months (question resolves January 1, 2026; today is November 10, 2025)",
            "perspective_relevance": "As a public choice theorist, I focus on the incentives and constraints facing both policymakers and organized interests (here, government and the BMA/doctor unions). Public choice theory emphasizes how interest group bargaining, bureaucratic incentives, voter preferences, and fiscal constraints shape collective outcomes in policy disputes like this one. This framework helps assess the credibility of both union threats and government resolve, as well as anticipating responses to shifting political and economic pressures.",
            "status_quo": "As of now, the government has stated definitively that no further pay increases will be offered before 2026, citing affordability and public finances. Strikes continue, but recent government communication is combative rather than conciliatory, and there have already been major pay rises (28.9% over three years).",
            "perspective_derived_factors": [
                {
                    "factor": "Government Fiscal Constraints and Budgetary Priorities",
                    "effect": "Decreases probability. Public choice theory predicts that, after large prior concessions and under strong fiscal constraints, the government faces significant costs in yielding to additional pay demands—especially given recent public claims of unaffordability and focus on NHS service restoration. Budgetary rules limit policy flexibility, especially post-election in a majority government setting with fiscal rules as binding constraints."
                },
                {
                    "factor": "Electoral Incentives and Public Opinion",
                    "effect": "Neutral to slightly decreases probability. While the government risks voter backlash from NHS disruption, polling shows public support for strikes has declined sharply (from majority in 2024 to minority now). The government may judge standing firm as less risky than conceding to union demands, particularly with media and opposition support for toughness against union 'obstruction'."
                },
                {
                    "factor": "Strike Leverage and Union Bargaining Power",
                    "effect": "Neutral to slightly increases probability. Strikes cause major disruption (millions of appointments cancelled, winter crises looming), and BMA has a legal strike mandate into January 2026. Classic public choice logic suggests some leverage exists, as the government may wish to 'buy off' industrial unrest if disruption gets out of hand. However, government/health leadership is adopting a more oppositional stance, trying to reduce the cost of strikes via contingency planning."
                },
                {
                    "factor": "Recent Pay Settlements and 'Offer Fatigue'",
                    "effect": "Decreases probability. The government recently delivered a historic pay uplift, above those given to other public sector groups, and is publicizing this fact. The marginal value to further pay increases is falling, while the political cost of repeated concessions rises."
                },
                {
                    "factor": "Path Dependence and Bureaucratic/Procedural Delays",
                    "effect": "Decreases probability. Even if a last-minute deal were struck in late 2025, bureaucratic and administrative processes could delay enactment until after Jan 1, 2026, leading to a NO resolution under the precise question criteria."
                },
                {
                    "factor": "International and Cross-Sectoral Comparisons",
                    "effect": "Neutral. Though cited by BMA to argue for higher pay, the government uses OECD and intra-UK comparisons selectively, and the cross-public sector context (i.e., pay rounds for teachers, nurses) means a further junior doctor uplift would open the door to knock-on claims elsewhere—a risk governments are typically keen to avoid."
                }
            ],
            "no_scenario": "The government sticks to its current position, rides out the strike, bankers on declining public support for further industrial action, and no new offer/enactment is made by Jan 1, 2026. Even if discussions resume, bureaucratic or parliamentary delays prevent a new pay uplift before the deadline. The BMA, perceiving diminishing returns, eventually suspends or dilutes its action in light of sagging public sympathy and political constraints.",
            "yes_scenario": "Strike action escalates to a point it threatens a serious NHS or political crisis: mass cancellations, shocking stories in the press, or an intra-government split leads to a sudden tactical concession—a modest pay uplift above 5.4% is rapidly enacted in late 2025, either as a last-minute government move (hoping to avert winter service breakdown) or via an independent pay review recommendation that the government accepts 'with regret.' The government chooses to absorb the fiscal cost in exchange for industrial peace and political stability.",
            "final_reasoning": "Public choice theory suggests that further pay concessions are very unlikely, given the incentives facing the government: strong fiscal constraints, declining public support for strikes, and a recent record pay settlement. The government has staked political credibility on being tough and has mechanisms (contingency planning, oppositional rhetoric) to mitigate disruption. There is always some chance (5–15%) of an exogenous shock (severe NHS meltdown or unexpected political shift) forcing a rapid deal, but most paths lead to no further pay increase before 2026—the bureaucratic risk of a late 2025 deal not being enacted before the deadline adds further downward weight. Given all the above and the history of protracted UK industrial action settling without final-year concessions, the most reasonable base rate (and the weight of current government, fiscal, and electoral signals) points toward 'No.' I set my probability at 10%.",
            "final_probability": 10
        },
        "Political Science (Punctuated Equilibrium)": {
            "time_to_resolution": "Approximately 13.5 months until January 1, 2026.",
            "perspective_relevance": "As a political scientist specializing in Punctuated Equilibrium Theory (PET), my approach is to scrutinize the propensity for sudden shifts in public policy following periods of stasis and incremental adjustment, particularly under external pressures (e.g., crises, political realignment, or changes in public opinion). This lens is highly relevant: the relationship between striking resident doctors, the BMA, and the political environment is ripe for punctuated dynamics, given prolonged conflict, high salience, and recent window-opening events (such as the Labour government, sustained strikes, and NHS winter crisis warnings).",
            "status_quo": "The current status is no further pay uplift above the already-enacted 5.4% for 2025–26, with the Labour government (Health Secretary Wes Streeting) insisting that no further increase is affordable or planned, despite ongoing industrial action. Previous strikes led to significant, but not full, restoration settlements—incrementally achieved.",
            "perspective_derived_factors": [
                {
                    "factor": "Government Fiscal Position & Stated Red Lines",
                    "effect": "Strongly decreases probability. The government and NHS leadership are on record as being more resistant to further uplifts than in previous cycles, with explicit public statements that no strike will change the pay offer and that finances are exhausted."
                },
                {
                    "factor": "Strike Frequency and Escalation",
                    "effect": "Slightly increases probability. Recurrent and escalating strikes put cumulative pressure on policymakers; repeated widespread disruption may catalyze a policy 'punctuation'. However, public support is waning, and the government seems prepared to accept short-term pain."
                },
                {
                    "factor": "Public Opinion and Media Framing",
                    "effect": "Slightly decreases probability. Recent polls show public support for the strikes has shifted to plurality opposition, reducing the political cost of holding out against BMA demands."
                },
                {
                    "factor": "Historical Base Rate (NHS Strikes Yielding Further Pay Uplifts)",
                    "effect": "Slightly increases probability. Past NHS strikes (2022–2024) resulted in improved offers following protracted industrial action. The base rate is perhaps ~30%, but prior increases were during more conducive fiscal/political contexts."
                },
                {
                    "factor": "Labour Government Profile and NHS Pressures",
                    "effect": "Ambiguous. While Labour is more union-friendly and ideologically sympathetic to NHS funding than Conservatives, they have adopted a noticeably tough stance to preserve fiscal credibility. Potential for a leftward 'punctuation' remains if the NHS crisis deepens, but currently leadership is resolved not to concede."
                },
                {
                    "factor": "Timing and Political Opportunity Structures",
                    "effect": "Slightly decreases probability. The window for unplanned policy shifts is constrained: after months of high-salience industrial action, further strikes might actually harden positions. The proximity to a new fiscal year (April 2026) may freeze pay bargaining windows, and no mechanism is visible for a last-minute offer unless a major crisis emerges."
                }
            ],
            "no_scenario": "Despite ongoing BMA pressure and further disruptive strikes, the government holds its line, citing fiscal crisis and declining public support. Industrial action continues into early 2026, but the 5.4% uplift remains the only enhancement to base pay for resident doctors in England before the January 1, 2026, deadline. The BMA accepts defeat for now or continues action in 2026.",
            "yes_scenario": "A severe NHS winter crisis (e.g., catastrophic hospital overcrowding, multiple deaths attributable to strikes, etc.) pairs with a spike in media attention and backbench/Labour left-wing rebuke. Public support rebounds for the doctors, creating overwhelming pressure. In December, the government reluctantly enacts a unilateral base pay increase (perhaps a modest 1-2% above the 5.4% already scheduled) to avert further collapse or electoral backlash, enacting and implementing the policy before the January 2026 cutoff.",
            "final_reasoning": "The most recent data shows hardened government resistance to BMA pay demands, highly visible statements of unaffordability, and tightening of NHS management's position. While strikes continue, public support is waning, and the government appears willing to weather the disruption. Base rate analysis indicates that further uplifts after multiple strikes are unusual but not unprecedented (about a 1-in-3 chance historically, higher if public/coalition pressure rises). PET theory suggests that exogenous shocks can catalyze sharp policy change, but the precondition—an overwhelming crisis—has not materialized yet. There are signs of NHS winter risk, but no clear political opportunity for a climbdown has been flagged. On balance, the lack of political will/fiscal room and declining public support outweigh the (still real) risk that a crisis will force the government's hand in late 2025. Accordingly, the most likely outcome is 'No further pay uplift'. I estimate a 20% chance of a further pay increase being implemented before January 2026, reflecting a diminished, but not eliminated, risk of a punctuated policy response.",
            "final_probability": 20
        },
        "Political Science (Interest Group Theory)": {
            "time_to_resolution": "Just under 14 months (until December 31, 2025).",
            "perspective_relevance": "My expertise in Political Science, particularly Interest Group Theory, is highly pertinent as it allows me to assess the power, strategies, and likely influence of the British Medical Association (BMA) and collective action of resident doctors in extracting concessions from government. I can analyze the equilibrium between public pressure, interest group leverage, government resource constraints, and historical negotiation dynamics to forecast pay settlements in contentious policy areas.",
            "status_quo": "The government has enacted a 5.4% average pay uplift for 2025–26. Wes Streeting, the Health Secretary, and NHS England have repeatedly insisted there is no fiscal space and further increases are not being considered. The BMA has rejected the most recent non-pay offer and is continuing strike action.",
            "perspective_derived_factors": [
                {
                    "factor": "Interest Group Resources and Unity",
                    "effect": "The BMA is an experienced, institutionally powerful union with broad legal strike mandate through January 2026. This increases leverage for concessions, as sustained strike action is credible. However, surveys indicate union solidarity may be weakening, especially among older doctors and as public support wanes, which could reduce impact."
                },
                {
                    "factor": "Government Fiscal and Political Constraints",
                    "effect": "Streeting and Treasury have drawn red lines on further pay. Public finances are tight and the Labour government is highly sensitive to accusations of fiscal irresponsibility. Making pay concessions while other groups (nurses, GPs) get less is politically risky. Pressure from the Treasury on holding a line makes pay awards less likely."
                },
                {
                    "factor": "Public Opinion and Service Disruption",
                    "effect": "Strike support among the public is waning (from 52% to 39% or lower). Prolonged patient disruption (millions of cancelled appointments) could force negotiation, but the government is betting that falling support will enable a harder stance. If winter pressures or hospital crises escalate, government may be forced to trade pay uplift for industrial peace to save NHS face."
                },
                {
                    "factor": "Historical Precedent & Base Rates",
                    "effect": "Previous rounds (2022–24) saw government resistance cave after cumulative strikes, yielding above-inflation pay deals across the NHS—even if initially ruled out. However, the current administration may be even more risk-averse fiscally, and is promising to be more 'resistant' this time."
                },
                {
                    "factor": "Interest Group Bargaining Strategy",
                    "effect": "The BMA is still demanding pay restoration and signals willingness to maintain strike action. Unless they back down, strikes will likely recur into early 2026 unless resolved. The government’s strategic concessions (like exam fees or extra training slots) are a sign of seeking alternatives to base pay increases, but not of complete intransigence—leaving some room for a face-saving, last-minute minor uplift if service crises grow."
                }
            ],
            "no_scenario": "Strikes continue sporadically through early winter and spring 2026. The BMA maintains pressure, but with waning public support, the government holds firm and waits out the strike. No further pay offer exceeding 5.4% is enacted before year's end. Bargaining is pushed into next year's round, with possible minor non-pay concessions, but base pay remains unchanged in 2025.",
            "yes_scenario": "Escalating winter NHS crises (e.g. severe flu wave, A&E backlogs), ongoing cancellations, and political fallout force the government into an emergency deal to shore up patient safety. Facing mounting service disruption, media criticism, and internal Labour dissent, Streeting authorizes a slim, face-saving base pay uplift (>5.4%) late in 2025 to secure industrial peace before the new year.",
            "final_reasoning": "Applying Interest Group Theory, the BMA retains considerable leverage due to its collective action ability, institutional experience, and the essential nature of doctors’ labour. Yet, the new Labour government, unlike prior Conservative ones, is highly sensitive to the charge of fiscal indiscipline and public resentment at strikes. Public support is ebbing, and NHS England leadership has adopted a confrontational approach. Streeting has categorically ruled out new money and is extending only non-pay or training offers. Base rates from similar NHS strikes suggest an eventual pay rise is not implausible, but the current environment (fiscal strain, declining public support, government 'toughness') tilts against it. That said, the unpredictability of health service collapse under winter pressure or a sudden crisis means a forced government retreat is still in play, especially for a symbolic/diminutive pay boost to prevent an NHS meltdown. Nevertheless, the on-record government stance—and their need to avoid a perceived climbdown—means the most likely scenario is 'No' unless unexpectedly severe pressures tip the balance late in the year. Thus, my best estimate is moderately low, sharply higher than a pure reading of rhetoric would justify, but lower than historical precedent alone suggests.",
            "final_probability": 27
        },
        "Economics (Labour Market Economics)": {
            "time_to_resolution": "Approximately 1 year and 1.5 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Labour Market Economics, I bring an understanding of industrial relations, public sector pay-setting, the political economy of strikes, budgetary constraints, wage compression in hierarchical organizations, and the dynamics of skill shortages and labor migration in heavily unionized systems such as the NHS. I can analyze how economic fundamentals, public opinion, historical precedents, labor bargaining power, fiscal pressures, and political incentives interact to determine the likelihood of further pay increases for resident doctors.",
            "status_quo": "Resident doctors in England received a 28.9% average pay increase over three years, with a scheduled 5.4% uplift for 2025–26. The government has stated further pay increases are unaffordable and has recently made clear, after failed talks with the BMA, that the current pay offer is final. This stance follows repeated strikes, and government messaging has grown less conciliatory.",
            "perspective_derived_factors": [
                {
                    "factor": "Historical Precedent of Strike-Induced Concessions",
                    "effect": "Increases probability: Past strikes (2022–2024) have led to government concessions and improved offers after initial intransigence, suggesting that persistence and disruption can yield results, especially under threat of NHS service deterioration or political liability."
                },
                {
                    "factor": "Government Fiscal Constraints and Current Political Signaling",
                    "effect": "Decreases probability: The government has taken a firm public stance citing 'enormous financial pressures,' with explicit statements that further pay increases are unaffordable, suggesting little fiscal or political appetite for capitulation within the available timeframe."
                },
                {
                    "factor": "Public and Political Backlash Against Strikes",
                    "effect": "Decreases probability: Public support for strikes has eroded (now 48% opposition vs. 39% support), increasing the political cost of granting further uplifts at a time of wider public sector pay restraint and NHS service struggles."
                },
                {
                    "factor": "BMA Legal Strike Mandate Until January 2026",
                    "effect": "Increases probability: The BMA could legally escalate or prolong industrial action until very near the deadline, potentially forcing government hands if public health outcomes or NHS winter performance become critical, especially if patient harm or media outcry intensifies."
                },
                {
                    "factor": "Labour Market Shortages and International Migration",
                    "effect": "Slightly increases probability: High vacancy numbers and the risk of further doctor emigration ('Japa syndrome') elevate long-term incentives for government to stabilize the workforce, which could create preconditions for a revised offer if NHS operational risks become acute."
                },
                {
                    "factor": "Scheduled 5.4% Uplift as Benchmark",
                    "effect": "Decreases probability: Any concession must clear this bar—a high hurdle after recent cumulative increases, and at a time when the government is signaling no further 'base pay' raises."
                },
                {
                    "factor": "Upcoming NHS Winter Crisis and Unexpected Event Risk",
                    "effect": "Increases probability modestly: If the NHS faces severe disruption, e.g. pandemic-like flu levels or avoidable deaths, emergency political expediency may drive a last-minute pay offer as damage control."
                }
            ],
            "no_scenario": "The government continues to resist BMA strike action, relying on a combination of public fatigue with industrial action, declining strike support, and alternative mitigation (redeploying consultants, prioritizing emergency services). The NHS weathers the winter crisis without catastrophic collapse. Talks remain deadlocked, and no further base pay increase is enacted before the 2026 cutoff. The BMA eventually winds down action as its legal strike mandate expires.",
            "yes_scenario": "Persistent or escalated strikes, especially paired with a sharp decline in NHS performance or patient safety crises during winter, create intolerable political pressure. Media or public outcry triggers a hurried round of negotiations, possibly with face-saving framing (e.g., a targeted uplift or a 'one-off exceptional payment') leading to an enacted base pay increase over the scheduled 5.4%. Either the BMA accepts or the government pushes it through by other means in late 2025.",
            "final_reasoning": "The probability of a further pay uplift hinges on the interplay of strike leverage, fiscal constraints, and political risk. The government appears resolutely opposed to further pay increases, armed with public opinion data and a clear narrative about affordability. However, the history of post-2008 NHS labor disputes shows repeated patterns of initial government resistance followed by late-stage concessions, particularly if operational and reputational risks mount. Given the legal strike mandate into January 2026, BMA capacity to maintain disruption (even if diminished) persists nearly to the resolution date.\n\nNevertheless, the public appears less sympathetic now than during previous strike cycles, winter operational planning is reportedly more robust, and the government has explicitly sold the current deal as a high-water mark—meaning a climbdown is more politically damaging unless triggered by exceptional circumstances. The need for the offer to be *enacted* (not merely agreed) by year-end is a further procedural hurdle.\n\nGiven all the above, my base rate—historically, post-strike NHS pay improvements after multiple strikes occur about 30-40% of the time; short timeframes and entrenched standoffs slightly lower this. But skill shortages and the BMA’s legal mandate do modestly increase the chance of a last-minute reversal in case of severe system stress. Overall, a Yes remains a live possibility if circumstances spiral, but the weight of evidence (government resistance, fiscal pressures, public opinion, benchmarked increases, and news tone) means that a No is somewhat more likely.\n\nProbability: 35%.",
            "final_probability": 35
        },
        "Economics (Collective Bargaining Theory)": {
            "time_to_resolution": "about 7 weeks (question resolves Jan 1, 2026; today is Nov 10, 2025)",
            "perspective_relevance": "As an economist specializing in collective bargaining theory, I analyze how the leveraging power of labor unions, government budget constraints, political costs of disruption, and historic patterns of strike resolution interact to produce negotiated outcomes in public sector labor disputes. My perspective allows a systematic, comparative view of industrial action outcomes in the NHS, recognizing the institutional, economic, and signaling factors at play.",
            "status_quo": "Resident doctors in England have received an average 28.9% pay increase over the period 2022–2025, with a further 5.4% uplift scheduled for 2025–26. The government insists that no further pay rise is affordable or forthcoming, despite ongoing strikes. The BMA continues to strike over both pay and job issues, but the government is holding firm and public support for strikes is waning.",
            "perspective_derived_factors": [
                {
                    "factor": "Bargaining leverage from strikes",
                    "effect": "Increases probability slightly; strikes have historically compelled the government to improve offers when disruption threatens to escalate, particularly if patient safety and NHS winter capacity are jeopardized."
                },
                {
                    "factor": "Government fiscal and political stance",
                    "effect": "Decreases probability; Labour Health Secretary Wes Streeting has explicitly ruled out further pay increases, citing budgetary constraints and significant pay rises already awarded (28.9%), and has political leeway given declining public support for strikes."
                },
                {
                    "factor": "Timing and time pressure",
                    "effect": "Decreases probability; with only about 7 weeks to resolution and the government adopting a tougher stance, time for new negotiations and implementation is very short."
                },
                {
                    "factor": "Historical base rates of late-year wage concessions",
                    "effect": "Decreases probability; while previous NHS strikes have eventually yielded higher offers, these have typically taken months rather than being agreed/enacted within the final weeks of a year, especially after several rounds of negotiation and large uplifts already given."
                },
                {
                    "factor": "Scope for non-pay concessions/face-saving solutions",
                    "effect": "No effect for resolution; government may offer exam-fee coverage, job expansion etc., but these do not count for this question's pay-only criteria."
                },
                {
                    "factor": "Public opinion and disruption effects",
                    "effect": "Increases probability slightly; major NHS disruption during winter exerts pressure for compromise, but polling now shows more opposition than support for strikes, weakening this."
                }
            ],
            "no_scenario": "Strikes continue through late 2025, but the government does not move on pay and instead offers only job expansion and non-pay measures. The BMA either calls off action with minimal gains or maintains strikes with no further pay deal enacted. The 5.4% uplift proceeds as planned with nothing higher agreed/enacted before year-end.",
            "yes_scenario": "Winter strikes cause severe NHS crisis, hospitals and public opinion turn against government, compounding strain on Labour government in its first full year. Government re-enters negotiations, a pay offer above 5.4% is accepted and enacted—possibly a small incremental uplift—by or just before December 31, 2025.",
            "final_reasoning": "Collective bargaining theory emphasizes strikes as a tool to extract concessions, with settlement likelihood shaped by economic constraints, institutional norms, timing, and public/political costs. Here, several rounds of strike/negotiation have occurred. The new Labour government has made clear that pay is 'off the table' due to budget constraints and prior large increases, while also signaling strong opposition to perceived union brinkmanship ('holding the country to ransom'). With only 7 weeks left, the government appears highly resistant to further pay movement, especially as strike support has fallen and the recent large increase (28.9%) significantly exceeds average public sector settlements. Importantly, the government's strategy is now to resist, not conciliate. Given these dynamics, a late-breaking pay settlement before Jan 1, 2026 (and enacted, per resolution) is historically rare and would require an abrupt political about-face following intractable postures. Non-pay deals and job expansions are likely, but these do not qualify. Unless there is catastrophic NHS disruption that forces a last-minute reversal (which remains possible but low-probability), the base rate for immediate, late-year pay concessions after multiple failed offers is low. Therefore, the probability that resident doctors in England will receive a further (enacted) pay increase above 5.4% before 2026 is low, but not zero.",
            "final_probability": 8
        },
        "Sociology (Social Movements Theory)": {
            "time_to_resolution": "About 1 year and 2 months (expected resolution: Jan 1, 2026; forecast date: Nov 10, 2025).",
            "perspective_relevance": "As an expert in Sociology (Social Movements Theory), my insights focus on the dynamics of contentious collective action, union-state bargaining, strike efficacy, resource mobilization, political opportunity structures, and shifting public opinion—factors that are instrumental in understanding whether medical labor unrest will lead to policy change. I can identify both near-term protest leverage and long-term institutional constraints, and integrate status quo tendencies against breakthrough bargaining.",
            "status_quo": "The status quo is a government holding the line at a 5.4% basic pay uplift for the 2025–26 financial year, publicly and repeatedly stating that further pay rises are unaffordable, and an employer (NHS England) taking a tough stance on future strike leverage. Strikes have been frequent but have so far yielded only non-pay concessions (training spots, fees) and rhetoric, not substantive new pay offers.",
            "perspective_derived_factors": [
                {
                    "factor": "Historical Precedent and Base Rate for Concession",
                    "effect": "In the 2022–24 cycle, protracted strikes sometimes produced improved offers in the eleventh hour. But the current stance is more combative and the public is less sympathetic, which historically reduces concession rates from government."
                },
                {
                    "factor": "Political Opportunity Structure",
                    "effect": "With Labour in power and facing other fiscal crises, the government is doubling down on affordability rhetoric, reducing the opening for a sudden pay climbdown."
                },
                {
                    "factor": "Strike Capacity and Movement Resources",
                    "effect": "While the BMA retains a strike mandate into January 2026, repeated industrial action can erode internal resolve, especially as public opinion sours, and if the government effectively manages disruptions (e.g., by redeploying senior staff). Diminishing protest leverage makes further pay uplift less likely."
                },
                {
                    "factor": "Public Support and Media Framing",
                    "effect": "Support for the doctors’ strikes has fallen below 40% according to cited polls, a steep drop from the majority support of previous years. Public fatigue and reframing strikes as irresponsible or 'ransom' further constrain the government’s room to manoeuvre."
                },
                {
                    "factor": "Bureaucratic and Fiscal Constraints",
                    "effect": "Both the government and NHS explicitly cite unaffordability, with projections on additional costs per 0.5% increase. There are unequivocal assertions that no further pay increase is on the table—even at the cost of enduring further strikes."
                },
                {
                    "factor": "Union Internal Dynamics",
                    "effect": "Movements can fragment: generational divides and member fatigue (with some junior doctors returning to work, emigrating, or calling for moderation) weaken the BMA’s bargaining position."
                }
            ],
            "no_scenario": "Negotiations remain deadlocked, with repeated but diminishingly impactful BMA-led strikes. The government stands firm on fiscal constraints, ‘resistance’ increases within NHS management, and the BMA is unable to regain sufficient public or institutional leverage to force a further pay offer. By Jan 1, 2026, no new base pay increase has been both offered AND enacted—merely non-pay, deferred, or symbolic gestures, or unaccepted recommendations. Strikes may continue or dwindle, but pay rates stay at the 5.4% uplift.",
            "yes_scenario": "A severe and unforeseen crisis—such as a catastrophic winter within the NHS, mass resignations, or a high-profile patient safety disaster—creates acute political risk. Public and media opinion swings sharply, and government, facing existential threat to stability or legitimacy, rapidly enacts an additional average pay increase for resident doctors before 2026, regardless of earlier rhetoric. Alternatively, backbench Labour rebellion or legal/fiscal windfall unlocks new resources unexpectedly. BMA is able to claim victory and strikes are called off.",
            "final_reasoning": "Base rates for major public sector pay concessions diminish with time as governments retrench after a series of strikes, and political will hardens—especially with declining public support and persistent fiscal austerity. The government’s rhetoric has hardened to a 'no further money' position and NHS England is structurally committed to a tougher line, with on-record support from NHS management for 'resistance.' Recent offers have focused on non-pay elements. Sociology’s resource mobilization and political process theory would consider the BMA’s protest cycle to be at the wane stage: receding public sympathy, internal fracturing, limited disruption capacity, and absence of acute exogenous shocks. The window for government climbdown is historically closing, not opening. While social movements sometimes achieve last-minute gains, all current material (including explicit government and managerial statements, and declining public support) push the odds toward a resolved stasis rather than breakthrough. Extreme events (e.g. a sudden NHS breakdown over winter) are possible but not probable. Taking all together, there is a low but non-negligible chance (<1-in-5) of last-minute concessions—making a strong, but not absolute, No the proper call.",
            "final_probability": 14
        },
        "Sociology (Professionalization Theory)": {
            "time_to_resolution": "Approximately 1 month and 20 days until January 1, 2026",
            "perspective_relevance": "As an expert in Sociology (Professionalization Theory), I focus on the historical dynamics of professional closure, labor bargaining power, and the legitimation strategies used by established professions within the state. Resident doctors (junior doctors) have a high degree of collective organization and legal legitimacy; their repeated strikes reflect both strong professional solidarity and a capacity to extract concessions under professional-recognition norms. However, the state can also leverage public opinion, division within the profession, and economic necessity narratives to resist further uplifts.",
            "status_quo": "The status quo is a 5.4% average uplift for 2025–26 previously agreed; the UK government has publicly stated no further uplift is affordable and recent offers have excluded new pay rises. Resident doctors have engaged in frequent strikes with diminishing public support and hardened government resistance.",
            "perspective_derived_factors": [
                {
                    "factor": "Erosion of Professional Legitimacy and Public Support",
                    "effect": "Decreases probability. Strikes are increasingly portrayed as irresponsible, lowering public sympathy, which is vital for leveraging concessions in professions justified by public service. Sociological theory indicates that professional closure weakens under declining legitimacy."
                },
                {
                    "factor": "Government Fiscal Constraints and Political Climate",
                    "effect": "Decreases probability. With Labour in power, framing itself as financially disciplined and 'resetting' post-pandemic spending, repeated assertions have been made that no further pay raise is possible; the government is also signaling determination not to appear 'hostage' to sectoral unions."
                },
                {
                    "factor": "Industrial Action Fatigue and Policy Precedent",
                    "effect": "Decreases probability. The BMA has called over a dozen strikes since 2023. There is now open debate within the medical profession about the appropriateness and efficacy of continued industrial action, and explicit government messaging about ending 'consequence-free' strikes. The system has made one-time concessions in the past, but each new round of action has produced less tangible gain."
                },
                {
                    "factor": "Historical Base Rate for New/Public Sector Pay Offers After Large, Recent Settlement",
                    "effect": "Decreases probability. Large multi-year settlements (over 20% cumulative for junior doctors recently) tend to exhaust immediate political will for further uplifts within a two-year window. Historically, rapid sequential pay deals are rare unless new exogenous shocks (e.g., COVID, sharp inflation spikes) emerge, which are not currently evident."
                },
                {
                    "factor": "Professionalization Strength: Ability to Disrupt and Self-Justify Action",
                    "effect": "Marginally increases probability. Resident doctors still form a vital professional cohort in the NHS, with their withdrawal threatening service continuity and, in theory, putting pressure on government. However, this effect diminishes as government and NHS management adapt contingencies and as the profession's closure is threatened by job creation bottlenecks."
                }
            ],
            "no_scenario": "Despite further industrial action or public appeals, the government stands firm, using a technocratic and economic argument to refuse further pay increases. The BMA maintains pressure but fails to force meaningful negotiation. An uplift is perhaps discussed for the following year (2026–27), but nothing is enacted or offered before January 1, 2026. Strikes continue or tail off with no pay change.",
            "yes_scenario": "A combination of severe winter NHS pressure, cascading service failures, or an unexpected crisis (e.g. major flu epidemic, acute staff shortages) prompts a political rethink. To avert electoral/political backlash or in response to evidence of worsening staff attrition, the government rushes through a new uplift, just clearing the deadline.",
            "final_reasoning": "Nearly every relevant indicator points toward a No outcome: hardened government and NHS management stance, repeated and explicit rejection of further pay, decreased public support, and a substantial recent uplift (over 20%). Professionalization theory suggests the BMA’s leverage is waning: without wider societal legitimation, further closure for financial gain becomes much more difficult. While the ongoing winter crisis could, in theory, force the government's hand, this would require either a major exogenous event or clear evidence that non-pay solutions have utterly failed. Both sides expect only a fraction of the public to be strongly mobilized, and most specialist/professional closures only succeed with broad social or elite buy-in—which is not currently present. The only plausible Yes scenario is a severe, unexpected system crisis, but this probability is under 10% given historic precedents and current statements. In sum: No is overwhelmingly likely before Jan 1, 2026.",
            "final_probability": 7
        }
    },
    "deliberation_probability": [
        8,
        5,
        13,
        11,
        10,
        20,
        27,
        35,
        8,
        14,
        7
    ],
    "deliberation_mean_probability": 14.363636363636363,
    "deliberation_sd": 9.341014155569269,
    "deliberation_probability_result": 14,
    "group_results": {
        "LabourRelationsIndustrialRelationsPractice": {
            "forecaster_to_engage": "EconomicsLabourMarketEconomics",
            "response_type": "critique",
            "response": "A 35% chance is, frankly, wildly optimistic given everything we know about UK industrial relations, the NHS's current posture, and the explicit signals coming from the new Labour government. You cite history of late-stage NHS concessions, but you're ignoring the context: this government cannot afford to look like it's being 'held to ransom' mere months after a historic uplift and with a fiscal straitjacket explicitly communicated to the public. The notion that the BMA’s strike mandate alone represents 'leverage' is undermined by collapsing public support, increased managerial resistance within the NHS, and clear evidence of government resolve. Administrative headwinds alone make enacting a new deal before year end near impossible, especially with the window shrinking and political capital for a last-minute U-turn nonexistent. By inflating the influence of 'operational and reputational risks,' you disregard the tight institutional and political parameters. The base rate may have its place, but you can't treat past years' deals as comparable when the signals of entrenchment, timing, and public mood are this decisive. The likeliest outcome is deadlock, not a late-year climbdown; your probability of over one in three is a clear overshoot."
        },
        "LabourRelationsTradeUnionNegotiation": {
            "forecaster_to_engage": "PoliticalScienceInterestGroupTheory",
            "response_type": "critique",
            "response": "You set your probability at 27%—a stark outlier not just among labour relations experts, but among almost all empirical readings of the present deadlock. You overplay the BMA’s 'collective leverage' and essential service status, quoting interest group theory as if those alone can override fiscal and political realignments. But what does leverage matter if management has grown immune? The BMA has repeatedly escalated but gained little; declining public support, tougher NHS management, and explicit Labour intransigence mean that the usual cycle of strikes yielding movement has been disrupted. The government's reputation risk for doing a humiliating U-turn—after already touting the scale of the last pay deal and warning endlessly about affordability—is much higher than in those 'base rate' precedent cases. Unless you see clear evidence that a truly system-shaking NHS crisis will force their hand, your forecast inflates a tail-risk into something routine. At this stage, all institutional, political, and timeline constraints favour stonewalling, not last-second face-saving money. Your probability should be much lower."
        },
        "UkPublicSectorPolicyNhsWorkforcePlanning": {
            "forecaster_to_engage": "PoliticalSciencePunctuatedEquilibrium",
            "response_type": "critique",
            "response": "A 20% probability in favor of an enacted further pay uplift is simply too generous given the realities of the current industrial relations climate. Punctuated equilibrium theory is best reserved for periods where latent policy instability is matched by political opportunity or public crisis—neither of which is truly present here. All signs point to government and NHS management resolve, a media environment increasingly hostile to further doctor disruption, and structural impediments to even a rapid pay change (not just agreement, but technical enactment, inside a very tight timeframe). You lean too heavily on the base rate of late policy reversals, underestimating that such shifts typically follow true systemic collapse or a government under existential threat—conditions absent in the polling and political posture today. NHS winter pressures are built into government risk calculations, and their current toughness signals they're ready to ride out all but the most catastrophic events. Frankly, the theory’s tail risk has been overemphasized at the expense of the overwhelming status quo resilience."
        },
        "UkPublicSectorPolicyUkGovernmentPayReview": {
            "forecaster_to_engage": "SociologyProfessionalizationTheory",
            "response_type": "defense",
            "response": "It's rare I see a probability this low that is still utterly defensible, but you're exactly right to drive home how little daylight exists between the government's explicit, repeated statements and a baked-in refusal to offer a further uplift—regardless of social or professional legitimation. You're correct that the BMA's strategic closure has lost its force when public endorsement and elite consensus have evaporated, especially after an enormous recent settlement. Professional-only leverage is weak in a context of government retrenchment and public exhaustion with disruption. Systemic crisis is the only, very remote, path to reversal here—requiring a scale of collapse that we demonstrably have not yet seen, and that no political actors appear to expect. Your sub-10% probability is well-justified: the odds of enactment before year end are vanishingly slim unless the unthinkable happens."
        },
        "PoliticalSciencePublicChoiceTheory": {
            "forecaster_to_engage": "EconomicsCollectiveBargainingTheory",
            "response_type": "defense",
            "response": "Your forecast succinctly slices through the bargaining cycle noise by putting the focus where it belongs: on institutional inertia, procedural lag, and the new government's unmistakable commitment to a hard line. Too many forecasters indulge the fantasy of last-minute capitulation to strikes as if the underlying fiscal, political, and timing realities are somehow trivial. But you recognize that after historic increases, mounting public fatigue with the BMA, and explicit ministerial warnings, the government has both the incentive and cover to resist union brinkmanship—even through severe NHS turbulence. Your call-out of the difference between non-pay and pay concessions is especially astute: many confuse job/training offers with real wage adjustments eligible for question resolution. Only a catastrophic, highly salient NHS breakdown could force a reversal, and even then the timeline for enacted change is razor thin. Your probability (8%) is tightly pegged to reality—anything higher is just wishcasting in the teeth of clear government resolve and process bottlenecks."
        },
        "PoliticalSciencePunctuatedEquilibrium": {
            "forecaster_to_engage": "LabourRelationsTradeUnionNegotiation",
            "response_type": "defense",
            "response": "This is one of the few forecasts that takes the government’s explicit entrenchment on pay both literally and seriously. You identify, correctly, that government rhetoric isn’t posturing—it’s a coordinated message built on political capital, fiscal red lines, and a desire to avoid a post-settlement precedent. The focus on government offering only non-pay elements (training, exam fees) is critical, as these don’t meet the question’s resolution bar. Your emphasis that a further ENACTED pay increase is both procedurally and politically fraught—especially as time dwindles and administrative inertia grows—is spot on. Others overstate tail risk, but your single-digit (5%) estimate grounds itself in the hard realities of public sector negotiation timelines and the comparative weakness of late-phase strike leverage. This is a rare case of clear-eyed probability discipline that others should heed."
        },
        "PoliticalScienceInterestGroupTheory": {
            "forecaster_to_engage": "EconomicsLabourMarketEconomics",
            "response_type": "critique",
            "response": "A 35% probability in this environment? That's textbook over-weighting of raw base rates with a near-total disregard for the endogenous shift in institutional and political context. You recite post-2008 NHS disputes and late-stage pay reversals as if cyclical government capitulation is an iron law, but you're ignoring the qualitative shift: this government, barely in office, CANNOT blink on fiscal credibility this soon after championing the supposed end of 'Tory chaos.' NHS management has openly strategized to minimize strike impact and the public's patience is GONE—your own cited opinion figures show less than 40% support, effectively neutering the BMA's main leverage. Even with winter risk, the institutional machinery cannot deliver, much less negotiate, enact, and validate a new pay deal on a sub-two-month clock. Your figure is nearly triple what rigorous application of current constraints implies—wishful thinking dressed as base-rate empiricism."
        },
        "EconomicsLabourMarketEconomics": {
            "forecaster_to_engage": "SociologySocialMovementsTheory",
            "response_type": "defense",
            "response": "This is one of the more analytically honest forecasts in the field: you recognize that the BMA's disruptive capacity is heavily diminished once public support, elite legitimation, and political opportunity have waned. Too many others indulge in theoretical tail risks or treat strike cycles as though each wave is equally potent, when in reality the government now has both learned defensive routines and hardened ideological will against further NHS pay drift. Your application of social movement 'wane cycles'—focusing on declining mass participation, resource exhaustion, and public fatigue—adds crucial context others miss. The sub-1-in-5 odds you assign is neither fatalistic nor wishy-washy: it’s anchored in empirical sociology, appreciating that even intense disruption rarely overcomes a locked-down, risk-averse state, especially this late in the process and on this timeline. Others should take note."
        },
        "EconomicsCollectiveBargainingTheory": {
            "forecaster_to_engage": "PoliticalScienceInterestGroupTheory",
            "response_type": "critique",
            "response": "The 27% figure you attach to a Yes outcome is an unreasonably high estimate given every major constraint currently in play. Relying on the theoretical potential of the BMA's collective action—while ignoring the new Labour government's strategic incentives and public fatigue with strike cycles—is a mistake. You treat interest group leverage as if it's uncoupled from practical effectiveness: but leverage only matters if it compels the employer to move, and all indicators point toward growing state immunity. Repeated hardline statements, high-profile spending limits, and the government's need to assert fiscal responsibility early on mean the 'tail risk' of a forced pay climbdown is lower than in any recent NHS dispute. By treating the BMA's structural position as the main parameter, you fundamentally underweight the government's need to avoid a humiliating precedent for other public sector pay rounds. Short of an epic NHS calamity, which you don't show is brewing, your forecast isn’t just on the high side—it’s disconnected from the decisively changed rules of the game."
        },
        "SociologySocialMovementsTheory": {
            "forecaster_to_engage": "PoliticalSciencePunctuatedEquilibrium",
            "response_type": "critique",
            "response": "Applying punctuated equilibrium to this scenario is only as meaningful as the evidence for impending 'policy punctuation.' The reality: despite recurrent NHS turbulence, none of the preconditions for policy rapid shift—a sudden, massive exogenous shock, broad public outrage, or elite fracture—are present. Your 20% probability inflates the likelihood that a routine winter crisis suffices, when the actual structure is of a government and NHS bureaucracy actively pre-committed to austerity and stonewalling, even in the face of disruption. Public and parliamentary exhaustion with strikes, well-telegraphed resistance (and even operational hardening) by NHS management, and no sign that the BMA can spark genuine panic, make this 'punctuation' thesis stretched past breaking. You're buying too much into theory at the cost of hard-nosed institutional analysis: the window isn't closing—it’s been bolted and barred. A tail risk remains, but it's much slimmer than your estimate, which overshoots by overcorrecting for a crisis that almost certainly won’t erupt at the required scale."
        },
        "SociologyProfessionalizationTheory": {
            "forecaster_to_engage": "LabourRelationsIndustrialRelationsPractice",
            "response_type": "defense",
            "response": "This is a rare example of someone not seduced by the cyclical strike-concession mythology. You correctly spotlight the new Labour government's lockstep fiscal messaging and the collapse of public support as truly salient variables—factors that social theory tells us utterly degrade a profession's collective bargaining clout. I especially appreciate how you challenge the BMA's maximalist framing and emphasize the real institutional and timing obstacles to last-minute 'face-saving' uplifts. Too many take abstract models or past years as gospel, but your argument is ruthlessly tethered to what's actually different NOW: political capital, negotiation timelines, and a stone-cold public sector context. Your probability is not just conservative—it's the only intellectually honest way to treat so many concurrent headwinds to professional closure. Well reasoned, empirically grounded, and unafraid to discount tail risk beyond what the evidence and sociology of professions warrant."
        }
    },
    "revision_results": {
        "Labour Relations (Industrial Relations Practice)": {
            "my_phase1_final_probability": 8,
            "reasoning_for_revised_probability": "The group forecasts overwhelmingly reinforce the low probability assigned in my initial forecast. All relevant expert perspectives—labour relations, NHS policy, political science, and sociology—converge on a 'No' outcome, citing the hardened government line, practical impossibility of swift enactment before 2026, declining public support, and rare historical precedents for late-stage pay increases after protracted deadlock. Notably, even the most optimistic forecasts (excluding the outlier at 35%) cluster near or below 20%, with the modal range at or below my own probability. The critique of the higher probability further strengthens this consensus, highlighting administrative and political barriers to a rapid government climbdown. Given no new material evidence from the discussion justifying an increase—and if anything, a slight tilt downward—my probability estimate remains at 8%.",
            "revised_probability": 8
        },
        "Labour Relations (Trade Union Negotiation)": {
            "my_phase1_final_probability": 5,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, especially the critiques of higher probabilities (notably the 27% and 35% forecasts), I find even more confidence that my initial probability is appropriate or possibly slightly high. The consensus among industrial relations, public sector policy, and even most political science perspectives is that the government's entrenchment, declining strike leverage, administrative barriers to rapid implementation, and explicit fiscal messaging create nearly insurmountable obstacles for a further enacted pay rise before 2026. While tail risks (such as a system meltdown) technically remain, all signals point to deadlock being overwhelmingly likely. There was no compelling new evidence or argument presented to justify raising my probability. If anything, group reasoning supports a possible downward nudge, but my initial 5% already appropriately captured the low but nonzero chance of a true crisis-driven reversal. Therefore, I maintain my original probability.",
            "revised_probability": 5
        },
        "UK Public Sector Policy (NHS Workforce Planning)": {
            "my_phase1_final_probability": 13,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, my confidence in the low-probability outcome is reinforced, if anything. The strongest arguments across sectors (labour relations, public sector pay, economics, political science) converge on a narrow window for policy reversal, considerable barriers to rapid enactment, eroding public support for striking doctors, large recent uplifts, and a government resolutely opposed to further pay increases in the current fiscal year. Engagements critiqued moderate-to-high outliers (20–35%), using sound arguments about the uniqueness of the current deadlock, institutional limits, and deadline pressure. No compelling new evidence emerged to justify an upward nudge; if anything, the convergence of expert doubt about tail-risk scenarios suggests even my initial estimate is robust, perhaps even slightly high. The final probability remains almost unchanged, as all critical institutional, political, and operational constraints still align toward a No.",
            "revised_probability": 12
        },
        "UK Public Sector Policy (UK Government Pay Review)": {
            "my_phase1_final_probability": 11,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, especially the critiques of higher (20%+) probability forecasts, my initial estimate stands as entirely justified, if anything, perhaps still a tick high. The firm consensus among UK policy, labour relations, and sociology perspectives is that the probability of a further *enacted* pay uplift before 2026 is very low—almost all experts point to the exceptional entrenchment of the government, diminishing public support, hardening management, and an absence of plausible political or practical mechanisms for a rapid U-turn. Arguments for a high tail risk (i.e., 20%+) have been effectively deconstructed as failing to reckon with the institutional and administrative realities. My own earlier reasoning that only a truly catastrophic and visible NHS breakdown could trigger a climbdown is, if anything, made stronger by the collective expert skepticism. Therefore, I see no reason to revise upward. In fact, I am revising slightly downward, to 8%, to reflect reinforced consensus and the persuasive arguments against a significant late surge risk.",
            "revised_probability": 8
        },
        "Political Science (Public Choice Theory)": {
            "my_phase1_final_probability": 10,
            "reasoning_for_revised_probability": "The group deliberation bolsters my initial assessment, if anything increasing my confidence that a further enacted pay uplift before 2026 is highly unlikely. Nearly all other subject matter experts place their probabilities at or below 14%, with only a few outliers above 20%-27% who are easily rebutted on institutional, timing, and political grounds. The consensus is unusually strong for a complex UK industrial relations question: there is hard evidence of government resolve, explicit ministerial statements ruling out further pay, declining public sympathy for the strike, and very little time for any new deal to both be agreed and enacted. Critiques further reinforce that, barring an outlier catastrophe, base rates of post-settlement pay reversals are negligible in this scenario. Administrative/legislative lag is a significant additional barrier. No compelling arguments emerged that warrant raising the initial estimate—in fact, the odds are arguably closer to the low end. Thus, I reaffirm my 10% forecast.",
            "revised_probability": 10
        },
        "Political Science (Punctuated Equilibrium)": {
            "my_phase1_final_probability": 20,
            "reasoning_for_revised_probability": "Group deliberation highlighted a consistently low consensus across a diverse set of fields, with nearly all expert perspectives converging on entrenched government resistance, sharply diminished public support, and extremely narrow procedural windows for any further pay enactment. Notably, the most compelling critiques pointed out that my original estimate overweighted the punctuated equilibrium 'tail risk' in an environment lacking the kind of true, overwhelming exogenous shock that historically precedes last-minute policy reversals. The forceful, consistent messaging by multiple forecasters—from labour relations to economics to public sector policy—emphasizes deadlock and institutional inertia, not policy instability. Realistically, extraordinary crisis (the only plausible Yes path) is plausible but clearly less likely than I allowed for. I am therefore revising downward to more closely align with base rates from strike deadlock scenarios and the current trajectory.",
            "revised_probability": 10
        },
        "Political Science (Interest Group Theory)": {
            "my_phase1_final_probability": 27,
            "reasoning_for_revised_probability": "Reviewing both my initial analysis and the group deliberation, the overwhelming consensus—across various disciplines, notably those grounded in empirical public sector bargaining, professionalization theory, and industrial relations—is that the probability of an enacted further pay increase before 2026 is decisively low. Critiques of my initial estimate highlighted that I over-weighted the generic leverage of interest groups and base rates from previous dispute cycles, while under-weighting the real institutional and political signals: entrenched government refusal, diminished public and elite support for ongoing strikes, and the bureaucratic/temporal challenges of delivering a new settlement before year-end. Defense of very low probabilities (sub-15%) was sharply argued, and my own critique of those forecasting above 30% reinforced that anything above single digits or low teens reflects ignoring the unique and hostile context BMA now faces. With administrative timelines and government political capital at a premium—and little to no evidence of a brewing system-wide NHS crisis that would force a reversal—I now judge the tail risk is even lower than I initially estimated.",
            "revised_probability": 13
        },
        "Economics (Labour Market Economics)": {
            "my_phase1_final_probability": 35,
            "reasoning_for_revised_probability": "After engaging with and reviewing critiques from other forecasters—especially those grounded in industrial relations and public sector pay-setting practice—it's clear I placed excessive weight on historical base rates and the possibility of a late-stage crisis-induced climbdown, while underestimating several key contemporary dynamics. These include the resolute and repeated public stance of the new Labour government, declining public support for strikes, the institutional hardening of NHS management, and severe administrative and timeline challenges for any further pay enactment within 2025. The repeated arguments that the BMA's legal strike mandate and the risk of operational collapse are less potent in this context are persuasive. While a further pay uplift is not totally out of the question—given the ever-present tail risks—the probability should be sharply revised downward to reflect these headwinds and the fact that any late proffered deal is highly unlikely to be formally enacted by January 1, 2026.",
            "revised_probability": 13
        },
        "Economics (Collective Bargaining Theory)": {
            "my_phase1_final_probability": 8,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, my conviction in a low probability outcome has only strengthened. There is remarkable consensus across industrial relations, policy, and political science perspectives: regardless of the theoretical 'tail risk' of a catastrophic NHS collapse, all real-world signals indicate an entrenched government, declining strike leverage, and clear administrative obstacles to any late-breaking deal being enacted before the deadline. Outliers who propose probabilities above 20% substantially overstate the continuing bargaining power of the BMA, misunderstanding both public fatigue and Labour’s need for fiscal discipline and reputational stability. Meanwhile, the lower-end forecasts are rooted in both historical base rates and unprecedented modern constraints. Since no new evidence or argument has emerged that justifies even a modest upward revision—and if anything, the debate revealed a sharper realism—the original estimate stands. If anything, a downward tweak would be justified, but to remain within the bounds of prior base rate exceptions, I will keep the probability at 8%.",
            "revised_probability": 8
        },
        "Sociology (Social Movements Theory)": {
            "my_phase1_final_probability": 14,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I am more convinced than ever that my initial probability may have been slightly high—even for a scenario explicitly accounting for tail risk. Both expert consensus and polemics from adjacent fields reinforce every key sociological warning sign: the government's position is not posturing, but rather emblematic of a determined institutional lock-in; the procedural/administrative timelines are prohibitive for a late-year reversal and enactment; and the only real-world scenario for Yes is a calamity on a scale we currently see no evidence for. Notably, those who estimate higher probabilities are consistently critiqued as overweighting historical base rates and undervaluing the decisive shift in the political, fiscal, and public-opinion context since the last concession cycles. No participant articulated a new, plausible, or concrete mechanism by which the BMA might overcome these reinforced barriers before January 2026, and many highlight that government and NHS management now have far less reason to yield to crisis than in previous years. Even in the most tail-risk scenarios, implementation barriers remain high. I therefore see strong justification for a further downward revision, landing just under my previous forecast.",
            "revised_probability": 10
        },
        "Sociology (Professionalization Theory)": {
            "my_phase1_final_probability": 7,
            "reasoning_for_revised_probability": "After group deliberation, my core reasoning is reinforced, not weakened. In fact, the weight of consensus among well-argued forecasts (Labour Relations, Public Sector Policy, Trade Union, and Social Movements Theory) converges around single-digit odds, and critiques against the few outlier higher estimates stress exactly the professionalization theory points: government resolve, procedural/administrative barriers, timeline tightness, and rapidly eroding public legitimation for further strike-based leverage. No new material factor increases tail risk—the only scenario for a Yes lies in an extreme, currently unmanifested system breakdown. The collaborative critique actually suggests 7% could be slightly generous, but I will retain this to allow for deep-winter volatility. My probability stands: a Yes outcome is highly unlikely unless the genuinely unprecedented occurs very swiftly.",
            "revised_probability": 7
        }
    },
    "revision_probability": [
        8,
        5,
        12,
        8,
        10,
        10,
        13,
        13,
        8,
        10,
        7
    ],
    "revision_mean_probability": 9.454545454545455,
    "revision_sd": 2.5441555126853532,
    "revision_probability_result": 9,
    "question_details": {
        "id": 38778,
        "title": "Will resident doctors in England receive a further pay increase before 2026?",
        "created_at": "2025-08-31T05:07:48.492133Z",
        "open_time": "2025-11-10T17:13:38Z",
        "cp_reveal_time": "2025-11-10T18:43:38Z",
        "spot_scoring_time": "2025-11-10T18:43:38Z",
        "scheduled_resolve_time": "2025-12-31T23:59:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-11-10T18:43:38Z",
        "actual_close_time": "2025-11-10T18:43:38Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "This question is synced with an identical question on Metaculus. The original question opened on 2025-07-18 13:53:08 and can be found [here](https://www.metaculus.com/questions/38884). This question will resolve to the same value as the synced question. The original question's background info at this time is below. \n\nResident (previously junior) doctors in England, represented by the British Medical Association (BMA), [have announced](https://www.bbc.co.uk/news/articles/cp820586x9do) a five-day strike beginning 25 July 2025, amid a long-running dispute over real-terms pay cuts since 2008.\n\nHealth Secretary Wes Streeting, has so far resisted the BMA’s demand for full pay restoration. However, [past strikes in 2022-2024](https://en.wikipedia.org/wiki/2022%E2%80%932024_National_Health_Service_strikes) led to an improved offer after prolonged industrial action.\n\nRead also: [Why are resident doctors striking and what are they paid?](https://www.bbc.co.uk/news/articles/cn0qyl4ljjko)\n\n`{\"format\":\"metac_closes_in_period\",\"info\":{\"post_id\":38884,\"question_id\":38199}}`",
        "resolution_criteria": "This question will resolve as **Yes** if, before January 1, 2026, the UK Department of Health and Social Care (DHSC) enacts a pay offer for resident doctors in England, which both:\n\n* Exceeds the 5.4% average uplift already confirmed for the 2025–26 financial year, AND\n* Is accepted by the BMA or enacted regardless, through unilateral government decision or pay review body recommendation.",
        "fine_print": "* This question will resolve as **Yes** only if the offer is enacted. If it is announced, but not enacted before 2026 (e.g., because it is under negotiation or because of bureaucratic delays), this question will resolve as **No**.\n* Only base pay uplifts for resident doctors in England count.&#x20;\n* Non-pay elements (e.g. working conditions, pensions, bonuses) will be ignored.\n* Partial or targeted uplifts (e.g., to certain training grades only) will count if they represent a higher average increase than the scheduled 5.4%.",
        "post_id": 39401,
        "aggregations": {
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Resident doctors say strike will continue until government takes action**\nThe Nigerian Association of Resident Doctors (NARD), led by President Muhammad Suleiman, announced that its nationwide strike will continue indefinitely until the federal government takes concrete action to fulfill agreed-upon commitments. The strike entered its tenth day on November 10, 2025, and stems from years of unmet demands, including unpaid arrears from salary adjustments, hazard and accoutrements allowances, delayed promotions, and poor working conditions. Suleiman criticized the government's claim that N41.3 billion was released to cover 25–35% arrears, stating that fewer than 60% of NARD members received payment alerts and that alerts have since ceased. He also noted that an additional N2.9 billion, promised for other allowances, had not been released as scheduled. The Ministry of Health and Social Welfare had previously claimed it approved N11.995 billion in payments within 72 hours and disbursed N10 billion in August for arrears and N10.6 billion for the 2025 Medical Residency Training Fund, while announcing recruitment waivers to address staff shortages. However, NARD insists these announcements do not reflect reality, as most members have not received payments. Reports from major hospitals in Lagos, Abuja, and Kaduna revealed severely reduced services, with many wards closed, outpatient units suspended, and only emergency and antenatal units operational. Suleiman emphasized that the strike is not only about financial demands but also about dignity, respect for agreements, safety, and survival. He reiterated that the strike will continue until the government demonstrates sincerity through tangible actions, stating, 'Until we agree on these issues and actions are taken, the industrial action will continue.'\nOriginal language: en\nPublish date: November 10, 2025 11:43 AM\nSource:[Premium Times Nigeria](https://www.premiumtimesng.com/health/health-news/834270-resident-doctors-say-strike-will-continue-until-government-takes-action.html)\n\n**Doctors branded 'farcical' for voting against improvements to GP appointments**\nThe British Medical Association (BMA) was criticized as a 'farce' by Care Minister Stephen Kinnock after its members voted against the government's proposed online GP appointment system, which aims to allow patients to book appointments from 8am to 6:30pm Monday to Friday. Kinnock accused the BMA of obstructing vital patient care improvements and endangering safety ahead of winter. The BMA's motion argued that the online access mandates would reduce care to 'box-ticking targets,' were inadequately funded, and could lead to missed urgent patient requests. The union's GP committee for England was instructed to prepare options for action, including strikes or non-compliance. Dr Tom Dolphin, BMA council chairman, warned that unfulfillable promises about online access could push GP practices to the brink, reduce available appointments, and risk missing urgent cases. The dispute reflects deteriorating relations between Health Secretary Wes Streeting and the BMA. The online booking initiative is central to Streeting’s pledge to end the 8am phone scramble for GP appointments, as online contact is now the most common way patients reach their surgeries. Meanwhile, resident doctors (formerly junior doctors) are preparing to strike for five days starting November 14 over pay and working conditions. Streeting labeled the strike 'reckless, irresponsible, and widely avoidable,' noting he had offered to cover exam fees to prevent it. Resident doctors have received an average 28.9% pay increase over three years, among the highest in the public sector.\nOriginal language: en\nPublish date: November 09, 2025 06:00 AM\nSource:[Yahoo](https://www.yahoo.com/news/articles/doctors-branded-farcical-voting-against-060000720.html)\n\n**Doctors' strike looms as Labour vents anger at trade union**\nEngland's care minister, Stephen Kinnock, has publicly condemned the British Medical Association (BMA), accusing its leadership of turning the union into a 'farce' and endangering patient safety ahead of winter. The dispute centers on a planned strike by resident doctors—formerly known as junior doctors—scheduled from Friday to Wednesday, marking the 13th walk-out since March 2023. The BMA rejected the government’s latest offer, which included accelerating training place expansion and covering exam fees. The conflict also involves a government directive requiring general practitioners (GPs) to implement online appointment booking to eliminate the 8am telephone booking rush, a move doctors have criticized over patient safety concerns. Kinnock stated the BMA leadership is obstructing vital changes that would benefit both patient care and the goals of medical staff, calling the strike 'founded on untruths' and a threat to safety during a critical period. The strike is set to begin on November 09, 2025.\nOriginal language: en\nPublish date: November 09, 2025 06:00 AM\nSource:[EXPRESS](https://www.express.co.uk/news/politics/2131439/doctors-strike-looms-labour-vents)\n\n**Time to shift ground - The Nation Newspaper**\nThe Nigerian Association of Resident Doctors (NARD) launched a nationwide strike on the midnight of November 1, 2025, following repeated warning strikes and a list of 19 demands that predate the current government. The strike is ongoing in approximately 91 health institutions across Nigeria. Key demands include the implementation of the Consolidated Medical Salary Structure (CONMESS), release of the 2025 Medical Residency Training Fund (MRTF) with inflation adjustments, health insurance for all medical and dental professionals, clearance of outstanding salary arrears, pension benefits, corrected allowances, specialist allowances, full entitlement for house officers, reinstatement of five resident doctors unjustly terminated at the Federal Teaching Hospital in Lokoja, end to casualisation, promotion scales, reversal of non-medical personnel appointments as honorary consultants, and the immediate establishment of health management boards. The article emphasizes that the strike, now over a week old, is causing casualties and threatens progress in Nigeria’s health sector. It warns of significant economic losses and the risk of reversing gains made by the government. The Nation Newspaper stresses that healthcare workers are vital national assets and that Nigeria’s severe doctor-to-patient ratio—below UN benchmarks—undermines public health and life expectancy. While acknowledging the government’s challenges, the article criticizes the disparity between public officials’ generous welfare packages and doctors’ unpaid salaries and allowances, including five-year-old COVID-19 allowances. It urges the Federal Government to immediately reopen negotiations with NARD, prioritize non-monetary issues to ease working conditions, and implement realistic, long-term policies. The paper also calls on NARD to uphold its Hippocratic Oath and show compassion, as the public suffers when professionals are caught in disputes. The underlying message is that both sides must commit to sustainable solutions to prevent the medical profession from becoming unattractive, as seen in education, where low pay discourages young people from entering the field.\nOriginal language: en\nPublish date: November 09, 2025 05:26 AM\nSource:[Latest Nigeria News, Nigerian Newspapers, Politics](https://thenationonlineng.net/time-to-shift-ground/)\n\n**NHS England toughens stance on resident doctors’ strike**\nNHS England, under Chief Executive Sir Jim Mackey, has adopted a tougher stance toward resident doctors' strike actions, stating it will be 'much more resistant' to pay demands than in the past. Mackey warned that strikes should no longer be 'consequence-free,' citing that previous industrial actions from July 2023 to February 2024 led to over 500,000 appointments and operations being cancelled, with doctors benefiting financially through overtime. He instructed hospital leaders to continue scheduled operations to avoid future overtime costs and emphasized that safety decisions rest with NHS leaders, not the British Medical Association (BMA). Health Secretary Wes Streeting supported hospital managers, saying they have 'your backs' if they must spread staff thinly—despite BMA concerns over safety. The BMA's Melissa Ryan stated the union wants to avoid prolonged strikes but demands concrete action, not just words. The Academy of Medical Royal Colleges warned that patient safety is at risk due to uncertainty over doctor absences and urged the BMA to suspend its guidance that doctors need not inform employers of strike intentions. The BMA has accepted a 22.3% pay settlement but still plans to return to strike action.\nOriginal language: en\nPublish date: July 24, 2025 11:19 AM\nSource:[personneltoday.com](https://www.personneltoday.com/hr/nhs-england-stance-resident-doctors-strike/)\n\n**Doctors branded 'farcical' for voting against improvements to GP appointments**\nThe British Medical Association (BMA) was criticized as a 'farce' by Care Minister Stephen Kinnock after its members voted against the government's proposed online GP appointment system, which aims to allow patients to book appointments from 8am to 6:30pm Monday to Friday. Kinnock accused the BMA of obstructing vital patient care improvements and endangering safety ahead of winter. The BMA's motion argued that the online access mandates would reduce care to 'box-ticking targets,' were inadequately funded, and could lead to missed urgent patient requests. The union's GP committee for England was instructed to prepare options for action, including strikes or non-compliance. Dr Tom Dolphin, BMA council chairman, warned that unfulfillable promises about online access could push GP practices to the brink, reduce available appointments, and risk missing urgent cases. The dispute reflects deteriorating relations between Health Secretary Wes Streeting and the BMA. The online booking initiative is central to Streeting’s pledge to end the 8am phone scramble for GP appointments, as online contact is now the most common way patients reach their surgeries. Meanwhile, resident doctors (formerly junior doctors) are preparing to strike for five days starting November 14 over pay and working conditions. Streeting labeled the strike 'reckless, irresponsible, and widely avoidable,' noting he had offered to cover exam fees to prevent it. Resident doctors have received an average 28.9% pay increase over three years, among the highest in the public sector.\nOriginal language: en\nPublish date: November 09, 2025 06:00 AM\nSource:[Yahoo](https://www.yahoo.com/news/articles/doctors-branded-farcical-voting-against-060000720.html)\n\n**Doctors' strike looms as Labour vents anger at trade union**\nEngland's care minister, Stephen Kinnock, has publicly condemned the British Medical Association (BMA), accusing its leadership of turning the union into a 'farce' and endangering patient safety ahead of winter. The dispute centers on a planned strike by resident doctors—formerly known as junior doctors—scheduled from Friday to Wednesday, marking the 13th walk-out since March 2023. The BMA rejected the government’s latest offer, which included accelerating training place expansion and covering exam fees. The conflict also involves a government directive requiring general practitioners (GPs) to implement online appointment booking to eliminate the 8am telephone booking rush, a move doctors have criticized over patient safety concerns. Kinnock stated the BMA leadership is obstructing vital changes that would benefit both patient care and the goals of medical staff, calling the strike 'founded on untruths' and a threat to safety during a critical period. The strike is set to begin on November 09, 2025.\nOriginal language: en\nPublish date: November 09, 2025 06:00 AM\nSource:[EXPRESS](https://www.express.co.uk/news/politics/2131439/doctors-strike-looms-labour-vents)\n\n**Wes Streeting accuses junior doctors of 'holding country to ransom'**\nWes Streeting, the UK Health Secretary, accused the British Medical Association (BMA), representing resident doctors, of holding the country 'to ransom' after they rejected the Government's latest pay offer. The offer, presented on Wednesday, included 28.9% pay increases over three years, more specialty training places, and coverage of mandatory exam and membership fees. The BMA rejected the offer within four hours, calling it 'crumbs' and criticizing it as insufficient to address the crisis of 30,000 doctors applying for only 10,000 training spots. Dr Melissa Ryan of the BMA stated the offer failed to resolve systemic issues. Streeting responded on social media, emphasizing taxpayer sacrifices and the financial pressures on the NHS, and warned that no strike action would change the Government’s position. He reiterated that further pay increases are unaffordable. Dr Jack Fletcher, BMA’s resident doctors committee chairman, countered that the offer does not solve the jobs crisis and accused Streeting of refusing a multi-year pay deal to restore historical pay freezes. The BMA warned that strikes from November 14 to 19 remain possible unless the Government demonstrates genuine willingness to negotiate a fair, long-term solution. The dispute stems from a broader conflict over pay, with the BMA arguing that a 5.4% inflation-busting rise is inadequate. The previous July strikes had caused widespread NHS disruption.\nOriginal language: en\nPublish date: November 06, 2025 01:49 PM\nSource:[Daily Mail Online](https://www.dailymail.co.uk/news/article-15265273/Wes-Streeting-accuses-junior-doctors-holding-country-ransom-bitter-pay-disupte-reject-inflation-busting-offer-crumbs-push-ahead-crippling-NHS-strikes.html)\n\n**Resident doctor strikes: BMA rejects Streeting's offer in dispute on jobs and pay**\nResident doctors in England, represented by the British Medical Association (BMA), have rejected a new offer from Health Secretary Wes Streeting to resolve a dispute over pay and job security. The offer, announced on 5 November 2025, included doubling the number of additional specialty training posts and covering mandatory exam and royal college membership fees, but Streeting stated he could not increase pay due to 'enormous financial pressures' facing the country. The BMA's Resident Doctors Committee declared the offer 'does not go far enough.' The dispute has intensified, with the BMA accusing Streeting of 'holding doctors' jobs hostage' after he warned that further strikes could jeopardize funding for training expansions. Streeting reiterated in his offer that he would 'not be able to afford to offer the non-pay package again' and 'may also have to reconsider whether the NHS can afford the other elements we have committed to' if strikes continue. Additionally, the Health Service Journal reported that the government's rapid national investigation into maternity and neonatal services will delay publishing interim findings this year, citing the upcoming strike as a contributing factor. The BMA has scheduled five days of strike action starting 7 am on Friday, 14 November 2025, following a previous five-day strike in July 2025.\nOriginal language: en\nPublish date: November 06, 2025 01:21 PM\nSource:[British Medical Journal](https://www.bmj.com/content/391/bmj.r2348)\n\n**Are NHS workers about to strike? Junior doctors set to walk out again**\nResident doctors across England, represented by the British Medical Association (BMA), are set to strike for five days from 7 a.m. on November 14 to 7 a.m. on November 19, 2025, after rejecting the UK government’s latest offer in a prolonged dispute over pay and job security. The government, citing financial pressures, stated it cannot increase pay further, emphasizing that 'no amount of strike action will change this.' The proposed offer included speciality training and coverage for exam and membership fees, but doctors argue it 'does not go far enough.' According to the BMA, as of August 2025, 34% of resident doctors reported not having regular or substantial employment, with 10,000 job openings available for 30,000 candidates, including international applicants. Dr. Jack Fletcher of the BMA stated that '1,000 more [jobs] is not going to fix this crisis' and criticized Health Secretary Wes Streeting for failing to address the severity of the situation, noting that doctors face unemployment while patients face long wait times. Resident doctors earn a basic salary of £38,831 annually, equating to approximately £2,600 per month after tax. The strike follows previous walkouts in July 2025, and while senior doctors are being deployed to mitigate disruptions, the action is expected to severely impact access to emergency and routine care. Dr. Fletcher emphasized that strikes could be avoided if the government offers a multi-year pay deal and a genuine solution on job creation, warning that the current stance risks a real-terms pay cut.\nOriginal language: en\nPublish date: November 06, 2025 08:18 AM\nSource:[Yahoo](https://ca.news.yahoo.com/nhs-workers-strike-vote-yes-104632498.html)\n\n**Resident doctors set to strike for five days over pay and job dispute**\nResident doctors in England, represented by the British Medical Association (BMA), have rejected a government pay and job offer, leading to a planned five-day strike from 7 a.m. on 14 November to 7 a.m. on 19 November 2025. The government's package, presented by Health Secretary Wes Streeting, included additional specialty training places and coverage of mandatory exam and membership fees, but excluded any pay increases. Streeting stated that financial constraints prevent further pay concessions, asserting that 'no amount of strike action will change this' and warning that the offer was 'not going to change' the situation. Dr Jack Fletcher, BMA's Resident Doctors Committee chairman, criticized the offer as insufficient, noting that 30,000 doctors applied for only 10,000 training places in the current year, and that adding 1,000 more spots would not resolve the systemic job crisis. He emphasized that a multi-year pay deal restoring pay over time could prevent strikes, but the government remains unwilling to commit. Streeting called the rejection a 'missed opportunity' and reaffirmed his commitment to minimizing patient impact, urging NHS staff to keep services running and assuring patients that disruptions will be mitigated.\nOriginal language: en\nPublish date: November 05, 2025 11:29 PM\nSource:[Yahoo](https://ca.news.yahoo.com/resident-doctors-set-strike-five-231902188.html)\n\n**Resident doctors set to strike next week after rejecting Government...**\nResident doctors in England, represented by the British Medical Association (BMA), have rejected a new government offer aimed at ending a prolonged dispute over jobs and pay, stating it 'does not go far enough.' The doctors are scheduled to strike for five days from 7 a.m. on November 14 to 7 a.m. on November 19, 2025. The government's offer includes 1,000 additional specialty training places and coverage of mandatory exam and membership fees. However, Dr. Jack Fletcher, BMA’s resident doctors committee chairman, emphasized that 30,000 doctors applied for only 10,000 training spots this year, and adding 1,000 places will not resolve the systemic job crisis. Health Secretary Wes Streeting reiterated that pay increases are not possible due to 'enormous financial pressures,' and stated that no amount of strike action will change this. He described the rejection as a 'missed opportunity' and stressed that the NHS leadership must now focus on minimizing patient disruption. Dr. Fletcher urged the government to offer a multi-year pay deal to avoid strikes, noting that the current offer includes a suggestion of a real-terms pay cut. He concluded that strikes can be avoided only if the government demonstrates willingness to provide a genuine solution on both pay and jobs.\nOriginal language: en\nPublish date: November 05, 2025 09:54 PM\nSource:[Daily Mail Online](https://www.dailymail.co.uk/wires/pa/article-15262911/Resident-doctors-set-strike-week-rejecting-Government-offer.html)\n\n**Our 19 demands reasonable, say striking resident doctors**\nThe Nigerian Association of Resident Doctors (NARD) stated on November 3, 2025, that its 19 demands are neither new nor unreasonable, but represent the minimum requirements for a sustainable healthcare system. The demands, jointly signed by NARD President Muhammad Suleiman, Secretary-General Dr. Shuaibu Ibrahim, and Publicity and Social Secretary Abdulmajid Ibrahim, address long-standing issues including the settlement of unpaid arrears (25/35% Consolidated Medical Salary Structure review, accoutrement allowance, promotion and upgrade arrears, and salary arrears), correction of irregularities in the Integrated Payroll and Personnel Information System, and the prompt implementation of delayed promotions. Despite the Federal Ministry of Health and Social Welfare's claim that over ₦30 billion has been released to offset arrears, NARD emphasized that many resident doctors have not received full payments. The association highlighted a decline in Nigeria’s resident doctor pool from 15,000–16,000 a decade ago to 9,000–10,000 today, driven by poor remuneration, unsafe work conditions, and delayed payments, fueling the 'Japa syndrome' (migration abroad). NARD criticized the government for delays in reinstating dismissed doctors from the Federal Teaching Hospital, Lokoja, and called for correction of the Medical and Dental Council of Nigeria’s (MDCN) re-categorisation of certificates, which demoralized doctors. It also demanded inclusion of resident doctors providing specialist-level services in the specialist allowance, an urgent review of the professional allowance table to align with inflation and the minimum wage, and resolution of unpaid salaries, non-implementation of the one-for-one replacement policy, and casualisation of doctors. NARD stressed that the strike is not against the public but for the dignity, safety, and survival of healthcare workers and patients, and called for verifiable actions, not promises, to restore industrial peace and a functional healthcare system.\nOriginal language: en\nPublish date: November 03, 2025 02:11 PM\nSource:[Punch Newspapers](https://punchng.com/our-19-demands-reasonable-say-striking-resident-doctors/)\n\n**The doctor will out-earn you now! A third of GP partners earn more than the Prime Minister, Wes Streeting reveals | Daily Mail Online**\nHealth Secretary Wes Streeting has challenged the British Medical Association's (BMA) claim that general practitioners (GPs) lack the funds or capacity to implement online booking for non-urgent appointments, calling the stance 'baffling' and 'absurd'. According to Department of Health data based on NHS England Digital research and HMRC self-assessment records, a third of GP partners in England earned over £175,000 in 2023-24—exceeding Prime Minister Sir Keir Starmer’s gross annual salary of £172,153. One in six GP partners earned more than £225,000, and the top 10% earned over £256,400. GP earnings have risen by £37,000 over the past decade and £18,500 in the last year alone. Streeting confirmed a backdated 4% pay award for GPs and other medical staff in May. The government emphasized it has invested an extra £1.1 billion in general practice and recruited 2,500 additional GPs to support modernization. The BMA, however, continues to oppose mandatory online booking, citing resource constraints. Meanwhile, Nicola Ranger of the Royal College of Nursing criticized the government’s proposed 2.5% pay rise as 'derisory', warning it fails to cover living costs and risks further staff shortages. The government cautioned that any pay increase above 2.5% could lead to £750 million in additional costs per 0.5 percentage point, potentially forcing service and staffing cuts.\nOriginal language: en\nPublish date: November 02, 2025 05:22 PM\nSource:[dailymail.co.uk](https://www.dailymail.co.uk/news/article-15250927/doctor-GP-partners-earn-Prime-Minister-Wes-Streeting.html)\n\n**Hospitals will be 'as bad as during the pandemic' this winter, warns NHS boss - Daily Star**\nJim Mackey, chief executive of NHS England, warned that hospitals could face a crisis this winter comparable to the pandemic due to a surge in flu cases and a planned doctors' strike. Flu cases are currently three times higher than usual for this time of year, and A&E departments are expected to see record demand. Mackey stated that the combination of increased patient footfall and staff shortages from the British Medical Association's (BMA) strike—scheduled from November 14–19 over pay and job concerns—could lead to conditions resembling those during the pandemic. The BMA rejected the government’s proposed 2.5% pay rise for 2026 as 'indefensible,' citing over a decade of pay erosion and rising workloads. BMA council chairman Dr Tom Dolphin called the offer a 'profound disregard' for doctors. Unison’s health head Helga Pile described the raise as an 'insult' and 'way-below-inflation,' predicting widespread dissatisfaction. A separate report by Age UK found that one in three patients over 90 now waits at least 12 hours in A&E, with some dying in hospital corridors. Health Secretary Wes Streeting acknowledged the NHS’s recurring winter crisis and emphasized that this government is planning earlier than in previous years.\nOriginal language: en\nPublish date: October 31, 2025 03:03 PM\nSource:[Daily Star](https://www.dailystar.co.uk/news/hospitals-as-bad-during-pandemic-36170069)\n\n**Resident doctors announce five-day strike as government talks collapse**\nResident doctors across England will conduct a five-day strike from 14 to 18 November 2025 after pay negotiations with the UK government collapsed. The British Medical Association (BMA) cited years of below-inflation pay increases and rising workloads, stating that many doctors are 'at breaking point.' The strike follows a failed attempt to reach a multi-year pay deal, with the BMA urging Health Secretary Wes Streeting to return to talks. Jack Fletcher, chair of the Resident Doctor Committee, emphasized that the proposed deal included a £1 hourly pay increase over four years to reverse cumulative pay erosion, which has reached 21% since 2008. A BMA survey of 4,401 doctors found that 34% were unable to secure substantive employment or regular locum positions by August 2026. Although the government pledged 1,000 additional specialty training places, doctors argue this is insufficient. Fletcher stressed that a comprehensive plan including pay restoration and job creation is essential to stabilize the NHS and prevent further industrial action, calling on Streeting to 'step up' and deliver a credible offer to make the NHS 'fit for doctors and fit for patients.'\nOriginal language: en\nPublish date: October 27, 2025 05:15 PM\nSource:[Open Access Government](https://www.openaccessgovernment.org/resident-doctors-announce-five-day-strike-as-government-talks-collapse/200424/)\n\n**Resident Doctors' Strike Threatens to Shut Down UK Hospitals for 5 Days**\nThe British Medical Association (BMA) announced that thousands of resident doctors, formerly known as junior doctors, will strike for five days from November 14 to 19, 2025, aiming to disrupt hospital operations. This marks the 13th strike since 2022, following the government's failure to offer a 'satisfactory' pay deal. Previous strikes have already led to the cancellation of approximately 1.5 million medical appointments. The BMA argues that the government's proposed 5.4% pay increase in May—based on an independent body's recommendation—is insufficient to offset a 21% real-terms pay erosion since 2008, and demands a 29.2% increase to restore pay value. Dr. Jack Fletcher, chair of the BMA’s junior doctors committee, stated that half of second-year residents face difficulties finding jobs, wasting their skills while patients await care. The strike follows failed negotiations, during which the government rejected proposals for phased pay increases and new job creation. Health Secretary Wes Streeting labeled the strike 'excessive and unnecessary,' warning it 'hinders the recovery of the National Health Service (NHS).' He claimed doctors have already received a 28.9% increase and that the government cannot afford further raises this year, accusing the BMA of rejecting proposals to improve working conditions and expand specialist training opportunities. The BMA maintains that the strike is justified due to the real-terms pay decline, citing the Retail Price Index (RPI), while the government relies on the Consumer Price Index (CPI), which shows only a 5% decline since 2008. A YouGov poll revealed 48% of Britons oppose the strike, compared to 39% in support—a shift from last summer’s majority support (52%). Resident doctors make up half of NHS doctors, earning £38,831 in their first year and rising to around £70,000 after eight years.\nOriginal language: ar\nPublish date: October 24, 2025 03:50 AM\nSource:[صحيفة عكاظ](https://www.okaz.com.sa/news/local/2219042)\n\n**Wes Streeting rages at 'reckless' doctors as new strike dates announced**\nDoctors in England, represented by the British Medical Association (BMA), have announced a five-day strike from 7 a.m. on November 14 to 7 a.m. on November 19, 2025, over disputes concerning jobs and pay. The strike involves resident doctors—formerly known as junior doctors—who make up more than half of all NHS doctors. Health Secretary Wes Streeting condemned the strike as 'preposterous,' accusing the BMA of rejecting a government offer to improve working conditions and create additional specialty training roles. He criticized the BMA for pursuing further strike action just one week after its new leadership began discussions with the government, stating they were 'walking away from an offer' aimed at addressing key concerns. The announcement was published on October 23, 2025, by the EXPRESS.\nOriginal language: en\nPublish date: October 23, 2025 01:58 PM\nSource:[EXPRESS](https://www.express.co.uk/news/politics/2125163/wes-streeting-doctors-strike-resident-bma)\n\n**Resident doctors announce strike action in England**\nResident doctors in England will go on strike for five consecutive days from 7 a.m. on November 14 to 7 a.m. on November 19, 2025, according to the British Medical Association (BMA). The strike follows ongoing disputes over pay and employment prospects, with the BMA stating that half of second-year doctors in England are struggling to find jobs, leading to wasted skills and unfilled hospital shifts. Dr. Jack Fletcher, chair of the BMA's resident doctors committee, said the government’s '11th hour letter' offered vague promises for changes to jobs and training two years in the future, showing 'little understanding of the crisis here and now.' He emphasized that better employment prospects and pay restoration are 'a credible way forward' for doctors, the government, and patients. The BMA has argued that real-terms pay has fallen by approximately 20% since 2008 and is demanding full 'pay restoration.' This strike marks the second walkout in 2025, following a five-day strike in July. Health Secretary Wes Streeting condemned the action as 'reckless' and 'irresponsible,' accusing the BMA of attempting to 'hold the country to ransom.'\nOriginal language: en\nPublish date: October 23, 2025 01:49 PM\nSource:[ITV Hub](https://www.itv.com/news/2025-10-23/resident-doctors-announce-strike-action-in-england)\n\n**How Resident Doctor Strike Exposed a Generational Rift Within The Profession**\nThe British Medical Association (BMA) announced a five-day walkout by resident doctors, which led to a public outcry. Health Secretary Wes Streeting accused the BMA of 'holding the country to ransom' and argued that the strikes would 'throttle' NHS progress on waiting lists. However, the BMA claims that the 22% pay rise awarded between 2023-2024 was not enough to restore pay to 2008 levels, and that doctors have suffered a pay erosion of 21% in real terms since 2008. The BMA's deputy chair, Dr Emma Runswick, stated that the 28.9% pay rise over the last three years only amounts to an 8% increase in real terms when taking inflation into account. The strikes have exposed a generational rift among doctors, with some arguing that resident doctors are 'entitled' and 'unconscionable', while others point out that medics today have it much harder than their predecessors. The BMA has revealed that 52% of FY2 doctors surveyed had 'no substantive employment' or locum work from August 2025, and that some doctors are living on Job Seeker's allowance or being forced to move to New Zealand. The situation is attributed to a training bottleneck, with not enough specialty training posts to match the number of doctors qualifying. The Government has committed to expanding the workforce, but the execution has been short-sighted. The BMA holds a legal mandate that allows strikes to carry on until January 2026.\nOriginal language: en\nPublish date: August 04, 2025 07:49 AM\nSource:[Byline Times](https://bylinetimes.com/2025/08/04/bma-doctor-strike/)\n\n**'No one wants to be on strike but what I do want is to not be paid less than doctors were in 2008' - Manchester Evening News**\nA five-day walkout by resident doctors in England began today, with members of the British Medical Association manning picket lines across the country. The BMA is pushing for full 'pay restoration' after real-terms pay has fallen by around 20% since 2008. Ross Nieuwoudt, co-chair of the BMA resident doctors committee, said, 'No one wants to be on strike - I don't want to - but what I do want is to feel valued and respected and not paid less than doctors were in 2008.' He added that morale among doctors is mixed, but many are leaving the country due to low pay and poor conditions. Health and Social Care Secretary Wes Streeting said, 'This government is doing all it can over this strike period to minimise patient harm and disruption.' However, the BMA argues that the government has not made a credible offer to restore pay, and the strike will continue until a satisfactory solution is reached.\nOriginal language: en\nPublish date: July 25, 2025 06:38 PM\nSource:[Manchester Evening News](https://www.manchestereveningnews.co.uk/news/greater-manchester-news/no-one-wants-strike-what-32137683)\n\n**50,000 British Doctors Go on 5-Day Strike Demanding 29% Pay Increase**\nApproximately 50,000 doctors in England have begun a 5-day strike, from 7am on Friday to 7am on Wednesday, July 30, after negotiations between the British government and the British Medical Association (BMA) representing the resident doctors (previously known as junior doctors) failed. The doctors are demanding a 29% pay increase to compensate for a 20% real-terms pay cut since 2008. Health Secretary Wes Streeting described the strike as 'unreasonable' and 'harmful to patients and efforts to reform the National Health Service.' The resident doctors, who make up about half of the doctors in Britain, are a crucial part of the healthcare system, working in various hospital departments, including emergency and general practitioner practices. They undergo a long training period of up to 10 years, facing challenges such as expensive training exam fees (up to thousands of pounds) and student debt of up to £100,000. Before the strike, Health Secretary Wes Streeting held extensive talks with the BMA, focusing on improving working conditions, such as covering exam fees, giving doctors more control over their schedules, and speeding up career progression. However, the BMA rejected a postponement of the strike, considering the government's offer 'lacking in credibility' to restore pay. A survey by the 'Ipsos' institute showed a decline in public support for the strike from 52% last year to 26%, increasing pressure on both sides to reach a solution. Health officials warn that the strike will lead to the cancellation of hundreds of thousands of patient appointments, threatening efforts to reduce waiting lists in the National Health Service, which serves around 300,000 appointments daily.\nOriginal language: ar\nPublish date: July 25, 2025 04:48 PM\nSource:[صحيفة عكاظ](https://www.okaz.com.sa/variety/na/2206046)\n\n**NHS England toughens stance on resident doctors’ strike**\nNHS England, under Chief Executive Sir Jim Mackey, has adopted a tougher stance toward resident doctors' strike actions, stating it will be 'much more resistant' to pay demands than in the past. Mackey warned that strikes should no longer be 'consequence-free,' citing that previous industrial actions from July 2023 to February 2024 led to over 500,000 appointments and operations being cancelled, with doctors benefiting financially through overtime. He instructed hospital leaders to continue scheduled operations to avoid future overtime costs and emphasized that safety decisions rest with NHS leaders, not the British Medical Association (BMA). Health Secretary Wes Streeting supported hospital managers, saying they have 'your backs' if they must spread staff thinly—despite BMA concerns over safety. The BMA's Melissa Ryan stated the union wants to avoid prolonged strikes but demands concrete action, not just words. The Academy of Medical Royal Colleges warned that patient safety is at risk due to uncertainty over doctor absences and urged the BMA to suspend its guidance that doctors need not inform employers of strike intentions. The BMA has accepted a 22.3% pay settlement but still plans to return to strike action.\nOriginal language: en\nPublish date: July 24, 2025 11:19 AM\nSource:[personneltoday.com](https://www.personneltoday.com/hr/nhs-england-stance-resident-doctors-strike/)\n\n",
    "date": "2025-11-10T17:37:50.242196",
    "summary": "Across a range of expert perspectives—labour relations, public sector policy, political science, economics, and sociology—the consensus forecast is that it is unlikely resident (junior) doctors in England will receive a further pay increase beyond the already enacted 5.4% for 2025–26 before January 1, 2026. Most experts highlight several converging factors decreasing the probability: the newly elected Labour government’s explicit and repeated stance that no further increases are affordable, tight fiscal constraints, declining public support for strikes (recent polls show more opposition than support), and historical precedent indicating late-year, post-settlement pay increases are rare. While most experts acknowledge that continued or escalating industrial action, especially if coinciding with a catastrophic winter crisis in the NHS, could theoretically force a last-minute government U-turn and a further pay rise, they generally see this as a low-probability (tail risk) scenario that would require an extraordinary exogenous shock or operational collapse. A few forecasters, especially those drawing on Economics (Labour Market) and Political Science (Interest Group Theory), give higher probabilities (up to 35% and 27%, respectively), arguing that workforce pressures, skill shortages, and the BMA’s strong collective action potential keep a non-negligible risk alive. However, most others (including Labour Relations and Public Policy experts) provide very low forecasts (5–14%) pointing to hardened government resolve, the marginal effect of additional strikes, and procedural/administrative barriers to implementing an uplift before the year’s end. Mean probabilities center in the low teens, with none exceeding 35%. The group chat also stresses that unless an increase is not just offered but actually enacted before the deadline, the resolution remains No. In summary, the expert consensus is that a further pay increase for resident doctors before 2026 is unlikely, barring a dramatic and unforeseen NHS crisis.",
    "forecasters": [
        "Labour Relations (Industrial Relations Practice)",
        "Labour Relations (Trade Union Negotiation)",
        "UK Public Sector Policy (NHS Workforce Planning)",
        "UK Public Sector Policy (UK Government Pay Review)",
        "Political Science (Public Choice Theory)",
        "Political Science (Punctuated Equilibrium)",
        "Political Science (Interest Group Theory)",
        "Economics (Labour Market Economics)",
        "Economics (Collective Bargaining Theory)",
        "Sociology (Social Movements Theory)",
        "Sociology (Professionalization Theory)"
    ]
}