{
    "deliberation_results": {
        "Military Intelligence (Threat Assessment Methodology)": {
            "time_to_resolution": "Approximately 1.5 months (question resolves January 1, 2026; today is November 18, 2025)",
            "perspective_relevance": "As an expert in Military Intelligence (Threat Assessment Methodology), my analysis focuses on evaluating the likelihood of interstate military escalation, factoring in observable order-of-battle changes, decision-making calculus, historic precedent, intelligence-indicated intent, regional military-political dynamics, and the implementation and effectiveness of confidence-building or de-escalation mechanisms. I further assess signaling dynamics, the resilience of any ceasefire arrangements, and both strategic drivers and accident risk, with special attention to scenario-based wargaming and base rates for deadly clashes. My approach emphasizes not just troop dispositions and kinetic exchanges, but also command-and-control discipline and willingness/ability of actors to absorb and retaliate to provocations.",
            "status_quo": "Low-intensity hostilities persist along the Thailand-Cambodia border despite an internationally brokered ceasefire, with frequent local incidents (including fatal ones) but, so far, only one recent fatality (civilian) since November 12, 2025. Both sides blame each other for ceasefire violations, but both governments express rhetorical commitment to restraint and are under international observation and pressure. Most recent headlines indicate sustained alertness and readiness but not open large-scale military operations or declared offensives.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent trend of escalation and recorded fatalities",
                    "effect": "Increases probability: Recent weeks have seen recurring kinetic incidents, resulting in fatalities and significant civilian displacement, indicating high friction and an elevated risk environment. The November 12 clash, while limited in scope, demonstrates that fatality thresholds can be breached in even relatively minor incidents."
                },
                {
                    "factor": "Fragility of ceasefire and breakdown of deconfliction mechanisms",
                    "effect": "Increases probability: Thailand's outright suspension of the peace agreement and the delay in confidence-building actions (such as prisoner releases) suggest institutionalized de-escalation channels are not robust. Accusations over new mine-laying, credible or not, breed distrust and compound the risk of accidental or misperceived hostile acts escalating."
                },
                {
                    "factor": "International diplomatic pressure and involvement of major powers (U.S., China, ASEAN)",
                    "effect": "Decreases probability: Both sides remain responsive to external pressure, particularly U.S. and Chinese involvement, due to strong economic and political incentives to avoid open warfare and the negative international consequences of escalation. Recent high-level communications underscore this leverage."
                },
                {
                    "factor": "Failure to address root causes and persistent mutual mistrust",
                    "effect": "Increases probability: The lack of resolution to core territorial disputes, paired with charged nationalist narratives on both sides, incentivizes both governments to maintain tough postures. Fragile internal political legitimacy may be bolstered by 'standing firm' on border issues, enabling or encouraging low-level military actions that could spiral."
                },
                {
                    "factor": "Past base rates of deadly border incidents",
                    "effect": "Marginally increases probability: Historically, Thailand and Cambodia have seen deadly low-level clashes over decades, but clusters of fatalities (3 or more in a single incident) are relatively rare between formal ceasefires. However, when truces have recently broken down, multi-fatality incidents have occurred (mid-2025, July–August 2025 saw over 40 deaths in a handful of days)."
                },
                {
                    "factor": "Current command and control, posture and force discipline",
                    "effect": "Neutral to slightly decreases probability: No evidence of massive mobilization or intent for broad offensives. Immediate responses have, so far, been limited and posture largely defensive, with reinforced discipline suggested by both governments after incidents."
                },
                {
                    "factor": "Seasonal and environmental factors",
                    "effect": "Slightly decreases probability: The dry season may facilitate movement (potentially raising risk), but there is no seasonal pattern of major operations during year-end holidays or new years, historically a period of relative calm in cross-border hostilities in Southeast Asia."
                }
            ],
            "no_scenario": "Despite ongoing tensions, both Thailand and Cambodia maintain strict command-and-control over local commanders, and external mediators (ASEAN, U.S., China) actively intervene after each incident. Small skirmishes or accidents continue, possibly resulting in single or double fatalities, but neither state escalates to a degree resulting in 3 or more deaths in a single clash. Political pressure builds for a semi-permanent buffer or additional observer presence, and the year closes without a qualifying deadly incident.",
            "yes_scenario": "A border incident—e.g., a mine detonation or ambiguous gunfire exchange—rapidly devolves: local commanders, acting on unclear or aggressive rules of engagement and amid intense nationalist rhetoric, overreact, leading to an intense skirmish or cross-border fire fight. A handful of soldiers and/or civilians are quickly killed (meeting or exceeding the 3 fatality threshold), either by direct combat or due to heavy weaponry use. Domestic outrage and incomplete de-escalation mechanisms delay high-level intervention until after a qualifying deadly clash has occurred.",
            "final_reasoning": "The situation is precarious: the ceasefire is fundamentally unstable, with both sides mistrustful and prone to blaming each other for every incident. There have been recent deaths and significant injuries, and sub-threshold violence persists. However, most incidents remain contained (often 1 fatality per event), with both sides repeatedly expressing 'commitment to peace,' and major powers actively working (and having strong incentive) to keep things contained. Historical base rates between Thailand and Cambodia suggest multiple-fatality clashes post-ceasefire are rare, but not unprecedented, especially when confidence-building measures are weak and both sides feel domestic pressure to demonstrate resolve. The proximity to the question's resolution (about 6 weeks left) limits time exposure. The presence of external pressure and diplomatic mechanisms marginally restrains both sides, but the current pattern of tit-for-tat and distrust means the probability of another deadly (3+ fatalities) clash is significantly elevated compared to peaceful border situations. My weighted assessment leads me to an above-average probability, reflecting risk of further escalation but short of near-certainty, as systemic incentives still slightly favor restraint.",
            "final_probability": 40
        },
        "Diplomatic Affairs (Track Two Diplomacy Practice)": {
            "time_to_resolution": "Approximately 44 days (until December 31, 2025)",
            "perspective_relevance": "As an expert in Track Two Diplomacy, my focus is on unofficial, informal channels for conflict resolution, de-escalation, and communication between parties where Track One (official) diplomacy is challenged by mutual distrust and nationalist pressures. This perspective is crucial for assessing latent escalation risks and the impact of backchannel mediation, civil society involvement, and external third-party facilitation (ASEAN, China, US, Malaysia) on the progression or containment of near-term violent incidents.",
            "status_quo": "After multiple deadly flare-ups and fragile ceasefire agreements, current conditions are tense: the formal peace process is on hold following a Thai landmine incident blamed on Cambodia, and both sides accuse each other of ceasefire violations. There have been deadly incidents (including one recent fatality and several injuries) but so far these have not escalated past three deaths in a single incident since July. International mediation is active but has not resolved underlying disputes.",
            "perspective_derived_factors": [
                {
                    "factor": "Short timeframe remaining",
                    "effect": "DECREASES probability—With only six weeks left in 2025, chances for further escalation to a deadly, multi-fatality clash diminish unless either side seeks to alter the facts on the ground before the year’s end."
                },
                {
                    "factor": "Track Two and multitrack diplomatic engagement (China, ASEAN, Malaysia, US)",
                    "effect": "DECREASES probability—Multiple external actors are intensely involved, providing pressure and mediation to prevent major escalation. Their credible threats (trade, reputation) and mediation platforms lower the risk of sustained hostilities crossing the fatality threshold."
                },
                {
                    "factor": "Mutual, entrenched distrust and unresolved border dispute",
                    "effect": "INCREASES probability—The century-old, emotionally charged nature of the dispute, coupled with accusations of new mine-laying and failure to honor agreements, increases the likelihood of accidental or intentional escalation, especially as nationalist sentiment is high."
                },
                {
                    "factor": "Recent flare-ups and disrupted ceasefire",
                    "effect": "INCREASES probability—The ceasefire is fragile, with several recent breaches (gunfire, deaths, injuries, population displacement), and both sides have demonstrated willingness to use kinetic force in response to perceived provocations."
                },
                {
                    "factor": "Lack of effective monitoring mechanisms",
                    "effect": "INCREASES probability—Despite bilateral and multilateral efforts, there is no credible joint monitoring or third-party observer presence on the ground, as both sides resist, making it easier for incidents to escalate or be misrepresented."
                },
                {
                    "factor": "Leadership caution and strategic interests",
                    "effect": "DECREASES probability—Both Bangkok and Phnom Penh have shown (in recent diplomatic statements and actions surrounding state visits, e.g., the Thai King's visit to China) that they prefer to de-escalate rather than risk international opprobrium, damage to economic ties, or third-party interventions."
                }
            ],
            "no_scenario": "Despite heightened tensions, sporadic violence (including any mine and firearm incidents) is kept under three total fatalities per incident due to robust backchannel communications, international monitoring visits, and the leaderships' desire to avoid further undermining their international standing or regional economic priorities. ASEAN, Malaysia, and China continue to pressure both parties to maintain the status quo and prevent the resumption of full-scale hostilities.",
            "yes_scenario": "A mine, patrol clash, or retaliatory artillery exchange leads to three or more deaths, overwhelming the capacity or willingness of both sides or mediators to keep the violence below a fatal threshold. This could happen through tit-for-tat escalation, miscalculation, or local commanders acting independently. Such an incident would be clearly reported by credible news sources and cross the question’s fatality threshold.",
            "final_reasoning": "Base rates for post-ceasefire flare-ups in the Thai-Cambodian border region historically show continued small-scale violence, but large, deadly incidents above three fatalities tend to be rare shortly after intense international mediation and under heavy external surveillance (2011, 2013 precedents). The latest incidents (November 10–12) resulted in up to one death and several injuries per event—close to but not surpassing the threshold. The window for a major new clash is narrowing as diplomatic engagement intensifies: both sides are now under significant pressure from ASEAN, China, Malaysia, and the US to avoid escalation while the world, and their own populations, are watching for de-escalation. Still, trust is low and both sides are forward-deployed and on alert, and without a robust monitoring or peacekeeping buffer, local miscalculation is possible. Factoring in the unstable truce, the absence of a lasting resolution to the underlying dispute, moral and material incentives on both sides not to escalate, and the very short time to resolution, I assess the risk as non-trivial but well below even odds—though not negligible, given multiple close calls. I estimate a 25% probability of a three-plus-fatality clash before 2026.",
            "final_probability": 25
        },
        "Crisis Management (Incident Command System)": {
            "time_to_resolution": "Approximately 6 weeks (Question resolves January 1, 2026; today is November 18, 2025)",
            "perspective_relevance": "As a crisis management and Incident Command System (ICS) expert, I bring a structured understanding of escalation and de-escalation dynamics, multi-agency command, and the friction between tactical field realities and top-level political commitments. My perspective emphasizes trigger points for kinetic escalation, the fragility of ceasefires lacking robust monitoring, and the impact of external mediators or absent verification on incident recurrence rates.",
            "status_quo": "After bloody border conflicts and a fragile, recently-breached ceasefire, both sides are cooperating with ASEAN and great power mediators (U.S., China, Malaysia), but remain deeply distrustful, and minor flare-ups (e.g., the 11/12–13 clash, civilian killed, armed exchanges) are occurring. Hostilities are paused, but border incidents and provocations persist.",
            "perspective_derived_factors": [
                {
                    "factor": "Absence of Effective Third-party Monitoring",
                    "effect": "Increases probability. There is no robust, on-the-ground, respected third-party observer mission. Both sides distrust each other and prior attempts to introduce observers (ASEAN, Malaysia) have failed. This leaves room for rapid tactical escalations, misperception, or rogue actors to trigger fatal clashes."
                },
                {
                    "factor": "Ongoing Low-level Skirmishes and Fatalities",
                    "effect": "Increases probability. Kinetic activity (mines, gunfire, deaths, injuries) has occurred in recent weeks despite formal ceasefires. In particular, the most recent incidents involve deaths and displacement, indicating the truce is not holding firmly."
                },
                {
                    "factor": "Political Will for Restraint and Multilateral Pressure",
                    "effect": "Decreases probability. The high-level engagement—calls from Trump, China-Thai diplomatic overtures, repeated ASEAN pressure—creates powerful incentives for both governments to avoid provocation or escalation into mass-casualty events, at least while global actors are watching closely."
                },
                {
                    "factor": "Fragility of Operational Control and Local-Level Command",
                    "effect": "Increases probability. Even when national leaders command calm, local troops operating in ambiguous, tension-filled zones historically (and per the news) act independently or under pressure, leading to accidental or retaliatory clashes beyond central control."
                },
                {
                    "factor": "Proximity to Holidays/New Year and International Attention",
                    "effect": "Decreases probability. The coming New Year, regional summits (ASEAN chair transition to Philippines), and donor engagement raise the reputational and political costs of escalation, making leaders more cautious."
                },
                {
                    "factor": "Resolution Base Rates",
                    "effect": "Neutral/modestly increases probability. Past Thailand–Cambodia border flare-ups (notably 2011, 2013, 2022, 2025) often result in sporadic deadly events for several weeks/months post-ceasefire until robust demilitarization or third-party involvement. Base rates suggest that fatal clashes in the weeks after a failed truce are not rare, but frequency drops as international mediation solidifies."
                }
            ],
            "no_scenario": "Despite repeated provocations—landmine blasts, stray gunfire, and diplomatic sparring—both sides, facing intense U.S./China/ASEAN scrutiny and upcoming diplomatic milestones, avoid any clash resulting in three or more fatalities. Small incidents and injuries persist, but operational restraint and rapid crisis response (e.g., escalation control, demilitarized buffer zones) prevent any major kinetic event.",
            "yes_scenario": "Another border incident—such as a large-scale mine blast, accidental escalation during a patrol, or intentional provocation by irregular or frustrated local forces—leads to a firefight or explosion, killing at least three servicemembers/civilians. This is triggered by incomplete demilitarization, absence of observers, or breakdown in command/control. Diplomatic back-channeling fails to pre-empt escalation at the field level.",
            "final_reasoning": "While the status quo is characterized by precarious calm, the factors most salient to an ICS/crisis management lens indicate that the groundwork for another deadly clash remains disturbingly strong. The continued kinetic events (fatal mines, gunfire), absence of third-party monitors, and operational breakdowns at the tactical level substantially elevate the risk, especially given historical base rates of post-ceasefire flare-ups. However, the high-level diplomatic and economic stakes, with major powers invested in maintaining peace, exert significant downward pressure on escalation. The period in question—6 weeks, through heavy international attention—makes another mass-fatality event possible but not the default. On the evidence, the odds are somewhat elevated relative to historical post-ceasefire baselines, mainly due to recent breaches and weak enforcement, but international pressure keeps this well below certainty. My estimate, reflecting high but not overwhelming risk, is:",
            "final_probability": 37
        },
        "Crisis Management (Risk Analysis Procedures)": {
            "time_to_resolution": "Approximately 6 weeks (until January 1, 2026)",
            "perspective_relevance": "As an expert in Crisis Management (Risk Analysis Procedures), my approach systematically identifies and weighs risk factors that drive escalation or containment in cross-border conflicts. This perspective is especially vital given the volatility, recent breaches of ceasefire, and the propensity for incidents to rapidly escalate into deadly confrontations—typical hallmarks of fragile post-ceasefire environments.",
            "status_quo": "There is a fragile, frequently violated ceasefire with recurring skirmishes, direct accusations of ceasefire violations, casualties (including at least low-fatality kinetic events), and heightened troop alert. International mediation efforts persist, but deep mutual distrust and unresolved territorial grievances underpin the conflict.",
            "perspective_derived_factors": [
                {
                    "factor": "Base rate of post-ceasefire re-escalation in Thailand-Cambodia border disputes",
                    "effect": "Increases probability. Recent history (2011, 2008, and 2025) shows that brief periods of calm after deadly confrontations are highly unstable. Violent flare-ups have repeatedly occurred within months of prior agreements, especially absent durable demobilization and successful third-party monitoring."
                },
                {
                    "factor": "Presence/absence of effective ceasefire monitoring and international pressure",
                    "effect": "Slightly decreases probability. The presence of ASEAN and U.S. mediation, with international observers to some extent involved, exerts downward pressure on escalation, but the reluctance of either party to host monitors weakens this effect."
                },
                {
                    "factor": "Recent trend of tit-for-tat violence and fatal incidents since October",
                    "effect": "Increases probability. Since July, the region has seen repeated deadly kinetic events: mine blasts (four Thai soldiers killed in November), shootings (at least one death and multiple serious injuries November 12), and artillery skirmishes. Escalatory spiral persists despite diplomatic activity."
                },
                {
                    "factor": "Grievance persistence and backlash from perceived breaches (mine accusations, prisoner of war stalemates)",
                    "effect": "Increases probability. Each breach (e.g. landmines, prisoner releases delayed, civilian deaths) has led to credible threats of escalation, suspension of peace deals, and increased military alert, with explicit statements by Thailand about reserving the right to escalate further if provoked."
                },
                {
                    "factor": "High concentration of displaced civilians and humanitarian strains",
                    "effect": "Increases probability. Over 300,000 displaced at peak, now over 800 Cambodian families recently displaced again. Large civilian concentrations in contested/border areas amplify opportunities for deadly incidents in the event of local-level misunderstandings or miscalculations."
                },
                {
                    "factor": "Major power mediation (U.S., China) and economic interdependence",
                    "effect": "Moderately decreases probability. Strong pressure from U.S. and China (via trade leverage and regional stability appeals) lowers threshold for political leaders to contain escalation if they can overcome nationalist pressures."
                },
                {
                    "factor": "Short time horizon until question closure",
                    "effect": "Slightly decreases probability. The closer we get to the closure date without a qualifying event (three or more fatalities in a single clash post-July 31), the less time remains for risk to materialize, though high recent incident rate still warrants major concern."
                }
            ],
            "no_scenario": "After the November fatal shooting and mine incidents, international mediation—especially via ASEAN, Malaysia, and the U.S.—induces both sides to restrain forces. Despite sporadic gunfire and continued tensions, no single incident results in 3 or more deaths before January 1, 2026. Thai and Cambodian leaders prioritize broader stability (trade ties, China relations), and local commanders exercise caution to avoid major confrontations. Any further incidents remain low-casualty or are de-escalated before threshold fatalities are reached.",
            "yes_scenario": "Ongoing border provocations continue to spiral: for example, a mine or patrol skirmish on either side leads to multiple soldiers killed (>3), or a miscalculated artillery exchange during heightened alert causes several fatalities in one episode. Local commanders, under pressure from unresolved grievances and mounting political/nationalist rhetoric, retaliate for recent incidents (landmines, shootings, POWs), overwhelming diplomatic containment efforts. International mediation is too slow or ineffective to prevent escalation, and news sources unambiguously report a multi-fatality military clash before January 1, 2026.",
            "final_reasoning": "The risk environment is extremely volatile. Since July, multiple deadly incidents have occurred despite high-level ceasefire agreements and visible international pressure. The November fatal mine incident (killing four Thai soldiers) and the November 12 shooting (one killed, three injured), alongside persistent mutual accusations, show a pattern of short interludes between deadly violence. The main constraint on escalation is international mediation and strong economic incentives for both sides (especially vis-à-vis China and the U.S.), but local-level triggers and the failure to implement robust monitoring make further deadly incidents plausible. Critically, based on base rates and current trends, the risk of a single incident crossing the three-fatality threshold before Jan 1, 2026 is higher than typical peacetime, but the very short period (~6 weeks) until question resolution modestly dampens this. I assess the likelihood as moderately high but not overwhelming, reflecting high incident frequency but also strong, if imperfect, external efforts at de-escalation.",
            "final_probability": 63
        },
        "International Relations (Realism)": {
            "time_to_resolution": "Approximately 43 days (from November 18, 2025, to January 1, 2026)",
            "perspective_relevance": "As an International Relations Realist, I focus on states as rational, self-interested actors pursuing security and power. Under realism, fundamental security dilemmas, unresolved territorial disputes, and the incentives for power projection persist even under the appearance of peace agreements. I pay particular attention to the fragility of ceasefires not buttressed by clear, verifiable mutual interests or external enforcement, as well as to the impact of international power politics, alliances, and mediators on state behavior.",
            "status_quo": "The status quo is a fragile, repeatedly violated ceasefire between Thailand and Cambodia. Hostilities have diminished from full-scale war but have not ceased; there are periodic skirmishes, civilian casualties, and ongoing military posturing along the border. Political and diplomatic engagement is ongoing, but tensions remain high.",
            "perspective_derived_factors": [
                {
                    "factor": "Unresolved Border and Security Dilemma",
                    "effect": "Increases probability. The underlying century-old border dispute remains unresolved, fueling persistent mistrust and opportunities for escalation despite ceasefire agreements."
                },
                {
                    "factor": "Recent Deadly Clashes and Ceasefire Violations",
                    "effect": "Increases probability. Kinetic incidents (landmines, shootings), recent fatalities, and claims of ceasefire breaches indicate the real risk of further escalation."
                },
                {
                    "factor": "Nationalism and Domestic Incentives",
                    "effect": "Increases probability. Both governments, facing internal pressures and recent casualties, have incentives for displays of strength and resolve, heightening escalation risks."
                },
                {
                    "factor": "Absence of Robust External Monitoring",
                    "effect": "Increases probability. Historic resistance to foreign observers/monitors (e.g. failed Indonesian/ASEAN observer plans) reduces the effectiveness of the ceasefire and makes renewed deadly clashes more likely."
                },
                {
                    "factor": "External Mediation and Great Power Involvement",
                    "effect": "Decreases probability, but marginally. The involvement of the U.S., China, and Malaysia increases pressure for restraint, but mediation is reactive and enforcement mechanisms are limited."
                },
                {
                    "factor": "Mutual Desire to Avoid Major War (Cost-Benefit Calculus)",
                    "effect": "Decreases probability. Both leaderships are rational actors who perceive high costs to renewed open warfare, especially economic disruption, trade effects, and civilian displacement."
                },
                {
                    "factor": "Escalation Management Patterns (Base Rate/Historical Precedent)",
                    "effect": "Slightly decreases probability. Patterns since 2011 show that after major clashes, both Thailand and Cambodia usually step back from the brink, even as low-level violence persists."
                }
            ],
            "no_scenario": "After the November 2025 spike in violence and subsequent suspensions of peace agreements, both countries engage in confrontational diplomacy but avoid direct large-scale clashes. Skirmishes and provocations (occasional exchanges of fire or civilian casualties) occur, but they remain contained or cause less than three fatalities on any one occasion. International mediation (U.S., China, ASEAN) and fear of economic and political costs ensure that brinkmanship does not escalate past the resolution threshold within 2025.",
            "yes_scenario": "A border incident, such as a mine detonation or miscalculated military patrol, kills military personnel on one or both sides—quickly followed by retaliatory strikes under heightened nationalist rhetoric. This escalates into brief but intense kinetic fighting involving artillery or heavy weaponry, resulting in three or more fatalities (potentially more, given historical episodes). The clash is subsequently contained by external diplomatic intervention, but only after meeting the 'three or more fatalities' threshold between November 18 and December 31, 2025.",
            "final_reasoning": "While a cold peace prevails, there have already been multiple kinetic incidents resulting in fatalities (e.g., the November 2025 shooting incidents and mine explosions), and both sides have recently suspended or called into question the October peace agreement. The border region remains heavily militarized and mutually contested, with weak international monitoring, and high domestic and nationalist pressures on both leaderships. On the other hand, external incentives to avoid a return to major war—such as economic sanctions, U.S. and Chinese engagement, ASEAN mediation, and the recognition of past costs—should motivate restraint. The base rate for large deadly clashes after ceasefires in this specific dyad (post-2011 and post-2010s) is relatively low, but present conditions are more volatile than usual. With roughly six weeks before the deadline, a single cross-border mishap (e.g., involving a mine or rapid escalation of a skirmish) could readily cross the three-fatality threshold, especially given the Remembrance- and blame-shifting rhetoric. However, since neither side wants full-scale war, an escalation is somewhat less likely than the current level of tension might suggest—absent an accidental or rogue incident. Integrating these factors, an outcome at or slightly above the midline (reflecting substantial risk but still a probability less than 50% that a qualifying deadly clash will occur) is warranted. Therefore, my initial forecast is:",
            "final_probability": 40
        },
        "International Relations (Liberal Institutionalism)": {
            "time_to_resolution": "Approximately 6 weeks (question resolves January 1, 2026; today is November 18, 2025).",
            "perspective_relevance": "As an expert in International Relations (Liberal Institutionalism), my analysis rests on the importance of international institutions (ASEAN, the US and China as mediators), norms, and interdependence as mechanisms for dampening escalation between Thailand and Cambodia. Liberal institutionalism suggests joint regimes, mediation, economic ties, and institutional monitoring are primary levers for peace, even against the pull of historical rivalries. Nevertheless, persistent institutional weaknesses and lack of credible enforcement mechanisms can frustrate the stabilizing effects institutions aspire to provide.",
            "status_quo": "The status quo is that after a major, deadly flare-up (over 40 killed) in July and multiple additional skirmishes (including further deaths and injuries and ambiguous responsibility over landmine use), clashes and provocations have continued sporadically. The US/ASEAN-brokered peace agreement is officially suspended by Thailand after renewed violence in early/mid-November. There has not, however, been a new incident with 3+ fatalities since the cut-off (after July 31) that would trigger a 'Yes.' Current incidents have caused 1 fatality at a time, and both sides resist full escalation. Tense but sub-threshold kinetic activity and limited violence remain the norm.",
            "perspective_derived_factors": [
                {
                    "factor": "Regional Institutional Mediation and Monitoring",
                    "effect": "Decreases probability. ASEAN (and, to a lesser degree, US/China) have invested in mediation, monitors, and high-level communication, maintaining a strong incentive for both sides to avoid large-scale violence. However, institutional leverage is limited by sovereignty sensitivities and the unwillingness to allow robust third-party observation."
                },
                {
                    "factor": "Recent Suspension/Undermining of Agreements",
                    "effect": "Increases probability. Thailand's suspension of the peace agreement and the lack of progress in demining or the return of POWs exacerbate mistrust, making further escalation more likely in the short term."
                },
                {
                    "factor": "Absence of Credible Enforcement or Monitoring",
                    "effect": "Increases probability. Liberal institutionalism argues institutions are only as effective as their enforcement and monitoring power. Historical failure to implement meaningful observer missions or joint mechanisms (as after 2011) weakens the ceasefire, raising the hazard of fatal miscalculations or unrestrained retaliations."
                },
                {
                    "factor": "Transnational and Economic Interdependence",
                    "effect": "Decreases probability. Despite the border's volatility, both governments have incentive to avoid further escalation for economic reasons—trade, cross-border movement, and rice export deals (notably with China) are at risk, providing material incentive for restraint."
                },
                {
                    "factor": "Domestic Politics and Nationalism",
                    "effect": "Increases probability. Particularly in Thailand, rising nationalist rhetoric (blaming Cambodia for mine incidents and civilian deaths) and domestic discontent can lead to escalation as leaders seek to appease constituencies or recover lost prestige. Cambodian hardline stances in response to casualties can also trigger tit-for-tat violence."
                },
                {
                    "factor": "International Great Power Involvement",
                    "effect": "Decreases probability. High-profile communications from the US, China, and Malaysia contribute diplomatic pressure against renewed deadly escalation, as all major external actors are united in urging restraint for regional stability."
                },
                {
                    "factor": "Historical Base Rates for Kinetic Escalation",
                    "effect": "Slightly increases probability. Although brief deadly clashes occur periodically (2008, 2011, 2025), protracted, multi-casualty escalations rarely persist for months at a time. Nevertheless, the history suggests that even after ceasefires, there is a non-negligible risk of a deadly incident."
                }
            ],
            "no_scenario": "Despite provocations (mine incidents, civilian shootings, military posturing, sporadic gunfire), both sides exercise restraint under coordinated pressure and maintain sub-lethal clashes only. Effective (if informally enforced) monitoring, the threat of economic sanctions, active diplomatic engagement from ASEAN, China, and the US, and mutually recognized high costs of escalation suppress the occurrence of another clash with 3+ fatalities before January 1, 2026.",
            "yes_scenario": "A miscalculation or escalation (e.g., a mine killing multiple soldiers, or retaliatory artillery fire in response to a border incursion resulting in 3 or more deaths) occurs—catalyzed by breakdown of bilateral trust, weak institutional monitoring, or domestic pressure. Institutional mechanisms prove too slow or toothless to intervene. Nationalists or hardliners on either side push for a punitive action, resulting in a clash surpassing the fatality threshold.",
            "final_reasoning": "With just over six weeks left and several recent violent but sub-threshold incidents, the situation is deeply unstable and institutional mechanisms are strained. However, the pattern suggests both governments remain highly sensitive to external (US, ASEAN, China) diplomatic/economic pressure and are wary of drawing international opprobrium or economic sanctions. The main risk is that a single uncontrolled incident could quickly escalate (especially given weak monitoring and fragile trust), but for now, most recent violence has remained sporadic and limited in lethality. Historical precedent shows that after a serious flare-up and international mediation, lethal violence frequencies usually fall for at least several months—though not always cleanly. Liberal institutionalism suggests the combination of active mediation, economic interdependence, and regional/international pressure creates strong, if imperfect, guardrails against renewed major violence, but these guardrails are not foolproof given the peace agreement's suspension and the institutional weaknesses. In sum: the risk of a renewed deadly clash is elevated compared to peacetime but less likely than not before the end of 2025.",
            "final_probability": 32
        },
        "Security Studies (Securitization Theory)": {
            "time_to_resolution": "Approximately 6 weeks (from 2025-11-18 to 2026-01-01)",
            "perspective_relevance": "As an expert in Security Studies and Securitization Theory, my analysis emphasizes how political actors frame threats, mobilize extraordinary measures, and the role of external actors, audience acceptance, and institutional context in transforming issues (such as border skirmishes) into existential security threats. I will not only evaluate the military and political base rates of escalation but also interpret how current securitizing moves, counter-securitization, and the interplay with international mediation affect escalation risks, and thus the probability of further fatal clashes.",
            "status_quo": "After a bloody summer in 2025, a tenuous ceasefire was established. Recent weeks have seen fresh violence (landmine blasts, shootings resulting in civilian or soldier deaths, and army alerts), but each incident has stopped short of returning to large-scale hostilities. Mediation (ASEAN, US, China, Malaysia) is ongoing, the October peace agreement is suspended but not formally repudiated, and both sides signal restraint publicly, despite mutual accusations and threats.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent Kinetic Clashes and Fatalities",
                    "effect": "Increases probability. Multiple incidents in November already involve deaths from landmines and cross-border shooting, showing the threshold for violence remains low and current mechanisms are not fully robust."
                },
                {
                    "factor": "Suspension (but not total breakdown) of the Peace Declaration",
                    "effect": "Increases probability. The suspension (by Thailand) of bilateral agreements after mine incidents signals a key institutional safeguard has weakened and increases risk of escalation, especially since heavy weapons withdrawal and prisoner exchanges are now on hold."
                },
                {
                    "factor": "Historical Pattern of Escalation and De-Escalation",
                    "effect": "Decreases probability. Historically, even after fatal incidents, both sides have tended to pull back from extended hostilities after bloody initial escalations. Large-scale, 3+ fatality clashes are infrequent compared to persistent low-level friction."
                },
                {
                    "factor": "External Mediation by Major Powers and ASEAN",
                    "effect": "Decreases probability. The active engagement of China, the US, and ASEAN increases the political cost of massive renewed violence. King's visit to China, high-level phone calls, and observer missions all provide diplomatic incentives for restraint. Personal appeals (e.g., Trump’s self-promotion as peacemaker) augment this effect in the short run."
                },
                {
                    "factor": "Mutual Securitization and Rising Nationalism",
                    "effect": "Increases probability. Both governments now frame the border as a matter of core sovereignty and national dignity, elevating the stakes and increasing audience pressure to retaliate for real or perceived violations."
                },
                {
                    "factor": "Fragility of Ceasefire Monitoring and Implementation Mechanisms",
                    "effect": "Increases probability. The lack of trusted, embedded monitoring (ASEAN observers are neither fully empowered nor fully trusted/accepted on both sides) creates information asymmetries and incentives to test boundaries, risking fatal misunderstandings."
                },
                {
                    "factor": "Domestic Political Calculations and Audiences",
                    "effect": "Neutral to slight increase. Neither government faces imminent regime collapse, but both have incentives to use controlled escalation to bolster nationalist credentials, especially if they can blame fatalities on the ‘other’ side, but uncontrolled escalation would threaten economic and diplomatic gains."
                },
                {
                    "factor": "Escalation/De-escalation Path Dependence",
                    "effect": "Increases probability. The current round, occurring so soon after a major escalation, suggests both armies are on heightened alert and the sequencing of tit-for-tat incidents raises the risk threshold for a new deadly clash."
                },
                {
                    "factor": "Securitization Theory: Audience Acceptance and International Image",
                    "effect": "Decreases probability. Both sides seek international legitimacy and are aware that a major deadly incident could result in loss of face at ASEAN, jeopardize trade deals, and attract sanctions or reputational cost."
                }
            ],
            "no_scenario": "Despite occasional fatal landmine or shooting incidents (1-2 deaths at a time), both governments maintain extraordinary diplomatic engagement, enforce strict ROEs to contain incidents, and respond to provocation with limited force or symbolic retaliation only. The presence of international observers, even if limited, provides a thin but sufficient reputational check. Any deaths fall short of the 'three or more fatalities' threshold, or are considered accidents, not attributed to direct kinetic clashes, thus not meeting the question criteria. Ceasefire violations remain isolated, and both sides refrain from escalatory actions, avoiding another incident that qualifies for resolution.",
            "yes_scenario": "In the next weeks, either a miscalculation at a hotspot (e.g., Prey Chan, Banteay Meanchey) or a tit-for-tat retaliation (possibly for further landmine incidents or border shootings) triggers intense crossfire or an ambush involving military or paramilitary forces, causing three or more deaths (e.g., a patrol wiped out, an artillery misfire hitting a group of troops, or heavy weapons reintroduced). The sense of grievance and mutual distrust, together with local commanders' autonomy and the lack of robust third-party monitoring, allow for a rapid, localized escalation before political leaders can de-escalate. Both sides blame each other, but the incident meets the resolution criteria, before the end of December.",
            "final_reasoning": "Taking into account the factors above, especially the securitization of the border issue, recent patterns of low-level violence that have nearly – but not quite – crossed the 'deadly clash' threshold, and the fragility of institutional arrangements, the risk of a qualifying incident before year-end is substantial. The pattern since July shows a sharp initial escalation causing many deaths, then a tenuous ceasefire, quickly violated by lower but persistent kinetic incidents (landmines, cross-border shootings, civilian/few-casualty skirmishes), now occurring more frequently. While international mediation and elite dialogue still operate, the peace agreement is effectively on ice, monitoring is insufficient, and both publics are primed for blame and retaliation. Historically, the base rate of three or more deaths in a single clash is low after the most violent outbreaks, but today's tensions are high, and the absence of robust stopgaps elevates the risk window. Securitization theory suggests that both leaderships might prefer restraint but are constrained by audience and reputation: an incident could spiral too quickly. With only six weeks left, major actors have clear incentives for peace, but the operational reality at the border – demonstrated by multiple fatal incidents already this month, and escalation in language/actions – significantly increases downside risk. Overall, I estimate about a 1-in-3 chance (33%) of another deadly, qualifying military clash in this window, higher than the historic average but below even odds, given the powerful (but fragile) countervailing forces.",
            "final_probability": 33
        },
        "Security Studies (Conflict Escalation Model)": {
            "time_to_resolution": "Approximately 43 days until January 1, 2026.",
            "perspective_relevance": "As a Security Studies expert focusing on conflict escalation models, I am uniquely equipped to assess not just the pattern of past violence but also the interplay of mechanisms (such as signaling, commitment problems, escalation ladders, and external mediators) that determine whether skirmishes transition to deadly, multi-casualty clashes or remain contained. This allows for a structured, risk-based assessment rooted in both empirical history and theory-driven analysis of current incentives and misperceptions.",
            "status_quo": "Ceasefire agreements, sometimes interrupted by sporadic violence or minor incidents resulting in limited casualties, prevail along the Thailand-Cambodia border. While violent flare-ups occur, rapid escalation to large-scale, multi-fatality clashes has been irregular, with diplomatic efforts and third-party mediation contributing to sporadic de-escalation.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent Escalatory Incidents and Casualties",
                    "effect": "Increases risk. Recent clashes (Nov 10–13) caused deaths and injuries, with at least one civilian killed and several wounded, but not breaching the three-fatality threshold. The proximity of violence to this threshold raises the probability of a qualifying clash if current tensions persist."
                },
                {
                    "factor": "Ceasefire Fragility and Mechanism Weakness",
                    "effect": "Increases risk. The presence of ceasefire mechanisms (Joint Declarations, monitoring offers from ASEAN) is undercut by lack of implementation and mutual mistrust. Both sides have suspended aspects of these mechanisms (Thailand pausing the declaration after mine incidents, delaying POW releases), reducing the effectiveness of institutional guardrails."
                },
                {
                    "factor": "Successful De-escalation and External Pressure",
                    "effect": "Decreases risk. Regional/international actors (ASEAN, China, U.S.) have active interest in containing escalation. The concurrent visit of the Thai king to China, hailed as a diplomatic milestone, and public communications from the U.S. and Malaysia reinforce pressure for restraint and dialogue. Past conflict cycles often show reduction in violence following such high-profile engagement."
                },
                {
                    "factor": "Conflict Escalation Model—Ladder and Signaling",
                    "effect": "Increases risk. The situation exhibits key features of unstable escalation: ambiguous border incidents, reciprocal accusations, rising nationalism, unresolved historic grievances, and tit-for-tat signaling (e.g., accusations about mine-laying and retaliation threats). The escalation ladder is at a 'skirmish' rung (deadly but small, civilian as well as military targets), but the capability and readiness for rapid escalation remain present on both sides."
                },
                {
                    "factor": "Base Rate and Historical Precedent",
                    "effect": "Mixed effect. While the 2025 conflict was deadlier than typical, history shows that most post-ceasefire periods (2011, mid-2010s) saw only sporadic fatalities, with major outbreaks rare but possible. However, July 2025 already saw a rapid escalation to over 40 deaths; the current environment is more combustible than typical peacetime lulls."
                },
                {
                    "factor": "Political Will and Domestic Constraints",
                    "effect": "Decrease risk marginally. Both governments face domestic and economic pressures to avoid large-scale war (border closures, trade disruptions, mass displacement, nationalist backlashes). Cambodia, for example, has taken the unusual step of not retaliating after civilian deaths to \"preserve the fragile truce,\" indicating cost-sensitivity and risk aversion at the leadership level."
                }
            ],
            "no_scenario": "Minor border incidents continue—occasional landmine or gunfire events cause injuries or 1-2 fatalities, but these do not cross the 'three or more' fatality threshold. Strong diplomatic pressure from China, ASEAN, and the U.S., coupled with mutual exhaustion, prevents escalation. No single clash results in three or more deaths. Both sides prioritize economic/trade interests and domestic stability over border provocation.",
            "yes_scenario": "A border incident—such as a mine explosion or misinterpreted patrol movement—results in several simultaneous deaths, perhaps involving both soldiers and civilians. Retaliatory artillery fire or small-unit skirmishes escalate beyond previous incidents, leading to three or more fatalities in a single, reportable clash before 2026. Domestic political actors (military, nationalist factions) push leaders to respond forcefully, overcoming moderating influences from international mediators.",
            "final_reasoning": "The status quo is highly unstable: despite ceasefire agreements, both November and July 2025 showed that the area can quickly revert to deadly violence. There have been at least two recent violent flare-ups with fatalities (just below the three-fatality threshold), suggesting the preconditions for a qualifying outcome are present. The current period is unusually volatile, marked by unresolved underlying disputes, mutual blame for ceasefire violations, suspended diplomatic mechanisms, and reciprocal escalation steps (mines, shootings, halted POW releases). While international mediation is strong and both sides have incentives to avoid a repeat of July's mass casualties and displacement, the escalation ladder's rungs are being tested—one more miscalculation or weapon mishap could easily result in the required threshold being crossed. However, the high external pressure, active diplomatic engagement (e.g., Chinese summitry, U.S. calls), and evident desire by leaders to avoid war (Cambodian restraint, Thailand's focus on trade, and continuous dialogue offers) together reduce—but do not eliminate—the risk. Thus, the likelihood is notably elevated relative to pre-July base rates, but slightly lower than if these moderating influences were absent. I assess the probability of another qualifying deadly clash at 55%.",
            "final_probability": 55
        },
        "Southeast Asian Studies (ASEAN Regionalism)": {
            "time_to_resolution": "Approximately 6 weeks (until January 1, 2026)",
            "perspective_relevance": "As an expert in Southeast Asian Studies with a focus on ASEAN regionalism, I bring a nuanced understanding of the region's historical border disputes, conflict management instruments, power dynamics, and the interplay between intra-ASEAN and extra-regional (US, China) diplomacy. I am able to distinguish between credible threats and ritualized brinksmanship, and situate current developments within the base rates, institutional constraints, and the unique contingencies shaping Thai–Cambodian relations.",
            "status_quo": "The status quo is an uneasy ceasefire repeatedly broken by localized incidents, but—crucially—no renewed large-scale kinetic clashes resulting in three or more fatalities since the truce of July 2025. Sporadic violence, high tension, and diplomatic intervention are ongoing, but all-out deadly confrontation has thus far not recurred post-ceasefire.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent escalation and ongoing violence",
                    "effect": "Increases probability. The suspension of the peace declaration, exchange of live gunfire, casualties (though <3 fatalities in the latest incident), frequent accusations of ceasefire violations, and mine incidents all indicate that the situation is dangerously unstable and that accident or escalation could quickly produce a deadly incident."
                },
                {
                    "factor": "Historical base rate of deadly Thai-Cambodian clashes",
                    "effect": "Neutral to slightly increases probability. Major fatal clashes (3+ killed in a single incident) are rare but not unprecedented. While most border violence is low-level, the past 18 months have seen at least two distinct flare-ups with high fatality counts, suggesting the base rate is currently elevated above the long-term average."
                },
                {
                    "factor": "Third-party mediation and international pressure (ASEAN, US, China, Malaysia)",
                    "effect": "Decreases probability. External actors are highly engaged; US, China, and Malaysia are all pressuring for de-escalation, and the ASEAN framework is being invoked for conflict management. While third-party monitoring is resisted, their involvement incentivizes restraint, particularly to avoid jeopardizing economic relationships or diplomatic reputation."
                },
                {
                    "factor": "Domestic political pressures and nationalism",
                    "effect": "Increases probability. In both Thailand and Cambodia, leaders have responded to accusations with nationalist rhetoric. There are incentives for hardline military postures, especially given border region constituencies and the enduring salience of historical/territorial grievances."
                },
                {
                    "factor": "Fragility of ceasefire and lack of robust monitoring",
                    "effect": "Increases probability. Both the July and October agreements are riddled with loopholes, lack direct enforcement mechanisms, face mutual mistrust, and have not yet implemented third-party monitoring. This raises the risk that a misunderstanding or deliberate provocation could produce a more deadly engagement."
                },
                {
                    "factor": "Desire to avoid economic harm and great-power repercussions",
                    "effect": "Decreases probability. (i) Trade relationships with the US and China are of major importance for both countries; (ii) trade and aid have been explicitly linked to the peace process; (iii) escalation would risk severe economic fallout at a time of regional economic uncertainty."
                },
                {
                    "factor": "Nature of most recent incidents",
                    "effect": "Slightly decreases probability. While recent violence has occurred, all kinetic incidents since the July truce—gunfire, landmine blasts—have thus far produced only single fatalities or small numbers of wounded (e.g., 1 killed, 3 wounded in the most recent exchange), suggesting both sides may be exercising restrained violence rather than returning to major combat."
                }
            ],
            "no_scenario": "Both sides continue with tit-for-tat provocation, sporadic low-level gunfire or mine incidents, and heated diplomatic rhetoric, but avoid a major engagement. International mediators (ASEAN, Malaysia, US, China) maintain pressure on Bangkok and Phnom Penh to restrain their forces, leveraging economic and diplomatic incentives. No single clash results in 3+ deaths; border remains tense but relatively stable through Jan 1, 2026.",
            "yes_scenario": "A local incident spirals—perhaps a border patrol confrontation, accidental or deliberate ambush, or miscommunication during a mine clearance operation—leading to an exchange of fire or an explosive event in which at least three military or security personnel (or civilians in crossfire) are killed. Nationalist backlash and lack of effective third-party monitoring exacerbates escalation, overwhelming international mediation efforts for at least one fatal clash.",
            "final_reasoning": "The probability of another deadly clash (3+ fatalities) before Jan 1, 2026, is notably elevated compared to peacetime, due to recent escalation (mine blasts, direct fire, breakdown of peace agreement), mutual mistrust, unresolved territorial issues, and absence of robust monitoring. The most recent violent incidents fall just below the threshold of 3 deaths, evidencing ongoing risk, but also showing that large-scale escalation has NOT (yet) recurred since July. On the other hand, the proximity of these incidents to the threshold, the fragility of existing mechanisms, and concurrent nationalist pressures suggest that a single miscalculation could trigger a qualifying fatal clash. However, external mediation and major economic interests on both sides are strong incentives for restraint in the coming six weeks. Balance of probability, given the time remaining, historical pattern, and current tension, lands slightly above even odds—danger is very real, but major actor incentives are aligned (albeit weakly) against a major new deadly clash. I judge the probability as modestly >50%, reflecting both the structural danger and significant mitigating factors.",
            "final_probability": 58
        },
        "Southeast Asian Studies (Postcolonial Border Dispute Analysis)": {
            "time_to_resolution": "Approximately 6 weeks remain until January 1, 2026.",
            "perspective_relevance": "As an expert in Southeast Asian Studies specializing in postcolonial border disputes, I offer an in-depth understanding of the historical roots, the dynamics of disputed demarcations, and the patterns of escalation/de-escalation between Thailand and Cambodia. I analyze not just current violence, but the role of ethnic, political, and external factors—including powers like China, US, and ASEAN mediation—shaping the likelihood of renewed deadly conflict.",
            "status_quo": "A fragile and repeatedly violated ceasefire is in place. Skirmishes, small-scale shootouts, and periodic mine incidents have recently occurred and resulted in fatalities and displacements. Hostilities have not risen to a multi-fatality (3+ deaths) clash since the fresh November incidents, but both sides remain on high alert, and cooperation over ceasefire monitoring is tenuous.",
            "perspective_derived_factors": [
                {
                    "factor": "Historical Base Rate and Pattern of Thai-Cambodian Clashes",
                    "effect": "Increases probability, as the border has seen repeated deadly escalations in 2008, 2011, and again earlier and mid-2025, even after high-profile ceasefires. Recurrent, unresolved disputes suggest flashpoints remain highly volatile."
                },
                {
                    "factor": "Presence and Violation of Ceasefire and Third-Party Monitoring",
                    "effect": "Decreases probability modestly, as even fragile ceasefires—especially those under international scrutiny—can restrain major escalations, although lack of effective monitoring (as currently observed) weakens this suppressive effect."
                },
                {
                    "factor": "Recent Incidents and Tit-for-Tat Retaliation",
                    "effect": "Increases probability. The injury and death of soldiers from landmines, cross-accusation of mine-laying, and shootouts causing civilian casualties have reignited public outrage, risk upward spirals, and have already led to suspension of deals and mobilization of troops."
                },
                {
                    "factor": "Great Power Engagement (China, US, ASEAN)",
                    "effect": "Decreases probability. The high-profile diplomatic engagement, including Trump's phone diplomacy and ASEAN’s mediation, imposes external costs to escalation and creates international pressure for restraint. However, its credibility and leverage are partially undermined by transactional dynamics and lack of unified third-party monitors."
                },
                {
                    "factor": "Domestic Political Pressures and Nationalism",
                    "effect": "Increases probability. Both Hun Manet (Cambodia) and Anutin (Thailand) are under pressure to demonstrate resolve. Rising nationalist sentiment, particularly amid accusations of sovereignty violations and civilian casualties, can push leaders or military actors to escalatory actions."
                },
                {
                    "factor": "Timing: Short Runway to 2026",
                    "effect": "Decreases probability. The next 6 weeks are a narrow window for a full 3+-fatality incident to materialize, unless another major spark occurs. But given volatility, this buffer is modest."
                }
            ],
            "no_scenario": "Incidents remain limited to sporadic low-level violence (such as single fatalities or non-lethal exchanges), restrained by external diplomatic pressure and awareness of the economic and political costs of a renewed deadly clash. ASEAN, the US, and China keep both sides in dialogue, enforcement of border discipline is increased, and neither army crosses the threshold of a clash causing 3+ deaths until January 1, 2026.",
            "yes_scenario": "A border incident—such as a mine explosion, an incursion real or perceived, or a local commander’s overreaction—ignites a sharp firefight or retaliatory attack. Mutual suspicions, recent troop mobilizations, and lack of on-the-ground monitoring allow escalation to a clash causing 3 or more deaths (either military or civilian) before 2026. Past patterns (e.g., July and November 2025, or 2011) repeat, with rapid but locally intense violence.",
            "final_reasoning": "The historical base rate for return to deadly violence after Thai-Cambodian ceasefires is high, with multiple deadly clashes in the last 20 years even under international mediation. The ceasefire and external diplomatic engagement exert moderating effects but are brittle: there is no robust ASEAN or outside observer team on the ground, and both sides have recently suspended critical elements of the peace process. Nationalist pressures and tit-for-tat violence have visibly increased in the past week, with fatalities, serious injuries, troop mobilizations, and suspension of prisoner releases. On the other hand, the international spotlight—due to Trump, Xi, ASEAN chair Malaysia/Philippines—has so far contained escalation to single-fatality events post-November 12. The very short time to resolution (6 weeks) works against a major new incident, but the November events (shots, mine, cross-border shooting with civilian death) show a very high baseline risk. Given all, and weighing recent escalation, base rates, and the slightly positive role of international pressure, I judge that the probability of a deadly (3+ fatality) clash before January 1, 2026 is high but not overwhelming—most likely around 62%.",
            "final_probability": 62
        }
    },
    "deliberation_probability": [
        40,
        25,
        37,
        63,
        40,
        32,
        33,
        55,
        58,
        62
    ],
    "deliberation_mean_probability": 44.5,
    "deliberation_sd": 13.769935043823232,
    "deliberation_probability_result": 44,
    "group_results": {
        "MilitaryIntelligenceThreatAssessmentMethodology": {
            "forecaster_to_engage": "CrisisManagementRiskAnalysisProcedures",
            "response_type": "critique",
            "response": "Your 63% probability almost reads as if you expect a deadly clash to be likely despite the short time horizon, but the evidentiary basis doesn't support that level of certainty. Yes, we've seen recent deadly incidents and plenty of near-miss escalation points, but nearly all have peaked at one or (rarely) two fatalities—even in the face of provocations, diplomatic breakdowns, and suspended mechanisms. Both sides have historically exercised sudden, if imperfect, restraint to avoid spiraling events after third-party intervention—base rates for multi-fatality clashes post-ceasefire in this dyad are still much lower than your number suggests, especially on short intervals. You're overweighting the risk posed by tactical volatility and underweighting the massive incentive structures (international mediation, economic levers, political face-saving) promoting sub-threshold violence. A 63% forecast implies the most likely outcome is a significant new deadly clash before New Year's—yet the available pattern is small-scale recurring violence, not sustained escalatory warfare. Dial down the crisis panic: the risk is real, but it's not yet the default."
        },
        "DiplomaticAffairsTrackTwoDiplomacyPractice": {
            "forecaster_to_engage": "SecurityStudiesConflictEscalationModel",
            "response_type": "critique",
            "response": "A 55% probability for another 3+ fatality clash in just the next 6 weeks is unreasonably high, given not just the historical base rates and the recent record (where recurring violence has consistently remained below the threshold), but more importantly, the current entanglement of Track One and Track Two diplomatic responses. Track Two and regional actors have dramatically increased the reputational and economic cost of further escalation, and both governments are positioning for diplomatic, not military, wins. You're overemphasizing 'instability' at the expense of substantial structural brakes that, in repeated prior post-ceasefire periods, have channeled tensions into brief, contained skirmishes, not renewed bloodshed on this scale. Your risk curve should show a spike after a collapsed truce, but then a rapid drop in probability absent new triggering events; instead, you have kept it suspiciously high, suggesting every incident is equally likely to escalate fatally, contrary to the record. Overweighting instability, underweighting diplomatic constraint—your forecast just doesn't parse."
        },
        "CrisisManagementIncidentCommandSystem": {
            "forecaster_to_engage": "SoutheastAsianStudiesAseanRegionalism",
            "response_type": "critique",
            "response": "Your 58% probability overshoots the mark and drifts into the territory of unjustified alarmism. ASEAN engagement, while not ironclad, historically acts as a substantial (if sometimes cosmetic) brake on full-scale escalations in the region—for all the failings of regional mechanisms, the reputational and economic ramifications for member states of triggering a new, deadly, internationally documented clash so soon after peace summits are enormous. You cite nationalist pressure and tactical triggers—no doubt they're real—but the system is now flooded with external peacekeeping signals from both great powers and ASEAN, with local command likely under greater-than-normal scrutiny. Recent violence, while alarming, has plateaued in severity and remains sub-threshold. To tip the odds over 50% ignores the strong path dependency following the last major clash—post-ceasefire periods almost always see a sharp drop in lethal kinetic incidents. You're conflating volatility with inevitability. The risk is significant, yes, but not the coin-flip or worse your number implies."
        },
        "CrisisManagementRiskAnalysisProcedures": {
            "forecaster_to_engage": "InternationalRelationsLiberalInstitutionalism",
            "response_type": "defense",
            "response": "For once, the liberal institutionalist lens isn't naïvely optimistic; your 32% sits in the right band and reflects the practical constraints of the situation. After a wave of sub-threshold violence and recent bloody but non-catastrophic incidents, it's crucial not to confuse persistent volatility with imminent disaster. Your insistence on the moderating effect of international economic linkages, active mediation, and 'guardrails' established by institutions and major-power involvement is exactly what the crisis management field would highlight as critical dampers on escalation. It's not that a multi-fatality clash is impossible—tactical risks are real—but rather that both governments are heavily incentivized to manage violence just below the international outrage threshold, especially with global and regional spotlights on them and economic negotiations at stake. You correctly recognize both the ongoing danger and the practical, historic drop-off in mass-lethal events post-mediation. Your forecast is sober, giving risk its due without succumbing to war fever."
        },
        "InternationalRelationsRealism": {
            "forecaster_to_engage": "SoutheastAsianStudiesPostcolonialBorderDisputeAnalysis",
            "response_type": "critique",
            "response": "Let's be clear: your 62% forecast is overcooked and betrays a fundamental misunderstanding of how power, not just trauma and base rates, drives escalation. You're absolutely right that colonial-era border disputes and nationalist grievance set the stage, but that doesn't make the actors automatons marching to war. Realism says states act when the balance of incentives favors it. Right now, neither Thailand nor Cambodia wants to jeopardize hard-won trade deals or upset their standing with ASEAN, Washington, or Beijing—all of whom have skin in the game and levers ready. The sharp drop-off in multi-fatality incidents post-ceasefire (look at 2011) isn't accidental; it's the result of deliberate, interest-driven restraint, with sub-threshold violence as safety valve. You risk confusing repeated headline drama for a ticking time bomb that must go off. There are many paths to vent anger without handing your adversary the propaganda coup of a deadly border incident. Sub-threshold tit-for-tat, symbolic gestures, hostage diplomacy—these are the statecraft tools in play now. 62% ignores how postcolonial grievances are managed, not unleashed, by rational regimes in a risky international environment."
        },
        "InternationalRelationsLiberalInstitutionalism": {
            "forecaster_to_engage": "SecurityStudiesSecuritizationTheory",
            "response_type": "defense",
            "response": "Credit where it's due: your securitization framework nails the interplay between audience costs, elite restraint, and the chilling reality that escalation pressure doesn't purely stem from regime interest but also the social construction of threat. Unlike the doom-mongers above 50%, your 33% forecast rightfully accentuates how both the Thai and Cambodian leaderships are trapped—yes, by volatile publics and legacy trauma, but also by their own desire to project calm to key international partners. Securitization, by making the border a matter of 'existential' threat, certainly raises risks. Yet your analysis refuses to fall into the trap of thinking every angry speech or skirmish automatically leads to lethal escalation. By recognizing the dual effect of elite posturing (raising the temperature at home, but also performing on the international stage for peace), you temper the odds with realism—a composite lens many others lack. Your modestly elevated 33% is a better fit for the evidence than the overblown alarmism elsewhere in this roster."
        },
        "SecurityStudiesSecuritizationTheory": {
            "forecaster_to_engage": "SecurityStudiesConflictEscalationModel",
            "response_type": "critique",
            "response": "The trouble with your 55% isn't just that it's high—it's that it treats tactical volatility as structurally determinative, ignoring how securitization interacts dynamically with international audience effects and elite signaling. You argue that current flare-ups and repeated posturing show the 'rungs are being tested' and a qualifying incident is at least even money, but you barely consider the centrality of public performance in this context. Both Thai and Cambodian political actors have gone out of their way to assure international partners of commitment to restraint: this isn't just cheap talk, it's embedded in repeated high-visibility diplomatic maneuvers, not least the king's visit to Beijing and each side's scramble to muster global sympathy. When you ignore the interactive constraints of international legitimacy (a core insight of securitization theory) and focus overwhelmingly on escalation ladders, you overestimate the degree to which tactical missteps override systemic incentives. The path dependence after July's carnage—numerous sub-threshold events, yes, but not a cascade to mass casualties—should clue you in that the system absorbs volatility via diplomatic and symbolic means. Not every show of force is mere prelude to bloodshed. 55% implies the default outcome is deadly violence, but in reality, social, diplomatic, and institutional contexts are pulling hard the other way."
        },
        "SecurityStudiesConflictEscalationModel": {
            "forecaster_to_engage": "DiplomaticAffairsTrackTwoDiplomacyPractice",
            "response_type": "critique",
            "response": "Your conservative 25% forecast is an artifact of wishful diplomatic thinking, disconnected from both recent incident patterns and the reality of escalation dynamics in this dyad. You hang your hat on the reputational costs and international pressure—fair points—but ignore the operational evidence that Track Two and Track One diplomacy are not translating into robust local control: incidents are recurring, key monitoring is ineffective or absent, and restraint, while signaled from capitals, isn't reliably enforced in the field. You cite 'intensified engagement,' but the November incidents prove that diplomatic entanglement does not immunize the border from non-trivial lethality. In fact, the repeated near-threshold violence (especially after high-level signaling) points to a disconnect between intent and implementation—classic for this region. Given how fast July's situation deteriorated, and the number of institutional frictions that persist, your sub-one-in-four estimate underplays the escalating cues and recent precedent. A true risk assessment—conflict escalation model or otherwise—needs to weight tactical volatility and the thin, brittle nature of current confidence-building measures far more heavily."
        },
        "SoutheastAsianStudiesAseanRegionalism": {
            "forecaster_to_engage": "CrisisManagementIncidentCommandSystem",
            "response_type": "critique",
            "response": "You argue my 58% forecast is alarmist and conflate volatility with inevitability, but that's a misread of both the regional context and the ASEAN 'brake' function. Post-ceasefire periods in Thai-Cambodian relations have not, in fact, always seen a sharp drop-off in lethal kinetic events—think back to 2011: even under active ASEAN pressure, incidents flared anew. ASEAN's ability to restrain is real, but brittle: when monitoring is resisted, and the foundational dispute goes unresolved, you get exactly this pattern—restraint under duress, suddenly tripped by local flashpoints. The bar for a qualifying incident is low—just three deaths—so any one of the recurring face-offs, mine incidents, or tit-for-tat exchanges could cross it, especially as both sides keep blaming each other and holding POWs. You underweight just how fragile the 'ramifications' are in the face of unexpected escalation. Yes, things could remain tense and sub-threshold, but the fuse is short and the powder dry. Over 50% is appropriate: this isn't inevitability, it's recognizing we're in a period where three deaths in a single incident is a hair-trigger event, not a remote scenario."
        },
        "SoutheastAsianStudiesPostcolonialBorderDisputeAnalysis": {
            "forecaster_to_engage": "InternationalRelationsRealism",
            "response_type": "critique",
            "response": "Your critique of my 62% as 'overcooked' reflects a classic Realist blind spot: you acknowledge international incentives and economic interests but underplay both the deep-seated historical grievance dynamics and how frequently those override rational actor calculations in Southeast Asian postcolonial encounters. Time and again, volatility at the Cambodia-Thailand border is unleashed not because rationality fails, but because the postcolonial wound is persistently re-opened by tactical events too fast for top-level mediation to halt—think July 2025, or the multi-fatality spikes in 2011. Your invocation of restraint ignores how that restraint repeatedly breaks down at the operational level; local triggers—landmine deaths, prisoner reprisal—provoke outsized, escalatory responses precisely because 'interest' is tangled up in historical trauma and nationalist performance. Sub-threshold action as 'safety valve' is true until it isn't: the last few weeks have shown just how easily events spiral past anyone's threshold, especially with monitoring absent and mutual suspicion so high. A forecast above 60% doesn't treat states as automatons, but recognizes the lived reality of Southeast Asian border crises: repeated, postcolonially-honed cycles of restraint, violation, tragic overreaction, and hurried diplomatic mop-up. You're the one confusing 'managed' grievance for durable control—it isn't, and never has been, at this border."
        }
    },
    "revision_results": {
        "Military Intelligence (Threat Assessment Methodology)": {
            "my_phase1_final_probability": 40,
            "reasoning_for_revised_probability": "After reviewing my initial forecast and the group deliberation, I remain convinced that the risk of another deadly (3+ fatality) clash before Jan 1, 2026 is elevated but still below even odds. The group is notably split, with some (CrisisManagementRiskAnalysisProcedures, SoutheastAsianStudiesPostcolonialBorderDisputeAnalysis) landing above 60%, but most other expert perspectives, including those emphasizing diplomatic, institutional, and historical base-rate constraints, cluster between 25-40%. The historical record and recent incident pattern both suggest sub-threshold violence is the norm under heavy international pressure, and the time window is short. While the critique I made reinforces that certain forecasts are overweighting tactical volatility, there is also a consensus that risk is notably elevated in this cycle. Considering all views—including the possibility I'm slightly underweighting the risk of a catastrophic breakdown given the sheer tempo of November kinetic incidents—I'm nudging my estimate very slightly upward to precisely reflect that broader expert caution, but keep it in line with historic patterns and practical realities.",
            "revised_probability": 43
        },
        "Diplomatic Affairs (Track Two Diplomacy Practice)": {
            "my_phase1_final_probability": 25,
            "reasoning_for_revised_probability": "Upon reviewing the group deliberation, I see most forecasters assign a significantly higher probability to a deadly clash, often in the 40–60%+ range. However, nearly all acknowledge the decisive moderating influence of external actors, international scrutiny, and the short time horizon, which substantially limit the probability of a qualifying event, especially given the historical tendency toward sub-threshold violence when these pressures are present. Critically, those at higher probabilities often overemphasize tactical volatility and historical flareups, while underweighting the power of diplomatic, economic, and reputational incentives to maintain just-below-threshold violence post-ceasefire. My main critique is that these higher estimates imply a default-violent scenario even after periods of close calls—a pattern not supported in the immediate term by base rates. Since concrete recent incidents have consistently shown restraint just below the threshold, I do not see compelling reason to significantly raise my risk estimate. The evidence continues to suggest a meaningful but less-likely-than-not chance—roughly 1-in-4—of a deadly clash exceeding three fatalities before 2026.",
            "revised_probability": 25
        },
        "Crisis Management (Incident Command System)": {
            "my_phase1_final_probability": 37,
            "reasoning_for_revised_probability": "In phase 2, my critique targeted the tendency to overstate the likelihood of another deadly incident (3+ fatalities) in the brief window remaining. I remain convinced that the combination of ongoing violence, fragile field-level command, and the absence of robust international monitors keeps risk notably above base peacetime, but crucially, engaging with the other forecasters clarified the importance of short time horizon and the observed pattern: recent escalations have stopped short of the three-fatality mark despite direct provocations. The group consensus—aside from a few outliers—also trended toward a moderately elevated, not high, probability, with arguments for international pressure and institutional incentives carrying weight. The persistent, sub-threshold nature of incidents (mostly 1–2 deaths) over several months, even as peace mechanisms are suspended or strained, gives credence to the idea that both governmental and diplomatic constraints are strong enough to prevent immediate mass-fatality clashes unless a severe miscalculation occurs. Balancing my crisis management concerns against these diplomatic and historical patterns, I am nudging my probability downward to account for the lull in lethal escalation and the strong incentives arrayed against a qualifying incident breaking out in just 6 weeks.",
            "revised_probability": 30
        },
        "Crisis Management (Risk Analysis Procedures)": {
            "my_phase1_final_probability": 63,
            "reasoning_for_revised_probability": "Group deliberation raised a critical weakness in my initial logic: while the tactical and operational volatility remains extreme, the historical base rates of post-ceasefire, multi-fatality clashes in the Thai-Cambodian dyad—especially within narrow, post-crisis windows—are notably lower than I originally weighted. Several forecasters emphasized that, even amid persistent sub-threshold violence, major powers’ pressure, economic costs, and the active spotlight of ASEAN and international mediators typically succeed in suppressing further high-lethality events, at least temporarily. The pattern of recent months—frequent, deadly but sub-qualifying clashes—supports this. I was overweighting the likelihood of a rogue tactical incident crossing the fatality threshold by failing to sufficiently discount for the near-term dampening effect of diplomatic, reputational, and economic costs. While the risk remains clearly elevated, the probability should be ratcheted down to reflect more accurately the rarity of exactly the kind of event the question stipulates, in this specific time-frame and scenario.",
            "revised_probability": 48
        },
        "International Relations (Realism)": {
            "my_phase1_final_probability": 40,
            "reasoning_for_revised_probability": "My original forecast of 40% was cautious but reflected heightened risk due to recent deadly incidents, a suspended peace deal, and ongoing military tension, but kept below even odds in view of strong international and economic incentives for restraint. The group deliberation reveals a tightly clustered distribution near the midline, with most operational and diplomatic forecasters—Military Intelligence (40%), ICS/Threat Assessment (37-40%), Liberal Institutionalism (32%), Securitization Theory (33%), Conflict Escalation (55%), and ASEAN Regionalism/Postcolonial (58-62%)—debating only the margin of this elevated-but-not-certain danger. Crucially, the collective critique repeatedly pointed to the historical pattern that after ceasefires and international spotlight, the risk of large, multi-fatality flare-ups, while real, is contained by strong incentives for sub-threshold violence and international face-saving. Many forecasters challenging the 50%+ crowd argued persuasively for a modest but significant risk—not the expectation of disaster. Conversely, the risk is clearly not negligible, as 'control' of escalation remains imperfect, and local forces are prone to miscalculation. Hence, I see no reason to either dramatically raise or lower my probability: the modal forecast (30-40%) is well-supported by both base rates and the current incentive structure. The only potential adjustment would have been a slight downward move, based on repeated reinforcement of the power of restraint, but the continual recurrence of new incidents and sustained operational mismanagement supports caution. I will keep my forecast at 40%.",
            "revised_probability": 40
        },
        "International Relations (Liberal Institutionalism)": {
            "my_phase1_final_probability": 32,
            "reasoning_for_revised_probability": "Upon reviewing the debate, there is wide expert consensus (outside a few outliers) that the probability of another 3+ fatality clash is below even odds, clustered in the 25–40% range, reflecting both continued volatility and the practical effectiveness of institutional and diplomatic dampening mechanisms. Critiques of the higher probabilities (55%+, especially CrisisManagementRiskAnalysisProcedures and SoutheastAsianStudiesPostcolonialBorderDisputeAnalysis) convincingly highlight that while violence is persistent, surpassing the key fatality threshold in the short window is still unlikely given strong incentives for restraint, international pressure, and the historic tendency for violence to subside after intense mediation. The defense of SecurityStudiesSecuritizationTheory and my own forecast, as well as the emphasis on sub-threshold violence, further reinforce this. However, the critiques did highlight a slight bias toward underestimating the effect of tactical miscalculation, and several recent incidents nearly crossed the threshold. In light of that, and in the spirit of updating toward the center of the strong expert cluster (around 33–40%), I will slightly raise my probability to 35%, giving more weight to baseline volatility and persistent tactical risk, but still well below a coin-flip.",
            "revised_probability": 35
        },
        "Security Studies (Securitization Theory)": {
            "my_phase1_final_probability": 33,
            "reasoning_for_revised_probability": "After careful consideration of peer forecasts and arguments, I see no compelling new evidence or argumentation that would justify substantially raising or lowering my initial probability. The critiques repeatedly underscore the continued importance of active international mediation, the restraining role of elite signaling to outside audiences, and the persistence of sub-threshold violence. Notably, the higher forecasts (above 50%) are consistently critiqued—both by myself and others—for conflating volatility with inevitability. The observed pattern since July is repeated near-misses, not a repeated escalation to qualifying deadly incidents, confirming my original analysis. The 6-week timeframe remains too short for the odds of a 3+ fatality incident to rise much further, unless a major triggering event occurs. Therefore, the most compelling, rationally grounded stance remains at roughly 1-in-3 odds: elevated risk due to tension and breakdowns, but still more likely than not that another qualifying deadly clash does not occur before Jan 1, 2026.",
            "revised_probability": 33
        },
        "Security Studies (Conflict Escalation Model)": {
            "my_phase1_final_probability": 55,
            "reasoning_for_revised_probability": "Reviewing group deliberation and alternative perspectives, I see consistent evidence that while the situation is volatile—recent mine incidents and gunfire killed and injured personnel, and the peace process is indeed fragile—the frequency and severity of violence have distinctly plateaued beneath the qualifying threshold. Several competitors make strong cases, particularly the Security Studies (Securitization Theory), International Relations (Liberal Institutionalism), and Military Intelligence perspectives, that after an initial post-ceasefire spike, historical base rates for multi-fatality incidents generally subside—especially under the heavy gaze of ASEAN, US, and China, as seen now. On the other hand, the critics of very low probabilities rightly emphasize that border-level volatility and command/control problems remain real, and the confidence-building mechanisms are not robust, sustaining some upward risk. The key adjustment is in calibrating more strongly toward historic patterns after intense mediation: very few direct major escalations so quickly post-ceasefire, and nearly all recent violence has been deadly but sub-threshold. Weighing these, I revise my probability slightly downward to reflect the importance of those historical post-mediation risk drops and visible political will on both sides to avoid full-scale incident, but I keep the estimate above the 'elevated risk' band due to persistent operational dangers.",
            "revised_probability": 40
        },
        "Southeast Asian Studies (ASEAN Regionalism)": {
            "my_phase1_final_probability": 58,
            "reasoning_for_revised_probability": "Group deliberation predominantly demonstrates a spectrum of risk estimates lower than my original 58% (most notably in the 25%-40% band), grounded in several cogent arguments: (1) Recent sub-threshold violence is persistent, but every event remains below the 3-death threshold; (2) Historical post-ceasefire dropoff in mass-lethal events (2011, 2013) is a real, if imperfect, pattern; (3) Active and multidirectional international mediation exerts meaningful, if brittle, downward pressure on escalation, and elite signaling is bent toward restraint despite ongoing tactical volatility; (4) Several critiques (especially from the Crisis Management and Military Intelligence perspectives) effectively argue that I may be overweighting the fragility and nationalism while underweighting sub-threshold conflict as a release valve and the empirical reality that crossing the 3+ fatality line in the next six weeks is possible but not the default outcome. That said, the arguments for sustained risk (see Crisis Management Risk Analysis, Postcolonial Border Analysis) are not empty—volatility remains elevated, and a hair-trigger incident is plausible. Balancing these, I now judge my earlier slight-majority probability to have been a tad alarmist for this short time window.",
            "revised_probability": 44
        },
        "Southeast Asian Studies (Postcolonial Border Dispute Analysis)": {
            "my_phase1_final_probability": 62,
            "reasoning_for_revised_probability": "Upon reviewing the group deliberation, several forecasters made compelling points about international incentives (especially post-ceasefire) that have historically worked to contain violence below the 3+ fatality threshold, even during tense, volatile periods. Multiple experts emphasized that, despite repeated sub-threshold incidents, local actors often face heavy, immediate pressure not to escalate—reinforced by swift diplomatic intervention and economic leverage from the US, China, and ASEAN. In addition, the strong evidence of self-restraint following third-party mediation, alongside the very limited time window remaining (just 6 weeks), moderately weakens the base-rate argument for a qualifying deadly incident, especially given that the last two escalations, while alarming, maxed out at single fatalities per event. While my postcolonial perspective still highlights the genuine risk of a sudden Spark/flashpoint, I now judge the short time period and external pressures to more significantly reduce (though not eliminate) the odds of further deadly escalation. I still see the threat as quite elevated, but a recalibrated probability is justified.",
            "revised_probability": 48
        }
    },
    "revision_probability": [
        43,
        25,
        30,
        48,
        40,
        35,
        33,
        40,
        44,
        48
    ],
    "revision_mean_probability": 38.6,
    "revision_sd": 7.691264886581111,
    "revision_probability_result": 39,
    "question_details": {
        "id": 38849,
        "title": "Will there be another deadly clash between Thailand and Cambodia, resulting in three or more fatalities, before 2026?",
        "created_at": "2025-08-31T05:08:37.597858Z",
        "open_time": "2025-11-18T10:48:35Z",
        "cp_reveal_time": "2025-11-18T12:18:35Z",
        "spot_scoring_time": "2025-11-18T12:18:35Z",
        "scheduled_resolve_time": "2026-01-01T06:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-11-18T12:18:35Z",
        "actual_close_time": "2025-11-18T12:18:35Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "This question is synced with an identical question on Metaculus. The original question opened on 2025-07-30 21:28:00 and can be found [here](https://www.metaculus.com/questions/39002). This question will resolve to the same value as the synced question. The original question's background info at this time is below. \n\nAfter a brief border conflict killing at least 20 military personnel on both sides, Thailand and Cambodia agreed to a ceasefire on July 28, 2025, which they [reaffirmed](https://apnews.com/article/thailand-cambodia-ceasefire-china-brokered-1970718e765717be6f7e3f69e0c006f3) two days later. Despite the ceasefire, skirmishes continued, including an [incident](https://en.freshnewsasia.com/index.php/en/localnews/62630-2025-07-30-08-31-00.html) in which up to 20 Cambodian troops were captured and possibly two killed on July 30, 2025. According to [Deutsche Welle](https://www.dw.com/en/will-the-cambodia-thailand-ceasefire-hold/a-73448995):\n\n> Matthew Wheeler, a senior analyst for the International Crisis Group in Bangkok, said Monday's truce could take hold — as long as both sides \"recognize their interests are better served by a ceasefire than further fighting.\"\n\n> He said the deal could hit some snags over the details, though, including how exactly to monitor the ceasefire, which has yet to be worked out in full.\n\n> Malaysia, as ASEAN chair, has offered to coordinate a monitoring team. But Wheeler says neither side is keen to host monitors from other countries.\n\n> \"There was a plan to introduce Indonesian observers under ASEAN auspices after fighting in 2011, but it never happened,\" he said. Even so, he added, \"both militaries have in the past demonstrated a capacity to de-escalate after earlier rounds of fighting.\"\n\n`{\"format\":\"metac_closes_in_period\",\"info\":{\"post_id\":39002,\"question_id\":38336}}`",
        "resolution_criteria": "This question resolves as **Yes** if, after July 31, 2025 and before January 1, 2026, there is a deadly clash between the military forces of Thailand and Cambodia, resulting in three or more total fatalities between both sides, according to [credible sources](https://www.metaculus.com/faq/#definitions).",
        "fine_print": "To count, a clash must either be [kinetic](https://en.wikipedia.org/wiki/Kinetic_military_action) (using explosive weaponry) or involve physical violence such as the close-quarters combat that occurred at[ Galwan Valley](https://en.wikipedia.org/wiki/2020%E2%80%932021_China%E2%80%93India_skirmishes#Galwan_Valley_clash) between forces of India and China in June 2020. Non-kinetic or non-physical actions such as a cyberattack would not count, even ones resulting in deaths.\n\nFor the purposes of this question, “military forces” means\n\n* personnel of the Royal Thai Armed Forces\n* personnel of the Royal Cambodian Armed Forces\n* law‑enforcement personnel of either state\n* or any paramilitary or militia group allied with any of the above - for example, Thahan Phran (Thai Rangers).",
        "post_id": 39472,
        "aggregations": {
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Tensions Between Thailand and Cambodia: Thai Military Detects New Landmines on Border**\nTailandia has accused Cambodia of violating the existing peace agreement after detecting new landmines along their shared border, following the injury of two Thai soldiers in a mine explosion the previous week. The Thai government and military presented evidence of the mine placements during a press conference, with government spokesperson Siripong Angskasakulkiat stating that Thailand will pursue bilateral mechanisms with Cambodia first, but reserves the right to escalate to multilateral measures if needed. He emphasized that Thailand will respond appropriately to provocations. Foreign Ministry spokesperson Nikorndej Balankura confirmed that Prime Minister Anutin Charnvirakul will send an official letter to U.S. President Donald Trump to reaffirm Thailand's position on suspending the Joint Declaration due to Cambodia's alleged breach. The letter, stemming from prior phone conversations, focuses solely on border security and excludes commercial issues. Balankura expressed hope that international pressure, particularly from the U.S., would prompt Cambodia to comply with its commitments. Trump has acknowledged Thailand’s concerns but has not publicly commented on the crisis. The peace agreement, signed in the presence of the U.S. president, aimed to end hostilities following violent clashes in July that caused over 40 deaths and displaced approximately 300,000 people. Historical tensions between the two nations date back over a century, with the recent July clashes triggered by Thailand’s accusation that Cambodia placed mines along the border—a claim Cambodia denies categorically. The conflict involved gunfire, bombings, and rocket launches, leading to the withdrawal of ambassadors and the closure of border crossings, allowing only the return of Cambodian migrant workers. The October peace deal included joint demining operations, removal of heavy weaponry, and ASEAN-coordinated international observers. Although Cambodia announced the withdrawal of destructive weapons, regional experts warn that without addressing the underlying territorial dispute, peace remains fragile and provisional.\nOriginal language: es\nPublish date: November 17, 2025 07:10 PM\nSource:[infobae](https://www.infobae.com/america/mundo/2025/11/17/tension-entre-tailandia-y-camboya-el-ejercito-tailandes-detecto-nuevas-minas-terrestres-en-la-frontera/)\n\n**Over 800 Cambodian Families Displaced by Border Incident; Cambodia Condemns Thai Forces' Use of Force**\nOver 800 Cambodian families were displaced due to a border incident on Wednesday, November 12, 2025, in the village of Prey Chan, where one person died and three were seriously injured in a shooting by Thai forces. Authorities and donors are providing essential humanitarian aid to hundreds of residents who fled to the Wat Chan Sy Samaky Ratanaram sanctuary. Although no further armed incidents were reported on November 13 and 14, the alert level remains high in Prey Chan and Chouk Chey, according to Cambodia’s national news agency AKP. Banteay Meanchey provincial governor Oum Reatrey stated that 'the Royal Government will not allow any citizen to be in a vulnerable situation during this difficult moment.' On November 15, State Secretary Sophea Eat informed the diplomatic corps and international organizations about the incident, formally protesting the Thai military's use of force and emphasizing that it disrupted ongoing demarcation efforts agreed upon in October. She referenced a prior landmine incident on November 10 near the Preah Vihear temple—historically contaminated since the 1980s war—as a case requiring investigation but cautioned against letting it hinder peace efforts. Sophea Eat reaffirmed Cambodia’s commitment to the July 28 ceasefire agreement and the October 26 Kuala Lumpur Joint Declaration on peaceful dispute resolution. The Ministry of Foreign Affairs and International Cooperation condemned the shooting as a 'grave violation of Cambodia’s sovereignty and territorial integrity,' a breach of international humanitarian law, and a violation of the UN Charter, ASEAN Charter, and the Southeast Asia Friendship and Cooperation Treaty. The ministry also highlighted Cambodia’s 'maximum moderation' in refraining from retaliation, including after the tragic shooting of civilians, to preserve the fragile truce.\nOriginal language: es\nPublish date: November 17, 2025 05:37 AM\nSource:[prensa-latina.cu](https://www.prensa-latina.cu/2025/11/17/mas-de-800-familias-camboyanas-desplazadas-por-incidente-fronterizo/)\n\n**Thai King’s Historic Visit to China Amid Border Tensions with Cambodia**\nOn November 13, 2025, King Maha Vajiralongkorn of Thailand arrived in Beijing, marking the first official state visit by a Thai monarch to China in decades. The visit was met with high-level Chinese hospitality, including a formal welcome ceremony and structured diplomatic talks, signaling the importance of Sino-Thai relations and being described by observers as a 'milestone' in regional diplomacy. However, on November 12, 2025, just one day before the king's arrival, intense gunfire erupted along the Thai-Cambodian border. Cambodia's Ministry of Defense accused Thai forces of opening fire on civilians, injuring five, and violating a ceasefire agreement. Thailand denied the claim, asserting that Cambodian troops initiated a 10-minute artillery exchange targeting a Thai border base, and stated it had maintained restraint despite being prepared to respond. This clash ended a fragile ceasefire that had lasted less than a month. Cambodian Prime Minister Hun Manet swiftly ordered border troops to full alert and deployed reinforcements, reaffirming his hardline stance established during a similar conflict in July 2025. The underlying cause of the conflict is the longstanding, unresolved border dispute spanning over 800 kilometers, with contested territories, resource competition, and historical grievances. The situation intensified after a Thai soldier was injured on November 10 from a mine, which Thailand blamed on Cambodia’s new mine-laying, while Cambodia claimed it was a legacy mine from past conflicts. This incident led Thailand to suspend implementation of the 'Peace Joint Statement' and halt the release of Cambodian prisoners of war, pushing tensions to a breaking point. While some speculated the conflict was orchestrated to disrupt the Thai king’s visit, this theory lacks credible evidence. The Sino-Thai visit, planned since May 2025, aims to strengthen 'family-like' ties and advance cooperation in trade, security, and military domains—evidenced by a May meeting between Chinese Defense Minister Dong Jun and Thai Armed Forces Commander Songwit, which confirmed joint military exercises and personnel training. The conflict has deep historical roots and is unrelated to Sino-Thai relations. Thailand’s decision to proceed with the visit despite the crisis underscores its commitment to dialogue and signals to Cambodia that peaceful resolution is possible. China, as a neutral mediator, has previously facilitated de-escalation and continues to play a constructive role. The high-level reception of the Thai king conveys a broader diplomatic message: 'dialogue over confrontation.' This atmosphere pressures both Thailand and Cambodia to de-escalate. Prolonged conflict would harm both nations, disrupting cross-border civilian life and economic development. Thailand seeks a stable neighborhood to support its China-focused cooperation, while Cambodia prioritizes its relationship with Beijing. The Chinese diplomatic gesture is thus both a sign of goodwill and a strategic signal. Ultimately, the coexistence of the king’s visit and the border conflict reflects the complexity of international relations. The most rational path forward is for both sides to return to negotiations, leveraging China’s mediation, to resolve disputes peacefully. The gunfire may be fleeting, but the enduring friendship between Thailand and China remains intact, and regional stability depends on mutual restraint and dialogue.\nOriginal language: zh\nPublish date: November 17, 2025 03:15 AM\nSource:[搜狐](https://mil.sohu.com/a/954713674_121997470?scm=10001.279_13-101000-0_922.0-0.0.a2_5X162X1532)\n\n**Great Power Rivalry Sparks Political, Economic, and Social Tensions in Small States: The Case of Thailand and Cambodia**\nOver the past week, Thailand and Cambodia's peace declaration was ruptured by a border mine explosion, prompting urgent mediation by ASEAN and the United States. King Vajiralongkorn of Thailand made a rare visit to Beijing, highlighting the difficult strategic choices facing small nations amid great power competition. The Taiwan issue reignited tensions between China and Japan, underscoring the high sensitivity of security in the Asia-Pacific region. Analysts普遍认为，超级大国之间缺乏互信，中美博弈的结构性矛盾无法因暂时的止损措施而改变, and Southeast Asian nations remain inevitably affected. Recent border clashes between Thailand and Cambodia resulted in injuries to two Thai soldiers, prompting Thailand to suspend implementation of a peace agreement. Cambodia denied the allegations and continued calling for the release of 18 Cambodian prisoners. The conflict erupted after the two countries signed the Kuala Lumpur Joint Declaration under the witness of U.S. President Donald Trump and ASEAN Chair Anwar Ibrahim, committing to resolve border disputes through ASEAN mechanisms. Following the renewed violence, ASEAN Chair Anwar Ibrahim initiated mediation, urging adherence to the agreement. He reported positive feedback from both leaders, who reaffirmed their commitment to peaceful resolution. ASEAN welcomed the removal of heavy weapons and destruction of weapons from border areas and coordinated humanitarian demining efforts. U.S. President Trump also engaged in phone diplomacy, stating he participated in efforts to implement the peace agreement, and claimed the two nations 'would be fine.' Reports indicate Trump reportedly requested that Beijing representatives not attend the signing ceremony, which Thailand reportedly respected. The border conflict, rooted in ambiguous colonial-era boundaries drawn by France, centers on the Preah Vihear Temple, which the International Court of Justice ruled in 1962 and reaffirmed in 2013 belonged to Cambodia—though Thailand continues to contest the decision. The ongoing tensions have led to closed trade ports, economic losses, and civilian displacement. ASEAN's mediation has yielded limited progress. Rising nationalism in both countries exacerbates internal social tensions, with Cambodia favoring international court resolution and Thailand preferring bilateral talks. Thai Foreign Minister Sihasak Phuangketkeow presented a briefing to 59 foreign envoys and four international organizations, asserting that mines were planted after the ceasefire agreement and accusing Cambodia of violating the Ottawa Convention. Thailand presented four demands: 1) acknowledgment of new mine placement; 2) responsibility for damages; 3) bilateral rules negotiation; and 4) access to 13 border zones for demining. Thai media reported that the U.S. suspended tariff talks until the peace agreement is upheld. Prime Minister Anutin reiterated Thailand’s stance on social media, stating that the agreement would not be resumed without compliance. The Thai Foreign Ministry later revealed that Trump informed Anutin that the U.S. would not intervene bilaterally, and that trade negotiations would continue independently of the border dispute. The U.S. continues to impose a 19% baseline tariff on Thai goods. Cambodian Prime Minister Hun Manet thanked Anwar Ibrahim and Trump for their role in promoting peace and reaffirmed Cambodia’s commitment to the spirit of the Kuala Lumpur Declaration. Thai media expressed disappointment over U.S. pressure, with journalist Suthichai Yoon stating that today’s trade is inherently political, with 'security' casting a shadow over every transaction—a hallmark of Trump-era Realpolitik. In contrast to past idealistic strategies emphasizing democracy and human rights, realism now prevails. Coinciding with the 50th anniversary of Thailand-China diplomatic ties, King Vajiralongkorn visited China from November 13–17, 2025, marking the first visit by a reigning Thai monarch to China. The Thai government stated the visit reflects deep friendship and mutual understanding. President Xi Jinping affirmed China’s willingness to strengthen strategic alignment with Thailand, advance major projects like the China-Thailand Railway, expand imports of high-quality Thai agricultural products, and deepen cooperation in emerging sectors such as AI, digital economy, and aerospace. China has been Thailand’s largest trading partner for 12 consecutive years. In the first half of 2025, bilateral trade reached $76.1 billion, up 17% year-on-year. Thai Prime Minister Anutin revealed on Facebook that China will purchase 500,000 tons of Thai rice under a government-to-government agreement, a key outcome of a bilateral meeting at the APEC summit in Busan. Meanwhile, Thailand maintains over 200 years of traditional ties with the U.S., and its Cold War-era status as a key U.S. strategic ally in Asia remains significant. The King’s visit is widely seen as a strategic diplomatic move. Southeast Asian media have closely monitored the sudden escalation of Sino-Japanese tensions over the Taiwan issue. After Japanese Prime Minister Sanae Takaichi stated 'if Taiwan is attacked, Japan will be affected,' China’s Consul General in Osaka, Xue Jian, responded with a 'decapitation theory' and warned Chinese citizens against traveling to Japan. China’s military media reported that the PLA Southern Theater Command conducted bomber patrols over the South China Sea to deter the Philippines’ joint patrols with Australia, New Zealand, and the U.S., accusing Manila of destabilizing regional peace. Beijing urged Manila to cease provocations. The U.S., whose core interests are at stake in Taiwan, has seen Defense Secretary Peter Brian Hegseth reiterate that Washington does not seek conflict but will continue to defend its interests in the region. Hegseth advanced military cooperation with India, Malaysia, and the Philippines during the Kuala Lumpur summit, signaling clear intent toward China. Singapore’s Prime Minister and Finance Minister Lawrence Wong recently warned that rising protectionism, populism, and rapid technological change are exacerbating inequality and internal pressures, fueling political polarization and social fractures—posing a major challenge for nations to prevent. Philippine President Ferdinand Marcos Jr. faces growing domestic pressure. The Philippine religious group INC held large-scale anti-corruption protests in Manila from November 16–18, supported by civil groups nationwide. Amid calls for anti-graft measures and democratic reform, rumors of a military coup by retired generals circulated. Economic growth remains weak, and officials now expect to revise downward the 2025 growth target of 5.5%–6.5%.\nOriginal language: zh\nPublish date: November 16, 2025 10:31 AM\nSource:[RFI](https://www.rfi.fr/cn/%E4%B8%93%E6%A0%8F%E6%A3%80%E7%B4%A2/%E6%9B%BC%E8%B0%B7%E4%B8%93%E6%A0%8F/20251116-%E5%A4%A7%E5%9B%BD%E5%8D%9A%E5%BC%88-%E6%BF%80%E5%8F%91%E5%B0%8F%E5%9B%BD%E6%94%BF%E7%BB%8F%E7%A4%BE%E4%BC%9A%E7%9F%9B%E7%9B%BE)\n\n**Trump calls Thailand, Cambodia after new clashes | Borneo Post Online**\nUS President Donald Trump stated on November 15, 2025, that he called the leaders of Thailand and Cambodia to reinforce the peace deal he co-signed on October 26, 2025, during a visit to Asia. The truce, brokered in Kuala Lumpur, aimed to end five days of intense fighting in the summer of 2025 that resulted in 43 deaths and displaced approximately 300,000 people. Fresh clashes erupted on November 13, 2025, in Banteay Meanchey province along the Cambodia-Thailand border, with Phnom Penh reporting the death of a civilian. Thailand suspended the agreement on November 10, 2025, following an alleged landmine blast. Trump claimed on Air Force One that he had 'stopped a war just today through the use of tariffs, the threat of tariffs,' and expressed confidence that the situation would improve, stating, 'They’re doing great. I think they’re gonna be fine.' The White House confirmed Trump also spoke with Malaysia, which had acted as a mediator. The underlying dispute stems from a century-old border disagreement from French colonial rule, with both nations contesting several boundary temples. The ASEAN Observer Team (AOT) visited the site of the civilian death on November 13, 2025, as documented in a photo released by Agence Kampuchea Press (AKP).\nOriginal language: en\nPublish date: November 15, 2025 07:03 AM\nSource:[theborneopost.com](https://www.theborneopost.com/2025/11/15/trump-calls-thailand-cambodia-after-new-clashes/)\n\n**Tensions Between Thailand and Cambodia: Thai Military Detects New Landmines on Border**\nTailandia has accused Cambodia of violating the existing peace agreement after detecting new landmines along their shared border, following the injury of two Thai soldiers in a mine explosion the previous week. The Thai government and military presented evidence of the mine placements during a press conference, with government spokesperson Siripong Angskasakulkiat stating that Thailand will pursue bilateral mechanisms with Cambodia first, but reserves the right to escalate to multilateral measures if needed. He emphasized that Thailand will respond appropriately to provocations. Foreign Ministry spokesperson Nikorndej Balankura confirmed that Prime Minister Anutin Charnvirakul will send an official letter to U.S. President Donald Trump to reaffirm Thailand's position on suspending the Joint Declaration due to Cambodia's alleged breach. The letter, stemming from prior phone conversations, focuses solely on border security and excludes commercial issues. Balankura expressed hope that international pressure, particularly from the U.S., would prompt Cambodia to comply with its commitments. Trump has acknowledged Thailand’s concerns but has not publicly commented on the crisis. The peace agreement, signed in the presence of the U.S. president, aimed to end hostilities following violent clashes in July that caused over 40 deaths and displaced approximately 300,000 people. Historical tensions between the two nations date back over a century, with the recent July clashes triggered by Thailand’s accusation that Cambodia placed mines along the border—a claim Cambodia denies categorically. The conflict involved gunfire, bombings, and rocket launches, leading to the withdrawal of ambassadors and the closure of border crossings, allowing only the return of Cambodian migrant workers. The October peace deal included joint demining operations, removal of heavy weaponry, and ASEAN-coordinated international observers. Although Cambodia announced the withdrawal of destructive weapons, regional experts warn that without addressing the underlying territorial dispute, peace remains fragile and provisional.\nOriginal language: es\nPublish date: November 17, 2025 07:10 PM\nSource:[infobae](https://www.infobae.com/america/mundo/2025/11/17/tension-entre-tailandia-y-camboya-el-ejercito-tailandes-detecto-nuevas-minas-terrestres-en-la-frontera/)\n\n**Thailand Suspends 'Peace Declaration' with Cambodia After Border Mine Incident**\nThailand has suspended the implementation of the declaration on conflict resolution with Cambodia, according to the Ministry of Foreign Affairs of Thailand. Prime Minister Anutin Charnvirakum sent official letters to U.S. President Donald Trump and Malaysian Prime Minister Anwar Ibrahim, stating that Thailand is pausing the declaration aimed at de-escalating tensions. The move follows a mine explosion in a border region that killed four Thai soldiers, which Thailand attributed to Cambodia. Authorities claimed the mines were placed on areas recently cleared of landmines, accusing Cambodia of a serious violation of the agreement. As a result, Thailand halted the withdrawal of heavy military equipment from the border and postponed the release of Cambodian prisoners of war. The border conflict intensified in May 2025, leading to full-scale fighting, but a ceasefire was agreed upon in July 2025. In October 2025, the declaration on relations was signed in Kuala Lumpur in the presence of U.S. and Malaysian leaders. The Ministry emphasized that Thailand reserves the right to defend its sovereignty, territorial integrity, and national security, with future actions dependent on Cambodia’s conduct.\nOriginal language: ru\nPublish date: November 17, 2025 01:04 PM\nSource:[���.Ru // �������, �����, �������� ���������� ���, ������-������� ���, ��������� �������](https://www.ntv.ru/novosti/2949527/)\n\n**Trump Seeks Credit for Cambodia-Thailand Ceasefire, U.S. Officials Downplay China's Role**\nIn July 2024, a border conflict erupted between Cambodia and Thailand near the disputed Ta Mo Anong Temple, resulting in civilian casualties and mass displacement. The conflict was resolved with a ceasefire agreement signed on August 7, 2024. China played a visible and active role in mediating the conflict, with both Cambodia and Thailand publicly thanking Beijing for its efforts. Chinese Foreign Minister Wang Yi engaged in multiple diplomatic initiatives, including hosting a trilateral informal meeting in Shanghai on July 30, 2024, and organizing a tea talk in Anning, Yunnan, on August 14, 2024, with Cambodian and Thai foreign ministers. Both countries reiterated their commitment to the ceasefire and praised China's constructive role. Despite this, a senior U.S. official claimed on October 24, 2024, that China had 'not played a significant or substantive role' in the peace talks. The U.S. reportedly pressured the organizers of the 47th ASEAN Summit in Malaysia to exclude Chinese officials from the official ceasefire signing ceremony, aiming to center attention on President Donald Trump. Trump sought to leverage the event to promote his image as a 'chief peacemaker' and bolster his bid for the Nobel Peace Prize, which he had openly pursued since returning to office in January 2024. However, the Nobel Peace Prize was awarded on October 10, 2024, to María Corina Machado of Venezuela, and Trump did not receive it.\nOriginal language: zh\nPublish date: November 17, 2025 10:15 AM\nSource:[guancha.cn](https://www.guancha.cn/internation/2025_10_25_794521.shtml?s=sywglbt)\n\n**Over 800 Cambodian Families Displaced by Border Incident**\nOver 800 Cambodian families have been displaced due to a border incident involving a shooting in the village of Prey Chan on Wednesday, November 12, 2025, which resulted in one death and three serious injuries. Authorities and donors are providing essential humanitarian aid to hundreds of residents who fled to the Wat Chan Sy Samaky Ratanaram sanctuary. Although no further armed incidents were reported on November 13 and 14, the alert level remains high in Prey Chan and Chouk Chey, according to Cambodia’s national news agency AKP. Banteay Meanchey provincial governor Oum Reatrey stated that 'the Royal Government will not allow any citizen to be in a vulnerable situation during this difficult moment.' On November 15, State Secretary Sophea Eat informed diplomatic missions and international organization representatives about the border events. She announced Cambodia’s formal protest against the Thai forces’ shooting on November 12, emphasizing that the illegitimate use of force also disrupted ongoing demarcation efforts agreed upon in October. Sophea referenced a prior landmine incident on November 10 near the Preah Vihear temple—historically contaminated since the 1980s war—calling for investigation but cautioning that it should not hinder peace efforts. She reaffirmed Cambodia’s commitment to the July 28 ceasefire agreement and the Kuala Lumpur Joint Declaration on peaceful dispute resolution, signed on October 26 by the prime ministers of Cambodia and Thailand. The Ministry of Foreign Affairs and International Cooperation declared the November 12 shooting a serious violation of Cambodia’s sovereignty and territorial integrity, a breach of international humanitarian law, and a violation of the UN Charter, ASEAN Charter, and the Southeast Asia Friendship and Cooperation Treaty. The statement highlighted Cambodia’s restraint in not retaliating against repeated provocations, including the civilian shooting, to preserve the fragile truce.\nOriginal language: es\nPublish date: November 17, 2025 06:05 AM\nSource:[Prensa latina](https://www.prensa-latina.cu/2025/11/17/mas-de-800-familias-camboyanas-desplazadas-por-incidente-fronterizo/)\n\n**Thai King’s Historic Visit to China Amid Border Tensions with Cambodia**\nOn November 13, 2025, King Maha Vajiralongkorn of Thailand arrived in Beijing, marking the first official state visit by a Thai monarch to China in decades. The visit was met with high-level Chinese hospitality, including a formal welcome ceremony and structured diplomatic talks, signaling the importance of Sino-Thai relations and being described by observers as a 'milestone' in regional diplomacy. However, on November 12, 2025, just one day before the king's arrival, intense gunfire erupted along the Thai-Cambodian border. Cambodia's Ministry of Defense accused Thai forces of opening fire on civilians, injuring five, and violating a ceasefire agreement. Thailand denied the claim, asserting that Cambodian troops initiated a 10-minute artillery exchange targeting a Thai border base, and stated it had maintained restraint despite being prepared to respond. This clash ended a fragile ceasefire that had lasted less than a month. Cambodian Prime Minister Hun Manet swiftly ordered border troops to full alert and deployed reinforcements, reaffirming his hardline stance established during a similar conflict in July 2025. The underlying cause of the conflict is the longstanding, unresolved border dispute spanning over 800 kilometers, with contested territories, resource competition, and historical grievances. The situation intensified after a Thai soldier was injured on November 10 from a mine, which Thailand blamed on Cambodia’s new mine-laying, while Cambodia claimed it was a legacy mine from past conflicts. This incident led Thailand to suspend implementation of the 'Peace Joint Statement' and halt the release of Cambodian prisoners of war, pushing tensions to a breaking point. While some speculated the conflict was orchestrated to disrupt the Thai king’s visit, this theory lacks credible evidence. The Sino-Thai visit, planned since May 2025, aims to strengthen 'family-like' ties and advance cooperation in trade, security, and military domains—evidenced by a May meeting between Chinese Defense Minister Dong Jun and Thai Armed Forces Commander Songwit, which confirmed joint military exercises and personnel training. The conflict has deep historical roots and is unrelated to Sino-Thai relations. Thailand’s decision to proceed with the visit despite the crisis underscores its commitment to dialogue and signals to Cambodia that peaceful resolution is possible. China, as a neutral mediator, has previously facilitated de-escalation and continues to play a constructive role. The high-level reception of the Thai king conveys a broader diplomatic message: 'dialogue over confrontation.' This atmosphere pressures both Thailand and Cambodia to de-escalate. Prolonged conflict would harm both nations, disrupting cross-border civilian life and economic development. Thailand seeks a stable neighborhood to support its China-focused cooperation, while Cambodia prioritizes its relationship with Beijing. The Chinese diplomatic gesture is thus both a sign of goodwill and a strategic signal. Ultimately, the coexistence of the king’s visit and the border conflict reflects the complexity of international relations. The most rational path forward is for both sides to return to negotiations, leveraging China’s mediation, to resolve disputes peacefully. The gunfire may be fleeting, but the enduring friendship between Thailand and China remains intact, and regional stability depends on mutual restraint and dialogue.\nOriginal language: zh\nPublish date: November 17, 2025 03:15 AM\nSource:[搜狐](https://mil.sohu.com/a/954713674_121997470?scm=10001.279_13-101000-0_922.0-0.0.a2_5X162X1532)\n\n**Incoming Asean chair Philippines faces a Thailand-Cambodia 'challenge'**\nThailand announced it was suspending the peace agreement with Cambodia, signed at the 47th Association of Southeast Asian Nations (ASEAN) summit in Kuala Lumpur on October 26, following reports that Cambodia laid new mines along their shared border. This led to injuries of several Thai soldiers, including one who lost a foot. Cambodia denied the allegations, with Prime Minister Hun Manet accusing Thai soldiers of killing a civilian. Despite the escalating tensions, a Thai government spokesman confirmed on Saturday that Bangkok would proceed with talks to finalize a reciprocal trade deal with the United States, stating these negotiations would remain separate from the ongoing border dispute. The incoming ASEAN chair, the Philippines, now faces the challenge of managing this bilateral conflict within the regional framework.\nOriginal language: en\nPublish date: November 17, 2025 02:30 AM\nSource:[South China Morning Post](https://www.scmp.com/week-asia/politics/article/3332959/philippines-takes-asean-helm-thailand-cambodia-dispute-be-significant-challenge)\n\n**Great Power Rivalry Sparks Political, Economic, and Social Tensions in Small States: The Case of Thailand and Cambodia**\nOver the past week, Thailand and Cambodia's peace declaration was ruptured by a border mine explosion, prompting urgent mediation by ASEAN and the United States. King Vajiralongkorn of Thailand made a rare visit to Beijing, highlighting the difficult strategic choices facing small nations amid great power competition. The Taiwan issue reignited tensions between China and Japan, underscoring the high sensitivity of security in the Asia-Pacific region. Analysts普遍认为，超级大国之间缺乏互信，中美博弈的结构性矛盾无法因暂时的止损措施而改变, and Southeast Asian nations remain inevitably affected. Recent border clashes between Thailand and Cambodia resulted in injuries to two Thai soldiers, prompting Thailand to suspend implementation of a peace agreement. Cambodia denied the allegations and continued calling for the release of 18 Cambodian prisoners. The conflict erupted after the two countries signed the Kuala Lumpur Joint Declaration under the witness of U.S. President Donald Trump and ASEAN Chair Anwar Ibrahim, committing to resolve border disputes through ASEAN mechanisms. Following the renewed violence, ASEAN Chair Anwar Ibrahim initiated mediation, urging adherence to the agreement. He reported positive feedback from both leaders, who reaffirmed their commitment to peaceful resolution. ASEAN welcomed the removal of heavy weapons and destruction of weapons from border areas and coordinated humanitarian demining efforts. U.S. President Trump also engaged in phone diplomacy, stating he participated in efforts to implement the peace agreement, and claimed the two nations 'would be fine.' Reports indicate Trump reportedly requested that Beijing representatives not attend the signing ceremony, which Thailand reportedly respected. The border conflict, rooted in ambiguous colonial-era boundaries drawn by France, centers on the Preah Vihear Temple, which the International Court of Justice ruled in 1962 and reaffirmed in 2013 belonged to Cambodia—though Thailand continues to contest the decision. The ongoing tensions have led to closed trade ports, economic losses, and civilian displacement. ASEAN's mediation has yielded limited progress. Rising nationalism in both countries exacerbates internal social tensions, with Cambodia favoring international court resolution and Thailand preferring bilateral talks. Thai Foreign Minister Sihasak Phuangketkeow presented a briefing to 59 foreign envoys and four international organizations, asserting that mines were planted after the ceasefire agreement and accusing Cambodia of violating the Ottawa Convention. Thailand presented four demands: 1) acknowledgment of new mine placement; 2) responsibility for damages; 3) bilateral rules negotiation; and 4) access to 13 border zones for demining. Thai media reported that the U.S. suspended tariff talks until the peace agreement is upheld. Prime Minister Anutin reiterated Thailand’s stance on social media, stating that the agreement would not be resumed without compliance. The Thai Foreign Ministry later revealed that Trump informed Anutin that the U.S. would not intervene bilaterally, and that trade negotiations would continue independently of the border dispute. The U.S. continues to impose a 19% baseline tariff on Thai goods. Cambodian Prime Minister Hun Manet thanked Anwar Ibrahim and Trump for their role in promoting peace and reaffirmed Cambodia’s commitment to the spirit of the Kuala Lumpur Declaration. Thai media expressed disappointment over U.S. pressure, with journalist Suthichai Yoon stating that today’s trade is inherently political, with 'security' casting a shadow over every transaction—a hallmark of Trump-era Realpolitik. In contrast to past idealistic strategies emphasizing democracy and human rights, realism now prevails. Coinciding with the 50th anniversary of Thailand-China diplomatic ties, King Vajiralongkorn visited China from November 13–17, 2025, marking the first visit by a reigning Thai monarch to China. The Thai government stated the visit reflects deep friendship and mutual understanding. President Xi Jinping affirmed China’s willingness to strengthen strategic alignment with Thailand, advance major projects like the China-Thailand Railway, expand imports of high-quality Thai agricultural products, and deepen cooperation in emerging sectors such as AI, digital economy, and aerospace. China has been Thailand’s largest trading partner for 12 consecutive years. In the first half of 2025, bilateral trade reached $76.1 billion, up 17% year-on-year. Thai Prime Minister Anutin revealed on Facebook that China will purchase 500,000 tons of Thai rice under a government-to-government agreement, a key outcome of a bilateral meeting at the APEC summit in Busan. Meanwhile, Thailand maintains over 200 years of traditional ties with the U.S., and its Cold War-era status as a key U.S. strategic ally in Asia remains significant. The King’s visit is widely seen as a strategic diplomatic move. Southeast Asian media have closely monitored the sudden escalation of Sino-Japanese tensions over the Taiwan issue. After Japanese Prime Minister Sanae Takaichi stated 'if Taiwan is attacked, Japan will be affected,' China’s Consul General in Osaka, Xue Jian, responded with a 'decapitation theory' and warned Chinese citizens against traveling to Japan. China’s military media reported that the PLA Southern Theater Command conducted bomber patrols over the South China Sea to deter the Philippines’ joint patrols with Australia, New Zealand, and the U.S., accusing Manila of destabilizing regional peace. Beijing urged Manila to cease provocations. The U.S., whose core interests are at stake in Taiwan, has seen Defense Secretary Peter Brian Hegseth reiterate that Washington does not seek conflict but will continue to defend its interests in the region. Hegseth advanced military cooperation with India, Malaysia, and the Philippines during the Kuala Lumpur summit, signaling clear intent toward China. Singapore’s Prime Minister and Finance Minister Lawrence Wong recently warned that rising protectionism, populism, and rapid technological change are exacerbating inequality and internal pressures, fueling political polarization and social fractures—posing a major challenge for nations to prevent. Philippine President Ferdinand Marcos Jr. faces growing domestic pressure. The Philippine religious group INC held large-scale anti-corruption protests in Manila from November 16–18, supported by civil groups nationwide. Amid calls for anti-graft measures and democratic reform, rumors of a military coup by retired generals circulated. Economic growth remains weak, and officials now expect to revise downward the 2025 growth target of 5.5%–6.5%.\nOriginal language: zh\nPublish date: November 16, 2025 10:31 AM\nSource:[RFI](https://www.rfi.fr/cn/%E4%B8%93%E6%A0%8F%E6%A3%80%E7%B4%A2/%E6%9B%BC%E8%B0%B7%E4%B8%93%E6%A0%8F/20251116-%E5%A4%A7%E5%9B%BD%E5%8D%9A%E5%BC%88-%E6%BF%80%E5%8F%91%E5%B0%8F%E5%9B%BD%E6%94%BF%E7%BB%8F%E7%A4%BE%E4%BC%9A%E7%9F%9B%E7%9B%BE)\n\n**Hun Manet Speaks to Donald Trump Via Phone After Thai Troops Open Fire on Cambodians | CamboJA News**\nOn November 15, 2025, Cambodian Prime Minister Hun Manet spoke by phone with U.S. President Donald Trump following an incident in which Thai troops opened fire on Cambodian civilians. Hun Manet conveyed that Trump emphasized his commitment to 'see lasting peace' between Cambodia and Thailand. Hun Manet also spoke with Malaysian Prime Minister Anwar Ibrahim, with whom he discussed efforts to maintain a peaceful resolution, reaffirming Cambodia’s commitment to using truce-established channels to address border disputes. Malaysia, as the current chair of ASEAN, has played a central role in ceasefire efforts alongside Trump. Hun Manet stated that he will continue to closely monitor the situation to ensure no further armed clashes occur along the Cambodia-Thailand border.\nOriginal language: en\nPublish date: November 15, 2025 12:32 PM\nSource:[cambojanews.com](https://cambojanews.com/hun-manet-speaks-to-donald-trump-via-phone-after-thai-troops-open-fire-on-cambodians/)\n\n**Trump calls Thailand, Cambodia after new clashes | Borneo Post Online**\nUS President Donald Trump stated on November 15, 2025, that he called the leaders of Thailand and Cambodia to reinforce the peace deal he co-signed on October 26, 2025, during a visit to Asia. The truce, brokered in Kuala Lumpur, aimed to end five days of intense fighting in the summer of 2025 that resulted in 43 deaths and displaced approximately 300,000 people. Fresh clashes erupted on November 13, 2025, in Banteay Meanchey province along the Cambodia-Thailand border, with Phnom Penh reporting the death of a civilian. Thailand suspended the agreement on November 10, 2025, following an alleged landmine blast. Trump claimed on Air Force One that he had 'stopped a war just today through the use of tariffs, the threat of tariffs,' and expressed confidence that the situation would improve, stating, 'They’re doing great. I think they’re gonna be fine.' The White House confirmed Trump also spoke with Malaysia, which had acted as a mediator. The underlying dispute stems from a century-old border disagreement from French colonial rule, with both nations contesting several boundary temples. The ASEAN Observer Team (AOT) visited the site of the civilian death on November 13, 2025, as documented in a photo released by Agence Kampuchea Press (AKP).\nOriginal language: en\nPublish date: November 15, 2025 07:03 AM\nSource:[theborneopost.com](https://www.theborneopost.com/2025/11/15/trump-calls-thailand-cambodia-after-new-clashes/)\n\n**Cambodia says Thai troops kill one in fresh border clashes**\nOn November 12, 2025, Cambodia reported that one civilian was killed and three others wounded in renewed border clashes with Thailand, following Bangkok’s pause in implementing a US-backed peace deal. The conflict, which erupted after a landmine blast wounded four Thai soldiers on Monday, saw gunfire exchanged between Thailand’s Sa Kaeo province and Cambodia’s Banteay Meanchey province, lasting about 10 minutes with no Thai casualties. Cambodian Prime Minister Hun Manet condemned the violence as a violation of humanitarian principles and recent peace agreements, sharing images and videos allegedly showing wounded civilians, though AFP could not verify their authenticity. Thai military spokesman Winthai Suvaree claimed Cambodian forces initiated fire into Thai territory, prompting Thai troops to respond with warning shots. Cambodian villagers, including Hul Malis and her husband Thong Kimleang, reported being shot at without provocation, with Malis stating, 'I am so frightened, I am running away now.' The border dispute stems from a century-old disagreement over colonial-era boundaries, with both nations claiming several temples. A truce was established on July 29, 2025, after intervention by former U.S. President Donald Trump, Chinese diplomats, and Malaysian Prime Minister Anwar Ibrahim, who chairs ASEAN. The agreement included withdrawal of heavy weapons and access for ceasefire monitors. However, Thailand has delayed releasing 18 captured Cambodian soldiers—a key condition—undermining the deal’s credibility. Experts note the agreement did not resolve the core territorial dispute.\nOriginal language: en\nPublish date: November 12, 2025 12:24 PM\nSource:[AFP](http://doc.afp.com/83RG79E)\n\n**Thailand says ceasefire with Cambodia brokered by Trump on hold after landmine kills troops**\nThailand has indefinitely paused implementation of a U.S.-brokered ceasefire with Cambodia following a landmine explosion on Monday that injured four Thai soldiers along the border in Sisaket province. The Thai army accused Cambodia of laying new mines in violation of the truce agreement signed last month, though Cambodia denied responsibility, attributing the blast to 'remnants of past conflicts' and urging Thai troops to avoid old minefield areas. Thai Prime Minister Anutin Charnvirakul visited the injured soldiers and the Thai Foreign Ministry spokesperson Nikorndej Balankura stated the incident revealed 'Cambodia's utter lack of sincerity,' demanding an apology, a thorough investigation, and preventive measures. As a result, Thailand will indefinitely postpone the return of 18 Cambodian soldiers held since the July conflict. The ceasefire, initially mediated by Malaysia and finalized during the ASEAN summit in October under pressure from President Trump—who threatened to withhold trade privileges—has been criticized by Matthew Wheeler, Southeast Asia senior analyst at the International Crisis Group, as a deal designed to placate Trump rather than resolve the underlying conflict. Wheeler noted the agreement was predictable to fail due to its transactional nature and Thailand’s strong nationalist sentiment, which hinders conciliatory diplomacy. Despite some progress in removing heavy weapons and land mines, the incident has reignited tensions. Cambodia reaffirmed its commitment to peace and civilian safety.\nOriginal language: en\nPublish date: November 11, 2025 05:22 PM\nSource:[CBS News](https://www.cbsnews.com/news/thailand-cambodia-ceasfire-trump-brokered-paused-after-landmine-kills-troops/)\n\n**Thailand says 'hostilities' remain despite Cambodia peace pact - Asia & Pacific - The Jakarta Post**\nThailand's Royal Thai Army (RTA) stated on November 11, 2025, that 'hostilities still remain' with Cambodia, suspending implementation of a US-backed peace deal brokered by former US President Donald Trump in October 2024. The suspension followed a landmine blast in Sisaket province that wounded four Thai soldiers, which Thailand accused Cambodia of violating the Ottawa Convention banning anti-personnel mines. The peace pact, signed in Kuala Lumpur on October 26 under the chairmanship of Malaysian Prime Minister Anwar Ibrahim, aimed to de-escalate a conflict that peaked in July 2024, resulting in at least 43 deaths and the displacement of approximately 300,000 civilians. Under the agreement, both sides were to withdraw heavy weapons from the border, allow ceasefire monitors access, and Thailand was to return 18 captured Cambodian troops. Cambodia claimed the mine was a relic of past conflicts, expressed regret, and stated the situation remains calm, reaffirming its commitment to the deal. However, Thailand's Prime Minister Anutin Charnvirakul confirmed the delay in releasing the captured troops, a key condition of the pact. Foreign Minister Sihasak Phuangketkeow emphasized that Cambodia must take responsibility by showing regret, participating in the investigation, and preventing future incidents. The Thai-Cambodian truce has held since July 29, but analysts note a comprehensive resolution to the underlying territorial dispute over century-old border temples remains unachieved.\nOriginal language: en\nPublish date: November 11, 2025 07:36 AM\nSource:[The Jakarta Post](https://www.thejakartapost.com/world/2025/11/11/thailand-says-hostilities-remain-despite-cambodia-peace-pact.html)\n\n**Thailand and Cambodia Agree to Ceasefire, but Doubts Remain**\nThailand and Cambodia agreed to an unconditional ceasefire after five days of deadly clashes, but doubts remain about whether the truce will hold. The agreement, reached on July 28, 2025, was met with cautious optimism. The border dispute has left at least 35 soldiers and civilians dead and forced the evacuation of 200,000 people in both countries. Zachary Abuza, a professor at the National War College in Washington, believes that both sides have achieved most of their objectives and that the truce could hold, despite possible sporadic gunfire. However, the Thai military has accused the Cambodian forces of violating the ceasefire in several areas, which the Cambodian Ministry of Defense has denied. Matthew Wheeler, a senior analyst at the International Crisis Group in Bangkok, highlights the lack of clarity on how the ceasefire will be supervised, which could hinder the agreement. Paul Chambers, an analyst at the Yusof Ishak Institute in Singapore, notes that without third-party supervision, it is difficult for any ceasefire agreement to be effectively implemented. The US has threatened to delay trade negotiations with both countries over tariffs unless they agree to end the clashes. According to Wheeler, the US threats have influenced Thailand's stance, which had previously rejected Malaysia's mediation offer.\nOriginal language: es\nPublish date: July 29, 2025 03:08 PM\nSource:[Deutsche Welle](https://www.dw.com/es/se-mantendr%C3%A1-el-alto-el-fuego-entre-camboya-y-tailandia/a-73455958)\n\n**Thailand and Cambodia Engage in Sixth Day of Border Clashes**\nTensions between Thailand and Cambodia continue to escalate, with the two countries engaging in border clashes for the sixth consecutive day, despite an immediate and unconditional ceasefire agreement reached in Malaysia the previous day. According to the Thai army, Cambodia violated the truce on Tuesday, prompting Thailand to respond accordingly. This is the same phrase used on July 24, when both countries' military forces blamed each other for initiating an attack. Cambodian Prime Minister Hun Manet stated on Facebook, 'The front line has calmed down after the ceasefire at midnight.' However, during a meeting in Malaysia with Thailand's interim Prime Minister Phumtham Wechayachai, each side questioned the other's sincerity, as their recent speeches have shown little consistency. The current conflict has resulted in 38 fatalities, dozens of injuries, and the displacement of nearly 300,000 people. The dispute combines unresolved historical issues, as the border was mapped by France in 1907, but still has several undemarcated points, which have led to clashes over the years. The current escalation is one of the bloodiest clashes between the two Southeast Asian neighbors, who have attacked each other this time with fighter jets, artillery, tanks, and infantry. Cambodia has taken the territorial dispute to the International Court of Justice, citing a desire for a peaceful solution based on international law, while Bangkok has advocated for a bilateral agreement. A meeting between the two armies in a disputed border area on May 28 ended in a fight that killed a Cambodian soldier. On July 23, a Thai soldier lost his right leg after stepping on a landmine in a border area in Ubon Ratchathani. International organizations and countries have urged the governments to resolve the issue through dialogue, but it remains to be seen whether the words and actions of both sides will align.\nOriginal language: es\nPublish date: July 29, 2025 05:09 AM\nSource:[Prensa latina](https://www.prensa-latina.cu/2025/07/29/persisten-desacuerdos-discursivos-entre-tailandia-y-camboya/)\n\n**Thailand and Cambodia Agree to Ceasefire, but Clashes Continue**\nDespite a ceasefire agreement reached on Monday, clashes have reportedly occurred at the border between Thailand and Cambodia. A meeting between military leaders of the two countries has been postponed. The ceasefire, which came into effect at midnight local time, has been broken, according to reports. The Thai army accused the Cambodian troops of violating the ceasefire agreement by launching attacks at several locations. In a statement on X, the Thai military said that 'unrest and armed conflict' had occurred in several areas, to which they had responded accordingly. However, the Cambodian Defense Ministry stated that the border remained calm. The two countries' leaders had agreed on a 'immediate and unconditional' ceasefire during a meeting in Malaysia on Monday, following severe clashes that resulted in several deaths. The meeting was attended by representatives from the US and China, with Malaysia hosting the meeting as the current chair of the Association of Southeast Asian Nations (Asean). The planned meeting between military leaders of the two countries was postponed by several hours, with no details on the reason. The conflict between the two neighboring countries has been ongoing for decades. On Thursday, severe clashes broke out along their 800-kilometer-long border, resulting in deaths and injuries on both sides, mainly among civilians. Both sides have accused each other of starting the violence, with the cause of the escalation still unclear. Over 200,000 people were displaced from their homes, but many have since returned to their regions. US President Donald Trump had personally intervened in the escalating conflict, calling for a ceasefire in phone calls with the leaders of both countries. Trump threatened that there would be no trade negotiations regarding his proposed tariffs if fighting continued. He had previously announced that the two countries would be subject to 36% tariffs starting in August. After the meeting in Malaysia, Trump wrote on his Truth Social platform: 'I have just spoken with the acting Prime Minister of Thailand and the Prime Minister of Cambodia. I am pleased to announce that both countries have reached a ceasefire and peace, thanks to my intervention as President of the United States.' He instructed his team to resume trade talks and added, 'I am proud to be the President of Peace!'\nOriginal language: de\nPublish date: July 29, 2025 03:33 AM\nSource:[Der Tagesspiegel](https://www.tagesspiegel.de/internationales/meldungen-uber-verstosse-am-morgen-waffenruhe-zwischen-thailand-und-kambodscha-ist-in-kraft-14098913.html)\n\n**Thailand and Cambodia Agree to Ceasefire After Five Days of Border Clashes**\nThailand and Cambodia have agreed to an 'immediate and unconditional' ceasefire, effective from midnight, ending five days of intense border clashes that killed 35 people and forced the evacuation of nearly 300,000 people. Malaysian Prime Minister Anwar Ibrahim announced the agreement as the president of the Association of Southeast Asian Nations (ASEAN), after a mediating meeting between the prime ministers of Thailand and Cambodia, Phumtham Wechayachai and Hun Manet, respectively. Anwar said, 'An immediate and unconditional ceasefire, effective from 24:00 on July 28 (17:00 GMT). This is a vital first step towards de-escalation and the restoration of peace and security.' The Malaysian leader highlighted that the conversations were positive and concluded with a mutual commitment to restore peace and security in the affected border areas. To consolidate the de-escalation, at least two bilateral meetings are scheduled: a meeting on Tuesday between military leaders from both countries and a second meeting planned for August 4. Hun Manet thanked US President Donald Trump's mediation and China's participation as an observer in the conversations. 'Let our bilateral discussions return to normal in our relationship,' the Cambodian leader expressed. Phumtham Wechayachai, acting as interim prime minister due to Paetongtarn Shinawatra's suspension, thanked the mediation and highlighted the agreement as 'a peaceful resolution to protect sovereignty and human life.' The clashes began on July 24 after weeks of increasing border tensions. Both armies accused each other of initiating the attacks, which involved heavy artillery including F-16 fighter jets and BM-21 rockets. The conflict left a toll of 35 deaths: 22 from the Thai side (14 civilians and 8 soldiers) and 13 from the Cambodian side (8 civilians and 5 military personnel). Additionally, dozens of people were injured and approximately 291,000 displaced, with over 156,000 in Thailand and around 135,000 in Cambodia. The humanitarian crisis generated by the clashes forced the authorities of both countries to establish massive evacuation centers to protect trapped civilians in the conflict zone. UN Secretary-General António Guterres celebrated the ceasefire as 'a positive step' towards a peaceful resolution of the conflict.\nOriginal language: es\nPublish date: July 28, 2025 09:42 PM\nSource:[Noticias SIN](https://noticiassin.com/tailandia-y-camboya-acuerdan-cese-al-fuego-tras-cinco-dias-de-combates-fronterizos-que-dejaron-35-muertos-1895153/)\n\n**Malaysia Facilitates Ceasefire Between Thailand and Cambodia**\nMalaysian Prime Minister Anwar, after the ceasefire talks, announced that the parties had agreed on an 'urgent and unconditional' ceasefire to take effect at midnight local time. According to The Star, Anwar announced that the Thai and Cambodian officials will host the General Border Committee (GBC) meeting on August 4 in Cambodia. Anwar stated that Cambodia, Thailand, and Malaysia will develop a three-party mechanism to implement the ceasefire, saying that it will 'form the foundation of sustainable peace and accountability.' Anwar emphasized the importance of the Kuala Lumpur meeting, stating that it reaffirmed Malaysia, Cambodia, and Thailand's joint commitment to finding a fair and lasting solution to the conflict through international law, peaceful coexistence, and multilateral cooperation. Anwar also announced that Malaysia will consult with ASEAN member countries on 'supporting peace in place.' He highlighted that the ceasefire is a vital first step in reducing tensions and restoring peace and security. Anwar emphasized that Malaysia is ready to coordinate the observation team to ensure the implementation of the ceasefire. The ceasefire talks were attended by officials from the US and China. Thailand and Cambodia have been experiencing a long-standing border dispute, with a recent conflict on May 28, resulting in a short-lived clash. The two countries' armies agreed to resolve the issue peacefully. However, a recent conflict on July 24 resulted in the loss of 32 lives from both sides. US President Trump announced on his Truth Social account that he had spoken with the parties and that they had agreed to work towards a ceasefire and ultimately peace. Despite Trump's announcement, the clashes continued.\nOriginal language: tr\nPublish date: July 28, 2025 11:34 AM\nSource:[Dünya](https://www.dunya.com/dunya/tayland-ve-kambocya-malezya-arabuluculugunda-ateskes-karari-aldi-haberi-787090)\n\n**ASEAN Under Pressure: Malaysia Pushes for Ceasefire as Deadly Thai–Cambodian Border Crisis Deepens**\nOngoing fighting between Thailand and Cambodia has resulted in over 30 deaths and displaced more than 200,000 residents. Malaysia, as ASEAN chair, is promoting an immediate ceasefire and offering mediation. Thailand insists on bilateral talks, while Cambodia has agreed to discuss a ceasefire. The conflict is rooted in territorial disputes and cultural sensitivities. Both countries have accused each other of violating international law and targeting civilians. ASEAN has offered to host talks and broker a ceasefire, but both sides remain entrenched. Analysts warn that without conciliation, the situation could lead to prolonged instability. Regional actors, including China and ASEAN, are urging restraint and dialogue. 'The situation remains volatile, and much now hinges on whether ASEAN-brokered diplomacy can overcome the mutual distrust that has long plagued this disputed border,' said a statement. 'ExpatGo welcomes and encourages comments, input, and divergent opinions, but kindly requests that you use suitable language and refrain from personal attacks or hate speech.'\nOriginal language: en\nPublish date: July 27, 2025 06:21 AM\nSource:[expatgo.com](https://www.expatgo.com/my/2025/07/27/asean-under-pressure-malaysia-pushes-for-ceasefire-as-deadly-thai-cambodian-border-crisis-deepens/)\n\n",
    "date": "2025-11-18T11:12:44.868724",
    "summary": "The panel of forecasting experts assesses the risk of another deadly clash (3+ fatalities) between Thailand and Cambodia before January 1, 2026, as significantly elevated but not a certainty. Nearly all experts emphasize (1) a fragile ceasefire, frequent violations, and a history of volatility along the border, with recent incidents (mine blasts, shootings) nearly reaching the fatal threshold, and (2) strong international pressure for restraint, especially from ASEAN, China, the US, and Malaysia, acting as a deterrent against large-scale escalation. \n\nKey increasing factors include: lack of robust third-party monitoring/verification, entrenched nationalist sentiment and domestic political pressures on both sides, and the historical pattern in which even post-ceasefire, sudden escalation remains plausible—especially given recent suspensions of peace agreements and prisoner stalemates. Lowering factors include: economic and political costs of renewed hostilities, robust (if sometimes ad hoc) diplomatic channels, and the short (6-week) window remaining for the question to resolve, giving less time for a qualifying incident to occur. While several experts see the greatest risk in accidental escalation by local commanders amid mutual mistrust, most believe the risk is somewhat offset by leaders' rational calculus, economic interdependence, and regional/international engagement.\n\nProbabilities estimated by experts range from a low of 25% to a high of 63%, with a cluster of forecasts just above and just below even odds (40%, 40%, 32%, 33%, 37%, 55%, 58%, 62%, 63%). The average forecast from these analyses is approximately 48%. In summary, while no expert sees major war as imminent, the consensus is that the chances of another deadly clash before year's end are notably higher than 'normal' peacetime and above historical averages for post-ceasefire periods, but remain short of a majority likelihood, mainly due to ongoing international restraint efforts and the limited time remaining.",
    "forecasters": [
        "Military Intelligence (Threat Assessment Methodology)",
        "Diplomatic Affairs (Track Two Diplomacy Practice)",
        "Crisis Management (Incident Command System)",
        "Crisis Management (Risk Analysis Procedures)",
        "International Relations (Realism)",
        "International Relations (Liberal Institutionalism)",
        "Security Studies (Securitization Theory)",
        "Security Studies (Conflict Escalation Model)",
        "Southeast Asian Studies (ASEAN Regionalism)",
        "Southeast Asian Studies (Postcolonial Border Dispute Analysis)"
    ]
}