{
    "deliberation_results": {
        "Nonprofit Administration (IRSForm990StaffingStandards)": {
            "time_to_resolution": "Approximately 3 months until the end of 2025.",
            "perspective_relevance": "As an expert in Nonprofit Administration and IRS Form 990 staffing standards, I have direct familiarity with how US 501(c)(3) organizations like the Forethought Foundation report employee headcount, how 'full-time equivalent' (FTE) is calculated for IRS and public reporting, as well as state-of-the-field norms for nonprofit research think tanks. This background helps me systematically assess available data, organizational status, and labor classification conventions for US-based nonprofits.",
            "status_quo": "The Forethought Foundation has historically reported on Form 990 either zero or a very small FTE staff count. The most recent available public filings (2022, filed in 2023) list only a few employees and mostly rely on contractor and academic affiliates. There is no strong public evidence that it has scaled up to a team exceeding two FTEs through 2024.",
            "perspective_derived_factors": [
                {
                    "factor": "Nonprofit think tank baseline size",
                    "effect": "Decreases probability. Small/elite research organizations, especially in the effective altruism/rationalist space, frequently run on skeleton full-time staff and distribute work to contractors, academic affiliates, or part-time contributors rather than maintaining a large direct headcount."
                },
                {
                    "factor": "IRS Form 990 reporting conventions",
                    "effect": "Decreases probability. FTE is calculated conservatively for Form 990; part-timers and independent contractors are not summed to inflate FTE above the strict 35-hour rule; thus even if there are many contributors, reported official FTE may remain low."
                },
                {
                    "factor": "Availability of funding and recent hiring",
                    "effect": "Neutral to mildly increasing. There was 2022 and early 2023 evidence of a hiring round; however, there is no news from 2024–2025 of further staff expansion or large new grants that would suggest a sudden shift to a large salaried core team."
                },
                {
                    "factor": "Signs of organizational abandonment or stagnation",
                    "effect": "Decreases probability. If the foundation's activity has become dormant or the founder is focused on other ventures, it is highly unlikely the headcount would expand."
                },
                {
                    "factor": "General labor market trends (remote/hybrid/post-pandemic)",
                    "effect": "Mostly neutral. News of broader hybrid/FTE norm changes do not directly affect this niche foundation's internal reporting and scale."
                }
            ],
            "no_scenario": "The most likely scenario is the Forethought Foundation continues normal operations as a boutique research entity with one or two official FTEs (possibly the executive director and an administrator), using grants to contract with academics or part-time researchers who do not qualify as FTE for IRS reporting. Their 2025 Form 990, to be filed in 2026, lists either 2 or fewer FTEs.",
            "yes_scenario": "A less likely scenario is that the foundation secured unexpectedly large new funding and pivoted to a much larger in-house research model, directly hiring three or more full-time researchers and/or operations staff with W-2 contracts, resulting in a reported FTE count above 2 for 2025 filings.",
            "final_reasoning": "Bringing together the base rates of similar nonprofits, historical Forethought Foundation staffing, IRS reporting conventions, and the lack of news of significant expansion or new fundraising success in 2024–25, it remains highly likely (over 80%) that the organization will continue to report two or fewer FTEs in its 2025 filings. While not impossible for a pivot, there is no outward indication of rapid expansion. Therefore, maintaining a probability of 19% for more than two full-time equivalent employees in 2025 is justified.",
            "final_probability": 19
        },
        "Nonprofit Administration (CharityNavigatorEvaluationCriteria)": {
            "time_to_resolution": "about 3 months until the end of 2025",
            "perspective_relevance": "As an expert in Nonprofit Administration, and with specific expertise on Charity Navigator evaluation criteria, I am familiar with best practices in nonprofit governance, staffing, transparency, and resource allocation—especially relevant in small, research-focused organizations like the Forethought Foundation. Staff size, hiring, and reporting practices within the nonprofit sector strongly inform my forecasting, as does understanding the typical evolution and scale of operations of similar think tanks and research-focused charitable entities.",
            "status_quo": "As of recent public data, the Forethought Foundation has tended to operate with a lean team and strong reliance on affiliations with the University of Oxford and the Global Priorities Institute. Its core team has generally remained small (~2 FTE or under), with additional research and admin support sometimes provided via part-time, temporary, or externally contracted staff.",
            "perspective_derived_factors": [
                {
                    "factor": "Nonprofit Grant Structure and Funding Model",
                    "effect": "Decreases probability, as foundation-style organizations with a philanthropic focus often prioritize lean administration."
                },
                {
                    "factor": "Academic-Think Tank Hybrid Model",
                    "effect": "Decreases probability; academic think tanks, especially those affiliated with universities, use part-time affiliates or joint appointments instead of scaling core full-time staff."
                },
                {
                    "factor": "Recent Hiring and Growth Announcements",
                    "effect": "Neutral/slightly increases probability; While there was a hiring round a few years ago, there is no current evidence in the news or on the website that the Foundation is undertaking major staff expansion in 2025."
                },
                {
                    "factor": "External Trends in Nonprofit Staffing",
                    "effect": "Neutral; increased demand for flexible/remote/hybrid work, but no indication the Forethought Foundation is responding with FTE expansion (as opposed to more flexible contracts or collaborations)."
                },
                {
                    "factor": "Transparency and Reporting Practices",
                    "effect": "Decreases probability; similar nonprofits are typically transparent about team scaling and would list new hires in annual reports, websites, or social media—none of which have indicated >2 FTE staff."
                },
                {
                    "factor": "Potential for Project Wind-Down or Strategic Pivots",
                    "effect": "If anything, increases likelihood of headcount shrinkage or stasis, as small research nonprofits sometimes sunset rather than dramatically scale up unless receiving a major new grant."
                }
            ],
            "no_scenario": "The Forethought Foundation continues to operate with its current staff composition or even reduces headcount—relying on a core of less than or equal to 2 FTE employees (likely William MacAskill plus an administrator), leveraging part-time research fellows, graduate affiliates, short-term contractors, and academic collaborators for project work. Annual reporting and/or web presence at the end of 2025 confirms no substantive growth in formal, full-time W2-equivalent staffing.",
            "yes_scenario": "The Foundation receives an unexpected major grant or initiates a large, externally funded research project in late 2025, requiring rapid formal expansion of its administrative and research team to >2 FTEs (e.g., by hiring new full-time program managers or postdoctoral researchers directly, not as university-joint appointments). The website, public filings, or a reputable third party reports this expansion as of year's end.",
            "final_reasoning": "Base rates for small, mission-driven research nonprofits like the Forethought Foundation suggest that scaling beyond 2 FTEs is uncommon unless a significant new grant or strategic shift emerges. Recent hiring and operational signals for the Foundation are weak or absent, and broader sector trends in 2025 favor flexible staffing arrangements over increased permanent headcount. Charity Navigator evaluation criteria emphasize transparency, and the public record does not indicate expansion to >2 FTEs. News coverage provides sector-wide context (e.g., increased demand for flexibility, stagnant or shrinking nonprofit staffing) but does not mention the Forethought Foundation or any similar organizations making sudden administrative expansions. Risk of project wind-down, maintenance of lean operations, or status quo are all higher-probability scenarios than rapid staff growth.",
            "final_probability": 19
        },
        "Human Resources (WorkforcePlanningBestPractices)": {
            "time_to_resolution": "Approximately 3 months until the end of 2025.",
            "perspective_relevance": "As a Human Resources (Workforce Planning Best Practices) expert, my perspective is uniquely valuable in analyzing small non-profit or think tank staffing trajectories. This lens facilitates an understanding of organizational lifecycles, capacity scaling, funding dependencies, and HR policy implementation in mission-driven, research-focused environments like Forethought Foundation.",
            "status_quo": "Forethought Foundation typically operated with a lean staff structure (1-2 FTE permanent), relying on temporary, part-time, or volunteer researchers. As of the last available public information (circa 2024), no evidence indicated the move beyond this minimal FTE base.",
            "perspective_derived_factors": [
                {
                    "factor": "Funding Availability and Security",
                    "effect": "Decreases probability. Grant-driven think tanks face high volatility linked to philanthropic priorities and economic climate. No recent reporting of major grant infusions or new funder commitments for Forethought Foundation is available."
                },
                {
                    "factor": "Field/Organizational Trends among EA-affiliated Foundations",
                    "effect": "Decreases probability. Organisations in the Effective Altruism sphere often maintain extremely lean payrolls, prioritizing flexibility and minimizing ongoing overhead."
                },
                {
                    "factor": "Recent Hiring or Expansion Announcements",
                    "effect": "Neutral to slightly decreases. The only publicly reported hiring was in 2021–2022; lack of further signals or press releases about team growth through 2025 is telling."
                },
                {
                    "factor": "General Labor Market/HR Trends for Similar Organisations",
                    "effect": "Neutral. While macro trends show many organisations return to office or hybrid expansion, this affects larger or more conventional orgs; research micro-orgs often remain primarily remote/flexible with small FTE counts."
                },
                {
                    "factor": "Risk of Abandonment or Dormancy",
                    "effect": "Decreases probability. If the Foundation has substantially wound down operations, the probability of increased FTEs is sharply reduced."
                }
            ],
            "no_scenario": "Forethought Foundation maintains a core of one or two FTE program staff (potentially executive director/operations), supplementing any ongoing projects with part-time, contract, or volunteer affiliates during specific grant cycles or project needs. There are no public announcements of expansion; funding is stagnant or declining, preventing new full-time hires.",
            "yes_scenario": "A change in funding environment or a large, newly secured grant allows Forethought Foundation to professionalize its operations in late 2025, bringing on 1–2 new full-time staff to meet compliance, research, or program delivery needs; this pushes FTE count over two for at least several months.",
            "final_reasoning": "My specialty in workforce planning underscores that small, grant-dependent think tanks rarely expand FTE payrolls absent specific, well-publicized surges in funding or programmatic expansion. Forethought Foundation's history of minimal hiring, the Effective Altruism sector’s cost-minimizing approach, and the complete absence of recent public job ads or staff updates all suggest the FTE count likely remains at two or below. Base rates for similar organizations growing their FTE count past two in the absence of external catalysts are low. The micro-organization segment (lean, academically focused EA-aligned orgs) rarely breach the 2 FTE barrier without external, visible drivers, of which there is no signal in the present news cycle. Thus, the probability for 'more than two FTEs in 2025' remains low, at 19%.",
            "final_probability": 19
        },
        "Organizational Sociology (ResourceDependenceTheory)": {
            "time_to_resolution": "Approximately 3 months (until December 31, 2025)",
            "perspective_relevance": "As an expert in Organizational Sociology specializing in Resource Dependence Theory (RDT), I analyze organizations as actors navigating resource constraints and opportunities within their environment. RDT holds that an organization's structure, growth, and persistence are shaped primarily by its need to secure critical resources (e.g., funding, talent, legitimacy) from its environment. This perspective is highly relevant here: Forethought Foundation's ability or willingness to sustain >2 FTEs depends directly on its resource environment, including grant availability, academic/project opportunities, leadership priorities, competition, and sectoral labor trends.",
            "status_quo": "The Forethought Foundation has historically operated with a very small core staff—often just 1-2 FTEs—with additional work performed by affiliates, contractors, or volunteers. There is no recent evidence of rapid expansion, nor evidence of organizational abandonment.",
            "perspective_derived_factors": [
                {
                    "factor": "Resource Slack/Funding Availability",
                    "effect": "Decreases probability: With effective altruism funding under pressure (post-FTX, more scrutiny in grantmaking, shifting funder priorities), it is less likely Forethought would expand core FTEs significantly unless specifically targeted by a new grant."
                },
                {
                    "factor": "Organizational Strategy/Leadership Preference",
                    "effect": "Decreases probability: Forethought's leadership (notably William MacAskill) has strong academic affiliations and a documented preference for keeping the organization lean (drawing on project-based or temporary assistance rather than growing a large staff)."
                },
                {
                    "factor": "Sectoral/Ecosystem Trends",
                    "effect": "Neutral to slightly decreasing: Many EA/longtermist think tanks have stayed small or consolidated recently, responding both to resource pressures and to a movement trend favoring project networks over large permanent teams."
                },
                {
                    "factor": "Labor Market Pressures and Competition",
                    "effect": "Decreases probability: There is heightened competition for talent (AI/EA orgs), making recruitment costlier; funding bodies are more demanding about impact for staff outlay, increasing barriers to expansion."
                },
                {
                    "factor": "Potential for Organizational Pivot",
                    "effect": "Slight increase: A radical pivot to a new funded project or embedding a new branch within Forethought could temporarily raise FTEs above 2, but there is no signal of this and past practice is against it."
                }
            ],
            "no_scenario": "Forethought Foundation maintains or reduces its staff: The organization continues to operate with core leadership (MacAskill), perhaps one administrator/researcher, and uses fellows, contractors, or unpaid affiliates for additional work. No major new grants or projects are announced. Absent signals of abandonment, the org remains small for flexibility and cost reasons.",
            "yes_scenario": "Forethought Foundation launches a large new research program or receives a major earmarked grant that mandates hiring extra full-time research staff, operations, or outreach personnel, pushing FTEs above 2. Such an expansion is announced publicly (via their website, Effective Altruism Forum, etc.) and maintained through the end of 2025. This would likely require a significant shift from current strategy or a major change in the external funding environment.",
            "final_reasoning": "The historical base rate for micro-think tanks in the effective altruism/longtermism ecosystem demonstrates remarkable organizational inertia toward staying small, especially in lean funding climates and in the absence of external mandates or top-down resource shocks. Resource Dependence Theory suggests this inertia persists until resource constraints (e.g., funding cuts or grants with headcount conditions) or new opportunities (e.g., a transformative grant or partnership) provide a compelling reason for structural change. No recent news, hiring spree, or sector-wide shift points to Forethought Foundation moving toward >2 FTEs. The organization's own public communications underscore its status as a lean, flexible entity. Sectoral conditions suggest stagnation or contraction in admin-heavy orgs, not sudden growth. The 'yes' outcome would require a resource discontinuity or public hiring surge not currently forecasted. Thus, a probability of 19% (below one-fifth) accurately reflects a low but plausible tail risk of organizational pivot, with the vast majority of weight on the status quo scenario.",
            "final_probability": 19
        },
        "Organizational Sociology (InstitutionalIsomorphism)": {
            "time_to_resolution": "Just over 3 months (question resolves during 2025)",
            "perspective_relevance": "Organizational Sociology, especially Institutional Isomorphism, provides insight into how small think tanks like the Forethought Foundation adapt to field-wide pressures, resource constraints, and legitimacy-seeking behaviors. This perspective helps estimate the likelihood that Forethought will conform to sectoral norms (often lean staffing) versus expand or contract in response to external shocks (e.g., funding, reputational challenges in effective altruism, macroeconomic labor trends).",
            "status_quo": "Forethought Foundation has historically operated with a small core staff (typically under 3 FTE), relying on project-based contractors, academic affiliates, and volunteers. Unless there is a distinct trigger, its size likely remains stable or grows slowly.",
            "perspective_derived_factors": [
                {
                    "factor": "Sectoral Norms for Think Tank Size",
                    "effect": "Decreases probability. Small global priorities/EA-affiliated think tanks historically run lean, particularly when funding and legitimacy are uncertain—often operating with 1-3 FTE staff and academic partnerships rather than hiring above 2 FTE."
                },
                {
                    "factor": "Resource Constraints and Funding Trends",
                    "effect": "Neutral to slightly decreasing. After the FTX collapse and scrutiny toward EA philanthropy, many EA-aligned organizations have struggled to secure multi-year funding or have adopted more conservative hiring postures. Most recent public reports or disclosures do not indicate a hiring spree or doubling-down on operations."
                },
                {
                    "factor": "Institutional Legitimacy and Isomorphic Pressures",
                    "effect": "Slight increase. If peer organizations (e.g., Global Priorities Institute, Rethink Priorities) publicly increase headcount, Forethought may feel pressure to follow, especially to be perceived as credible or to match external expectations."
                },
                {
                    "factor": "Labor Market Trends",
                    "effect": "Marginally decreasing. With increased employer leverage (e.g., return-to-office trends), FTE contracts may be less flexible, and small organizations may prefer short-term/remote contractors over FTEs to manage risk and benefit from global talent."
                },
                {
                    "factor": "Organizational Goal Evolution or Abandonment Risk",
                    "effect": "Significant. If Forethought pivots to a more grantmaking/support role or is de-prioritized by senior leadership, it could further reduce FTE headcount. If it is abandoned as an active project, the resolution is negative by definition."
                }
            ],
            "no_scenario": "Forethought continues operating with 1-2 core staff, supplemented by academic (non-employee) affiliates and contractors—a typical model for small, grant-funded think tanks in the EA ecosystem, especially in a conservative funding environment.",
            "yes_scenario": "Forethought secures a large new grant (perhaps from Open Phil or via renewed EA/LT funding), or experiences a mission shift requiring operational scale-up (e.g., launching large in-house projects or events), leading to an explicit hiring round and growing to 3+ FTEs.",
            "final_reasoning": "Base-rate analysis is central: Most comparable think tanks (small, EA-affiliated, research-driven) have 1-3 FTEs and rarely surpass 2 for extended periods unless organizational scope or revenue grows significantly. After year-long negative sectoral news (e.g., FTX aftershocks), substantial expansion is unlikely barring catalytic new funding or a strong externally signaled change. No public evidence or sectoral cues (from the news articles) suggest substantial hiring at Forethought or a broader EA hiring spree. Labor market and isomorphic pressures are either neutral or slightly suppressive for FTE growth, and abandonment or scaling-back for strategic/financial reasons remains a risk. Therefore, the probability that Forethought Foundation will have >2 full-time equivalent employees in 2025, as strictly defined, is low, and I set it at my initial base rate: 19%.",
            "final_probability": 19
        },
        "Nonprofit Management (LifeCycleModelNonprofits)": {
            "time_to_resolution": "Approximately 3 months until the end of 2025.",
            "perspective_relevance": "As an expert in Nonprofit Management, specifically the Life Cycle Model for nonprofits, my perspective informs an understanding of nonprofit organizational growth patterns, talent management, and the tendency of new or early-stage organizations (such as Forethought Foundation, founded in 2018) to scale staff cautiously based on funding, mission clarity, and operational maturity. This also involves recognizing unique hiring traits of think tanks and effective altruism organizations, which often use a mix of core employees and affiliated researchers rather than a robust, purely full-time staff model.",
            "status_quo": "The available public data consistently points to Forethought Foundation having a very small team over its history, often with two or fewer full-time staff members and relying primarily on fellows, part-timers, or affiliated academics for project work.",
            "perspective_derived_factors": [
                {
                    "factor": "Nonprofit Life Cycle Model",
                    "effect": "Decreases probability. Early-stage or niche nonprofits like Forethought Foundation tend to stay lean and avoid overhiring, emphasizing programmatic partnerships or fellowships rather than expanding full-time staff until sustainably funded, highly established, and facing operational demand for scale."
                },
                {
                    "factor": "Funding Landscape Post-FTX and in EA Community",
                    "effect": "Decreases probability. The effective altruism community, particularly in the wake of shocks from the FTX scandal and subsequent funder caution, has pulled back on aggressive expansion, emphasizing longer funding runways, with many organizations staying flat or reducing FTE (full-time equivalent) headcounts."
                },
                {
                    "factor": "Think Tank/Academic Model",
                    "effect": "Decreases probability. Institutions centered on research and policy frequently use networks of fellows, visiting academics, and contractors, limiting the necessity of full-time staff, especially if the founder (MacAskill) is well connected and can pull in high-impact project collaborators without changing formal payrolls."
                },
                {
                    "factor": "Recent Hiring Trends and Public Announcements",
                    "effect": "Neutral to slightly decreasing. There have been no prominent public job postings or organizational announcements in 2024 or 2025 indicating a rapid permanent staff expansion above two FTEs; the lack of visible recruitment is strong evidence against a sudden hiring spurt."
                },
                {
                    "factor": "Potential for Abandonment",
                    "effect": "Decreases probability. If the organization were to wind down, the question explicitly resolves NO. There is no evidence of wind-down, but also none for escalation."
                },
                {
                    "factor": "Resolution Mechanism and Modality",
                    "effect": "Neutral. Resolution relies on explicit organizational reporting and/or best estimates if reporting is ambiguous. Given the public-facing nature of the foundation's work, sudden expansion to >2 FTEs would likely have been noticed."
                }
            ],
            "no_scenario": "The organization continues operating with MacAskill and possibly one other full-time program manager or executive, supplemented by fellows, temporary research assistants, and university-affiliated collaborators. Annual reports or Metaculus moderator inquiries reveal a staff size of 1–2 full-time equivalents at the 35-hour threshold, matching historic patterns of very small central staff, possibly with a mix of part-timers that do not combine to exceed 2+ FTE.",
            "yes_scenario": "Due to a major new grant, program expansion, or significant shift in operational strategy (for example, an intentional scale-up to become a more direct grantmaking or convening body), the Forethought Foundation hires at least three full-time equivalents (e.g., an executive director, a program director, and an ops/admin lead), all working at least 35 hours per week by EOY 2025, with public documentation or confirmation from Metaculus moderators.",
            "final_reasoning": "The base rate for small, academically-focused nonprofits with highly-networked founders is that they maintain minimal FTE staff, relying on flexible, project-based, or contract/fellow arrangements. Nothing in recent news, staff listings, or the broader effective altruism funding environment suggests expansion over the last year. In fact, risk aversion and donor scrutiny post-FTX argue strongly against headcount increases absent major visible grants. The status quo is a team of one or two full-time equivalents, and there are no public signals pointing to imminent change. Given these reasons—and that the question resolves negatively if staff headcount is ambiguous or status quo continues—the probability is well below even odds. I set it at 19%, reflecting a small but nonzero possibility of a structural shift, but the overwhelming likelihood is that Forethought Foundation will report no more than two full-time equivalent employees at the end of 2025.",
            "final_probability": 19
        },
        "Nonprofit Management (SocialEnterpriseTheory)": {
            "time_to_resolution": "Approximately 3 months, until the end of 2025.",
            "perspective_relevance": "As an expert in Nonprofit Management (SocialEnterpriseTheory), I analyze scalability, funding trends, labor market dynamics, and mission-centric hiring in small, impact-oriented organizations like the Forethought Foundation. My expertise helps assess how nonprofits balance lean staffing with scaling ambitions, how funding streams and labor market pressures affect FTE numbers, and how think tanks strategize personnel deployment to maximize mission impact.",
            "status_quo": "Historically, the Forethought Foundation has operated with a very lean staff structure, often fewer than 3 FTEs, supplementing core work with part-time, contract, and volunteer labor. There is no clear public evidence of recent, significant hiring or expansion.",
            "perspective_derived_factors": [
                {
                    "factor": "Funding environment post-FTX/crisis-induced Effective Altruism contraction",
                    "effect": "Decreases probability: Many EA-aligned organizations faced funding shortfalls or risk aversion after controversies in 2022–2024. Lean staffing is favored due to uncertain or diminished grants."
                },
                {
                    "factor": "Programmatic focus of organization",
                    "effect": "Decreases probability: FF’s work is primarily research and grantmaking, both of which require a small team of highly skilled professionals who often combine roles, making >2 FTEs less likely unless launching new major programs."
                },
                {
                    "factor": "Nonprofit sector hiring trends",
                    "effect": "Neutral or slightly decreases probability: Recent news shows HR and flexibility issues, but small think tanks often resist scaling FTE headcount, relying on hybrid roles, fellowships, and deployment of part-time researchers."
                },
                {
                    "factor": "Transparency and reporting norms",
                    "effect": "Decreases probability: The EA/longtermist movement, now less exuberant, faces higher expectations for cost-effectiveness and transparency, further incentivizing ultra-lean staffing until demonstrated impact or new funding."
                },
                {
                    "factor": "Possibility of abandonment",
                    "effect": "Decreases probability: If project momentum has lapsed (absent recent updates or public programmatic growth), headcount may have shrunk further rather than grown."
                }
            ],
            "no_scenario": "FF continues operating with a core 1–2 FTE team and distributed contractors/associates. The Foundation prioritizes flexibility, drawing on university partnerships, part-time research fellows, and unpaid interns, without expanding full-time paid staff. No new major research or expansion is launched due to constrained growth funding, and any hiring is fractional. Organization continues producing work at a sustainable, slow growth pace, perhaps even winding down certain activities.",
            "yes_scenario": "FF secures a major new grant or donation in the second half of 2025, perhaps tied to an emerging global catastrophic risk initiative. The Foundation rapidly expands research output or undertakes a new public engagement campaign, necessitating hiring of additional full-time research staff and a project manager/admin. Number of FTEs rises to 3+ by year-end, documented in public filings or credible reports.",
            "final_reasoning": "Base rates for small, academically focused think tanks, especially in the longtermist EA-aligned space, show persistent lean staffing unless a major externally catalyzed acceleration/funding event occurs. Post-FTX, and with the EA movement’s visible retrenchment, appetite for adding fixed labor costs is low. The Forethought Foundation’s own recent activities, based on public channels (forum posts/newsletter/job boards) as of late 2025, do not indicate new expansion drives or a shift toward labor-intensive operations. The broad labor market news provided largely addresses public sector, private corporations, or very large nonprofit employers in other geographies; there are no tailored signals indicating a hiring surge at the FF. Therefore, the combination of historical staffing patterns, constrained funding, programmatic focus, and sector signals make >2 FTEs unlikely absent surprise developments. The base rate is low, and there are no clear arguments from recent news to push much higher than that.",
            "final_probability": 19
        },
        "Labor Economics (TheoryOfLaborDemand)": {
            "time_to_resolution": "Approximately 3 months until end of 2025",
            "perspective_relevance": "As an expert in Labor Economics (Theory of Labor Demand), I bring an analytical framework that models how think tanks like Forethought Foundation make staffing decisions. This involves understanding the demand for labor in small non-profits, inputs/outputs tradeoffs, funding constraints, labor market competition, and labor law implications on the definition of FTE (35-hour standard). My approach is to examine: (1) the marginal productivity of adding another employee; (2) wage structure, budgetary flexibility, and risk tolerance; (3) the application of broader sectoral labor market trends to this niche context.",
            "status_quo": "The status quo is that the Forethought Foundation, from available public information, is a small think tank, previously advertising for one or two positions, likely having no more than 2 full-time equivalent employees. If nothing changes in funding, mission, or expansion plans, it is unlikely to exceed this size.",
            "perspective_derived_factors": [
                {
                    "factor": "Budget Constraint / Funding Stream",
                    "effect": "Decreases probability. Think tanks grow employees only as funding allows. Unless there is an unexpected windfall grant, additional full-time hires are unlikely. Effective altruist community organizations tend to be extremely cost-conscious."
                },
                {
                    "factor": "Labor Market Tightness and Wage Pressure",
                    "effect": "Decreases probability. Current news mentions labor shortages and wage pressure in some sectors, but think tank/researcher labor supply typically exceeds demand, so limited impact. If anything, a tight labor market may discourage extra hiring due to higher wage demands."
                },
                {
                    "factor": "Organizational Mission and Output Demand",
                    "effect": "Neutral to slightly decreasing. Unless Forethought launches a new initiative requiring more output or is responding to a surge in demand for its research, there's little market-pull for expansion."
                },
                {
                    "factor": "Marginal Productivity and Economies of Scale",
                    "effect": "Neutral. For small research organizations, the marginal productivity of a third hire relative to the fixed costs may be low, unless there's a step-change in scope."
                },
                {
                    "factor": "Precedent/Base Rate for Similar Orgs",
                    "effect": "Decreases probability. Small think tanks in the effective altruist or philosophical global priorities research sector tend to remain at 1-2 FTE unless there’s rapid, visible growth or major new funding."
                },
                {
                    "factor": "Employment Law/FTE Definition Change",
                    "effect": "Neutral. There are no signals in the news about legal or regulatory changes that would alter the 35-hour FTE definition in a way making the threshold easier to cross, nor pressure from the remote/hybrid work movement that would affect the headcount count."
                },
                {
                    "factor": "Risks of Organizational Abandonment",
                    "effect": "Neutral to decreases probability. Although the org is not likely abandoned, if it was, this would resolve No, but there is no indication that abandonment has occurred."
                }
            ],
            "no_scenario": "The Forethought Foundation continues at its current scale, employing 1 or 2 FTEs (or a couple of part-time or contract staff), uses research collaborators or volunteers to supplement, but does not expand via new hires, due to stable or constrained funding, absence of major new grants or mandates, and limited pressure for increased formal output.",
            "yes_scenario": "A significant new grant is received or a new initiative is launched (e.g., via Open Philanthropy or another EA funder), accompanied by a hiring push that brings the FTE headcount above 2—e.g., hiring a new research manager plus a second researcher or a communications role, all working >35 hours/week each.",
            "final_reasoning": "Given the economic theory perspective and known sector characteristics, the base rate for very small think tanks to have <3 FTE is high and persistent absent obvious shocks or growth drivers. There are no news signals or industry trends suggesting an expansion. Labor market news in the articles is broadly about hybrid work, strikes, and labor shortages in other sectors—not think tanks. Forethought’s explicit mission, track record, and cost-minimizing culture fit the pattern of tight staffing. Thus, the likelihood of exceeding two FTEs in 2025 remains low.",
            "final_probability": 19
        },
        "Labor Economics (ScaleEconomiesTheory)": {
            "time_to_resolution": "Approximately 3 months (until December 31, 2025).",
            "perspective_relevance": "As a labor economist specializing in Scale Economies Theory, my perspective is particularly salient for analyzing organizational staffing size decisions in small research nonprofits. Economic theory indicates that small knowledge-based organizations like think tanks tend to operate below minimum efficient scale to retain flexibility and minimize administrative overhead. However, as research output or project count increases, there are potential returns to 'scaling up' through hiring more full-time-equivalent (FTE) staff—provided funding and demand exist. This provides a rigorous framework to assess whether The Forethought Foundation is likely to move beyond two FTE staff.",
            "status_quo": "The organization historically has operated at or below two FTE staff; unless new funding, expansion, or increased project demand emerges, it will likely remain at this level.",
            "perspective_derived_factors": [
                {
                    "factor": "Typical Size of Similar Research Nonprofits",
                    "effect": "Decreases probability. Most comparable academic research nonprofits (especially in the effective altruism space) remain at or below the 2 FTE threshold due to focus, funding constraints, and efficient operation at low headcount."
                },
                {
                    "factor": "Constraints/Opportunities from Scale Economies",
                    "effect": "Decreases probability. The returns to additional FTEs in small, grant-driven think tanks are marginal; management overhead rises and agility falls, creating a strong incentive to stay lean unless project scale demands otherwise."
                },
                {
                    "factor": "Recent Hiring Activity",
                    "effect": "Slightly increases probability if evidence of hiring, but absent recent multiple full-time job openings, this remains a moderate downward force."
                },
                {
                    "factor": "Funding and Grant Environment",
                    "effect": "Neutral to slightly decreasing probability (without recent news of major new grants or endowments, expansion is unlikely; most EA-aligned funding has become more conservative post-FTX)."
                },
                {
                    "factor": "Project Pipeline and Research Output Demands",
                    "effect": "Increases probability if there was a surge in projects or outreach, but as of now, there’s no sharp signal of rapidly expanding scale."
                },
                {
                    "factor": "Automation and Contracting Trends in Knowledge Work",
                    "effect": "Decreases probability. There is a growing reliance on gig-based, fractional, or contract researchers to handle peaks in workload, rather than converting short-term needs into permanent FTEs."
                }
            ],
            "no_scenario": "The Forethought Foundation continues to focus on core projects with minimal administrative expansion, leverages contractors for spikes in workload, and does not secure a new round of unrestricted funding. As a result, it finishes 2025 with two or fewer FTEs as per public reporting or informal confirmation from Metaculus moderators.",
            "yes_scenario": "Unexpected major grants (possibly from Open Philanthropy, Longview, or similar) are received in 2H 2025 earmarked for a new multi-year research program, requiring the hiring of new permanent staff (e.g., an additional program director and research fellow) and pushing regular FTE count to three or above.",
            "final_reasoning": "Bringing together base rates for similar organizations, the continuing trend toward maintaining small in-house teams in grant-funded research foundations, and the absence of concrete evidence of major recent expansion, I see little reason to believe that the Forethought Foundation will cross the three FTE threshold in 2025. Economic incentives for scale are muted, funding is not obviously rising, and sector practice is to use contractors for transitory needs. Therefore, I retain the base rate and my initial estimate.",
            "final_probability": 19
        }
    },
    "deliberation_probability": [
        19,
        19,
        19,
        19,
        19,
        19,
        19,
        19,
        19
    ],
    "deliberation_mean_probability": 19.0,
    "deliberation_sd": 0.0,
    "deliberation_probability_result": 19,
    "group_results": {
        "NonprofitAdministrationIrsform990staffingstandards": {
            "forecaster_to_engage": "NonprofitAdministrationCharitynavigatorevaluationcriteria",
            "response_type": "critique",
            "response": "While your reasoning correctly applies public transparency standards akin to Charity Navigator's criteria and recognizes the influence of sector-wide lean staffing, your analysis could be improved by explicitly considering IRS Form 990's technical definition of 'full-time equivalent' (FTE)—which more strictly accounts for paid W-2 employees working 35+ hours weekly, not contractors or short-term roles. Charity Navigator's focus is more on transparency and program overhead than capturing the fine-grained headcount calculation nuances relevant to question resolution. For this particular forecast, such technical distinctions are critical; overlooking them might underweight the possibility that informal or semi-core contributors could be misconstrued as FTEs absent explicit knowledge of reporting conventions. Your conclusion is directionally correct, but a sharper operational definition of FTE, and an explicit mention of how IRS conventions filter status, would further strengthen the argument and provide additional insurance against unlikely data misinterpretation scenarios."
        },
        "NonprofitAdministrationCharitynavigatorevaluationcriteria": {
            "forecaster_to_engage": "HumanResourcesWorkforceplanningbestpractices",
            "response_type": "defense",
            "response": "Your workforce planning perspective strengthens the base-rate case by emphasizing that organizational growth from 1-2 FTEs to more than 2 in small, grant-reliant nonprofits is a rare event that typically leaves a public trace (such as job postings, org chart updates, or funding announcements). You also correctly highlight the Effective Altruism sector's cost-minimizing tendencies, which align with Charity Navigator's own assessment benchmarks for sustainability and efficiency. This intersection between prudent workforce planning and sector-specific administrative norms effectively reduces the likelihood of unnoticed or rapid FTE expansion. Your argument is particularly compelling because it synergizes operational HR realities with the underlying financial and transparency priorities that evaluators like Charity Navigator use. This combined lens justifies the low probability and guards against overestimating the risk of surprise scaling."
        },
        "HumanResourcesWorkforceplanningbestpractices": {
            "forecaster_to_engage": "OrganizationalSociologyResourcedependencetheory",
            "response_type": "defense",
            "response": "Your use of Resource Dependence Theory adds valuable explanatory power to the status quo bias evident across micro-think tanks in the EA/longtermism niche. By specifying that organizational inertia persists unless there are sharp, externally evident resource shocks (e.g., major grants, regulatory changes), you clarify the necessary preconditions for a staffing pivot. This theoretical framing complements the HR/workforce planning view because it ties observed organizational behavior—namely, sticking to a minimal FTE model—directly to external funding and partnership signals (none of which are observable in recent news). This layered argument not only reinforces the base rate but also helps rule out hidden internal drivers for staffing expansion, making your 19% probability highly defensible in light of the available evidence and sector history."
        },
        "OrganizationalSociologyResourcedependencetheory": {
            "forecaster_to_engage": "OrganizationalSociologyInstitutionalisomorphism",
            "response_type": "critique",
            "response": "Your base-rate logic is solid, and your invocation of institutional isomorphism correctly recognizes that small, research-focused think tanks seldom deviate from the staffing norms of their immediate peers. However, from a Resource Dependence Theory perspective, your forecast could be sharpened by weighting the causal influence of resource flows (funding or partnership shocks) more heavily than mimetic or normative pressures. Isomorphic conformity often follows from similar external contingencies—if one major funder in the EA space changed its criteria or another peer institution publicly expanded, Forethought's behavior might be more directly shaped by resource necessity than field mimicry. As is, your argument is somewhat tautological: field-wide 'suppression' of hiring is both an outcome and a reflection of prevailing resource limits. Greater explicit discussion of resource pipelines—perhaps referencing recent donor retrenchment, or the risk/opportunity of strategic pivots—would enrich and qualify your otherwise correct directionality."
        },
        "OrganizationalSociologyInstitutionalisomorphism": {
            "forecaster_to_engage": "NonprofitManagementLifecyclemodelnonprofits",
            "response_type": "defense",
            "response": "Your application of the nonprofit lifecycle model insightfully identifies strong status quo bias regarding staff size for small, founder-driven think tanks. You note that, unless the organization experiences a clear-cut phase of expansion or transformative funding, most academically anchored nonprofits remain in a 'lean' or 'consolidation' phase for extended periods. This perspective complements the institutional isomorphism argument by providing a dynamic model for why staffing change is unlikely: it's not only a matter of sector norms but a reflection of the organization's own developmental stage. Your recognition of the post-FTX climate amplifies the rationale for risk aversion, and your stress on the role of public signals (or their absence) reliably constrains outside expectations. Overall, your forecast is robust and empirically anchored, reinforcing the shared view that >2 FTEs would only occur in rare, high-visibility circumstances."
        },
        "NonprofitManagementLifecyclemodelnonprofits": {
            "forecaster_to_engage": "NonprofitManagementSocialenterprisetheory",
            "response_type": "critique",
            "response": "While your reasoning appropriately integrates sectoral base rates and notes the dampening effect of post-FTX retrenchment on headcount expansion in EA-aligned organizations, your forecast could benefit from a clearer distinction between revenue-generating social enterprises and grant-dependent think tanks like Forethought Foundation. Social Enterprise Theory emphasizes hybrid funding, earned income streams, and scaling incentives, but Forethought's model remains deeply reliant on philanthropic/research grants rather than mission-linked commercial activities. This difference reduces the relevance of certain social enterprise analogues for FTE expansion dynamics. Greater attention to the unique constraints and motivations of academy-adjacent, non-entrepreneurial nonprofits would mitigate overgeneralization and help tailor the argument to the particularities of the think tank landscape. In short, while your rejection of high FTE probability is directionally correct, some of the underlying justifications are less immediately applicable to Forethought’s specific strategic and resource context."
        },
        "NonprofitManagementSocialenterprisetheory": {
            "forecaster_to_engage": "LaborEconomicsTheoryoflabordemand",
            "response_type": "defense",
            "response": "Your labor economics framing reinforces the low probability from another acute angle: labor demand theory supports the notion that, in the absence of external demand shocks (such as a large new grant, regulatory requirement, or surge in programmatic scale), small think tanks will not increase FTEs. You correctly point out that the news cycles provided reference labor disputes, hybrid work trends, and hiring issues in large or public-sector entities—none of which analogize well to the grant-dependent think tank segment. This labor demand perspective efficiently rules out hidden drivers for FTE growth, and, in tandem with the base rate evidence, makes it highly unlikely that Forethought Foundation spontaneously exceeds 2 FTEs in 2025. Your succinct synthesis tightly maps economic rationale to the empirical realities of such organizations, robustly supporting a probability that stays close to the lower bound."
        },
        "LaborEconomicsTheoryoflabordemand": {
            "forecaster_to_engage": "LaborEconomicsScaleeconomiestheory",
            "response_type": "critique",
            "response": "While your argument is directionally correct in emphasizing that small grant-funded research foundations typically maintain limited staff and outsource transitory tasks, your treatment of scale economies could be expanded. For micro-think tanks like Forethought, true economies of scale don't generally manifest until the organization is much larger and can exploit fixed cost spreading or labor specialization. In fact, the marginal cost of an additional full-time hire may be prohibitive relative to potential output increases, especially considering diminishing returns in research productivity. Integrating more discussion of the diseconomies of scale or barriers to realizing significant efficiency gains at this small size would strengthen your rationale. Moreover, while you correctly note that there's 'no obvious evidence of major recent expansion,' a sharper focus on the precise cost-benefit calculus at ultra-small organizations would better support the lingering possibility of remaining at ≤2 FTE absent pronounced, externally-induced scaling need."
        },
        "LaborEconomicsScaleeconomiestheory": {
            "forecaster_to_engage": "LaborEconomicsScaleeconomiestheory",
            "response_type": "critique",
            "response": "While your argument is directionally correct in highlighting the tendency for small, grant-funded research nonprofits to remain lean, your application of scale economies theory could be more granular. For organizations as small as Forethought Foundation, classic scale economies (e.g., fixed cost absorption, labor specialization) only become relevant as organizations grow to a higher threshold—not at the 2–3 FTE level. In fact, at this size, diseconomies (coordination costs, loss of founder-led agility) are often more salient and might actively disincentivize increasing headcount without overwhelming programmatic necessity. As such, your forecast would be even stronger by recognizing that, in micro-organizations, scale economies do not meaningfully incentivize cross-over into >2 FTE territory; rather, avoidance of excess fixed cost risk predominates. This reframing would further strengthen your low-probability assignment by more explicitly negating the possible rationales for scaling up in this context."
        }
    },
    "revision_results": {
        "Nonprofit Administration (IRSForm990StaffingStandards)": {
            "my_phase1_final_probability": 19,
            "reasoning_for_revised_probability": "After reviewing my initial forecast and engaging with the group, no new substantive information emerged that would materially alter the likelihood. All forecasters independently drew on base rates, recent public signals, and sectoral norms, and consistently converged on low probabilities for hiring expansion. My critique of the CharityNavigatorEvaluationCriteria perspective reinforced that precise IRS Form 990 definitions are central and that there is no credible scenario where contractor roles or flexible nonprofit norms would lead to a misclassification above the two FTE threshold. No new evidence from the field pushes the probability meaningfully higher or lower.",
            "revised_probability": 19
        },
        "Nonprofit Administration (CharityNavigatorEvaluationCriteria)": {
            "my_phase1_final_probability": 19,
            "reasoning_for_revised_probability": "Reviewing the initial analysis and group deliberation, the consensus among forecasters across relevant disciplines remains strong: there is no concrete evidence (public reporting, hiring, or expansion signals) indicating that the Forethought Foundation will exceed two FTEs in 2025. Critique from the IRS Form 990 staffing expert reminded me of the importance of sticking to the precise technical definition of FTE for US nonprofit reporting, further reducing the already low risk that peripheral or semi-core contributors might be misclassified as FTEs. Group defenses reinforced that base rates, sector norms, and transparency expectations all drive probability toward the lower range. Nothing arising in deliberation justifies a substantive shift up (no new risk) or down (tail probability already very low and covering slim chance of a surprise grant or pivot), so my estimate is unchanged.",
            "revised_probability": 19
        },
        "Human Resources (WorkforcePlanningBestPractices)": {
            "my_phase1_final_probability": 19,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I find strong confirmation of my initial reasoning. Across disciplines—IRS reporting, Charity Navigator standards, and resource dependence theory—forecasters emphasized that base rates, technical definitions of FTEs, and the lack of any signaled expansion all point toward low probability. Defense of my argument further validates the convergence of HR best practices and sectoral inertia, while critique of neighboring perspectives highlights the importance of strict operational definitions and public traceability in reporting true staff expansion. No new evidence contradicts the initial analysis, and argumentation from other experts—rather than raising previously ignored tail risks or alternative scenarios—solidifies the initial base-rate-driven outlook. As such, there is insufficient reason to revise the probability.",
            "revised_probability": 19
        },
        "Organizational Sociology (ResourceDependenceTheory)": {
            "my_phase1_final_probability": 19,
            "reasoning_for_revised_probability": "Upon reviewing all arguments provided in group deliberation, I find that consensus across varied expert domains (nonprofit administration, HR, organizational sociology, labor economics) points to very strong organizational and sectoral inertia for maintaining lean staffing at the Forethought Foundation. Critiques and defenses alike highlighted that without a significant, visible funding/resource discontinuity or a public signal of strategic shift (e.g., a major grant or program expansion), it is highly improbable for the organization to exceed two FTEs. No evidence has surfaced to increase the perceived likelihood of a hidden surge in FTE headcount—especially when factoring in the technical reporting definitions discussed in the Charity Navigator/IRS-focused arguments. My initial probability of 19% remains well-supported by both theoretical and practical evidence, so I see no reason to revise.",
            "revised_probability": 19
        },
        "Organizational Sociology (InstitutionalIsomorphism)": {
            "my_phase1_final_probability": 19,
            "reasoning_for_revised_probability": "The group deliberation reinforced and validated the original base-rate reasoning. Every domain—ranging from IRS technicalities and nonprofit transparency to HR best practice, resource dependence theory, and nonprofit lifecycle models—converged on the strong tendency of small, academically focused, grant-funded organizations like the Forethought Foundation to remain at or below two FTEs. No forecaster identified credible signals (such as new job ads, public funding announcements, or sectoral hiring waves) that would justify a higher probability. Critiques and defenses during deliberation sharpened the original theoretical distinctions but found no overlooked upside risks. Consensus analysis confirms that any scenario exceeding two FTEs in 2025 would require a visible, low-probability funding or strategic discontinuity not in evidence. Thus, there is no reason to adjust the probability upward or downward.",
            "revised_probability": 19
        },
        "Nonprofit Management (LifeCycleModelNonprofits)": {
            "my_phase1_final_probability": 19,
            "reasoning_for_revised_probability": "Group deliberation maintained a striking consensus, with all forecasters converging on the same (19%) probability and emphasizing highly similar rationales: persistent sector norms, base rates, post-FTX EA funding caution, and an absence of signals for staff expansion. Critiques addressed theoretical nuance but did not surface any overlooked evidence for a staffing surge, and the critiques reinforced distinctions that further suppress the probability (e.g., reminding us not to over-read general sectoral trends, or to focus on technical FTE reporting standards). No material new argument or external factor arose to justify movement from the initial assessment. The collective lack of contradicting evidence strongly supports holding the initial low probability.",
            "revised_probability": 19
        },
        "Nonprofit Management (SocialEnterpriseTheory)": {
            "my_phase1_final_probability": 19,
            "reasoning_for_revised_probability": "After reviewing both my own initial analysis and the group deliberation, I find strong cross-disciplinary consensus on the low probability scenario for Forethought Foundation exceeding two full-time equivalent employees in 2025. All engaged forecasters, with various theoretical lenses (IRS reporting, Charity Navigator standards, workforce planning, resource dependence, lifecycle models, labor economics), converge on the rarity of FTE expansion in this setting, the lack of organizational signals or news to the contrary, and the specific definitional strictness of FTE under question resolution. Critiques in the deliberation further sharpen the need to distinguish between contractors, part-timers, and true full-time equivalents as per 990 reporting or best-practice definitions. No new evidence or arguments emerged that would push the probability meaningfully higher or lower. Thus, the most justified stance is to maintain the initial, well-calibrated estimate.",
            "revised_probability": 19
        },
        "Labor Economics (TheoryOfLaborDemand)": {
            "my_phase1_final_probability": 19,
            "reasoning_for_revised_probability": "After group deliberation, I find further support for my original forecast. The critiques and defenses reinforced that sector base rates, operational funding realities, and both organizational lifecycle and labor demand theory overwhelmingly support the low probability of Forethought Foundation exceeding two FTEs in 2025. Notably, the IRS Form 990 technical definition and the acute barriers to economies of scale for micro-foundations were brought to the fore, highlighting not only sector inertia but also the powerful cost disincentives for small-scale staff expansion. No peer forecaster offered direct evidence to support raising the probability; in fact, the consensus repeatedly reinforces a strong status quo bias absent external shocks. Thus, I see no justification for adjustment.",
            "revised_probability": 19
        },
        "Labor Economics (ScaleEconomiesTheory)": {
            "my_phase1_final_probability": 19,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, no new evidence or alternate frameworks emerged to tilt the probability away from my initial estimate. All relevant disciplinary perspectives (nonprofit administration, labor economics, organizational sociology, HR) reinforced the extremely low base rate and identified no plausible signals of imminent expansion at the Forethought Foundation. Notably, critiques focused on even more granular reasons for stasis: at this organizational scale, even potential scale economies are marginal or negative, and sectoral/operational inertia is overwhelming in the absence of catalytic external shocks. No countervailing explanatory factor, news, or structural argument supports a higher probability. Therefore, there is no justification to increase the forecast. The probability that the Forethought Foundation will have more than two full-time equivalent employees in 2025 remains solidly at 19%.",
            "revised_probability": 19
        }
    },
    "revision_probability": [
        19,
        19,
        19,
        19,
        19,
        19,
        19,
        19,
        19
    ],
    "revision_mean_probability": 19.0,
    "revision_sd": 0.0,
    "revision_probability_result": 19,
    "question_details": {
        "id": 38963,
        "title": "Will the Forethought Foundation have more than two full-time equivalent employees in 2025?",
        "created_at": "2025-08-31T06:17:43.652036Z",
        "open_time": "2025-09-25T15:39:01Z",
        "cp_reveal_time": "2025-09-25T17:09:01Z",
        "spot_scoring_time": "2025-09-25T17:09:01Z",
        "scheduled_resolve_time": "2025-12-30T23:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-09-25T17:09:01Z",
        "actual_close_time": "2025-09-25T17:09:01Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "This question is synced with an identical question on Metaculus. The original question opened on 2021-07-01 22:00:00 and can be found [here](https://www.metaculus.com/questions/7101). This question will resolve to the same value as the synced question. The original question's background info at this time is below. \n\nThe [Forethought Foundation for Global Priorities Research](https://www.forethought.org/about-us) is a recently launched think tank led by William MacAskill, which \"aims to promote academic work that addresses the question of how to use our scarce resources to improve the world by as much as possible\". It has recently been [hiring](https://forum.effectivealtruism.org/posts/ndEZwLXN8ynLdRkxR/the-forethought-foundation-is-hiring)\n\n`{\"format\":\"metac_closes_in_period\",\"info\":{\"post_id\":7101,\"question_id\":7101}}`",
        "resolution_criteria": "For the purposes of this question, a full-time equivalent is defined as working 35 hours per week, without including volunteers. Question will be resolved negatively if the project has clearly been abandoned, otherwise, reports by the organization together with best estimates by Metaculus moderators will be used",
        "fine_print": "",
        "post_id": 39586,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Zurich Debates 35‑Hour Work Week – Legal Questions Arise**\nThe Zurich city council debate over a 35‑hour work week for public employees has stalled after the finance director Daniel Leupi refused to extend the deadline. The motion, introduced by David Garcia Nuñez (AL) and Anna Graff (SP), seeks to reduce working hours to 35 per week while keeping full pay, targeting staff in the VBZ, police and care sectors. Leupi cited high costs and the risk that reduced hours could leave up to 1,500 specialists short. A legal opinion concluded that a pilot would constitute a 'massive Eingriff in das städtische Recht und insbesondere sein Lohnsystem' and that a statutory framework would be needed to comply with Article 8 of the Swiss Constitution. The motioners accused the council of a delay tactic and demanded the matter be referred to a commission. The council rejected the extension request, leaving Leupi to answer the commission. The debate echoes a 2023 pilot in hospitals where 70 assistant doctors worked 42 hours instead of 46. 45 % of Swiss workers reported that resources and burdens in their work life are just balancing, according to recent surveys. The motioners’ pilot would involve staff in shift work, such as those in the VBZ, police or care sector. Leupi warned that a reduction could result in a shortage of up to 1,500 specialists. The legal opinion noted that the city, as an employer, must treat all employees equally and that a pilot would be a 'massive Eingriff in das städtische Recht und insbesondere sein Lohnsystem'. The motioners’ request for a commission was rejected, and the council will now face questions from commission members.\nOriginal language: de\nPublish date: September 25, 2025 03:15 AM\nSource:[Neue Zürcher Zeitung](https://www.nzz.ch/zuerich/35-stunden-woche-fuer-staedtische-angestellte-zuercher-stadtrat-fuerchtet-juristische-probleme-al-wittert-eine-verzoegerungstaktik-ld.1903802)\n\n**/C O R R E C T I O N -- Insight Global/**\nInsight Global released its 2025 Employee Sentiment Report, revealing that only 35% of the 905 U.S. workers surveyed feel engaged at work and the same percentage feel essential in their roles. The survey, conducted by Atomik Research, found that 4 in 5 workers would stay longer in a role with better onboarding, 22% had left a job within the first 90 days—often due to poor training—and workers are 8 times more likely to feel engaged in a strong workplace culture. Respondents also reported that it takes 6–7 months to feel settled in their role. Brindy Pickett, Vice President of Consultant Engagement at Insight Global, said, 'A defined culture is not a nice‑to‑have. We've found it's a foundational driver of engagement, retention, and performance. If you're intentional about the culture you want, it breeds success.' The report recommends role‑specific onboarding, intentional culture‑building, and connecting daily work to a larger purpose to improve engagement and retention.\nOriginal language: en\nPublish date: September 24, 2025 04:45 PM\nSource:[Advanced Financial Network](https://uk.advfn.com/stock-market/share-news/C-O-R-R-E-C-T-I-O-N-Insight-Global/96879583)\n\n**Mediator assigned as college full-time support staff strike closes in on two weeks**\nOntario full‑time support staff at 24 colleges have been on strike since September 11, 2025 after failing to reach a new contract with the College Employer Council (CEC). A ministry‑appointed mediator has been assigned to help negotiate a settlement. Dayna Smockum, Director of Communications for the Ministry of Colleges, Universities, Research Excellence and Security, said the mediator is ready to support a fair resolution and that the goal is to put students first: 'We remain hopeful that all parties reach a fair deal that puts students first.' OPSEU Local 421 President Tim Prewer said picket lines allow only one vehicle at a time and that the college has not yet met with members; he also highlighted safety concerns and requested a meeting on the line: 'Members would like to be able to have multiple vehicles safely line up off of Wallbridge‑Loyalist Road and further along the college roadway.' CEC CEO Graham Lloyd said the council has offered more than $145 million in wage, benefit and job‑security improvements and is willing to meet in mediation on September 26, 2025, hoping to end the strike: 'Colleges have consistently bargained in good faith and have put forward more than $145 million in improved wages, benefits, and job security, and advised OPSEU of issues it cannot accept.' The strike is expected to close in about two weeks.\nOriginal language: en\nPublish date: September 24, 2025 02:26 PM\nSource:[91x.fm](https://91x.fm/2025/09/24/mediator-assigned-as-college-full-time-support-staff-strike-closes-in-on-two-weeks/)\n\n**Thousands of office workers face having to obey 72-hour rule in UK - Birmingham Live**\nA recent analysis of job postings on Indeed shows that 85% of UK hybrid roles now require employees to work at least two days a week in the office, up from 77% in 2024 and 66% in 2023. 56% of postings expect two office days, 25% require three days, and only 4% specify four days. 15% allow a single office day, down from 22% in 2024, 34% in 2023, and 35% in 2022.  Jack Kennedy, a senior economist at Indeed, said, 'What we're seeing is employers using the softer labour market to push for more face‑to‑face time, whether that's to encourage collaboration, rebuild office culture, or simply because they feel they can.'  A March study of 3,000 UK remote workers found that 67% felt disconnected from colleagues and 49% said this disconnection negatively affected their job perception.  A similar survey by Indeed reported that 45% of US remote workers missed in‑person meetings and 46% missed informal office conversations.\nOriginal language: en\nPublish date: September 24, 2025 06:00 AM\nSource:[Birmingham Mail](https://www.birminghammail.co.uk/news/cost-of-living/thousands-office-workers-face-having-32538009)\n\n**Zurich Debates 35‑Hour Work Week – Legal Questions Arise**\nThe Zurich city council debate over a 35‑hour work week for public employees has stalled after the finance director Daniel Leupi refused to extend the deadline. The motion, introduced by David Garcia Nuñez (AL) and Anna Graff (SP), seeks to reduce working hours to 35 per week while keeping full pay, targeting staff in the VBZ, police and care sectors. Leupi cited high costs and the risk that reduced hours could leave up to 1,500 specialists short. A legal opinion concluded that a pilot would constitute a 'massive Eingriff in das städtische Recht und insbesondere sein Lohnsystem' and that a statutory framework would be needed to comply with Article 8 of the Swiss Constitution. The motioners accused the council of a delay tactic and demanded the matter be referred to a commission. The council rejected the extension request, leaving Leupi to answer the commission. The debate echoes a 2023 pilot in hospitals where 70 assistant doctors worked 42 hours instead of 46. 45 % of Swiss workers reported that resources and burdens in their work life are just balancing, according to recent surveys. The motioners’ pilot would involve staff in shift work, such as those in the VBZ, police or care sector. Leupi warned that a reduction could result in a shortage of up to 1,500 specialists. The legal opinion noted that the city, as an employer, must treat all employees equally and that a pilot would be a 'massive Eingriff in das städtische Recht und insbesondere sein Lohnsystem'. The motioners’ request for a commission was rejected, and the council will now face questions from commission members.\nOriginal language: de\nPublish date: September 25, 2025 03:15 AM\nSource:[Neue Zürcher Zeitung](https://www.nzz.ch/zuerich/35-stunden-woche-fuer-staedtische-angestellte-zuercher-stadtrat-fuerchtet-juristische-probleme-al-wittert-eine-verzoegerungstaktik-ld.1903802)\n\n**/C O R R E C T I O N -- Insight Global/**\nInsight Global released its 2025 Employee Sentiment Report, revealing that only 35% of the 905 U.S. workers surveyed feel engaged at work and the same percentage feel essential in their roles. The survey, conducted by Atomik Research, found that 4 in 5 workers would stay longer in a role with better onboarding, 22% had left a job within the first 90 days—often due to poor training—and workers are 8 times more likely to feel engaged in a strong workplace culture. Respondents also reported that it takes 6–7 months to feel settled in their role. Brindy Pickett, Vice President of Consultant Engagement at Insight Global, said, 'A defined culture is not a nice‑to‑have. We've found it's a foundational driver of engagement, retention, and performance. If you're intentional about the culture you want, it breeds success.' The report recommends role‑specific onboarding, intentional culture‑building, and connecting daily work to a larger purpose to improve engagement and retention.\nOriginal language: en\nPublish date: September 24, 2025 04:45 PM\nSource:[Advanced Financial Network](https://uk.advfn.com/stock-market/share-news/C-O-R-R-E-C-T-I-O-N-Insight-Global/96879583)\n\n**Mediator assigned as college full-time support staff strike closes in on two weeks**\nOntario full‑time support staff at 24 colleges have been on strike since September 11, 2025 after failing to reach a new contract with the College Employer Council (CEC). A ministry‑appointed mediator has been assigned to help negotiate a settlement. Dayna Smockum, Director of Communications for the Ministry of Colleges, Universities, Research Excellence and Security, said the mediator is ready to support a fair resolution and that the goal is to put students first: 'We remain hopeful that all parties reach a fair deal that puts students first.' OPSEU Local 421 President Tim Prewer said picket lines allow only one vehicle at a time and that the college has not yet met with members; he also highlighted safety concerns and requested a meeting on the line: 'Members would like to be able to have multiple vehicles safely line up off of Wallbridge‑Loyalist Road and further along the college roadway.' CEC CEO Graham Lloyd said the council has offered more than $145 million in wage, benefit and job‑security improvements and is willing to meet in mediation on September 26, 2025, hoping to end the strike: 'Colleges have consistently bargained in good faith and have put forward more than $145 million in improved wages, benefits, and job security, and advised OPSEU of issues it cannot accept.' The strike is expected to close in about two weeks.\nOriginal language: en\nPublish date: September 24, 2025 02:26 PM\nSource:[91x.fm](https://91x.fm/2025/09/24/mediator-assigned-as-college-full-time-support-staff-strike-closes-in-on-two-weeks/)\n\n**Council to vote today on motion to rescind Ottawa's return-to-office mandate**\nOn September 24 2025, Ottawa City Council will vote on a motion to rescind the city’s return‑to‑office mandate that requires municipal employees to work five days a week in the office. City Manager Wendy Stephanson announced on August 26 that the mandate would take effect on Jan. 1, stating that a five‑day office standard would strengthen organizational culture and build public trust. Councillor Jeff Leiper will introduce a motion arguing that no evidence shows reduced productivity or taxpayer value under the current hybrid arrangement, and that a five‑day standard would not significantly improve either. The motion would direct the city manager to rescind the mandate and continue to accommodate hybrid work. Horizon Ottawa and several unions—including the Civic Institute of Professional Personnel, the Amalgamated Transit Union, the Canadian Association of Professional Employees and the Public Service Alliance of Canada—will rally outside City Hall to support Leiper’s motion. Tom Ledgley, Coordinator of Horizon Ottawa, said, 'Remote work technology and practices are well‑developed and effective,' and that studies show productivity remains strong when people work from home. Ottawa employs about 17,100 full‑time equivalent positions, with roughly 85 % of staff onsite each day. Stephanson clarified that alternative work arrangements will remain available, and that a regular on‑site presence is 'critical to help strengthen relationships, reinforce team norms, support formal systems and processes, facilitate ongoing knowledge transfer, support mentorship and succession planning, protect the integrity of our corporate memory, build confidence in the city's ability to deliver service excellence, and ultimately strengthen public trust.' The motion comes amid Ontario’s mandate that all members of the Ontario Public Service be in the office four days a week from November, and federal core public service employees must be in the office at least three days a week.\nOriginal language: en\nPublish date: September 24, 2025 12:29 PM\nSource:[Pulse24.com                        ](https://www.cp24.com/news/canada/2025/09/24/council-to-vote-today-on-motion-to-rescind-ottawas-return-to-office-mandate/)\n\n**985 Management Trainees Work 12‑Hour Shifts Daily – Wuling Responds to Recruitment Controversy**\nIn September 2025, a report from the \"Next‑Generation Vehicle Research Institute\" column revealed that Shanghai‑General‑Wuling (SGW) had recruited roughly 800 graduates from 985 and 211 universities as management trainees (管培生).  The trainees reported that, contrary to the 9‑to‑5, five‑day schedule advertised during campus recruitment, they were required to work from 8 a.m. to 8 p.m., six to seven days a week, for a continuous six‑month period before being assigned to a permanent role.  The company’s official statement acknowledged a 6‑month front‑line training period and claimed that a dual‑person rotation system had been introduced to reduce daily hours, but the trainees said the rotation had not yet been implemented.  The column quoted several trainees: ‘I was told the training would be 9‑5 for five days, but after two weeks of hard work I’ve been on the line for a month with no rotation or transfer notice.’  Experts warned that such prolonged, high‑intensity work could compromise product quality and lead to talent loss.  The article also highlighted SGW’s financial pressure: in the first half of 2025 SGW reported revenue of 404.82 billion yuan and a net profit of 5.76 billion yuan, yielding a net margin of only 1.42 %.  Over the past five years, SGW’s revenue has fluctuated while its profit margin has remained low, prompting the parent group to pursue a \"cost‑cutting and efficiency‑boosting\" strategy.  The column noted that the company’s heavy reliance on high‑intensity training for new graduates may backfire by damaging employee morale, product quality, and the firm’s reputation.\nOriginal language: zh\nPublish date: September 24, 2025 10:40 AM\nSource:[驱动之家](https://news.mydrivers.com/1/1076/1076695.htm)\n\n**The Great Flexpectation: 86% of UK workers demand flexible hours as four-day week and work-to-rule go mainstream, Owl Labs report reveals**\nThe Owl Labs State of Hybrid Work Report, released on 24 September 2025, surveyed 2,000 full‑time UK employees and found that 86 % demand flexible hours, with 93 % willing to leave a job that no longer allows remote or hybrid work. 41 % of workers attend the office three days a week, 27 % four days, and only 15 % would prefer full‑time office work. 51 % schedule personal appointments during work hours, and 35 % practice clock‑blocking to protect their time. 44 % have already engaged in work‑to‑rule, 35 % have clock‑blocked, and 44 % participate in coffee‑badging. 73 % view a four‑day week as an important benefit, and 45 % would give up 10 % or more of their salary for it. 79 % consider meetings after 4:30 pm too late, while 80 % of managers reject them. 68 % believe employers should provide more flexibility for those who need it most, such as working parents. 84 % overall say the ability to work in a range of locations is key to job satisfaction. 75 % of employers actively encourage AI adoption, and 87 % of employees already use AI at work.  ‘Our data demonstrates that hybrid working is no longer just about when and where we work. Rather, the rise in trends like coffee badging and work‑to‑rule demonstrates that UK employees are also looking for true fluidity in how they work,’ said Frank Weishaupt, CEO of Owl Labs. The report highlights that technology—especially AI tools, IT support and upgraded meeting room equipment—has become a top priority for organisations seeking to support flexible work arrangements.\nOriginal language: en\nPublish date: September 24, 2025 07:06 AM\nSource:[FinanzNachrichten.de](https://www.finanznachrichten.de/nachrichten-2025-09/66518288-the-great-flexpectation-86-of-uk-workers-demand-flexible-hours-as-four-day-week-and-work-to-rule-go-mainstream-owl-labs-report-reveals-004.htm)\n\n**Thousands of office workers face having to obey 72-hour rule in UK - Birmingham Live**\nA recent analysis of job postings on Indeed shows that 85% of UK hybrid roles now require employees to work at least two days a week in the office, up from 77% in 2024 and 66% in 2023. 56% of postings expect two office days, 25% require three days, and only 4% specify four days. 15% allow a single office day, down from 22% in 2024, 34% in 2023, and 35% in 2022.  Jack Kennedy, a senior economist at Indeed, said, 'What we're seeing is employers using the softer labour market to push for more face‑to‑face time, whether that's to encourage collaboration, rebuild office culture, or simply because they feel they can.'  A March study of 3,000 UK remote workers found that 67% felt disconnected from colleagues and 49% said this disconnection negatively affected their job perception.  A similar survey by Indeed reported that 45% of US remote workers missed in‑person meetings and 46% missed informal office conversations.\nOriginal language: en\nPublish date: September 24, 2025 06:00 AM\nSource:[Birmingham Mail](https://www.birminghammail.co.uk/news/cost-of-living/thousands-office-workers-face-having-32538009)\n\n**UK white-collar recruits expected in office more as hybrid working balance shifts**\nThe Guardian article reports that UK white‑collar job adverts now demand more in‑office days than during the post‑pandemic period. 85 % of hybrid roles posted on Indeed require at least two days a week in the office, up from 77 % in 2024 and 66 % in 2023. 56 % of postings expect two office days, 25 % require three, and only 4 % specify four days. 15 % allow a single office day, down from 22 % in 2024 and 34 % in 2023.  Accounting roles average 2.4 office days, HR and IT 2.3, software developers 2.3 (an increase of 0.6 days since 2023), while architecture and social science roles average 1.6 days.  Regional variation shows the north‑east England requiring 2.7 days, Wales and south‑west England 2.3, London and Scotland 2.2.  Amazon now mandates a full five‑day office schedule.  In response, some employers offer a casual office dress code, which is 10 × higher as of July 2025 than before 2020, yet remains only 3.3 % of UK postings.  Jack Kennedy, a senior economist at Indeed, said: 'What we're seeing is employers using the softer labour market to push for more face‑to‑face time, whether that's to encourage collaboration, rebuild office culture, or simply because they feel they can. But workers continue to prize flexibility, and many will think carefully before accepting roles that don't offer it.'\nOriginal language: en\nPublish date: September 24, 2025 05:00 AM\nSource:[The Guardian](https://www.theguardian.com/money/2025/sep/24/uk-jobs-back-to-office-hybrid-working)\n\n**SAIC‑GM‑Wuling Autumn Recruitment Sparks Controversy as 985 Management Trainees Complain of 12‑Hour Shifts: Feeling Deceived**\nSAIC‑GM‑Wuling’s 2025 management‑training cohort, comprising about 800 graduates from 985 and 211 universities, reported that the company’s recruitment promises were not met. The company advertised a '955' work system (9 am–5 pm, five days a week) and a 1‑to‑3‑month on‑the‑job training period. Instead, trainees were sent to the Liuzhou plant’s assembly line where they work from 8 am to 8 pm, six to seven days a week, for 12 hours per day. One trainee said, '每天从早8点干到晚8点，一周工作六至七天，已经在产线待了一个月，没听到任何轮岗、调离的消息。' The company replied that the training period had been adjusted to six months and that shift rotation would reduce daily hours, but trainees claim the adjustment was only announced after they had begun work. Several trainees have resigned or are preparing for graduate school, and a few have reported injuries. Parents have expressed dissatisfaction, saying the company’s approach 'does not care about employees' and is not humane. Experts note that tasks such as screw tightening and body polishing require skilled workers and that long, high‑intensity shifts can lead to errors and safety risks.\nOriginal language: zh\nPublish date: September 24, 2025 02:07 AM\nSource:[驱动之家](https://news.mydrivers.com/1/1076/1076530.htm)\n\n**Address Discrimination (Especially Given RTO), and Other Actions for Allies**\nReturn‑to‑office (RTO) mandates are rising, with Microsoft announcing that beginning February 2026 many employees will be required to work from the office at least three days a week. The newsletter cites research by Laura Doering, PhD and András Tilcsik, PhD that shows women in hybrid roles experience higher rates of bias, exclusion and discrimination, especially younger women or those in male‑dominant teams. The author urges allies to confront discrimination rather than 'pushing women into remote roles as a way of trying to get around the issue.' Hady Méndez’s book *Calladita No More* is highlighted, with her quote: 'I find that when I partner with people that think differently, we end up with an even greater outcome. It is like the idea that 1 + 1 – 3.' The newsletter discusses the 'Let Them' theory controversy, noting Cassie Phillips’ 2022 poem and Mel Robbins’ 2023 book, and encourages proper attribution. A Facebook post by '30AF' is quoted: 'PSA for employers in 2025: Don’t Mind the Gap. Seriously. It doesn’t matter. If the job candidate has background experience that qualifies them for the role and their interview ticks the boxes of who you want in this position, the fact that they didn’t work for 8 months 5 years ago is equal parts irrelevant and none of ur business.' The author recommends inclusive hiring practices, citing an EEO statement that explicitly mentions ‘length of time spent unemployed.’ Ben Swanson shares an ally action: sending interview questions in advance and copying them into the chat for candidates with auditory processing challenges. The newsletter ends with a call to action for readers to share their ally steps.\nOriginal language: en\nPublish date: September 19, 2025 01:13 PM\nSource:[Code Like A Girl](https://code.likeagirl.io/address-discrimination-especially-given-rto-and-other-actions-for-allies-3f01a9ac0fe6)\n\n**PERSOL Global Workforce and Shareful Co‑host Seminar on 9/26**\nPERSOL Global Workforce Co., Ltd. and Shareful Co., Ltd. announced a joint seminar scheduled for Friday, September 26 2025, to address the acute labor shortage in Japan’s food‑service sector. The seminar, titled \"New Norms in a Recruitment‑Hard Era: Hybrid Human‑Resource Strategy Using Skima‑Baito and Foreign Talent to Resolve Staffing Shortages in Restaurants,\" will be held online via Zoom from 14:00 to 15:00 and is free for pre‑registered participants. The target audience is HR and recruitment professionals who are concerned about future staffing shortages, current hiring difficulties, or overall recruitment challenges.\n\nBackground: According to a 2023 study by the Persol Research Institute and Chuo University, Japan’s labor demand in 2030 is projected at 70.73 million workers, while supply is expected to be only 64.29 million, creating a shortfall of 6.44 million workers. The seminar will discuss how short‑term gig work (Skima‑Baito) and foreign‑worker recruitment can help mitigate this gap, especially in the restaurant industry.\n\nKey details:\n- Date & time: 2025‑09‑26, 14:00–15:00\n- Format: Zoom webinar\n- Cost: Free (pre‑registration required)\n- Speakers: Sato Daisuke, Director of Sales at PERSOL Global Workforce; Terashima Shunichiro, General Manager of Shareful’s First Sales Division.\n- Shareful’s Skima‑Baito app currently serves about 10 million users, connecting individuals seeking short‑term work with companies needing temporary staff.\n\nBoth companies highlighted their missions: PERSOL Global Workforce focuses on supporting foreign talent under the \"Special Skill\" and \"Technical/Intellectual/International Business\" visa categories, while Shareful aims to expand the labor‑sharing market by enabling quick, one‑day hiring without resumes.\n\nThe seminar will feature real‑world case studies illustrating how combining gig workers and foreign talent can alleviate staffing shortages in restaurants.\n\nFor more information, participants can register at https://s.sharefull.com/lp/wp/webinar_250926/index.html.\nOriginal language: ja\nPublish date: September 19, 2025 02:40 AM\nSource:[ASCII.jp](https://ascii.jp/elem/000/004/320/4320988/)\n\n**Shark Tank's Kevin O'Leary disagrees with Microsoft on key issue**\nThe article reports that Microsoft (MSFT) will require employees living within 50 miles of its Redmond, Washington headquarters to work onsite at least three days per week by February 2026, aligning the company with other large employers such as Meta, Google, JPMorgan, and Amazon that have tightened return‑to‑office (RTO) policies. Microsoft has laid off more than 15,000 workers since early 2025, and the RTO mandate is seen by some as a tool for workforce reduction. The policy will affect 53,000 employees based at the Redmond campus, potentially increasing traffic in the Puget Sound area. Kevin O’Leary, a Shark Tank investor, publicly criticized the 9‑to‑5 office model, stating on LinkedIn: 'I don't believe in the 9 to 5 job market any more. None of my team works in an office any more because they don't want to. We have people working for us all around the world. We somehow are very, very productive and that's the new economy.' He added, 'I don't care when you get it done. I don't care if it's two in the morning or eight in the morning. There is no 9 to 5. Just get it done by the deadline.' The article notes that RTO policies are increasingly used as a performance metric and a subtle way to prompt resignations or terminations. It also highlights criticism of Microsoft’s continued H1‑B visa hiring amid layoffs and the broader national trend of shifting away from remote work as a default.\nOriginal language: en\nPublish date: September 15, 2025 12:08 AM\nSource:[TheStreet](https://www.thestreet.com/personal-finance/shark-tanks-kevin-oleary-disagrees-with-microsoft-on-key-issue)\n\n**End of Home Office in 2025? Understanding the Current Scenario**\nThe article discusses the possible end of home office in Brazil by 2025, highlighting a growing trend toward in‑person work among large companies while noting that remote work remains highly valued by employees. According to a survey by Grupo Top RH with Infojobs, '85,3% of Brazilian professionals would change jobs for more remote days per week', indicating strong demand for flexibility. Market data from Gupy shows that only '5% of job postings in June 2024 were fully remote', compared with '87,2% that were in‑person', and the number of in‑person hires rose from 55,000 in April 2023 to 87,000 in April 2024. The IBGE reports that just '8,3% of Brazilian workers work exclusively remotely'. Major global firms such as Amazon and Apple have already implemented partial return policies, requiring employees to be in the office at least three days a week. The article warns that abrupt termination of remote work can lead to employee resistance, lower motivation, higher turnover, and deteriorating workplace culture. It also outlines the legal framework under Brazil’s Consolidated Labor Laws (CLT), which allows employers to mandate a return to the office with a minimum 15‑day notice and a contractual addendum, but employees may retain remote work if health risks are proven. Finally, the piece suggests hybrid work as a balanced solution, citing ABRH Brasil research that shows hybrid models are as popular as fully in‑person arrangements. The article is presented in an objective, data‑driven tone without editorial bias.\nOriginal language: pt\nPublish date: September 14, 2025 02:00 PM\nSource:[Portal Contabeis](https://www.contabeis.com.br/noticias/72785/fim-do-home-office-em-2025-entenda-o-cenario-atual/)\n\n**Korean Student Aid Foundation hires 33 new staff and 2 part‑time workers**\nOn August 22, 2025, the Korean Student Aid Foundation (한국장학재단) announced that it will recruit 33 new full‑time employees and 2 new part‑time workers for the 2025 general staff hiring and the 2025 second‑half open hiring. The 33 full‑time positions are divided into 23 general administration (5th grade), 5 IT development & operation, 2 information security, and 3 6th‑grade administrative support. The two part‑time positions are one field‑training support project manager and one central employment support center operations assistant. The foundation increased the general staff quota by 50 % from last year and introduced a new information‑security role. It also plans to give extra points to candidates with disabilities, veterans, and self‑reliance‑preparation youth, and to target talent from Daegu, Gyeongbuk, and other non‑metropolitan areas. Applications close September 4 at 6 p.m. on the foundation’s recruitment website. The full‑time selection process will include written test, written exam in late September, practical interview in late October, and in‑depth interview in early November, with final results announced November 14. The part‑time process will have written test in early September, interview in mid‑September, and final results announced September 30.\nOriginal language: ko\nPublish date: August 22, 2025 02:02 AM\nSource:[아시아경제](https://www.asiae.co.kr/article/2025082211010182433)\n\n**Gyeonggi Province Job Foundation Releases Report on 0.5&0.75 Job Program**\nThe Gyeonggi Province Job Foundation has released a report on the '0.5&0.75 job' program, which allows public institution employees to work 20-38 hours a week. The report found that participants used the program for various reasons, including self-development (48%), childcare and education (28%), and health and leisure. The program's 'hybrid' work system, which allows employees to work 32-38 hours a week without adjusting their workload, was highly praised by users. However, the report also noted that the program's entry barrier is the reduction in wages, with 44% of respondents expressing negative opinions on continuing to use the program after the wage support ends. The report concludes that the program's success depends on the organization's culture, and that a mutual understanding and respect culture is essential for the program's successful implementation. 'The 0.5&0.75 job program is not just a simple work-time reduction policy, but a effective alternative for achieving work-life balance,' said Kim Min-young, a researcher at the Gyeonggi Province Job Foundation. 'As it is a new type of work system, it is necessary to encourage the use of the program through some support, such as wage support, until the program is fully established.'\nOriginal language: ko\nPublish date: August 07, 2025 10:26 PM\nSource:[아시아경제](https://www.asiae.co.kr/article/2025080807264586286)\n\n**Gyeonggi Province Selects 47 Additional Companies for 4.5-Day Workweek Pilot Project**\nGyeonggi Province and the Gyeonggi Province Job Foundation announced the selection of 47 additional companies for the '2025 Gyeonggi 4.5-day workweek pilot project' through the second round of recruitment. The province initially selected 50 companies, but received 105 applications, leading to a second round of recruitment. The second round saw 54 companies apply, with 47 being selected as 4.5-day workweek pilot companies. The selected companies include 25 small and medium-sized enterprises with 10-30 employees, 19 with 30-100 employees, and 3 with over 100 employees. The pilot project aims to reduce working hours through labor-management agreements, without reducing wages, and to create a healthy work environment. The selected companies will receive up to 260,000 KRW per employee per month in wage preservation incentives and up to 20 million KRW in support for improving work processes, consulting, and attendance management systems. Gyeonggi Province Labor Director Choi Hong-gyu said, 'We appreciate the high interest and active participation of companies in the second round of recruitment' and 'expect the project to contribute to improving the work-life balance of workers and enhancing the competitiveness of companies.' The province plans to continue recruiting and selecting companies to promote the 4.5-day workweek and measure its effectiveness.\nOriginal language: ko\nPublish date: July 15, 2025 10:23 AM\nSource:[아시아경제](https://www.asiae.co.kr/article/2025071519233807611)\n\n**AI talent war: OpenAI executives slam Meta's aggressive hiring approach - The Economic Times**\nThe war for AI talent is intensifying between Meta and OpenAI. Mark Zuckerberg's Meta has been aggressively hiring and offering signing bonuses as high as $100 million to OpenAI employees, including top researchers. OpenAI's chief research officer, Mark Chen, has addressed Meta's tactics in a memo to employees, saying 'I feel a visceral feeling right now, as if someone has broken into our home and stolen something.' Chen also stated that OpenAI is 'recalibrating comp' and 'scoping out creative ways to recognise and reward top talent.' The report notes that OpenAI staff are working long hours, with some employees working 80 hours per week, and the company is shutting down next week to give employees time to recharge. However, Chen warned that Meta may try to poach top talent during this time, saying 'Meta knows we're taking this week to recharge and will take advantage of it to try and pressure you to make decisions fast and in isolation.'\nOriginal language: en\nPublish date: June 30, 2025 07:09 AM\nSource:[Economic Times](https://economictimes.indiatimes.com/tech/artificial-intelligence/ai-talent-war-openai-executives-slam-metas-aggressive-hiring-approach/articleshow/122155120.cms)\n\n**Emplois d'été Canada 2025: A Program to Support Young People**\nThe Emplois d'été Canada (EEC) program is part of the Stratégie emploi et compétences jeunesse (SECJ), a horizontal initiative of the Government of Canada implemented jointly by 12 federal ministries, organizations, and state-owned companies. The SECJ helps young people (15-30 years old), particularly those facing employment obstacles, to obtain employment support, skill-based training, and professional experience needed to integrate the labor market. The EEC program, administered by Emploi et Développement social Canada, provides salary subsidies to non-profit and public sector employers, as well as private sector organizations with 50 or fewer full-time employees, to offer quality summer jobs to young people aged 15-30. The funded jobs allow young people to improve their skills or acquire new ones. For many young people, it is their first work experience, which will influence their future education and career choices. The program takes into account national and local priorities, as well as labor market needs. Projects that support young people facing employment obstacles are prioritized, including those with disabilities, Indigenous youth, Black or 2ELGBTQI+ youth, and youth from racialized groups, rural or remote communities, or minority language communities. By offering young people equal opportunities to improve their skills, EEC facilitates their success in the labor market. The jobs funded by the EEC program are full-time (30-40 hours per week) and last 6-16 weeks, with an average of 8 weeks at 35 hours per week. The hiring period for young people for 2025 runs from April 21 to July 21, 2025, and the jobs will end no later than August 30, 2025. Up to 76,000 jobs counting for young people and our communities will be posted on the Government of Canada's Job Bank website and mobile app, which will be regularly updated. Young people can therefore frequently check the Job Bank to see which new jobs are offered in their community.\nOriginal language: fr\nPublish date: June 06, 2025 05:21 PM\nSource:[Government of Canada](https://www.canada.ca/fr/emploi-developpement-social/nouvelles/2025/06/document-dinformation--emplois-dete-canada-2025.html)\n\n",
    "date": "2025-09-25T15:40:08.671686",
    "summary": "All eight forecasting experts, each drawing on distinct but overlapping disciplinary perspectives (Nonprofit Administration, Human Resources, Organizational Sociology, Nonprofit Management, and Labor Economics), independently conclude that the probability the Forethought Foundation will have more than two full-time equivalent (FTE) employees in 2025 is low—each providing a final estimate of 19%. Their consensus is based on multiple factors: (1) historical pattern of lean staffing (typically 1-2 core employees, supplemented by contractors, part-timers, or academic fellows), (2) base rates for similarly sized and mission-aligned nonprofits and think tanks (especially in the Effective Altruism ecosystem), (3) lack of recent public hiring announcements or signals of rapid expansion, (4) conservative funding and hiring trends post-FTX within the EA sector, and (5) sectoral norms and incentives favoring flexibility and low administrative overhead. While all identify a scenario involving major new grants or a strategic pivot that could push the organization above two FTEs, they judge this outcome unlikely due to the absence of corresponding signals in funding, project pipeline, or operational reporting. No viable news signals or sectoral shifts were found to raise the baseline probability, and all experts highlight that the default for such organizations is to remain small in headcount unless a pronounced external catalyst emerges. Thus, they jointly forecast a 19% chance that the Forethought Foundation will exceed two FTEs in 2025, with the overwhelming likelihood placed on status quo continuity or shrinkage.",
    "forecasters": [
        "Nonprofit Administration (IRSForm990StaffingStandards)",
        "Nonprofit Administration (CharityNavigatorEvaluationCriteria)",
        "Human Resources (WorkforcePlanningBestPractices)",
        "Organizational Sociology (ResourceDependenceTheory)",
        "Organizational Sociology (InstitutionalIsomorphism)",
        "Nonprofit Management (LifeCycleModelNonprofits)",
        "Nonprofit Management (SocialEnterpriseTheory)",
        "Labor Economics (TheoryOfLaborDemand)",
        "Labor Economics (ScaleEconomiesTheory)"
    ]
}