{
    "deliberation_results": {
        "Nuclear Policy (NonProliferation Treaty Regime)": {
            "time_to_resolution": "Less than 2 months (the question resolves January 1, 2026; today is November 6, 2025)",
            "perspective_relevance": "As a nuclear policy and NPT regime expert, I assess the likelihood of IAEA access using deep familiarity with IAEA-Iran negotiation history, NPT compliance norms, diplomatic leverage points (e.g. sanctions, military pressure), and the patterns by which access has been granted or denied in crisis periods. I can evaluate the interplay of external pressure, Iranian internal politics, legal obligations, and technical realities of uranium management—insights critical to judging the plausibility of timely renewed inspections.",
            "status_quo": "Currently, Iran is denying the IAEA access to its main uranium stockpile sites at Fordow, Natanz, and Isfahan. September’s inspection deal was quickly voided; IAEA officials report no progress and access remains blocked. Iran’s official stance is that material remains buried under rubble, and it will not allow inspections while snapback sanctions are in effect.",
            "perspective_derived_factors": [
                {
                    "factor": "Diplomatic Collapse and Hostility",
                    "effect": "Decreases probability. Following the June war, Iran-IAEA/West relations have deteriorated further, with Iran repeatedly accusing the IAEA of bias, voiding the September agreement due to sanctions, and refusing negotiations with the US under current conditions. Trust is at a nadir."
                },
                {
                    "factor": "Snapback Sanctions and Conditionality",
                    "effect": "Decreases probability. The explicit linkage of IAEA cooperation to the lifting of snapback sanctions and cessation of hostilities, both of which remain in place and show no sign of imminent reversal, sharply reduces prospects for near-term access."
                },
                {
                    "factor": "Technical/Physical Barriers to Inspection",
                    "effect": "Decreases probability. Iran claims uranium is literally buried in bombed-out sites; even if access were granted, immediate inspections might be technically difficult or require time-consuming safety preparations."
                },
                {
                    "factor": "Potential Leverage via Threat of Renewed Military Action",
                    "effect": "Slightly increases probability. The prospect of further Israeli/US attacks if IAEA access is denied is a historic motivator for some Iranian concessions, and is discussed by experts. However, so far this threat has not shifted Iran’s calculus."
                },
                {
                    "factor": "Precedent of Last-Minute Concessions",
                    "effect": "Marginally increases probability. Iran has, under extreme pressure, made late-stage inspection concessions in the past (e.g. 2015 JCPOA negotiations). The short time window and international attention create a non-zero chance Tehran could reverse course to forestall escalation or greater isolation."
                },
                {
                    "factor": "Iranian Domestic Political Dynamics",
                    "effect": "Decreases probability. Current regime posture—parliament's overwhelming vote to suspend IAEA cooperation, alignment of leadership in anti-West stance, and present nationalist sentiment—makes a rapid policy reversal politically costly."
                },
                {
                    "factor": "China/Russia Mediation or Pressure",
                    "effect": "Very slightly increases probability. China has urged restoration of talks. However, their practical leverage is limited by the broader context of hardline Iranian policy and Western disengagement."
                }
            ],
            "no_scenario": "Iran continues to refuse IAEA access to its uranium stockpile sites, citing snapback sanctions, ongoing security concerns, and the absence of progress on diplomatic or sanctions relief. The IAEA is unable to verify or inspect the relevant facilities before January 1, 2026. The standoff persists, perhaps punctuated by rhetorical or symbolic gestures, but no binding agreement on renewed access is announced.",
            "yes_scenario": "Facing the imminent threat of further Israeli/US strikes or a credible, unified international ultimatum (perhaps with some mediated incentive from China/Russia or via backchannel European overtures), Iran announces—likely late in December—an agreement to permit the IAEA to inspect its uranium stockpiles at Fordow, Natanz, and Isfahan. This announcement is made under extreme pressure, seeking to defuse an international or military crisis. Actual access may not occur before January, but the formal announcement is made in time.",
            "final_reasoning": "Base rate analysis indicates Iran historically delays or suspends IAEA access for months or years after crises—a delayed return to compliance is common, with immediate reversals rare under conditions of maximal hostility and sanctions. The present confluence—deep postwar mistrust, active snapback sanctions, parliamentary mandates against cooperation, and Iran's explicit use of IAEA access as leverage—makes a 2025 breakthrough unlikely. Only the extreme specter of imminent military escalation, perhaps in December, could force a last-minute concession, but current momentum is against it: no indications of diplomatic movement, Iran's political elite are united against concessions, and Western policy (sanctions, political hardening) remains unchanged. The technical barrier (stockpile 'under rubble') and the time required to set up inspection logistics further diminish the plausibility of an access deal. On balance, the probability of a yes outcome before 2026 is well below parity, though not absolutely zero given Iran's record of brinksmanship reversals. Net: 90% chance Iran does NOT announce agreement before the deadline. 10% chance of a late-stage, pressure-driven reversal.",
            "final_probability": 10
        },
        "Nuclear Policy (IAEA Safeguards System)": {
            "time_to_resolution": "Less than 2 months (until December 31, 2025)",
            "perspective_relevance": "My expertise in the IAEA safeguards system, Iran’s compliance history, and the interplay between international political dynamics and nuclear oversight allows for an informed analysis of both technical and diplomatic pressure points affecting the likelihood Iran resumes cooperation by granting inspections of its enriched uranium stockpile before 2026.",
            "status_quo": "As of November 2025, Iran has suspended cooperation with the IAEA following the June 2025 war, the September snapback of UN sanctions by European powers, and only Bushehr has been inspected since. The September agreement to resume inspections at Isfahan, Fordow, and Natanz has been voided. Iranian officials have repeatedly stated material is 'under rubble,' and no inspections of bombed sites are planned. The IAEA continues to demand access but is denied.",
            "perspective_derived_factors": [
                {
                    "factor": "Precedent of Suspension Post-Conflict & Political Hostility",
                    "effect": "Decreases probability. Iran has a record of ceasing IAEA cooperation after perceived threats or attacks (as after earlier sabotage or sanctions), and the politics post-war—including accusations that IAEA reporting justified Israeli strikes—have hardened negative sentiment."
                },
                {
                    "factor": "Legal and Treaty-Based Obligations (NPT, CSAs)",
                    "effect": "Increases probability. Iran remains a party to the NPT and has not legally withdrawn from its Comprehensive Safeguards Agreement, so there is legal pressure to eventually allow inspections—especially as Iran has openly not exited the treaty so as to avoid \"North Korea status.\""
                },
                {
                    "factor": "Linkage to Sanctions and Diplomatic Leverage",
                    "effect": "Mixed; slightly increases probability. The 'snapback' of UN sanctions by E3/US has decreased Iranian willingness to cooperate, but it also creates incentives: Iran could try a last-minute inspection offer to demonstrate compliance, divide Western negotiators, or build support from China/Russia before further sanctions effects set in."
                },
                {
                    "factor": "Security/Technical Obstacles",
                    "effect": "Decreases probability. With the stockpile physically under rubble in heavily bombed and possibly unstable underground sites, even if a political decision is made, technical and safety hurdles (and perhaps genuine uncertainty about the state of the material) could delay or frustrate actual inspection before 2026."
                },
                {
                    "factor": "Military/Diplomatic Deterrence and Risk of Further Strikes",
                    "effect": "Slightly increases probability. Threats (explicit or implied) from Israel or the US to conduct renewed military action if the uranium's status remains opaque may motivate some limited, controlled inspection as a de-escalatory gesture—though only if Iran believes such an action will avert new attacks."
                },
                {
                    "factor": "Internal Iranian Politics and Decision-Making",
                    "effect": "Decreases probability. The Iranian security establishment/Supreme National Security Council must approve access, and hardliners’ anti-IAEA stance is currently ascendant after blaming the agency for legitimizing strikes."
                },
                {
                    "factor": "Base Rates and Prior Episodes",
                    "effect": "Slightly increases probability. Despite prevarication, Iran has a track record of eventual tactical compliance under acute pressure, especially where total isolation or renewed kinetic action is threatened (e.g., previous 'final hour' technical cooperation gestures during the JCPOA’s crises)."
                }
            ],
            "no_scenario": "Iran continues to cite rubble, sanctions, security, and 'principled resistance' to perceived Western aggression as the rationale for denying inspectors. Hardliners overrule any attempt at partial cooperation. The IAEA threatens (but does not execute) referral to the Security Council. Instead, Iran seeks China/Russia diplomatic cover and gambles that the regional status quo is preferable to further Western escalation. Technical, political, and security obstacles—plus Iranian sensitivity to loss of face domestically—preclude any agreement before January 1, 2026.",
            "yes_scenario": "Spiking concerns of imminent Israeli/US military follow-up, escalating economic costs from renewed UN sanctions, or a credible PRC/Russian mediation package lead the Iranian Supreme National Security Council to pivot—at least tactically—and announce a narrow, face-saving agreement for the IAEA to access the stockpiled uranium sites. They tightly stage-manage access (possibly only to part of the material), but the IAEA confirms an inspection is agreed to before December 31, 2025. This is positioned as temporary/conditional but meets the resolution criteria.",
            "final_reasoning": "The base rate for Iran reversing hardline IAEA restrictions under acute pressure is not negligible—under the JCPOA and post-Stuxnet, Iran has eventually opted for tactical cooperation when fully isolated or facing the real risk of force. Nevertheless, the current context is especially antagonistic: The September 2025 agreement has been voided and, more importantly, Iran’s leadership has politically and publicly linked inspections to Western 'aggression' and the snapback sanctions. The Supreme National Security Council’s approval remains a hard constraint. However, Israel’s clear threatening posture (possibly preparing new strikes if opacity persists) and the risk of renewed or intensified pressure give Iran a rationale for a controlled, last-minute gesture if needed. Logistically, the uranium remains under destroyed tunnels/rubble, which adds non-trivial technical barriers even if access is agreed. Given the extreme time pressure (<2 months), the absence of signals of an imminent inspection deal, and the repeated hardening of Iran’s position just weeks before deadline, the probability is well below 50%. However, the danger of further escalation suggests a non-negligible chance for abrupt tactical reversal. Thus, my initial probability is 18%.",
            "final_probability": 18
        },
        "Diplomacy (Track Two Diplomacy)": {
            "time_to_resolution": "Approximately 8 weeks (today is November 6, 2025, so the question resolves January 1, 2026).",
            "perspective_relevance": "As a Track Two Diplomacy expert, I bring a nuanced understanding of unofficial and semi-official dialogue, backchannel communication, and crisis management in highly adversarial situations where formal diplomacy is stymied. This lens is critical: when formal talks collapse (as seen here between Iran and the IAEA) and overt hostilities/retaliation risk escalation, Track Two and backchannel efforts often make the difference between intractable standoffs and last-minute, face-saving compromise.",
            "status_quo": "Iran has ‘voided’ the September 9 agreement to allow IAEA inspections of its stockpiles at bombed facilities (Fordow, Natanz, Isfahan). Since the June war, Iran has blocked access to these sites, although it is theoretically still an NPT signatory. As of now, no inspections of the 60% enriched uranium stockpile are permitted, and IAEA chief Grossi is publicly voicing urgent concerns over the lack of transparency. No imminent breakthrough is visible.",
            "perspective_derived_factors": [
                {
                    "factor": "Track Two Diplomatic Channels and Third-Party Mediation Potential",
                    "effect": "Slightly increases probability. Even when official relations break down, ongoing communication via Egypt, China, or other regional actors can create last-minute deals—especially if Iran seeks to avoid another military strike or further economic collapse. However, the time window is very narrow."
                },
                {
                    "factor": "Domestic Iranian Political Calculus (Hardliners vs. Moderates)",
                    "effect": "Decreases probability. With Iranian parliament overwhelmingly voting to suspend cooperation, and regime hardliners leveraging anti-IAEA sentiment after Israeli/US strikes, political risk for a sudden reversal is extremely high until/unless the Supreme Leader sees existential benefit in a tactical concession."
                },
                {
                    "factor": "Military Deterrence and Threat of Renewed Strikes",
                    "effect": "Increases probability. The credible threat of a new Israeli or US strike if enriched uranium cannot be accounted for could force Iran's hand in marginally reopening access as a crisis-avoidance measure, particularly if backchannel ultimatums are delivered by the US or regional intermediaries."
                },
                {
                    "factor": "International Sanction Pressure (UN/EU Snapback)",
                    "effect": "Marginally increases probability. With UN nuclear sanctions now reimposed (via the 'snapback'), the economic costs of total isolation may incentivize partial, time-limited inspection access—but more likely if Iran can present this as being in exchange for sanctions relief, which seems unlikely to materialize before deadline."
                },
                {
                    "factor": "Operational/Technical Barriers",
                    "effect": "Decreases probability. The uranium is 'under rubble' in bombarded, unsafe facilities, and Iran can (plausibly, in the short term) claim that technical safety or reconstruction challenges prevent meaningful inspections before January 2026, even if the intention to cooperate is signaled in principle."
                },
                {
                    "factor": "Time and Negotiation Dynamics",
                    "effect": "Decreases probability. The short window (less than 2 months), history of brinksmanship, and Iran's track record of eleventh-hour compliance (or delay) make a new agreement before January unlikely unless a true crisis materializes."
                }
            ],
            "no_scenario": "Iran continues denying IAEA access through the end of 2025, citing national security, technical/reconstruction barriers, or refusing cooperation as long as sanctions remain, and as retaliation for perceived IAEA bias and Western aggression. No new agreement is announced, or only a vague intention, not a formal deal, is registered. Backchannel talks continue, but are insufficient to break the impasse before the Jan 1 deadline.",
            "yes_scenario": "In a bid to avoid a new military strike (as Israeli rhetoric heats up about 'unresolved' enriched uranium) or devastating new sanctions, Iran's Supreme National Security Council authorizes a symbolic, time-limited IAEA inspection of the bombed sites before year's end—perhaps after mediation by Egypt, Russia or China. Iran frames this both as a technical assessment (verifying the uranium is still present and not diverted) and a demonstration of its continued NPT commitment, but only with safeguards for its nuclear scientists and national prestige.",
            "final_reasoning": "The diplomatic and technical environment is extremely unfavorable for a breakthrough. After IAEA censure, renewed war, and the voiding of the last agreement, official Iranian channels are entrenched in defiance, with hardliners seeking leverage from crisis. While the threat of another military strike (or even rumors of imminent action) could force a narrow, last-minute tactical concession, this is unlikely given the short window, lack of ongoing formal negotiation, and Iran's ability to plausibly delay based on site safety or politics. The only plausible way this resolves Yes is if Track Two or third-party mediation (e.g., by China or Egypt) can rapidly broker a face-saving deal for minimal, symbolic access—essentially a repeat of past last-minute confidence-building measures in the region. Track Two actors will be active, but the window is so short, political incentives so adversarial, and technical obstacles so real that the base rate of sudden pre-deadline reversals after formal suspension is low. Historically, in post-crisis NPT standoffs with intense polarization (North Korea, past Iran episodes), reversals within 2 months are rare unless an existential threat is perceived or sanctions relief is concrete. Thus, my initial probability, integrating base rates, the immediate status quo, and Track Two potential, is low but not zero: 18%.",
            "final_probability": 18
        },
        "Diplomacy (International Negotiation Practice)": {
            "time_to_resolution": "Approximately 8 weeks until January 1, 2026.",
            "perspective_relevance": "Diplomacy, especially international negotiation practice, offers insight into the pressures, incentives, and sequencing involved in crisis diplomacy, back-channel talks, sanctions leverage, and the way parties can trade transparency for concessions or security reassurances—even under extreme distrust and recent hostilities. Understanding Iran's historical approach to inspections, as well as the interplay between technical realities and public diplomacy, sharpens our evaluation of short-term negotiation vs. intransigence.",
            "status_quo": "Iran is currently NOT allowing IAEA inspections at its enriched uranium stockpiles in Fordow, Natanz, and Isfahan. Cooperation has been suspended, contingent agreements have collapsed, and the only allowed inspections have occurred at the Bushehr plant.",
            "perspective_derived_factors": [
                {
                    "factor": "Sanctions and Diplomatic Isolation",
                    "effect": "Increase probability moderately—restored UN/EU sanctions (snapback mechanism) increase Iran’s incentive to offer limited transparency to ease economic pressure. However, this avenue is weaker given Iran’s history of resilience and alternative partnerships (China/Russia)."
                },
                {
                    "factor": "Security and Risk of Further Strikes",
                    "effect": "Increase probability somewhat—Immediate threat from Israel or the US if uranium status remains ambiguous could motivate Iran to negotiate an inspections deal to prevent renewed military action. However, Iran may calculate that temporary opacity prolongs deterrence more than transparency."
                },
                {
                    "factor": "Technical and Logistical Constraints",
                    "effect": "Decrease probability—Iran claims stockpiles are under rubble and asserts practical physical barriers to inspection access. Even if politically willing, technical recovery, site safety, and potential for loss-of-face slow potential agreement and implementation."
                },
                {
                    "factor": "Internal Iranian Political Calculus",
                    "effect": "Decrease probability—Post-war nationalist sentiment, parliament’s overwhelming opposition to cooperation, and blame placed on the IAEA for the war make a policy reversal costly for the regime, especially before securing tangible reciprocal concessions."
                },
                {
                    "factor": "Negotiation Traditions and Patterns",
                    "effect": "Decrease probability—Historically, Iran demands significant, visible reciprocal benefits for transparency (sanctions relief, security guarantees, etc.), seldom grants access as a confidence-building measure alone, and uses time to create bargaining leverage."
                },
                {
                    "factor": "Precedents and Resolution Criteria",
                    "effect": "Decrease probability—Recent agreements (September deal) were scrapped after snapback sanctions and hostile rhetoric; Iran has signaled that restored cooperation depends specifically on improved Western behavior or sanctions relief, neither of which is visible."
                },
                {
                    "factor": "Time Constraint/Base Rate",
                    "effect": "Decrease probability—The window (less than 2 months) is very short for a significant diplomatic reversal and technical arrangement even if incentives suddenly shift. Historically, even 'urgent' IAEA access requests to Iran have taken longer to resolve."
                },
                {
                    "factor": "External Mediators and Backchannel Options",
                    "effect": "Increase probability slightly—China and Russia might press Iran for a symbolic restoration of IAEA access to forestall further escalation with the West, though their influence is limited and Iran has so far prioritized security concerns."
                }
            ],
            "no_scenario": "Iran maintains its refusal or delays meaningful technical access to the IAEA at bombed sites, citing technical obstacles, sovereignty, and security concerns. Inspections remain limited to less sensitive or undamaged facilities. With ongoing hardliner rhetoric, and in the absence of a new diplomatic breakthrough, Iran lets the deadline lapse, potentially signaling future willingness but blocking immediate action.",
            "yes_scenario": "Amid escalating threats of renewed Israeli or US strikes, combined with mounting economic pain from snapback sanctions, an emergency backchannel agreement is brokered—likely with mediation by China or Egypt. In return for some symbolic sanctions relief, Western guarantees, or technical assistance (or a strategic pause by Israel/US), Iran agrees to a one-time or carefully choreographed IAEA inspection at the required sites, with heavy restrictions and possibly staged for international optics.",
            "final_reasoning": "While both diplomatic precedent and current tactical realities create, in theory, an incentive for Iran to allow inspections to de-escalate regional risk and pursue sanctions relief, the institutional, domestic, and technical barriers remain formidable. The complete breakdown of the September 2025 deal, the very short time horizon, and explicit Iranian statements tying inspection resumption to sanctions reversal or Western 'good behavior' (at a time when the opposite has occurred) argue strongly against a near-term breakthrough. The technical barrier (buried uranium, site destruction) offers a plausible, face-saving pretext for Iran to stall or refuse, even as it leaves the door open to talks after the deadline. While a desperate, last-minute 'deal' cannot be wholly discounted given past backchannel patterns, the momentum, signals from all sides, and base rates for such inspection resumptions—especially after war and collapsed trust—make this outcome unlikely before January 1, 2026.",
            "final_probability": 13
        },
        "International Relations (Realism)": {
            "time_to_resolution": "Approximately 8 weeks (until December 31, 2025)",
            "perspective_relevance": "As an expert in International Relations (Realism), I focus on state interests, power dynamics, security dilemmas, and the rational pursuit of national survival. Realists understand state behavior as driven primarily by self-interest and concerns regarding relative power and security, often independent of legal, moral, or institutional constraints. In this context, Iran’s decisions about transparency with the IAEA are shaped far more by its security calculus, regime stability, and threat perceptions than by normative obligations to the NPT or pressure from international institutions.",
            "status_quo": "Iran is not granting the IAEA access to inspect its stockpile of enriched uranium at its key bombed facilities (Fordow, Natanz, Isfahan), having suspended the September inspection deal after European powers invoked snapback sanctions, following the June 2025 war.",
            "perspective_derived_factors": [
                {
                    "factor": "Security Dilemma and Deterrence Imperative",
                    "effect": "Decreases probability: Iran perceives the display of ambiguity and refusal to allow inspections as essential for strategic deterrence, particularly given recent attacks by the US/Israel. Full transparency diminishes uncertainty for adversaries and makes Iran more vulnerable to future strikes or sabotage."
                },
                {
                    "factor": "Great Power Dynamics and Lack of Incentives",
                    "effect": "Decreases probability: Western powers (US, UK, France, Germany) have reinstated sanctions; China and Russia are not pressuring Iran to cooperate, reducing incentives for short-term compliance or engagement."
                },
                {
                    "factor": "Domestic Political Environment and Regime Survival",
                    "effect": "Decreases probability: Hardline pressures are dominant after the war and under sanctions, making accommodation to external oversight highly costly domestically. The regime risks appearing weak to internal audiences by caving under coercion."
                },
                {
                    "factor": "Risk of Renewed Military Action",
                    "effect": "Slightly increases probability: Israel has a track record of preemptive military action if ambiguity persists. Iran may calculate that a partial, face-saving inspection (e.g., after some delay or under new frameworks) could reduce likelihood of further strikes if credible threat signals are received. However, timing is tight for such recalibration."
                },
                {
                    "factor": "Base Rate of Rapid Turnaround in Iran-IAEA Transparency after Conflict",
                    "effect": "Decreases probability: Historically, even at lower levels of tension, Iran has rarely provided access or cooperation with the IAEA within weeks of severe military confrontation, especially after major escalatory events and snapback sanctions."
                },
                {
                    "factor": "Technical Feasibility and Physical Access",
                    "effect": "Slightly decreases probability: The uranium is reportedly buried under rubble—raising technical, safety, and logistical obstacles to rapid inspection resumption. Even if Iran agreed in principle, implementation might take longer than the remaining time window."
                }
            ],
            "no_scenario": "Iran’s Supreme National Security Council sustains its current posture, citing security and sovereignty; the regime withstands sanctions, does not recalculate based on military threat within the 8-week window, and maintains or even hardens restrictions on IAEA access to key bombed facilities. European and U.S. pressure is insufficient to provoke a rapid tactical reversal, and China/Russia shield Iran diplomatically. No new agreement on IAEA inspections is announced by end-2025.",
            "yes_scenario": "Facing escalating credible threats of further Israeli military action, intense pressure from China or Russia wanting to avert broader regional chaos, and/or a face-saving diplomatic initiative (possibly proposing strictly limited, one-time access under strict Iranian conditions), Iran’s leadership quickly recalculates that limited, highly choreographed IAEA access is in its interest. An agreement to allow IAEA inspections is publicly announced before January 1, 2026, even if inspections occur later.",
            "final_reasoning": "The dominant realist factors—security imperatives, status anxiety after recent military humiliation, internal hardline consolidation, and lack of near-term material incentives to accommodate the West—heavily weight against Iran agreeing to inspections so soon after the June conflict and the snapback of UN sanctions. Iran’s regime will be acutely risk-averse about showing vulnerability. Even though possible renewed Israeli threats create some theoretical incentive for tactical transparency, the historical base rate for Iran making sharp turnarounds in IAEA cooperation in similar (though always less intense) situations is very low. While technical obstacles (uranium under rubble) add an additional barrier, these are secondary compared to the national interest calculus. The only plausible scenario for a yes outcome is a rapid, externally-induced crisis that makes the risk of non-cooperation existential to regime survival—but with only two months left and current news showing increased, not decreased, defiance, this is very unlikely. Therefore, the probability is low, but not quite at the absolute minimum, accounting for residual risk from potential last-minute diplomatic shocks or escalatory triggers.",
            "final_probability": 10
        },
        "International Relations (Liberal Institutionalism)": {
            "time_to_resolution": "Approximately 8 weeks (until January 1, 2026).",
            "perspective_relevance": "As an expert in Liberal Institutionalism, my core lens prioritizes international cooperation through institutions (like the IAEA) and the interplay between state interests, reciprocity, legal commitments, and the constraints and opportunities afforded by multilateral frameworks. I focus on the rational incentives for both Iran and international actors to seek cooperative arrangements, even after conflict, and assess how institutions mediate escalatory pressures. This approach stresses the path-dependency of past agreements, the costs and benefits of cooperation with the IAEA, and the credibility of security guarantees and sanctions as tools of leverage.",
            "status_quo": "Iran is currently denying IAEA access to inspect its stockpile of enriched uranium at Fordow, Natanz, and Isfahan. An inspector access agreement announced in September was voided after Europe triggered the UN sanctions snapback, and repeated diplomatic pressure since has failed to restore IAEA access.",
            "perspective_derived_factors": [
                {
                    "factor": "Heightened Security Dilemma and Post-Conflict Mistrust",
                    "effect": "Decreases probability. The June war and subsequent strikes by Israel/US deeply eroded Iranian trust in international institutions, reinforcing the view that cooperation with the IAEA provides targeting intelligence for adversaries. This mistrust is amplified by open Western threats and perceived IAEA complicity, driving an institutional breakdown."
                },
                {
                    "factor": "Sanctions Leverage and International Pressure",
                    "effect": "Increases probability, but weakly and with delay. The snapback mechanism reimposed major multilateral sanctions, increasing Iran’s economic pain. Under liberal institutionalist logic, this pressure eventually incentivizes cooperation, but Iran’s historical record shows such moves are slow and transactional, not rapid or unconditional."
                },
                {
                    "factor": "Reciprocal Institutional Bargaining",
                    "effect": "Decreases probability in the short term. Cooperation has become contingent, not automatic, on reciprocal concessions (e.g., sanctions relief, security assurances)—which are not currently forthcoming from the West. Institutional bargaining has hit a stalemate."
                },
                {
                    "factor": "Risk of Renewed Military Action",
                    "effect": "Increases probability moderately if crisis escalates. Israel’s threats to act if the uranium’s fate remains opaque could pressure Iran to allow partial access to defuse international alarm. However, this would only tip the balance if Iranian leadership perceives imminent threat outweighs sovereignty and credibility costs."
                },
                {
                    "factor": "Influence of China and Russia",
                    "effect": "Slightly increases probability. Both powers are urging restraint and dialogue, aiming to avert further conflict and protect their interests in Iran. However, without offering meaningful guarantees or mediation breakthroughs, their influence merely nudges Iran towards dialogue, not immediate transparency."
                },
                {
                    "factor": "Domestic Iranian Politics and Nationalism",
                    "effect": "Decreases probability. Parliamentary hardliners have codified resistance to inspections; to reverse this after heavy domestic propaganda about Western betrayal would be politically costly absent tangible Western concessions."
                },
                {
                    "factor": "Path Dependency of Past (Now Voided) Frameworks",
                    "effect": "Slight increase, but time-limited. Iran has a track record of ultimately walking back maximalist stances after securing face-saving concessions. With only weeks left, the time for this institutional ratcheting is running out."
                }
            ],
            "no_scenario": "Iran maintains its demand for reciprocal concession (e.g., partial sanctions relief, US/EU security commitments) before allowing inspections. The West, preoccupied with other crises and content with reimposed sanctions, offers no new incentives. Hardline Iranian leadership doubles down on sovereignty, using access as leverage for future negotiations in early 2026. Minimal engagement with the IAEA continues—inspectors visit Bushehr or non-strategic sites, but not Fordow, Natanz, or Isfahan. By January 1, 2026, no new public agreement is announced and no site inspections occur at the relevant sites, so the status quo holds.",
            "yes_scenario": "A security crisis unfolds in December: Israeli officials credibly threaten new strikes, while European intelligence shares new alarmist assessments. Facing imminent risk, and under quiet diplomatic pressure from China/Russia (possibly with backchannel assurances from the US on sanctions enforcement), Supreme Leader Khamenei authorizes a conditional, one-off inspection at the bombed facilities. To save face, Iran announces an 'agreement in principle' covering IAEA access (even with caveats or limited scope), which meets the resolution criteria before January 1, 2026.",
            "final_reasoning": "While institutional theory expects eventual return to cooperation, the timeline to 2026 is extremely short—most classic liberal-institutional recoveries from post-conflict breakdowns take several months at minimum and usually yield only after transactional bargaining. Sanctions are already reimposed and the Iranian regime has not received any reciprocal concession. International pressure is high, but not yet at a crisis threshold, and Tehran’s leadership is currently prioritizing regime credibility and security over international approval. The historical base rate for Iran backtracking on a hardline position within weeks is low, especially given the new parliamentary law and the current public antagonism toward the IAEA. The war aftermath, the absence of a new Western offer, and modest third-party pressure all combine to make a pre-2026 breakthrough unlikely, barring a very sharp new military threat or unanticipated diplomatic incentive. On balance, given the above and the absence of concrete movement in the past month despite extrinsic pressure, my probability skews strongly toward 'No,' but not at the lowest boundary because of the small but real possibility of a last-minute crisis forcing Tehran’s hand.",
            "final_probability": 10
        },
        "International Relations (Constructivism)": {
            "time_to_resolution": "Approximately 56 days (until January 1, 2026)",
            "perspective_relevance": "As an International Relations Constructivist, my expertise centers on how state behavior is shaped by social norms, identity narratives, and collective perceptions, rather than mere material interests or raw power. In this specific context, Iran’s choices around nuclear transparency and engagement with the IAEA can best be understood through its constructed narrative of victimhood, resistance, and non-Western solidarity, as well as its perception of international legitimacy and security norms. Constructivism highlights how shifting norms around sovereignty, security, and trust influence Iran’s stance toward international inspectors.",
            "status_quo": "Iran is currently denying the IAEA access to its bombed high-enriched uranium stockpiles at Fordow, Natanz, and Isfahan, citing security, sovereignty, and recent external aggression as justifications. No agreement is in force for inspection. The status quo, if unchanged, results in a NO outcome.",
            "perspective_derived_factors": [
                {
                    "factor": "National Identity and Narratives of Victimhood and Resistance",
                    "effect": "Decreases probability. Iran's domestic rhetoric post-strike emphasizes resistance to Western pressure and skepticism of IAEA neutrality, constructing non-cooperation as an assertion of sovereignty and a response to 'unjust aggression.'"
                },
                {
                    "factor": "Social Norms of International Legitimacy and Membership",
                    "effect": "Slightly increases probability. Iran remains in the NPT and seeks some international legitimacy, which generates incentives to avoid outright pariah status (à la North Korea) and preserve lines to multilateral diplomacy. Threats of NPT violation pressure Iran to eventually allow at least symbolic engagement with the IAEA."
                },
                {
                    "factor": "Perceptions of Security and Precedent",
                    "effect": "Decreases probability. Recent war solidifies a narrative that compliance leads to vulnerability; opening bombed sites to inspection is perceived as exposing Iran to surveillance by potential future attackers, further undermining regime trust in inspection mechanisms."
                },
                {
                    "factor": "Constructed Incentives and Role of Third Parties",
                    "effect": "Mildly increases probability. Mediation by China and Russia, or shifting signals from key Western states (e.g., moratorium on new sanctions or some symbolic diplomatic gestures), might enable Iran to frame reopening inspections as a national victory or a step to break isolation—if sufficiently face-saving."
                },
                {
                    "factor": "Escalating International Pressure vs. Regime Cohesion",
                    "effect": "Decreases probability. Ongoing snapback sanctions and threat of further strikes incentivize hardliners to double down domestically, deterring any near-term opening before 2026."
                }
            ],
            "no_scenario": "The prevailing narrative within Iran’s domestic politics frames the recent war and ongoing Western sanctions as proof of perfidy and aggression. Hardliners dominate discourse, casting the IAEA as complicit in enabling attacks. Security fears, resentment, and a desire to demonstrate resistance lead to continued denial of IAEA access, despite ongoing international warnings. No deal is reached—inspectors remain locked out of key sites through January 1, 2026.",
            "yes_scenario": "Amid intensifying economic pain under reimposed UN sanctions and fears of renewed Israeli or American strikes, a diplomatic opening emerges—perhaps with mediation by China or Russia. Iranian authorities, needing relief and external legitimacy, agree to a limited, highly controlled inspection protocol at Fordow, Natanz, and Isfahan. The announcement is framed domestically as a gesture of magnanimity or as extracting a concession from the West, allowing a face-saving return to partial cooperation before the deadline.",
            "final_reasoning": "The base rate for states reopening IAEA inspections under intense pressure but after a major conflict and overt external attack is quite low in the short term (weeks-to-months). While Iran did repeatedly, under prior threats, restrict and then eventually resume limited inspection (as in the years after the 2009/2010 Stuxnet and sabotage events), resumption has typically followed months or years of diplomatic maneuvering, and never under such acute perceived betrayal by both the IAEA and the Western security community. Constructivist analysis underscores that Iran’s regime needs to sustain a posture of resistance, lest it appear weak domestically or undermine its anti-Western identity narrative. Simultaneously, total isolation is not sustainable for Iran in the long run, and the regime has been careful not to withdraw from the NPT nor slam the door shut on all engagement. However, the time frame (less than two months) is particularly short, and the present pattern shows hardening of positions, not softening: failed deals, explicit threats that cooperation is void if sanctions continue, new domestic legislation suspending cooperation, and intensifying anti-IAEA rhetoric. There is no evidence of a new mediating effort or credible face-saving gesture emerging at this late juncture. Thus, while not impossible, the odds of an announcement before January 1, 2026, are low, but not zero given the risk calculus could change in response to an impending severe threat. Current constructive factors are substantially outweighed by regime narrative and security-driven closure.",
            "final_probability": 13
        },
        "Security Studies (Nuclear Nonproliferation Theory)": {
            "time_to_resolution": "Approximately 8 weeks (forecast date November 6, 2025; deadline January 1, 2026)",
            "perspective_relevance": "As an expert in security studies and nuclear nonproliferation, I bring a comprehensive understanding of Iran’s motivations regarding its nuclear program, how nuclear signaling and the threat of military force interact with incentives for transparency, and the mechanisms and historical cases surrounding IAEA access. I can ground the forecast in empirical patterns of Iranian nuclear diplomacy, coercion, retaliation, the cost of isolation, and the impact of US/Israeli military strikes and UN sanctions.",
            "status_quo": "As of early November 2025, Iran is denying the IAEA access to core uranium stockpile sites (Fordow, Natanz, Isfahan). The access agreement reached in September has collapsed after the EU snapback sanctions, and Iran's parliament has suspended cooperation with the IAEA. Iran claims the uranium remains 'buried under rubble.' Inspectors have had no access to the stockpiles since June. A hostile stalemate persists.",
            "perspective_derived_factors": [
                {
                    "factor": "Precedent: Historical Iranian IAEA Cooperation and Retaliation Patterns",
                    "effect": "Decreases probability. Iran often leverages denial of IAEA access as deliberate strategic retaliation when it perceives unacceptable Western pressure, especially following military attacks or new sanctions. If there is no incentive or quid pro quo, and with snapback sanctions now in place, historical base rates suggest extended noncooperation."
                },
                {
                    "factor": "International Pressure and Threat of Further Strikes",
                    "effect": "Increases probability, slightly. Persistent ambiguity about the fate of 400kg of 60% enriched uranium raises fears in Israel, creating a strong incentive for the US/EU to pressure Iran to restore inspections to avert further Israeli/U.S. action. If Iran believes persistent opacity will provoke another strike, it may be compelled to partially reopen access."
                },
                {
                    "factor": "Domestic Iranian Politics—Hardline Consensus After Strikes",
                    "effect": "Decreases probability. The overwhelming parliamentary vote to suspend IAEA cooperation after the war, and public rhetoric denouncing the IAEA for 'abetting' Israeli action, signals a hardline domestic stance. The regime likely feels compelled to show defiance to both internal and external audiences, making short-term capitulation unlikely."
                },
                {
                    "factor": "Technical Realities—Uranium Physical Accessibility and Reconstructive Delay",
                    "effect": "Neutral to slightly decreases probability. Iran’s claim that stockpiles are ‘under rubble’ has some technical merit; Iranian officials themselves are unclear how much remains intact or safely accessible in the bombed facilities. This technical reality may provide a genuine—if temporary—justification to delay inspections without a dramatic policy reversal."
                },
                {
                    "factor": "Diplomacy and Negotiation Prospects (Including Chinese Mediation)",
                    "effect": "Slightly increases probability. Mediation attempts (e.g., China’s outreach, Egypt’s prior mediation) are ongoing and could, in theory, generate a last-minute agreement for symbolic IAEA access as part of a broader freeze or face-saving gesture, especially if linked to economic incentives or de-escalation."
                },
                {
                    "factor": "Time Pressure—Short Window Until Year's End",
                    "effect": "Decreases probability. With less than two months remaining, the window for a meaningful diplomatic breakthrough is very narrow. Progress so far has been negative (collapse of September deal). Large bureaucratic and political hurdles exist for any rapid change."
                },
                {
                    "factor": "Risk Aversion in Iran’s Strategic Culture",
                    "effect": "Slightly decreases probability. Facing both severe external threats and domestic demands for resistance, Iranian leaders often emphasize risk aversion. Allowing IAEA in now, after publicizing defiance, would look like a retreat unless coupled to clear, face-saving gains."
                }
            ],
            "no_scenario": "Despite increasing diplomatic and military pressure, Iran maintains its current policy—citing security, sovereignty, and the physical inaccessibility of uranium due to damage. Talks are ongoing but stall over sequencing (Iran wants sanctions relief first; P5+1 demands access first). Iran rejects last-minute US/EU proposals, and no formal agreement for IAEA inspections is announced before December 31, 2025. The IAEA remains able to monitor via satellite and secondary sites (e.g., Bushehr), but is shut out of Fordow, Natanz, and Isfahan.",
            "yes_scenario": "Fearing renewed Israeli/U.S. strikes and/or catastrophic economic consequences from snapback sanctions, Iran’s Supreme National Security Council authorizes limited, highly-controlled IAEA access to the relevant bombed sites as a symbolic gesture—framed domestically as necessary to avert war and internationally as a step towards dialogue (using face-saving language about site 'safety inspections' not full transparency). The announcement comes after a last-ditch mediation bid, possibly with some minor Western concession (e.g., humanitarian economic measures or a promise of future dialogue). An agreement is signed and publicly announced in late December 2025.",
            "final_reasoning": "The base rate for rapid restoration of IAEA inspections after this type of major crisis (post-military strike, post-snapback sanctions, hostile domestic environment) is very low—likely below 20% under similar historical circumstances. Since the September agreement collapsed, there has been no observable movement toward compromise; if anything, Iran is doubling down on its refusal. Key voices in the regime link renewed IAEA access to the lifting of sanctions, which is not forthcoming. Conversely, escalation risks—i.e., threat of further Israeli strikes or economic collapse—do provide a small window for reversal, especially if international mediation yields a minimal, symbolic gesture. But the technical argument regarding physical inaccessibility (uranium under rubble) and bureaucratic constraints further delay the process. Major favorable shifts in negotiation, access, or Iranian policy would likely generate international headlines, and none have emerged. With only 8 weeks left and negative momentum, the probability that Iran will announce an agreement to allow full IAEA inspections at Fordow, Natanz, and Isfahan is low. Given the combination of strong base rates, negative recent developments, and only weak upside scenarios, the most justifiable bold-but-defensible estimate is:",
            "final_probability": 14
        },
        "Security Studies (Security Dilemma)": {
            "time_to_resolution": "Approximately 8 weeks (question resolves January 1, 2026; today is November 6, 2025)",
            "perspective_relevance": "As an expert in Security Studies focusing on the security dilemma, I bring a nuanced understanding of how states' actions to secure themselves—such as uranium enrichment, military build-ups, or constraining international verification—can provoke insecurity in rivals and unintended escalation spirals. This lens is critical when evaluating Iran’s calculus after being attacked, subjected to snapback sanctions, and publicly isolated, and when considering how Iran balances demonstrating resolve and reaping security, economic, or diplomatic benefits from transparency.",
            "status_quo": "Iran is currently denying the IAEA access to its high-enriched uranium stockpiles at Fordow, Natanz, and Isfahan. Despite intermittent talks and a briefly announced agreement in September, ongoing snapback sanctions, hostile Western rhetoric, and fresh wounds from military strikes have prompted Iran to walk back even partial cooperation. Over a dozen IAEA inspections since June have not reached these sites, and Iranian officials continue to justify the shutdown of cooperation as retaliatory and necessary for security.",
            "perspective_derived_factors": [
                {
                    "factor": "Security Dilemma Intensification after Strikes",
                    "effect": "Decreases probability. Recent Israeli-US airstrikes have strengthened Iran’s perception of existential external threat, incentivizing it to limit transparency to retain a deterrent capability, avoid revealing vulnerabilities, and deny adversaries precise targeting intelligence for additional strikes."
                },
                {
                    "factor": "Political Capital of Defiance Domestically",
                    "effect": "Decreases probability. Iran’s leadership must placate hardline factions and public anger after the strikes by projecting sovereignty and strength, typified by Parliament’s overwhelming vote to suspend cooperation. Significant transparency now might be framed as capitulation."
                },
                {
                    "factor": "Snapback of Sanctions and Erosion of Diplomatic Incentives",
                    "effect": "Decreases probability. The September snapback by E3 and subsequent UN Security Council measures undercut tangible diplomatic/economic incentives Tehran would require to risk appearing compliant. With no prospect of sanctions relief before 2026, cost-benefit for transparency is low."
                },
                {
                    "factor": "Risk from Resuming Inspections: Possible Triggers for Renewed Strikes",
                    "effect": "Decreases probability. Both Israeli and US officials are keen to verify Iran is not reassembling or moving its stockpile for weapons use. Disclosing locations or transfers—even if limited—could invite preemptive military action, bolstering Iranian caution."
                },
                {
                    "factor": "Residual Pathways for Diplomacy and Avoiding Total Isolation",
                    "effect": "Slightly increases probability. Iran is not withdrawing from the NPT or declaring intent to build weapons. There is engagement with China, Russia, and messages of possible willingness for future 'reasonable' nuclear talks. If faced with an explicit, time-limited Western offer (e.g., a sanctions freeze in exchange for limited IAEA access), Iran could calculate a last-minute gesture to break isolation."
                },
                {
                    "factor": "Recovery/Condition of Stockpile and Facility Integrity",
                    "effect": "Neutral/Decreases probability. Stockpiles are said to be 'under rubble' and technical issues with access (physical retrieval, contamination) provide a genuine bureaucratic hurdle and plausible excuse for delaying access."
                },
                {
                    "factor": "Precedent: Post-Strike Transparency in Other Nuclear Proliferation Cases",
                    "effect": "Decreases probability. Historically, states struck militarily (e.g., Iraq 1981, Syria 2007) have not subsequently admitted inspectors until regime change, war, or coercive circumstances produced a collapse in policy autonomy."
                }
            ],
            "no_scenario": "The most likely scenario is one in which Iran continues its current policy: keeping the IAEA out of Fordow, Natanz, and Isfahan until well after January 1, 2026. Iran points to the physical state of sites, security concerns about further military action, retaliatory justification for noncooperation (snapback sanctions, 'unjustified' IAEA censure), and uses domestic political concerns to delay any international overtures until after the 2026 deadline.",
            "yes_scenario": "A less likely scenario would involve an abrupt diplomatic reset, possibly motivated by a credible back-channel offer from Western powers (freeze or partial rollback of sanctions, or Chinese/Russian mediation for security guarantees) contingent on IAEA site access before 2026. Iran could grant limited or symbolic access to the IAEA in a tightly scripted and controlled inspection, seeking both to restore some lost legitimacy and to preempt new Israeli/US military action. This would require rapid negotiation and strong Iranian leadership will, both of which appear absent given present hostility and institutional incentives.",
            "final_reasoning": "Base rates of post-military-strike nuclear transparency are exceedingly low, especially in the absence of robust incentives or regime change. The entirety of the evidence—including Iranian domestic politics, explicit precondition of sanctions relief, hostile US/Israeli posture, and the observable tendency for states to dig in after attacks—strongly weighs against a Yes outcome. Iran’s language about inspections being void if further sanctions or attacks occur is not only a face-saving excuse, but an institutional commitment that makes a rapid about-face before New Year's improbable. Any scenario for resumed access likely requires formal negotiation (which is explicitly moribund), emergent acute threat of greater isolation or force (which Iran evidently discounts), or a sudden change in Western or Chinese policy (not in evidence). With only eight weeks to go, with Iranian elite consensus favoring resistance until at least minimal concessions materialize, I assess a very low—but not totally impossible—chance of last-moment symbolic compliance.",
            "final_probability": 6
        },
        "Middle East Studies (Regional Security Complex Theory)": {
            "time_to_resolution": "Approximately 56 days (question resolves on January 1, 2026; today is November 6, 2025)",
            "perspective_relevance": "As an expert in Middle East Studies and Regional Security Complex Theory (RSCT), I am positioned to analyze Iran’s nuclear diplomacy and its calculus vis-à-vis both external threats and internal security imperatives. RSCT emphasizes the interplay of local interdependence, historical security dynamics, regional polarity, and extra-regional powers. This lens is critical in assessing how Iran’s nuclear behavior is shaped by immediate regional threats (e.g., Israel, Saudi Arabia), ongoing rivalry, and international mediation, especially following significant military escalation and shifting alliances.",
            "status_quo": "Iran is currently denying IAEA inspectors access to its major stockpiles of enriched uranium at the bombed Fordow, Natanz, and Isfahan sites. Although an agreement for inspections was reached in September, it has since been voided amid renewed international sanctions and distrust.",
            "perspective_derived_factors": [
                {
                    "factor": "Regional Security Dilemma and Deterrence Posture",
                    "effect": "Decreases probability. Following direct Israeli and US strikes, Iran is likely to prioritize secrecy and nuclear ambiguity to preserve its deterrent and retaliatory credibility, undermining incentives to allow intrusive inspections."
                },
                {
                    "factor": "External Pressure and the Risk of Escalation",
                    "effect": "Slightly increases probability. Israeli and US threats of further military action, combined with European snapback sanctions, increase pressure on Iran to demonstrate some cooperation to avoid new strikes—especially if backchannel warnings are issued."
                },
                {
                    "factor": "Domestic Political Calculus and Regime Legitimacy",
                    "effect": "Decreases probability. Hardliners dominate Iran’s post-war security establishment, using external pressure and national resistance as central legitimizing narratives. Appearing to capitulate so soon after the strikes (and parliamentary vote) would be politically costly."
                },
                {
                    "factor": "Condition of the Enriched Uranium and Technical Factors",
                    "effect": "Slightly increases probability. Since much of the uranium is reportedly 'under rubble,' Iran could argue that limited inspection poses low risk to security. However, the regime loses leverage once the IAEA confirms the stockpile status and extent of recoverability."
                },
                {
                    "factor": "Past Patterns/Base Rate of Iranian-IAEA Cooperation After Crisis",
                    "effect": "Decreases probability. Historically, after major escalation (e.g., 2019 tanker incidents, assassination of Soleimani, attack on Natanz 2021), Iran has delayed meaningful IAEA cooperation for months or years, leveraging opacity to gain concessions."
                },
                {
                    "factor": "Role of Major Powers (China, Russia)",
                    "effect": "Minimal effect. While China and Russia urge talks, they have not provided Iran sufficient cover or incentives (material or diplomatic) to resume inspections rapidly, especially as snapback sanctions proceed."
                }
            ],
            "no_scenario": "Iran’s leadership maintains its suspension of IAEA cooperation through the end of 2025, citing security, ongoing Western hostility, and sanctions. The Supreme National Security Council vetoes any return to site access. Iran may offer only rhetorical transparency or allow limited IAEA visits to untouched facilities (e.g., Bushehr) but not to Fordow, Natanz, or Isfahan. The standoff persists into 2026, with perhaps minor technical contacts but no full announced agreement for inspections at the primary enriched uranium stockpile sites.",
            "yes_scenario": "A renewed spike in regional tension—such as a credible threat of Israeli or US military follow-up—forces Iran’s hand. Under pressure from China and Russia, and needing to avoid further airstrikes or bolster economic stability, Iran announces a conditional, face-saving agreement: the IAEA will be allowed to conduct supervised inspections at the bombed sites to verify the uranium stockpile, with the security council’s approval and strict access protocols. The agreement is likely to be announced in late December as a political gesture but with implementation details left ambiguous.",
            "final_reasoning": "The base rate for Iran restoring full IAEA access to high-value nuclear sites within two months of a military escalation and snapback sanctions is very low. The regime’s security logic, reinforced by RSCT, suggests maximum caution and an interest in maintaining nuclear ambiguity for both domestic and external deterrence. Recent parliamentary and security council decisions, as well as consistently adversarial rhetoric, strongly suggest that even technical obstacles (uranium reportedly 'under rubble') will not incentivize a quick policy reversal. While external military and economic pressure could trigger a tactical adjustment, there is little evidence of immediate movement in that direction as of early November 2025, and political costs for the regime to reverse course before a meaningful diplomatic face-saving opportunity are high. The only plausible pathway to a Yes outcome before 2026 would require a dramatic, specific threat (e.g., a new imminent airstrike) and/or a tangible economic incentive, neither of which is visible right now. Thus, while not a true zero, the probability is toward the low extreme.",
            "final_probability": 12
        }
    },
    "deliberation_probability": [
        10,
        18,
        18,
        13,
        10,
        10,
        13,
        14,
        6,
        12
    ],
    "deliberation_mean_probability": 12.4,
    "deliberation_sd": 3.717824931626316,
    "deliberation_probability_result": 12,
    "group_results": {
        "NuclearPolicyNonproliferationTreatyRegime": {
            "forecaster_to_engage": "DiplomacyTrackTwoDiplomacy",
            "response_type": "critique",
            "response": "Your analysis correctly notes the bleak prospects for a near-term diplomatic breakthrough, and you rightly downplay the chances that Track Two actors can move the needle so quickly. But honestly, even your modest 18% feels implausibly generous given both the technical and political realities. You overstate the speed and capacity of Track Two mediation: in past Iran-NPT standoffs, Track Two dialogue inches forward over months, not weeks, and never produces high-stakes inspection agreement announcements independent of formal government authorization. Here, the Iranian state has made public, parliamentary, and supreme council commitments explicitly against renewed IAEA access so long as snapback sanctions and 'aggression' continue. The concept that China or Egypt could broker a symbolic gesture within a single news cycle just doesn't align with the well-documented bureaucratic rigidity and nationalist context of post-strike Iran. Further, the regime’s embrace of the technical impossibility argument ('under rubble') conveniently allows indefinite stalling without appearing to refuse outright—perfect for regime narrative with no external pay-off in sight. Barring the sudden emergence of a truly existential threat to regime survival, talk of Track Two magic at an 18% likelihood overstates both base rates and current signals. The modal outcome is recalcitrance up to or past the deadline, punctuated by performative negotiation, not a real deal."
        },
        "NuclearPolicyIaeaSafeguardsSystem": {
            "forecaster_to_engage": "InternationalRelationsLiberalInstitutionalism",
            "response_type": "defense",
            "response": "Your reasoning is spot on: liberal-institutionalism might expect restoration of transparency in the long run, but the short fuse here is critical. Iran hasn't just drifted away from cooperation; it has legally and politically locked itself in, invoking national law and using technical obstacles as excuses. Your call-out that multilateralism and norms will not suddenly materialize into an inspection agreement in a vacuum of incentives or trust is well grounded. The institutional context is toxic: current sanctions are already maxed out, the snapback mechanism is active, and there's neither a credible international carrot nor a face-saving offramp for Tehran. In short, the formal frameworks that might draw Iran back in have been thoroughly undermined, and your recognition that the regime prizes internal legitimacy far above international approval at this moment is well-argued. Your probability is appropriately bold for these facts."
        },
        "DiplomacyTrackTwoDiplomacy": {
            "forecaster_to_engage": "SecurityStudiesNuclearNonproliferationTheory",
            "response_type": "defense",
            "response": "Your base-rate focused analysis of rapid IAEA inspection restoration in the wake of military conflict and snapback sanctions is on target, and I absolutely concur with your low-probability assessment. Where some optimists overplay the thin possibility of last-minute Track Two or third-party breakthroughs, you correctly discount superficial diplomatic noise unless it is matched by genuine, visible shifts in either regime incentive structure or the severity of external threat. Highlighting technical arguments ('uranium under rubble') as politically convenient delay mechanisms is astute — the regime can look cooperative to mediators while refusing to budge in practice. The historic pattern is for months (minimum) of diplomatic stalemate following outright suspensions, particularly once the domestic system has mobilized against perceived capitulation. Unless there’s unmistakable evidence of new existential pressure or an unexpected, high-stakes international intervention, your skepticism remains the sanest position."
        },
        "DiplomacyInternationalNegotiationPractice": {
            "forecaster_to_engage": "InternationalRelationsConstructivism",
            "response_type": "critique",
            "response": "You correctly focus on the regime's identity narrative—resistance, anti-Western legitimacy, and the need to avoid appearing weak after a humiliating attack. However, you underplay how this identity narrative can actually serve as a surprisingly flexible bargaining resource for Iran when existential pressure mounts. The regime has, in the past, pivoted tactically under severe pressure while doubling down on victimhood and 'heroic flexibility' rhetoric to sell concessions at home. You also over-index on the notion that parliamentary and Supreme Council alignments are ironclad: Khamenei has historically reversed hardline stances overnight when regime survival calculus shifts. Your probability and rationale are bogged down by assuming narrative rigidity equals short-term policy immovability, but in Iran's playbook, those narratives are a tool, not a cage. If Israel escalates threats or mediation achieves a narrow symbolic deal, the regime could frame even thin IAEA access as a patriotic victory for defiance and control—paradoxically enabling a tactical concession at the last minute. In short: don't confuse the regime's ideological outward stance with an inability to swerve for survival."
        },
        "InternationalRelationsRealism": {
            "forecaster_to_engage": "NuclearPolicyIaeaSafeguardsSystem",
            "response_type": "defense",
            "response": "Your 18% estimate stands above the hardline consensus here, and justifiably so. Real-world Iranian reversals have repeatedly come not just from threats or isolation, but from the sense that a controlled, face-saving fig leaf for compliance is possible—and the regime's view of IAEA access as a tactical currency, not a moral issue, supports the plausibility of this. You are right to highlight that isolated regimes, facing the specter of catastrophic escalation, sometimes choose token cooperation to reset the game, and that Iran has walked back ferocious rhetoric to cool things off in the past (as in selected JCPOA episodes and 2015). You are also correct to note that technical barriers, while real, rarely prevent an announcement if political will emerges—the regime can always designate a 'pre-inspection' or staged access as the first step, even while dragging out actual implementation. In sum: Your forecast has the virtue of recognizing not just what’s probable, but what’s possible under duress and late-breaking diplomatic judo. You inject needed nuance beyond binary hardline dogmatism."
        },
        "InternationalRelationsLiberalInstitutionalism": {
            "forecaster_to_engage": "SecurityStudiesSecurityDilemma",
            "response_type": "critique",
            "response": "Your reading of the incentives behind Iranian stonewalling is broadly correct, but your probability—6%, the lowest among all—pushes beyond even what the overwhelmingly negative evidence justifies. You treat the regime’s posture as essentially immutable absent regime change, but both the liberal-institutional and historical record show that Iran retains a pragmatic streak even when rhetoric and law point toward maximal defiance. In severe crises (think November 2013 Geneva interim deal, or the snap interim IAEA access after 2015), Iran has performed tactical, face-saving concessions when the escalation ladder became unstable. You're right to stress that no meaningful negotiation track or Western incentive exists right now, but you underweight the real, nontrivial risk: Israel credibly threatening fresh strikes, or Chinese intervention yielding a palatable face-saving offer. With technical access so nebulous ('under rubble') there’s actually space for performative, partial compliance, which could still get trumpeted as an ‘agreement’ by both sides. Sub-10% is only defensible if new external shocks are ruled out between now and year's end, and that's not prudent forecasting—surprises drive last-minute diplomacy all the time. Give a bit more weight to the possibility of tactical, ambiguous deals emerging from this brinksmanship cycle."
        },
        "InternationalRelationsConstructivism": {
            "forecaster_to_engage": "SecurityStudiesNuclearNonproliferationTheory",
            "response_type": "defense",
            "response": "You absolutely nail the core logic: history shows that after a military strike and in an environment of maximum sanctions, states—especially Iran—dig in, slow-walk, and weaponize technicalities rather than cave swiftly to inspection demands. Your insistence on distinguishing between performative diplomatic noise and genuine, regime-level policy shift is essential here. Even if rumors, mediation, or international gestures swirl, the post-strike Iranian political system is built for institutional inertia and suspicion, not rapid reversals. The regime's current embrace of 'physical impossibility' ('under rubble') is both a political slogan and a bureaucratic moat, allowing Tehran to refuse without saying no. You rightly anchor your probability on this inelasticity rather than daydreams of dramatic last-minute Track Two breakthrough. With so little time before the deadline, and with every practical and narrative incentive on Iran's side against opening up, your low-confidence scenario is not just justified—it's the only defensible reading of contemporary Iranian crisis management."
        },
        "SecurityStudiesNuclearNonproliferationTheory": {
            "forecaster_to_engage": "MiddleEastStudiesRegionalSecurityComplexTheory",
            "response_type": "critique",
            "response": "You do a solid job of mapping regional security logic and Iran's interest in maintaining ambiguity, but you under-emphasize two critical factors that make your already-low estimate slightly too generous. First, you treat the technical excuse ('uranium under rubble') as just one minor obstacle, when in fact it's the ideal pretext—endorsed by both the Atomic Energy Organization of Iran and top regime officials—for indefinite delay without cost, and it gives Iran an internationally legitimate talking point to resist inspections even under pressure. Second, you let the mere possibility of 'external pressure or incentives' keep your estimate above 10%, yet as of now, there's no credible new economic, diplomatic, or military threat visible that would force Tehran’s hand so rapidly. Unlike previous cycles, the confluence of maximal defiance, domestic political locking, and the technical smokescreen means the base rate for sudden access agreements is closer to hard-zero, absent an imminent existential threat. Only a truly dramatic, public shift—e.g., US/Israel promising further strikes or a surprise breakthrough with China—would justify the probability you assign. The weight of evidence puts the odds barely above 'hopeless.'"
        },
        "SecurityStudiesSecurityDilemma": {
            "forecaster_to_engage": "NuclearPolicyNonproliferationTreatyRegime",
            "response_type": "defense",
            "response": "Credit where it's due: your forecast is bolder, but grounded. You don't just cite the usual 'low probability' suspect; you tie it to rigorous base rates (Iran and others only resume access after major crises with lengthy delays, often under regime-changing terms), concrete institutional hardening (parliamentary mandates, snapback sanctions, and leadership consensus), and you correctly contrast wish-casting about escalatory brinkmanship with the actual lack of diplomatic movement. Many forecasters here hedge by leaving the door wide open for a last-minute shock. You, however, underscore that barring active signals of negotiation or a clear, present threat to regime tenure, the modal outcome with two months left is staunch resistance. You also nail the point that technical obstacles are more than engineering issues—they're regime-sanctioned alibis for delay. Your 10% is not just a number plucked from the gloom: it's a tight, logically defended estimate that cuts through over-optimistic noise about abrupt Track Two success. Well-reasoned, bold, and unflinching in probabilistic logic—this is the backbone of good nuclear forecasting."
        },
        "MiddleEastStudiesRegionalSecurityComplexTheory": {
            "forecaster_to_engage": "SecurityStudiesNuclearNonproliferationTheory",
            "response_type": "critique",
            "response": "You’ve rightly homed in on the dismal base rate for post-crisis inspection deals and the regime’s embrace of the 'technical impossibility' narrative—but your 14% still overshoots the real odds implied by this situation. Let’s be brutally honest: Iran’s technical argument isn’t just a convenient excuse, it’s the perfect diplomatic firewall, sanctioned across every regime level, enabling them to feign scientific caution and string along the IAEA and outside pressure for months, if not longer. You pay lip service to the chance of existential escalation—but with no new credible threats or carrots looming, the mechanics of a 'symbolic gesture' agreement are even more far-fetched than your low number suggests. With maximalist defiance in the parliament, Security Council, and the street, and absolutely zero diplomatic or technical movement, your scenario for a Yes outcome is a long shot even in regime imagination. Truthfully, the only way you break double digits here is if the West puts an actual gun to Tehran’s head or delivers an irresistible economic rescue—nothing remotely visible now. There’s no shame in 14%, but the logic you lay out actually screams for something sub-10%. Don’t let recency bias overvalue the minuscule odds of a breakthrough born out of pure brinkmanship theater."
        }
    },
    "revision_results": {
        "Nuclear Policy (NonProliferation Treaty Regime)": {
            "my_phase1_final_probability": 10,
            "reasoning_for_revised_probability": "After reviewing both my initial forecast and the group deliberation, especially the critique of Track Two diplomacy's effectiveness and timeline, I find even more reason to discount the plausibility of a late-breaking inspection agreement. None of the group’s arguments introduce evidence or scenarios that significantly increase the chances of an imminent Iranian reversal before January 1, 2026. On the contrary, most participants independently converge on a low-probability, reinforcing my view that technical obstacles, the political red lines established by Iran’s regime, and lack of diplomatic movement leave little room for even symbolic concessions on inspections within such a short time window. The few slightly higher estimates rely on mechanisms (e.g., Track Two) that are, if anything, slower or less effective in this specific context than even I originally considered. Therefore, my original probability of 10% remains justified, and if anything, appears a touch high. I will leave it unchanged to reflect the still nonzero risk of some extreme-pressure last-minute reversal.",
            "revised_probability": 10
        },
        "Nuclear Policy (IAEA Safeguards System)": {
            "my_phase1_final_probability": 18,
            "reasoning_for_revised_probability": "Reviewing the group deliberation, especially the critiques of Track Two diplomacy and comparisons across theoretical lenses, reinforces my sense that even my initial probability may have been slightly too high. The collective expertise repeatedly emphasizes not only the negative base rates for post-conflict, rapid inspection resumption, but also the layered nature of Iran's commitments against access: legal, parliament-backed, Supreme National Security Council-approved—and the regime now has the perfect technical excuse ('under rubble') to delay without reputational damage. The points raised about how Iran weaponizes IAEA access for leverage, and the turn to performative, not substantive, negotiations, further diminish the plausibility of a sudden reversal. The international context offers no new incentives, and there is no visible mediation effort capable of catalyzing a deal in such a narrow window. While I had previously allowed for some risk of an abrupt, tactical inspection as a de-escalatory move in the face of new threats, the fact is that no such threat is visibly materializing at scale, and Iranian elite unity against cooperation is strong. Accordingly, I will slightly revise my probability downward to 14%.",
            "revised_probability": 14
        },
        "Diplomacy (Track Two Diplomacy)": {
            "my_phase1_final_probability": 18,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, my view is reinforced that the base rate for rapid IAEA inspection resumption after such a crisis is extremely low. Critiques from other forecasters, especially from the NPT regime and nuclear nonproliferation perspectives, compellingly highlight how the technical pretext ('under rubble') and hardline legal/political stances make even brief symbolic access unlikely absent an extraordinary, imminent existential threat. The defense of a slightly higher probability ascribed to Track Two/third-party mediation seems less persuasive when set against the visible alignment of regime, parliament, and security council against any quick concession. Other experts rightly note that Track Two in this context, while not irrelevant, is unlikely to precipitate swift, high-stakes compliance within eight weeks, especially given the absence of sanctions relief or open negotiations. Therefore, the group consensus and its arguments merit a modest downward revision. I now assign a final probability of 12%.",
            "revised_probability": 12
        },
        "Diplomacy (International Negotiation Practice)": {
            "my_phase1_final_probability": 13,
            "reasoning_for_revised_probability": "The group deliberation largely validated my initial skeptical baseline: all participating experts, regardless of disciplinary lens, coalesced around a low probability that Iran would allow IAEA inspection access before 2026. Notably, the interventions highlighted two refinements: (1) Even politically marginal scenarios—such as a face-saving symbolic gesture—require either an acute, existential threat or a diplomatic breakthrough not yet in evidence. Both Security Studies and Nuclear Policy experts stress that even Track Two diplomacy, often invoked as a last-minute fix, cannot outpace the inertia of Iran’s explicit political, institutional, and technical stalling. (2) Critiques of constructivist and diplomatic flexibility urge caution against underestimating Iran’s tactical agility should regime survival feel endangered. However, since no sharply credible escalation is visible right now, and Iran’s leadership has entrenched against external pressure and linked inspections to sanctions relief, the most plausible scenario remains stalling through the deadline. The deliberation strengthened my conviction that any probability above 15% would significantly overestimate the odds, given the evidence and historic base rates. I thus maintain my probability at 13%.",
            "revised_probability": 13
        },
        "International Relations (Realism)": {
            "my_phase1_final_probability": 10,
            "reasoning_for_revised_probability": "After reviewing the diverse group discussion, my original assessment remains strongly corroborated. The overwhelming majority of forecasters—spanning realist, institutionalist, and nonproliferation perspectives—converge on a very low probability for a December 2025 breakthrough. There is general agreement that the domestic, technical, and diplomatic barriers are too high, with only narrow room for a desperate, last-minute partial climb-down (theoretical but not strongly evidenced). While some acknowledge that past Iranian pivots can occur rapidly under acute pressure, there is no credible signal of imminent external escalation or internal recalibration. The slightly higher estimates (e.g., 18%) are well-defended but not compelling enough against such a unified wall of structural and behavioral obstacles. Most group commentary further reinforces the extremely low odds, particularly the lack of any practical diplomatic movement or functional third-party mediation in recent weeks. Therefore, my forecast remains unchanged: No new data or compelling argument emerged to justify either a more extreme (lower) or higher probability.",
            "revised_probability": 10
        },
        "International Relations (Liberal Institutionalism)": {
            "my_phase1_final_probability": 10,
            "reasoning_for_revised_probability": "The group deliberation reveals a remarkable convergence among nearly all expert perspectives around a low-probability outcome (10-18%), with essentially no one credibly defending a base rate above 20%. Notably, even the more flexible arguments (from IAEA Safeguards and Realism) allow for the possibility of a face-saving tactical deal but frame it as an unlikely—though not impossible—outlier, given Iran's current domestic and international context. My initial estimate is reinforced by these arguments, particularly those highlighting how technical, legal, and narrative constraints make a near-term turnaround unlikely. Still, the sharpest critiques (including of sub-10% forecasts) point out that a tactical/performative agreement—where symbolic IAEA access is announced even if not fully implemented—remains within the realm of possibility, given the unpredictability of military or diplomatic escalation and Iran's pragmatic flexibility under existential threat. The combination of overwhelming evidence for continuity with a non-trivial tail risk leads me to nudge my forecast very slightly upward, to reflect the outside chance of a last-ditch, ambiguous 'deal' in the face of crisis. Therefore, I revise to 12%.",
            "revised_probability": 12
        },
        "International Relations (Constructivism)": {
            "my_phase1_final_probability": 13,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, my initial forecast is reinforced. The consensus across security, regional, nuclear, and diplomatic analysts is that the odds of a breakthrough before January 1, 2026, are very low, with estimates clustering between 6% and 18%. Critiques of the higher estimates consistently emphasize that institutional inertia, technical excuses ('under rubble'), hardline legal constraints, and narrative rigidity form a formidable short-term barrier to agreement. Defenses of slightly higher probabilities hinge almost entirely on 'black swan' last-minute diplomacy—an outcome for which there is scant historical precedent in similar settings, especially with current regional hardening and no credible mediation track visible. The deliberation does, however, strengthen the argument for giving marginal weight to tactical ambiguity or Israel-triggered brinksmanship, but not enough to fundamentally shift probability. I see no compelling evidence warranting a substantial move from my already-low forecast of 13%.",
            "revised_probability": 13
        },
        "Security Studies (Nuclear Nonproliferation Theory)": {
            "my_phase1_final_probability": 14,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I see strong consensus among experts across policy, IR, and regional domains that the near-term base rate for Iran restoring IAEA access is extremely low—multiple forecasts are at or below my own, and the arguments provided further reinforce the absence of any known mechanism, mediation, or shift that could compel an imminent agreement. Valuable critiques highlight, if anything, that my Phase 1 estimate might have been slightly too generous: technical pretexts ('under rubble') give Tehran maximum plausible deniability; domestic and institutional incentives powerfully reinforce stonewalling; and there is virtually no evidence of a shock external enough (military, diplomatic, or economic) to force compliance in the next 8 weeks. While there is caution against going near-absolute (sub-5%) due to inherent non-zero risk of last-minute brinkmanship or symbolic compliance, the combination of zero movement since September and hardened Iranian consensus makes an agreement before end of 2025 barely plausible. Therefore, I am revising my forecast downward slightly for sharper alignment with the 'hardline stonewalling with thin risk of surprise' consensus.",
            "revised_probability": 11
        },
        "Security Studies (Security Dilemma)": {
            "my_phase1_final_probability": 6,
            "reasoning_for_revised_probability": "Upon reviewing the Phase II debate, I am further assured of the soundness of my initial low estimate. Group consensus clusters tightly in the 10-18% range, but the critiques of modestly higher probabilities (especially the pushback against optimism about Track Two or crisis-driven reversals) reinforce my logic: the technical excuse of 'uranium under rubble' provides durable cover for continued stonewalling; the regime is locked in by law and politics; and, barring a visible, existential, last-minute crisis (which is not apparent), Iran will not announce an inspection deal before 2026. Critiques of sub-10% probabilities mostly rest on hypothetical last-minute escalation or diplomatic magic, neither of which has historical precedent under such acute domestic hardening. My security-dilemma perspective and attention to base rates are even more validated in this environment. The tiny nonzero risk remains for a shock or performative, symbolic deal, but with less than eight weeks remaining and adverse trends, sticking with my initial 6% is both bold and best justified.",
            "revised_probability": 6
        },
        "Middle East Studies (Regional Security Complex Theory)": {
            "my_phase1_final_probability": 12,
            "reasoning_for_revised_probability": "The deliberation reinforced and sharpened the core pessimistic base-rate logic underlying my initial assessment. Multiple forecasters drew on parallel historical analogies showing even longer lag times to IAEA access after crisis, and emphasized that Track Two diplomacy or diplomatic surprises play out almost exclusively over months, not weeks. Critiques highlight the fully institutionalized nature of Iran’s technical and legal arguments for delay, and the absence of credible near-term exogenous shocks or new incentives—meaning the only plausible pathway to Yes would require an abrupt, externally induced existential threat, which is not evidenced in the current open-source environment. My original estimate reflected a slim window for tactical reversal driven by acute external dangers or economic panic, but upon reflection, even this looks slightly high. The odds that Iran would risk a regime credibility crisis for an ambiguous gesture—especially when the technical pretext for stalling is perfect and sanctioned at the highest levels—are even lower than my initial assessment. In short, the noise of possible performative gestures or last-minute deals is further outweighed by hardened regime resolve and the cost-free 'under rubble' narrative. As such, I am revising down to 8%.",
            "revised_probability": 8
        }
    },
    "revision_probability": [
        10,
        14,
        12,
        13,
        10,
        12,
        13,
        11,
        6,
        8
    ],
    "revision_mean_probability": 10.9,
    "revision_sd": 2.4698178070456938,
    "revision_probability_result": 11,
    "question_details": {
        "id": 40193,
        "title": "Will Iran allow the IAEA to inspect its stockpile of enriched uranium before 2026?",
        "created_at": "2025-11-05T19:20:33.417844Z",
        "open_time": "2025-11-06T15:30:00Z",
        "cp_reveal_time": "2025-11-06T17:00:00Z",
        "spot_scoring_time": "2025-11-06T17:00:00Z",
        "scheduled_resolve_time": "2026-01-01T01:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-11-06T17:00:00Z",
        "actual_close_time": "2025-11-06T17:00:00Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "A [brief, 12-day war](https://en.wikipedia.org/wiki/Iran%E2%80%93Israel_war) between Iran and Israel in June 2025 ended when American B-2 bombers dropped several [GBU-57](https://en.wikipedia.org/wiki/GBU-57A/B_MOP) 30,000-pound bunker-buster bombs on Iran's nuclear facilities in Natanz, Fordow, and Isfahan. On June 25, a day after the ceasefire began, Iranian lawmakers [overwhelmingly voted](https://www.rferl.org/a/iran-parliament-suspend-iaea-cooperation-nuclear/33454363.html) to suspend Iran's cooperation with the International Atomic Energy Agency (IAEA).\n\nOn September 9, 2025, Iran and the IAEA [announced](https://www.reuters.com/world/middle-east/iran-iaea-announce-agreement-resuming-nuclear-inspections-2025-09-09/) a deal to resume inspections at the bombed nuclear sites. But more recently, on October 20, [Reuters reported](https://www.reuters.com/world/middle-east/iran-says-cooperation-deal-with-un-nuclear-watchdog-is-void-2025-10-20/) that the deal had been scrapped. The IAEA [estimates](https://www.fdd.org/analysis/2025/10/20/iaea-chief-assesses-irans-enriched-uranium-stockpile-remains-inside-sites-destroyed-by-israel-and-u-s/) that Iran has 400 kilograms of 60% enriched uranium stockpiled at the bombed nuclear facilities.\n\n`{\"format\":\"metac_reveal_and_close_in_period\",\"info\":{\"post_id\":40437,\"question_id\":40007}}`",
        "resolution_criteria": "The question will resolve as **Yes** if, before January 1, 2026, Iran announces an agreement to allow the IAEA to inspect its stockpiles of enriched uranium at the Fordow, Natanz, and Isfahan nuclear sites.",
        "fine_print": "",
        "post_id": 40604,
        "aggregations": {
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**IAEA Inspectors Denied Access to Bombarded Iranian Nuclear Sites Amid Rising Tensions**\nAccording to a Financial Times (FT) article, the International Atomic Energy Agency (IAEA) has been denied access to nuclear facilities in Fordo, Natanz, and Isfahan in Iran—sites reportedly bombed by the United States—despite approximately ten IAEA inspections conducted in Iran since its conflict with Israel in June 2024. IAEA Director General Rafael Grossi confirmed that movement near uranium enrichment sites was observed in October 2024, but emphasized this does not indicate active enrichment. Iran's Foreign Ministry spokesperson Esmaeil Baghaei stated that Grossi is 'fully aware' of the peaceful nature of Iran's nuclear program and should refrain from 'unfounded opinions.' Iranian officials previously accused the IAEA of justifying Israel’s attacks, which began the day after the IAEA Board of Governors declared Iran in violation of its non-proliferation obligations. Grossi told FT that while the IAEA seeks to understand Iran’s 'difficult' circumstances, Iran must still comply with its safeguards obligations. He warned that if Iran is treated as exempt due to war, the IAEA would lose all visual access to materials. Grossi also highlighted the unresolved fate of 408 kilograms of uranium enriched nearly to weapons-grade levels. The FT notes experts fear Israel may launch further attacks if concerns over high-enriched uranium stocks are not addressed and if no progress is made on a nuclear deal between Washington and Tehran.\nOriginal language: ru\nPublish date: November 05, 2025 05:31 PM\nSource:[НОВОСТИ Mail.Ru](https://news.mail.ru/politics/68597023/)\n\n**Grossi Urges Iran to Avoid 'Confrontation' with the West Over Nuclear Program**\nRafael Grossi, Director General of the International Atomic Energy Agency (IAEA), warned Iran that its membership in the Non-Proliferation Treaty (NPT) is conditional upon fulfilling its commitments, urging improved cooperation with IAEA inspectors to avoid confrontation with the West. In an interview with the Financial Times, Grossi revealed that the IAEA conducted approximately 12 inspections since the outbreak of the Iran-Israel war in June 2024 but was denied access to key nuclear sites, including Fordo, Natanz, and Isfahan—sites previously targeted in U.S. airstrikes. He emphasized that the attacks caused significant damage and that the fate of 408 kilograms of uranium enriched close to weapons-grade remains unclear, heightening the urgency for resumed inspections. Grossi stated, 'Iran cannot claim membership in the NPT while failing to meet its obligations,' and stressed that the IAEA seeks to manage its 'volatile' relationship with Tehran through understanding and restraint, but cannot accept war as a justification for evading responsibilities. In response, Iranian Foreign Ministry spokesperson Ismail Baghaei asserted that the IAEA 'understands the peaceful nature of Iran’s nuclear program' and urged it to avoid 'statements not grounded in reality.' Foreign Minister Abbas Araghchi claimed Iran’s enriched uranium stockpile is 'buried under rubble' and reiterated Iran’s refusal to negotiate with the U.S. on 'zero enrichment' or its missile program, though it remains open to fair nuclear talks based on 'mutual benefit.' Following the 12-day conflict, Iran suspended cooperation with the IAEA, prompting analysts and diplomats to warn that continued uncertainty over the enriched uranium could lead Israel to launch new strikes, especially amid stalled U.S.-Iran negotiations. Observers stress that resolving the crisis requires full access for international inspectors, clarification on the fate of the enriched uranium, and genuine political will to restart dialogue. China’s Foreign Minister Wang Yi, in a phone call with Araghchi, urged resumption of nuclear talks, commended Iran’s reaffirmation of the peaceful nature of its program, and affirmed support for its right to peaceful nuclear energy, calling for all parties to maintain communication channels. This follows the UN’s reinstatement of nuclear-related sanctions in September 2024 after the UK, France, and Germany activated the 'snapback mechanism' over alleged violations of the 2015 nuclear deal. The June 2024 attacks on Iran’s nuclear facilities by the U.S. and Israel have severely strained relations between Tehran and the IAEA.\nOriginal language: ar\nPublish date: November 05, 2025 04:39 PM\nSource:[صحيفة الشرق الأوسط](https://aawsat.com/node/5205452)\n\n**Grossi Warns: Iran Still Holds All Enriched Uranium After Recent Nuclear Strikes**\nRafael Grossi, Director General of the International Atomic Energy Agency (IAEA), warned on Wednesday, November 5, 2025, that tensions between Iran and Western countries persist due to Iran's lack of cooperation in inspections of its nuclear facilities. According to Grossi, Iran has not allowed IAEA inspectors access to its most critical sites since the recent Israeli and American strikes. He stated that Iran still retains nearly its entire stockpile of enriched uranium, despite damage to nuclear facilities during the brief conflict with Israel in June 2025. The targeted facilities include Fordo, Natanz, and Isfahan. Grossi emphasized that the fate of approximately 408 kilograms of uranium close to weapons-grade use remains unknown, heightening the urgency for resumed inspections. The IAEA has conducted around 12 inspection visits since the attacks but has been denied access to key sites. Grossi noted that relations with Tehran are managed through efforts to reach understanding, but require greater Iranian commitment to transparency. This information was reported by 'Al-Bawaba' news portal.\nOriginal language: ar\nPublish date: November 05, 2025 02:15 PM\nSource:[بوابة اخبار اليوم](https://m.akhbarelyom.com/news/NewDetails/4719682/1/%D8%AC%D8%B1%D9%88%D8%B3%D9%8A-%D9%8A%D8%AD%D8%B0%D8%B1-%D8%A5%D9%8A%D8%B1%D8%A7%D9%86-%D9%85%D8%A7-%D8%B2%D8%A7%D9%84%D8%AA-%D8%AA%D8%AD%D8%AA%D9%81%D8%B8-%D8%A8%D9%83%D9%84-%D8%A7%D9%84%D9%8A%D9%88%D8%B1)\n\n**IAEA Urges Iran for Substantial Improvement in Cooperation with Inspectors**\nRafael Grossi, Director General of the International Atomic Energy Agency (IAEA), urged Iran to make a 'substantial improvement' in its cooperation with UN international inspectors, warning that escalating tensions with the West could have serious consequences. Despite nearly 12 inspections conducted by the IAEA in Iran since the conflict with Israel in June 2024, access has been denied to key nuclear sites including Fordo, Natanz, and Isfahan—locations previously targeted by U.S. strikes. Grossi emphasized that the fate of 408 kilograms of uranium enriched to levels near weapons-grade remains unclear, creating an 'increasing sense of urgency' to resume inspections, stating, 'We really need to restart inspection activities.' The IAEA relies on satellite imagery to monitor sites damaged by airstrikes. While Grossi stated that referring Iran to the UN Security Council is not currently necessary, he stressed that cooperation must improve significantly. Iran suspended its cooperation with the IAEA following the war and has faced strong criticism from Iranian officials toward both the agency and Grossi. In response, European powers invoked the 'snapback mechanism' at the UN, demanding the reimposition of international sanctions due to Iran’s lack of cooperation. The European countries called for Iran to resume talks with the U.S., fully cooperate with the IAEA, and clarify the status of its high-enriched uranium stockpile. Iran’s Foreign Ministry spokesperson, Ismail Baghaei, criticized the 'contradictory statements' from IAEA officials, saying they would not serve cooperation. Iran asserts its right to uranium enrichment under the Non-Proliferation Treaty and claims it will not abandon enrichment but is open to discussing potential restrictions. The IAEA previously reported unverified movements at inaccessible nuclear sites and emphasized the need to confirm that enriched uranium has not been diverted for military use. Grossi told the Financial Times that 'the damage was severe, but our available assessment indicates that most, if not all, of the uranium enriched to 60 percent—along with material enriched to 20%, 5%, and 2%—remains present,' adding, 'The material is still there, and although we do not attribute any final purpose to it, the mere availability of highly enriched uranium, approaching weapons-grade, is a source of concern.'\nOriginal language: ar\nPublish date: November 05, 2025 02:04 PM\nSource:[اليوم السابع](https://m2.youm7.com/story/2025/11/5/%D9%88%D9%83%D8%A7%D9%84%D8%A9-%D8%A7%D9%84%D8%B7%D8%A7%D9%82%D8%A9-%D8%A7%D9%84%D8%B0%D8%B1%D9%8A%D8%A9-%D8%AA%D8%AF%D8%B9%D9%88-%D8%A5%D9%8A%D8%B1%D8%A7%D9%86-%D8%A5%D9%84%D9%89-%D8%AA%D8%AD%D8%B3%D9%8A%D9%86-%D8%AC%D9%88%D9%87%D8%B1%D9%8A-%D9%81%D9%8A-%D8%A7%D9%84%D8%AA%D8%B9%D8%A7%D9%88%D9%86/7185700)\n\n**IAEA urges Iran to step up cooperation**\nThe International Atomic Energy Agency (IAEA) chief, Rafael Grossi, urged Iran to 'seriously improve' its cooperation with UN nuclear inspectors to prevent escalating tensions with the West, according to a November 5, 2025 report by The Express Tribune citing the Financial Times. Grossi stated that despite approximately a dozen inspections conducted in Iran since hostilities with Israel began in June 2025, access to key nuclear facilities—including Fordow, Natanz, and Isfahan—had not been granted, facilities that were previously bombed by the United States. In October 2025, Grossi reported detecting movement near Iran’s enriched uranium stockpile but clarified that this did not indicate active enrichment. Iranian Foreign Ministry spokesperson Esmaeil Baghaei responded by asserting that Grossi was 'fully aware of the peaceful nature' of Iran’s nuclear program and criticized him for expressing 'unfounded opinions.' Iranian officials have accused the IAEA of providing a pretext for Israel’s military actions, which commenced the day after the IAEA board voted to declare Iran in violation of its obligations under the Nuclear Non-Proliferation Treaty.\nOriginal language: en\nPublish date: November 05, 2025 09:04 PM\nSource:[The Express Tribune](https://tribune.com.pk/story/2576081/iaea-urges-iran-to-step-up-cooperation)\n\n**IAEA Inspectors Denied Access to Bombarded Iranian Nuclear Sites Amid Rising Tensions**\nAccording to a Financial Times (FT) article, the International Atomic Energy Agency (IAEA) has been denied access to nuclear facilities in Fordo, Natanz, and Isfahan in Iran—sites reportedly bombed by the United States—despite approximately ten IAEA inspections conducted in Iran since its conflict with Israel in June 2024. IAEA Director General Rafael Grossi confirmed that movement near uranium enrichment sites was observed in October 2024, but emphasized this does not indicate active enrichment. Iran's Foreign Ministry spokesperson Esmaeil Baghaei stated that Grossi is 'fully aware' of the peaceful nature of Iran's nuclear program and should refrain from 'unfounded opinions.' Iranian officials previously accused the IAEA of justifying Israel’s attacks, which began the day after the IAEA Board of Governors declared Iran in violation of its non-proliferation obligations. Grossi told FT that while the IAEA seeks to understand Iran’s 'difficult' circumstances, Iran must still comply with its safeguards obligations. He warned that if Iran is treated as exempt due to war, the IAEA would lose all visual access to materials. Grossi also highlighted the unresolved fate of 408 kilograms of uranium enriched nearly to weapons-grade levels. The FT notes experts fear Israel may launch further attacks if concerns over high-enriched uranium stocks are not addressed and if no progress is made on a nuclear deal between Washington and Tehran.\nOriginal language: ru\nPublish date: November 05, 2025 05:31 PM\nSource:[НОВОСТИ Mail.Ru](https://news.mail.ru/politics/68597023/)\n\n**Grossi Urges Iran to Avoid 'Confrontation' with the West Over Nuclear Program**\nRafael Grossi, Director General of the International Atomic Energy Agency (IAEA), warned Iran that its membership in the Non-Proliferation Treaty (NPT) is conditional upon fulfilling its commitments, urging improved cooperation with IAEA inspectors to avoid confrontation with the West. In an interview with the Financial Times, Grossi revealed that the IAEA conducted approximately 12 inspections since the outbreak of the Iran-Israel war in June 2024 but was denied access to key nuclear sites, including Fordo, Natanz, and Isfahan—sites previously targeted in U.S. airstrikes. He emphasized that the attacks caused significant damage and that the fate of 408 kilograms of uranium enriched close to weapons-grade remains unclear, heightening the urgency for resumed inspections. Grossi stated, 'Iran cannot claim membership in the NPT while failing to meet its obligations,' and stressed that the IAEA seeks to manage its 'volatile' relationship with Tehran through understanding and restraint, but cannot accept war as a justification for evading responsibilities. In response, Iranian Foreign Ministry spokesperson Ismail Baghaei asserted that the IAEA 'understands the peaceful nature of Iran’s nuclear program' and urged it to avoid 'statements not grounded in reality.' Foreign Minister Abbas Araghchi claimed Iran’s enriched uranium stockpile is 'buried under rubble' and reiterated Iran’s refusal to negotiate with the U.S. on 'zero enrichment' or its missile program, though it remains open to fair nuclear talks based on 'mutual benefit.' Following the 12-day conflict, Iran suspended cooperation with the IAEA, prompting analysts and diplomats to warn that continued uncertainty over the enriched uranium could lead Israel to launch new strikes, especially amid stalled U.S.-Iran negotiations. Observers stress that resolving the crisis requires full access for international inspectors, clarification on the fate of the enriched uranium, and genuine political will to restart dialogue. China’s Foreign Minister Wang Yi, in a phone call with Araghchi, urged resumption of nuclear talks, commended Iran’s reaffirmation of the peaceful nature of its program, and affirmed support for its right to peaceful nuclear energy, calling for all parties to maintain communication channels. This follows the UN’s reinstatement of nuclear-related sanctions in September 2024 after the UK, France, and Germany activated the 'snapback mechanism' over alleged violations of the 2015 nuclear deal. The June 2024 attacks on Iran’s nuclear facilities by the U.S. and Israel have severely strained relations between Tehran and the IAEA.\nOriginal language: ar\nPublish date: November 05, 2025 04:39 PM\nSource:[صحيفة الشرق الأوسط](https://aawsat.com/node/5205452)\n\n**IAEA chief urges Iran to restore nuclear transparency**\nIAEA Director General Rafael Grossi urged Iran to enhance cooperation with UN nuclear inspectors to prevent escalation with Western powers. Following a 12-day conflict with Israel in June 2024, which included US airstrikes on Iran’s Fordow, Natanz, and Isfahan nuclear sites, Iran has limited engagement with the IAEA. Iranian officials claim the damaged facilities can no longer be monitored under previous inspection frameworks and argue that IAEA reports contributed to the conflict. Although a new cooperation framework was signed in Cairo shortly after the war, Iran withdrew in September 2024 after France, Germany, and the UK activated the sanctions snapback mechanism. Since the war, the IAEA has conducted around a dozen inspections, but access to sensitive nuclear sites remains blocked—only the Bushehr nuclear power plant has been visited, where inspectors observed a routine fuel replacement. Iran has not formally withdrawn from the Nuclear Non-Proliferation Treaty (NPT), but Grossi warned that the status of 408kg of uranium enriched close to weapons-grade levels remains unclear. He stated, 'We should have already resumed the inspection work,' and cautioned that failing to meet NPT obligations cannot be justified by wartime circumstances. Grossi emphasized that even without a declared purpose, highly enriched uranium at 60%, 20%, 5%, and 2% levels poses a serious proliferation risk. He noted that current assessments indicate most or all of this material remains on site, but stressed that cooperation must improve significantly to avoid further diplomatic fallout. While referral to the UN Security Council is currently unnecessary, Grossi warned that continued non-compliance could lead to such action. Iranian Foreign Ministry spokesperson Esmaeil Baghaei responded on November 4, 2025, stating that 'contradictory remarks' by IAEA officials hinder constructive engagement.\nOriginal language: en\nPublish date: November 05, 2025 03:36 PM\nSource:[bne IntelliNews](https://www.intellinews.com/iaea-chief-urges-iran-to-restore-nuclear-transparency-409853/)\n\n**Grossi Warns: Iran Still Holds All Enriched Uranium After Recent Nuclear Strikes**\nRafael Grossi, Director General of the International Atomic Energy Agency (IAEA), warned on Wednesday, November 5, 2025, that tensions between Iran and Western countries persist due to Iran's lack of cooperation in inspections of its nuclear facilities. According to Grossi, Iran has not allowed IAEA inspectors access to its most critical sites since the recent Israeli and American strikes. He stated that Iran still retains nearly its entire stockpile of enriched uranium, despite damage to nuclear facilities during the brief conflict with Israel in June 2025. The targeted facilities include Fordo, Natanz, and Isfahan. Grossi emphasized that the fate of approximately 408 kilograms of uranium close to weapons-grade use remains unknown, heightening the urgency for resumed inspections. The IAEA has conducted around 12 inspection visits since the attacks but has been denied access to key sites. Grossi noted that relations with Tehran are managed through efforts to reach understanding, but require greater Iranian commitment to transparency. This information was reported by 'Al-Bawaba' news portal.\nOriginal language: ar\nPublish date: November 05, 2025 02:15 PM\nSource:[بوابة اخبار اليوم](https://m.akhbarelyom.com/news/NewDetails/4719682/1/%D8%AC%D8%B1%D9%88%D8%B3%D9%8A-%D9%8A%D8%AD%D8%B0%D8%B1-%D8%A5%D9%8A%D8%B1%D8%A7%D9%86-%D9%85%D8%A7-%D8%B2%D8%A7%D9%84%D8%AA-%D8%AA%D8%AD%D8%AA%D9%81%D8%B8-%D8%A8%D9%83%D9%84-%D8%A7%D9%84%D9%8A%D9%88%D8%B1)\n\n**IAEA Urges Iran for Substantial Improvement in Cooperation with Inspectors**\nRafael Grossi, Director General of the International Atomic Energy Agency (IAEA), urged Iran to make a 'substantial improvement' in its cooperation with UN international inspectors, warning that escalating tensions with the West could have serious consequences. Despite nearly 12 inspections conducted by the IAEA in Iran since the conflict with Israel in June 2024, access has been denied to key nuclear sites including Fordo, Natanz, and Isfahan—locations previously targeted by U.S. strikes. Grossi emphasized that the fate of 408 kilograms of uranium enriched to levels near weapons-grade remains unclear, creating an 'increasing sense of urgency' to resume inspections, stating, 'We really need to restart inspection activities.' The IAEA relies on satellite imagery to monitor sites damaged by airstrikes. While Grossi stated that referring Iran to the UN Security Council is not currently necessary, he stressed that cooperation must improve significantly. Iran suspended its cooperation with the IAEA following the war and has faced strong criticism from Iranian officials toward both the agency and Grossi. In response, European powers invoked the 'snapback mechanism' at the UN, demanding the reimposition of international sanctions due to Iran’s lack of cooperation. The European countries called for Iran to resume talks with the U.S., fully cooperate with the IAEA, and clarify the status of its high-enriched uranium stockpile. Iran’s Foreign Ministry spokesperson, Ismail Baghaei, criticized the 'contradictory statements' from IAEA officials, saying they would not serve cooperation. Iran asserts its right to uranium enrichment under the Non-Proliferation Treaty and claims it will not abandon enrichment but is open to discussing potential restrictions. The IAEA previously reported unverified movements at inaccessible nuclear sites and emphasized the need to confirm that enriched uranium has not been diverted for military use. Grossi told the Financial Times that 'the damage was severe, but our available assessment indicates that most, if not all, of the uranium enriched to 60 percent—along with material enriched to 20%, 5%, and 2%—remains present,' adding, 'The material is still there, and although we do not attribute any final purpose to it, the mere availability of highly enriched uranium, approaching weapons-grade, is a source of concern.'\nOriginal language: ar\nPublish date: November 05, 2025 02:04 PM\nSource:[اليوم السابع](https://m2.youm7.com/story/2025/11/5/%D9%88%D9%83%D8%A7%D9%84%D8%A9-%D8%A7%D9%84%D8%B7%D8%A7%D9%82%D8%A9-%D8%A7%D9%84%D8%B0%D8%B1%D9%8A%D8%A9-%D8%AA%D8%AF%D8%B9%D9%88-%D8%A5%D9%8A%D8%B1%D8%A7%D9%86-%D8%A5%D9%84%D9%89-%D8%AA%D8%AD%D8%B3%D9%8A%D9%86-%D8%AC%D9%88%D9%87%D8%B1%D9%8A-%D9%81%D9%8A-%D8%A7%D9%84%D8%AA%D8%B9%D8%A7%D9%88%D9%86/7185700)\n\n**Iran: Enriched Uranium Remains Under Ruins of Nuclear Facilities**\nIran's Foreign Minister Abbas Araghchi stated in a televised interview with Al Jazeera, published on his Telegram channel on November 2, 2025, that the 400 kilograms of uranium enriched to 60%—which disappeared after U.S. strikes on three major Iranian nuclear facilities—remain 'where they were before the attacks.' He emphasized that most of the material is located underground and that Iran has no intention of retrieving it until 'necessary conditions' are met. Araghchi acknowledged uncertainty about how much of the 400 kg survived the attacks, noting that the damage to the facilities, including buildings, equipment, and machinery, was 'significant.' However, he asserted that Iran's uranium enrichment technology remains intact and that 'our will has not disappeared, even after this.' The U.S. joined Israel in the conflict after Israel launched a large-scale attack on Iran on June 13, 2025, targeting nuclear and military sites. The U.S. conducted strikes on facilities in Fordo, Natanz, and Isfahan. A ceasefire agreement between Israel and Iran took effect on June 24, 2025. While Israel aimed to prevent Iran from developing a nuclear weapon—denied by Tehran—the U.S. intelligence found no evidence of such a program. U.S. President Donald Trump claimed the Iranian nuclear program was 'completely destroyed.' However, the International Atomic Energy Agency (IAEA) confirmed it cannot track the 400 kg of enriched uranium and its director, Rafael Grossi, stated in late June 2025 that Iran could resume enrichment within months. In response to U.S. calls for renewed negotiations, Araghchi said Iran might consider a 'reasonable, balanced, and fair' proposal but reiterated that it would not abandon uranium enrichment.\nOriginal language: ru\nPublish date: November 03, 2025 12:20 PM\nSource:[Deutsche Welle](https://www.dw.com/ru/glava-mid-irana-obogasennyj-uran-nahoditsa-pod-ruinami-adernyh-obektov/a-74597484)\n\n**U.N. Watchdog Agency Detects Nuclear Activity in Iran**\nRafael Grossi, Director of the International Atomic Energy Agency (IAEA), reported on October 31, 2025, that suspicious activity has been detected at Iran's bombed-out nuclear sites—Fordow, Natanz, and Isfahan—following U.S. and Israeli airstrikes in June 2025, which destroyed the facilities after the IAEA censured Iran for violating nuclear non-proliferation obligations. Although there is no evidence that Iran has resumed uranium enrichment, the IAEA believes the 'majority' of Iran's stockpile of near-weapons-grade uranium (enriched to 60%) remains intact and likely buried in the ruins of the destroyed sites. Grossi emphasized that the agency is currently inspecting in Iran but not at all required sites, with ongoing discussions to resume access to Natanz, Fordow, and Isfahan. He noted that while industrial activity is observed at the sites, it does not indicate enrichment work. Grossi stressed the importance of verifying the location and status of the enriched uranium to prevent diversion. He warned that if Iran could resume enrichment from 60% to weapons-grade, it could produce up to ten nuclear warheads. Additionally, European intelligence reports indicate Iran imported 2,000 tons of sodium perchlorate from China—a key component for solid-fuel ballistic missiles—though U.N. sanctions do not explicitly prohibit such imports. Jeffrey Lewis, director of the East Asia Nonproliferation Program, noted that this quantity could fuel around 500 missiles, suggesting Iran is replenishing depleted stockpiles after prior production levels of about 200 missiles per month.\nOriginal language: en\nPublish date: October 31, 2025 11:44 PM\nSource:[Breitbart](https://www.breitbart.com/middle-east/2025/10/31/u-n-nuclear-watchdog-detects-nuclear-activity-in-iran/)\n\n**IAEA: Iran Has Not Resumed Enrichment, But Activity Detected Near Uranium Stockpile**\nAccording to Rafael Grossi, head of the International Atomic Energy Agency (IAEA), Iran has not resumed uranium enrichment since the outbreak of the war with Israel in June 2024. However, IAEA inspectors have observed activity near facilities storing Iran's 60% enriched uranium stockpile. Grossi previously stated on October 18, 2024, that most of Iran's 60% enriched uranium remained in nuclear facilities in Isfahan, Fordo, and Natanz. These sites were targeted in Israel's 'Rising Lion' operation, which triggered the brief conflict, followed by U.S. strikes using bunker-busting bombs. Grossi confirmed that the facilities were severely damaged but the uranium stock itself was largely unaffected. A leaked IAEA report from September 2024 indicated Iran possessed 440 kilograms of enriched uranium by June 2024; Grossi now estimates this stock at approximately 400 kilograms. Access to the uranium will depend on Iran's willingness to cooperate. Grossi questioned whether the IAEA would be allowed to access the material, whether Iran would retain it, reduce enrichment levels again, or transfer it abroad, emphasizing that dialogue could prevent another round of airstrikes. Iran severed ties with the IAEA after the Israeli and U.S. strikes, then restored relations under a new framework allowing IAEA inspectors to enter nuclear sites only with approval from Iranian security agencies. However, Iranian Foreign Minister Abbas Araghchi announced this month that the agreement is no longer valid due to the activation of the European Union's 'trigger mechanism'.\nOriginal language: ar\nPublish date: October 29, 2025 07:35 PM\nSource:[Albawaba](https://www.albawabhnews.com/5285607)\n\n**UN Nuclear Chief Says Iran Isn't Actively Enriching Uranium but Movement Detected Near Stockpile**\nRafael Mariano Grossi, Director General of the International Atomic Energy Agency (IAEA), stated during an interview at UN headquarters on October 29, 2025, that Iran is not currently actively enriching uranium, though recent satellite imagery has detected movement around storage sites holding previously enriched uranium. Grossi emphasized that uranium enriched to 60%—which could enable Iran to produce up to 10 nuclear bombs if weaponized—remains in Iran, and the IAEA needs physical access to verify its status and prevent diversion. Despite a recent agreement signed in Cairo to resume cooperation, including inspections, implementation has not yet occurred. The agreement followed Iran’s suspension of cooperation after the June 2025 12-day war with Israel, during which the US conducted strikes on Iranian nuclear sites, including the Fordo facility. Preliminary US intelligence indicated the strikes only delayed Iran’s program by a few months, as the underground infrastructure at Fordo remained intact. The IAEA board had previously censured Iran for noncooperation—the first such action in 20 years—prompting Iran to accuse the agency of aiding Israel and the US, leading to threats against Grossi, who now receives protection from Austria’s Cobra unit. Grossi confirmed that inspectors are currently inside Iran and he maintains 'constant contact' with Foreign Minister Abbas Araghchi, though he stressed that cooperation is not at the required level and that the situation is neither fully denied nor fully compliant. Additionally, UN sanctions have been reimposed under the 'snapback' mechanism due to Iran’s noncompliance, further straining relations. Grossi confirmed there is no active enrichment operation at the Isfahan site as of October 29, 2025.\nOriginal language: en\nPublish date: October 29, 2025 06:10 PM\nSource:[Asharq Al-Awsat English](https://english.aawsat.com/node/5202964)\n\n**U.N. atomic watchdog chief said Iran's enriched uranium still under rubble from air attacks**\nAccording to Rafael Grossi, Director General of the International Atomic Energy Agency (IAEA), most of Iran's stockpile of highly enriched uranium—approximately 400 kilograms enriched to 60% (just below weapons-grade)—remains buried under rubble at nuclear facilities in Isfahan, Natanz, and Fordo following Israeli and U.S. airstrikes during a 12-day conflict in June 2025. Grossi stated that while the damage was severe, Iran's technical capabilities, including its centrifuges, remain intact and can be rebuilt. The IAEA confirmed no evidence that Iran intends to build a nuclear bomb, but acknowledged Iran possesses enough enriched uranium for at least 10 nuclear bombs. Satellite imagery from late September and early October indicates recent activity at two of the three tunnel entrances at the Isfahan complex, suggesting preparations for controlled access and enhanced protection against future strikes, according to the Institute for Science and International Security (ISIS). ISIS also noted that the U.S. and Israel have not publicly detailed the extent of damage at Isfahan, unlike the Fordo site. The think tank speculated that advanced Joint Multiple Effects Warhead System warheads may have been used on Tomahawk missiles, enhancing bunker-busting capability. Andrea Stricker of the Foundation for Defense of Democracies said Iran would risk military retaliation if it attempted to recover the buried uranium. Iranian Foreign Minister Abbas Araghchi stated that Iran will not return to nuclear negotiations with the U.S. under the Trump administration, citing 'excessive demands' and Washington's 'overreach' as reasons for the collapse of prior talks. Iran claims its restrictions on IAEA inspections are due to security concerns, which Grossi acknowledged. Grossi praised Iran's decision not to withdraw from the Non-Proliferation Treaty or become a pariah state like North Korea, but warned that failure of diplomacy could lead to renewed military action.\nOriginal language: en\nPublish date: October 23, 2025 04:06 PM\nSource:[Washington Times](https://www.washingtontimes.com/news/2025/oct/23/un-atomic-watchdog-chief-said-irans-enriched-uranium-still-rubble-air/)\n\n**U.N. Nuclear Watchdog Estimates Most of Iran's Uranium Is Intact**\nRafael Grossi, Director-General of the International Atomic Energy Agency (IAEA), stated on October 21, 2025, that the IAEA believes 'the majority' of Iran's stockpile of near-weapons-grade uranium—approximately 400 kilograms enriched to 60% purity—survived U.S. and Israeli airstrikes in June 2025 targeting Iran’s primary nuclear facilities at Isfahan, Fordow, and Natanz. Iranian officials, including Foreign Minister Abbas Araghchi, confirmed that most of the enriched uranium remains buried in the rubble of these sites. The IAEA has requested access to the uranium but has received limited cooperation from Iran. Satellite imagery analyzed by the Institute for Science and International Security (ISIS) indicates Iran is beginning to excavate tunnels at the Isfahan complex, though the activity appears focused on securing access and reinforcing entrances rather than immediately recovering uranium. FDD non-proliferation expert Andrea Striker noted that while Iran’s ability to enrich the 60% uranium to weapons-grade levels has been disrupted, any recovery effort would risk further military action by the U.S. and Israel. On October 21, 2025, Ali Larijani, Secretary of Iran’s Supreme National Security Council, announced Iran had canceled its inspection agreement with the IAEA, ending all cooperation with the agency. Larijani cited the European signatories (France, Germany, and the UK) invoking the 'snapback' mechanism in August 2025—triggered by Iran’s alleged JCPOA violations—as justification, calling the move a 'wrongdoing' and claiming Iran had met all obligations for the past 10 years. The U.N. Security Council imposed snapback sanctions in September 2025, a move endorsed by the U.S. but opposed by China and Russia, which continue to engage with Iran despite the sanctions.\nOriginal language: en\nPublish date: October 21, 2025 07:51 PM\nSource:[Breitbart](https://www.breitbart.com/middle-east/2025/10/21/u-n-nuclear-watchdog-estimates-most-of-irans-uranium-is-intact-but-blocked-from-verifying/)\n\n**IAEA chief Rafael Grossi: Iranian enriched uranium stockpile in bombed sites unharmed by US-Israeli airstrikes**\nIAEA Director Rafael Grossi stated in an interview with the Swiss daily Neue Zürcher Zeitung that Iran's stockpile of highly enriched uranium, estimated at approximately 400kg prior to the June 2024 airstrikes, remained largely intact despite Israeli and U.S. military strikes on key nuclear facilities in Isfahan, Fordo, Natanz, Arak, Tehran, Karaj, and the SPND headquarters. Grossi confirmed that the majority of the uranium is still located in these facilities, which were heavily damaged but partially underground, making access dependent on Iran's full cooperation—only likely if Iran perceives a national interest. The strikes, conducted by the Israeli Defense Forces using F-15, F-16, and F-35 aircraft, along with drones and precision-guided missiles, and later joined by the U.S. Air Force deploying GBU-57 bunker buster bombs and Tomahawk cruise missiles, caused extensive destruction to smaller sites but failed to significantly damage the deeper, fortified storage areas. Iran's uranium enrichment level has reached 60.8%, nearing the 90% threshold needed for weapons-grade material. Grossi emphasized that concerns over Iran's nuclear ambitions remain unaddressed, especially after the 2015 nuclear deal's termination, the reimposition of international sanctions, and Iran's subsequent freedom to pursue weapons-grade enrichment. He expressed encouragement over U.S. President Donald Trump's recent remarks in the Knesset advocating for diplomacy, stating that while past military actions cannot be undone, renewed dialogue could prevent further conflict. Iran's Foreign Minister Abbass Araghchi confirmed that much of the stockpile remains undamaged beneath rubble, though the IAEA has lost pre-strike knowledge of its condition. The Atomic Energy Organisation of Iran (AEOI) is currently assessing recovery methods, focusing on safety, container volatility, and technological feasibility. The IAEA has not yet regained access to the sites.\nOriginal language: en\nPublish date: October 20, 2025 01:13 PM\nSource:[http://www.uniindia.com/fadnavis-orders-probe-into-mumbai-pub-fire/states/news/1090400.html](http://uniindia.com/~/iaea-chief-rafael-grossi-iranian-enriched-uranium-stockpile-in-bombed-sites-unharmed-by-us-israeli-airstrikes/World/news/3616902.html)\n\n**UN nuclear watchdog believes most of Iran's enriched uranium unharmed by war with Israel**\nThe International Atomic Energy Agency (IAEA), led by Director Rafael Grossi, stated that most of Iran's enriched uranium—estimated at approximately 400 kilograms of 60% enriched uranium—remained intact following the 12-day conflict with Israel in June 2025. This assessment is based on a confidential IAEA report showing that Iran possessed 440.9 kilograms (972 pounds) of 60% enriched uranium as of June 13, 2025. Grossi confirmed that the uranium is still located in Iran’s damaged nuclear facilities, including Isfahan, Natanz, and Fordo, which were heavily struck by both Israel and the United States during the conflict. Despite the extensive damage, the IAEA has not been granted access to these sites due to Iran’s suspension of cooperation, which followed the agency’s failure to condemn the Israeli strikes. Iran now requires approval from its security body before allowing inspections, under a new cooperation framework. Grossi emphasized that Iran remains a party to the Nuclear Non-Proliferation Treaty and has not withdrawn from negotiations, urging a return to diplomatic talks to prevent further military escalation. Iran’s foreign minister, Abbas Araghchi, confirmed that enriched material remains 'under the rubble' of the attacked sites. While Iran denies seeking nuclear weapons, it has enriched uranium to levels with no peaceful use, obstructed inspections, and expanded its ballistic missile program, with evidence suggesting it had advanced toward weaponization prior to the June 13 attack.\nOriginal language: en\nPublish date: October 20, 2025 03:15 AM\nSource:[The Times of Israel](https://www.timesofisrael.com/un-nuclear-watchdog-believes-most-of-irans-enriched-uranium-unharmed-by-war-with-israel/)\n\n**Tehran Approves Resumption of Cooperation with IAEA**\nTehran’s Supreme National Security Council (SNSC) announced that its nuclear committee approved earlier signed agreements to resume cooperation with the International Atomic Energy Agency (IAEA). The document, signed on 9 September in Cairo by IAEA Director‑General Rafael Grossi and Iranian Foreign Minister Abbas Arakchi, will be contingent on safeguarding Iranian nuclear sites. The IAEA states that if any hostile actions against Iran or its nuclear facilities occur, including the reinstatement of previously suspended UN Security Council resolutions, the agreements will be suspended, as the document notes: 'В случае любых враждебных действий против Ирана и ее ядерных объектов, включая восстановление ранее прекращенных резолюций Совета Безопасности ООН, реализация этих договоренностей будет приостановлена'. Resuming inspections could help Iran avoid new economic sanctions imposed by Germany, the United Kingdom, France, the United States, China and Russia. In 2015 the three European states and the US, China and Russia signed the Joint Comprehensive Plan of Action (JCPOA) to prevent Iran from developing nuclear weapons. In 2018 the Trump administration unilaterally withdrew and imposed sanctions. Since then Tehran has gradually abandoned its obligations and resumed uranium enrichment, reportedly exceeding the JCPOA limit fourfold, a claim Iran denies. Cooperation with the IAEA was suspended after a 12‑day war in June 2025 when Israel and the US struck Iranian nuclear sites in Fordo, Natanz and Isfahan. IAEA inspectors were expelled on 2 July by President Masoud Peshgheian. In June 2025 Israel launched a massive attack on Iran, supported by the US, targeting mainly nuclear and military sites; Iran responded with missile and drone strikes. Rafael Grossi has repeatedly urged Tehran to allow inspections of the three damaged sites to assess damage and enriched uranium stockpiles, but the Iranian government has repeatedly refused.\nOriginal language: ru\nPublish date: September 14, 2025 12:06 PM\nSource:[Deutsche Welle](https://www.dw.com/ru/iran-odobril-soglasenie-o-vozobnovlenii-sotrudnicestva-s-magate/a-73989436)\n\n**Iran says enriched nuclear material 'under rubble' of facilities hit during Israel war | News**\nIran’s Foreign Minister Abbas Araghchi said that enriched nuclear material remains \"under the rubble\" of facilities damaged in the 12‑day war with Israel. He stated, \"All of our material is… under the rubble of the bombed facilities,\" and that the Atomic Energy Organization is assessing the stockpile. The new cooperation framework with the IAEA, agreed on Tuesday, allows UN inspectors only after approval by the Supreme National Security Council and distinguishes between attacked sites and unharmed ones such as the Bushehr reactor. Araghchi added, \"No inspections are currently on the agenda,\" and that the agreement would be \"no longer be valid\" if sanctions return. IAEA chief Rafael Grossi said the agreement covers all facilities and outlines inspection procedures. The agency reported that Iran held 440.9 kg of uranium enriched to up to 60 % as of 13 June, a level close to the ~90 % needed for weapons. Western countries have accused Iran of pursuing a nuclear weapon, a claim Tehran denies. In August Britain, France and Germany re‑imposed UN sanctions, which Iran calls illegal, and warned that the IAEA agreement would be voided if sanctions resume.\nOriginal language: en\nPublish date: September 12, 2025 03:20 AM\nSource:[Bangladesh Sangbad Sangstha (BSS)](https://www.bssnews.net/news/310949)\n\n**Iran’s Uranium Stockpile Still in Ruins of Targeted Facilities**\nIran’s Foreign Minister Abbas Iracagi said on Thursday that the country’s stock of enriched uranium remains in the wreckage of nuclear facilities that were bombed during the recent war with Israel, which the United States participated in. He explained that the Iranian Atomic Energy Organization is assessing the extent of damage and the possibility of accessing the material, in preparation for a report to the Supreme National Security Council. This comes amid growing concern in Western countries and the International Atomic Energy Agency (IAEA) about the fate of Iran’s enriched uranium after three nuclear sites were targeted in June. Tehran had suspended cooperation with the IAEA after the war but signed a new agreement on Tuesday with IAEA Director General Rafael Grossi to resume cooperation. Iracagi said the agreement gives the IAEA the right to inspect 'provided it obtains approval from the Supreme National Security Council', noting that inspectors currently cannot access some of the facilities that were bombed, while the agreement excludes facilities that have not been touched, such as the Bushehr nuclear plant. Grossi announced that the new cooperation framework covers 'all nuclear facilities and infrastructure in Iran', stressing that resuming inspections is essential for the stability of Iran’s nuclear file.\nOriginal language: ar\nPublish date: September 12, 2025 01:07 AM\nSource:[Albawaba](https://www.albawabhnews.com/5261350)\n\n**Iran enters new nuclear pact with UN for site inspection 3 months after Israel-US strike**\nOn September 11 2025, Iranian and United Nations negotiators announced an agreement to resume IAEA inspections of Iranian nuclear sites, following a Cairo meeting between IAEA head Rafael Grossi and Iran's foreign minister Abbas Araghchi. Grossi said the sides had agreed 'on practical modalities to resume inspection activities in Iran', marking a key step toward restoring oversight after Tehran halted cooperation three months earlier during the 12‑day war with Israel and subsequent US‑backed Israeli strikes on sites such as Natanz. The deal, brokered with Egyptian mediation, outlines procedures for inspection and notification and addresses facilities struck in June. Iran had halted inspections after the attacks, which involved heavy bunker‑busting bombs, and had amassed more than 880 pounds of highly enriched uranium, enough to produce multiple weapons if further processed. Western diplomats say the agreement may help avert a new sanctions crisis, as Britain, France and Germany had threatened to activate the 2015 nuclear accord's 'snapback' mechanism. Iranian officials, including spokesman Esmaeil Baghaei, view the pact as necessary amid the 'new situation' created by the attacks, but warned it could be voided if facilities were attacked again or if UN Security Council resolutions were reinstated. The IAEA remains concerned about Iran's growing stockpile, and the agreement provides a fragile pathway back to limited transparency, though experts note it may not resolve deeper disputes over enrichment limits or the legacy of the 2015 accord.\nOriginal language: en\nPublish date: September 11, 2025 03:05 AM\nSource:[Firstpost](https://www.firstpost.com/world/iran-nuclear-weapons-iran-israel-war-iaea-abbas-araghchi-13932576.html)\n\n**Iran Increased Near-Weapons-Grade Uranium Stockpile Ahead Of Israel Strike, Says IAEA**\nThe International Atomic Energy Agency (IAEA) released a confidential report indicating that Iran had increased its stockpile of uranium enriched to near weapons‑grade levels just before Israel’s airstrike campaign on June 13, 2025. The report, circulated among IAEA member states and obtained by the Associated Press, covers Iran’s nuclear activities between May 17 and June 12, 2025. It states that as of June 13, Iran possessed 440.9 kilograms (972 pounds) of uranium enriched up to 60 % purity, an increase of 32.3 kilograms (71.2 pounds) since the previous report in May. The IAEA emphasised that this data is 'based on the information provided by Iran, agency verification activities between the above provided dates, and estimates based on the past operation of the relevant facilities.' Enrichment to 60 % brings Iran alarmingly close to weapons‑grade uranium, which requires 90 % purity; experts note that approximately 42 kilograms of 60 % enriched uranium, if further enriched, could be enough to produce one atomic bomb. The report also notes that no agreement has been reached with Iran to resume inspections at nuclear sites damaged during Israeli and U.S. airstrikes in June, leaving the extent of the damage uncertain. Israel has justified its targeted strikes on Iranian military and nuclear facilities by arguing it cannot allow Tehran to develop nuclear weapons. Israeli officials have expressed growing alarm over Iran’s nuclear progress, while Iran insists its program is entirely peaceful and for civilian purposes. On June 22, the U.S. joined the offensive, deploying bunker‑buster bombs against suspected Iranian nuclear sites. In response, Iran’s newly elected president, Masoud Pezeshkian, signed a law on July 2, passed by the Iranian Parliament, suspending all cooperation with the IAEA. Since then, the only site the IAEA has accessed is the Bushehr Nuclear Power Plant, where inspectors observed a fuel replacement procedure on August 27 and 28. The IAEA expressed alarm in its report, stating inspectors have not been able to verify Iran’s near bomb‑grade uranium stockpile for over two and a half months, calling it 'a matter of serious concern.' Iran remains legally obligated to cooperate with the IAEA under the Treaty on the Non‑Proliferation of Nuclear Weapons (NPT).\nOriginal language: en\nPublish date: September 03, 2025 08:38 PM\nSource:[News18](https://www.news18.com/world/iran-increased-near-weapons-grade-uranium-stockpile-ahead-of-israel-strike-says-iaea-ws-l-9547861.html)\n\n",
    "date": "2025-11-06T15:43:04.650462",
    "summary": "All experts agree that the probability Iran will allow IAEA inspections of its enriched uranium stockpile before January 1, 2026 is low, with estimates ranging from 6% to 18%. The dominant reasons are: (1) the acute breakdown in relations and trust after the June 2025 war and snapback of UN sanctions, (2) hardliner dominance in Iranian domestic politics and the overwhelming parliamentary vote to suspend IAEA cooperation, (3) Iran's use of transparency as leverage for concessions, with no sign the West will offer sanctions relief or other incentives in the remaining weeks, and (4) genuine technical and safety barriers at the bombed facilities. Some analysts note a marginal nonzero chance for a dramatic, last-minute tactical reversal if external military threats escalate or if major powers mediate a face-saving compromise. However, most consider this unlikely given precedent: Iran historically takes months or longer to restore access after conflicts, only does so under reciprocal bargaining, and currently signals increased, not decreased, defiance. Risk calculations related to regime survival, face, and deterrence dominate over legal or institutional obligations. Technical access is further hampered by Iran’s claim that uranium is 'under rubble', creating an additional pretext to delay. Across IR theory lenses—realism, liberal institutionalism, constructivism, and security studies—as well as from nuclear policy and diplomatic practice viewpoints, the core assessment is remarkably consistent: unless a major unforeseen crisis or concession occurs, Iran will not announce renewed IAEA access before the deadline. Most forecasts cluster between 10% and 14%, with the lowest at 6% and multiple experts choosing 10% or 13-14%.",
    "forecasters": [
        "Nuclear Policy (NonProliferation Treaty Regime)",
        "Nuclear Policy (IAEA Safeguards System)",
        "Diplomacy (Track Two Diplomacy)",
        "Diplomacy (International Negotiation Practice)",
        "International Relations (Realism)",
        "International Relations (Liberal Institutionalism)",
        "International Relations (Constructivism)",
        "Security Studies (Nuclear Nonproliferation Theory)",
        "Security Studies (Security Dilemma)",
        "Middle East Studies (Regional Security Complex Theory)"
    ]
}