{
    "deliberation_results": {
        "Regulatory Affairs (FDAApplicationSubmission)": {
            "time_to_resolution": "Approximately 2 months and 3 weeks (until December 31, 2025).",
            "perspective_relevance": "As an expert in Regulatory Affairs and FDA Application Submission, I bring critical insight into the procedural hurdles, strategic sponsor behaviors, and regulatory nuances that can expedite or delay psychedelic drug applications (NDAs, EUAs) and DEA rescheduling decisions. My expertise allows me to distinguish between media hype/progress in clinical research and the actual likelihood of a regulatory submission or schedule change within a defined timeframe.",
            "status_quo": "Since the FDA’s public rejection of MDMA-assisted therapy in August 2024, no NDA, EUA, or DEA rescheduling for a classic or novel psychedelic for a DSM-5 mental disorder has been filed or completed, though clinical and political interest remain high. Currently, esketamine remains the only psychedelic-related agent approved for depression in the US.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent FDA Rejection of MDMA for PTSD (Lykos Therapeutics, August 2024)",
                    "effect": "Decreases probability: The FDA articulated significant efficacy and safety concerns, requiring a new clinical trial, which, under ordinary development timelines, makes a resubmission before end-2025 unlikely for MDMA/PTSD."
                },
                {
                    "factor": "Political/Administrative Shifts and Prioritization of Psychedelic Therapies",
                    "effect": "Increases probability: Under the Trump administration and with support from figures like RFK Jr., there is new momentum for regulatory innovation, including expedited review pathways, reduced timeline requirements, and intention to relax standards for placebo controls and support for compassionate/EUA routes."
                },
                {
                    "factor": "Intense Unmet Medical Need and Broadening Public/Legislative Support",
                    "effect": "Increases probability: Heightened mental health crisis, strong lobbying by veterans and public figures, and recent Congressional/State-level moves (e.g., Texas ibogaine program) add pressure for federal action, perhaps through the DEA or an EUA mechanism."
                },
                {
                    "factor": "Regulatory Precedents (Breakthrough Designations, Rapid Ketamine Pathway, Orphan Programs)",
                    "effect": "Increases probability: The FDA previously issued Breakthrough Therapy Designations to MDMA and psilocybin, showing agency willingness to accelerate review under the right circumstances. The precedent set with ketamine/esketamine for depression/ideation suggests a possible template."
                },
                {
                    "factor": "R&D/Trial Timelines and FDA Submission Readiness",
                    "effect": "Decreases probability: Most late-stage global psychedelic trials are not due to complete until 2026 or later. US NDA submissions usually trail large Phase 3 readouts by months, and even 'file-and-refuse' filings (to meet resolution criteria) require minimal trial completion."
                },
                {
                    "factor": "Distinct Possibility of DEA Rescheduling",
                    "effect": "Increases probability: As per the criteria, rescheduling (e.g., from I to II) of a psychedelic for mental health indications suffices, and the DEA is currently considering rescheduling cannabis in parallel, indicating institutional openness to rapid action if White House support exists."
                },
                {
                    "factor": "Recent IND Clearance for a Novel MDMA Formulation for Generalized Anxiety Disorder (GAD)",
                    "effect": "Marginal: IND acceptance alone does not fulfill resolution criteria, but if Arcadia Medicine or others seek a backdoor EUA for high-need populations, this could accelerate progress if public or political pressure harmonizes."
                },
                {
                    "factor": "Psychedelics Market and Industry Behavior",
                    "effect": "Neutral/slightly increases: With investor money flowing and companies motivated to file NDAs to satisfy public shareholders or create news for additional fundraising, sponsors may attempt early filings (even if high risk of CRL/rejection)."
                }
            ],
            "no_scenario": "Despite new administrative priorities and strong lobbying, (a) ongoing clinical trials for major psychedelic candidates (psilocybin, MDMA, LSD) do not yield pivotal results in time to file a US NDA, (b) sponsors refrain from symbolic or low-data-risk filings, (c) the DEA holds off on rescheduling due to remaining unresolved safety/public health concerns, and (d) the FDA does not permit an emergency use application in the absence of an extraordinary threat (like the COVID-19 precedent).",
            "yes_scenario": "A sponsor (potentially for psilocybin, MDMA, or an analog) leverages expedited agency pathways or political favor to file an NDA or EUA—perhaps in the context of mounting evidence for treatment-resistant depression or PTSD, possibly supported by international approvals (e.g., Australia, Czech Republic). Alternatively, the DEA—under administrative instruction or political pressure—initiates a rescheduling of one or more psychedelics to Schedule II, aligning with public health declarations or Congressional/veteran advocacy.",
            "final_reasoning": "Despite the legitimate procedural barriers for a clean, data-driven NDA or EUA on classic psychedelics within 2025, there is extraordinary political and societal pressure for progress after the recent MDMA rejection, coupled with clear signals from the Trump administration that psychedelic approvals are now 'top priority.' The resolution criteria are notably generous—any NDA, EUA or DEA rescheduling for a psychedelic and a DSM-5 mental disorder is sufficient, regardless of application success. Enhanced FDA leadership attention, explicit calls for timeline reduction, and a high-profile pipeline of Phase 2/3 candidates (even if some are not yet fully mature) all raise the probability of some sponsor or federal agency taking a 'first mover' action before year's end, especially given positive precedents in other countries, and mounting bipartisan support (including significant veteran lobbying). While base rates for psychedelic NDA filings have historically been virtually zero, the policy and political environment has shifted sharply. A highly likely path is the DEA opting to reschedule at least one psychedelic—possibly MDMA or psilocybin—based on public and administrative pressure, irrespective of new clinical submissions. Thus, despite procedural headwinds, the confluence of political, regulatory, and sponsor incentives makes a Yes outcome modestly* more probable than not.",
            "final_probability": 67
        },
        "Regulatory Affairs (BreakthroughTherapyDesignation)": {
            "time_to_resolution": "Approximately 2 months and 3 weeks (until Dec 31, 2025)",
            "perspective_relevance": "As an expert in Regulatory Affairs with a focus on Breakthrough Therapy Designation (BTD), I have deep insight into the timing, requirements, and nuances surrounding US FDA and DEA regulatory processes for psychedelic compounds in mental health, including pathways such as NDA, EUA, and DEA rescheduling. I can distinguish between hope and reality in sponsor statements, spot regulatory bottlenecks that are invisible to the general public, and contextualize policy shifts in the broader landscape of drug development.",
            "status_quo": "The US FDA declined to approve MDMA for PTSD in August 2024, citing concerns with trial blinding, efficacy, and durability of response. No NDAs are known to be currently filed for other psychedelics for mental disorders, and North American regulatory posture remains cautious. Congress and federal agencies are only starting to reconsider psychedelic regulations, with no rescheduling having occurred for DSM-5 indications since the 1970s. As of early October 2025, no NDA, EUA, or federal DEA rescheduling for psychedelics (outside of ketamine/esketamine, already approved for depression) has occurred.",
            "perspective_derived_factors": [
                {
                    "factor": "Political and Regulatory Signals",
                    "effect": "INCREASE – The FDA, under a new administration, has signaled openness to reconsidering psychedelic approvals and accelerating review timelines (potentially as short as one month). Influential advocates (Robert F. Kennedy Jr., Trump allies) and policy changes (e.g., Texas funding, HHS hiring proponents) support this shift, increasing plausibility of action within 2025."
                },
                {
                    "factor": "Clinical Data and Application Readiness",
                    "effect": "DECREASE – Recent high-profile rejection (MDMA for PTSD) and the explicit call for new, rigorous trials highlight that pivotal studies for most psychedelics either lacked sufficient blinding/durability or have not yet finished. The most advanced programs (psilocybin for depression, 5-MeO-DMT) report ongoing or just completed phase 3 trials, but sponsors have not announced imminent NDAs/EUAs for new molecules in the US. Compass Pathways (psilocybin) phase 3 may finish soon but has not publicly announced an application for 2025."
                },
                {
                    "factor": "Breakthrough Therapy and Fast Track Designation Trends",
                    "effect": "INCREASE – The FDA has repeatedly issued BTD and Fast Track for MDMA, psilocybin, and related compounds, demonstrating interest and regulatory flexibility, which can expedite sponsor engagement and potentially trigger an NDA/EUA filing if any new results are positive or new sponsors (like Arcadia Medicine with AM-1002/MDMA) believe their products address FDA’s prior objections."
                },
                {
                    "factor": "DEA Rescheduling Pathway (Non-FDA-Dependent)",
                    "effect": "MODERATE INCREASE – Even without a successful NDA, DEA rescheduling could trigger a Yes (e.g., moving psilocybin or MDMA to Schedule II or III for medical use after advocacy or via emergency or policy-driven action). The political climate suggests possible appetite, though concrete moves would likely trail a public application or high-profile push."
                },
                {
                    "factor": "Industry Funding and Sponsor Capacity",
                    "effect": "DECREASE – Statements from smaller sponsors (e.g., Cellectar, Jaguar) in other therapeutic areas note that NDA filings are contingent on new funding. Psychedelic commercial sponsors are reliant on capital-intensive clinical programs; unless a major player or a philanthropist intervenes, some applications may be delayed beyond 2025."
                },
                {
                    "factor": "Precedent and Base Rates",
                    "effect": "DECREASE – Historically, the gap between phase 3 readout and NDA submission for breakthrough CNS/psychiatric drugs is 12–24 months, sometimes more if trials are marginal or contentious. Rapid EUA is rare in mental health, and the only precedent for rapid approval/rescheduling in this space is ketamine/esketamine (which took years and concerted pharma effort)."
                }
            ],
            "no_scenario": "Despite a supportive political climate, no sponsor in the US manages to file a new NDA or EUA for a psychedelic targeting a DSM-5 mental disorder in 2025 due to timing (trials completing after submission deadlines), ongoing regulatory caution following the Lykos/MDMA rejection, or lack of adequate data to satisfy even a more permissive FDA. Likewise, DEA does not move forward on rescheduling (e.g., waiting for FDA/NIH safety/efficacy recommendation or in the absence of strong clinical/federal impetus).",
            "yes_scenario": "A sponsor (e.g., Compass Pathways, Arcadia Medicine, or another company with advanced-phase data or new formulation/indication, such as AM-1002 for GAD or psilocybin for treatment-resistant depression) submits an NDA or EUA to the FDA for a psychedelic, emboldened by FDA signals of expedited review, or a coalition of political/regulatory actors manages to push through DEA rescheduling for at least one psychedelic, e.g., via a veterans' or palliative use carve-out. Alternatively, an exceptional EUA (e.g., for veterans with depression/PTSD) is filed on a compassionate basis following new phase 3 or expanded access data.",
            "final_reasoning": "There is clear regulatory, political, and public interest momentum for psychedelic therapies in mental health, further buoyed by international moves (Australia, Czech Republic, Spain). The FDA, under Makary and political pressure, is not fundamentally opposed to rescheduling or NDA/EUA filings for psychedelics, especially for new indications, new formulations (Arcadia’s non-racemic MDMA), or strong unmet need populations (veterans, treatment-resistant depression). However, the main limiting factor is clinical data sufficiency, practical readiness of trials/NDA dossiers, and availability of funding and sponsor capacity to actually file within the. 2025 window. The base rate for NDA submissions within a year of phase III completion is <50% in psychiatry and psychedelics, but strong signals from FDA and new sponsors (AM-1002, for example) raise the odds; even a single filing by a determined sponsor or a well-timed DEA decision would resolve Yes. On the other hand, sponsors (e.g., Lykos, Compass Pathways) may still need more time to address FDA’s concerns from past CRLs. I assign a moderate-to-high probability, but far from certainty, weighted toward the possibility that at least one sponsor attempts an NDA or EUA or that DEA rescheduling occurs, even if approval is not ultimately granted in 2025.",
            "final_probability": 62
        },
        "Clinical Trial Management (INDApplicationProcess)": {
            "time_to_resolution": "Approximately 2 months and 3 weeks (question resolves January 1, 2026)",
            "perspective_relevance": "As an expert in Clinical Trial Management and IND Application Process, I closely follow regulatory pathways for drug approval, including timelines, pitfall factors, and the granular requirements of FDA/DEA submissions. My perspective allows me to interpret the news about clinical progress, regulatory sentiment, and political context with a focus on practical likelihood for NDA/EUA filings or DEA rescheduling.",
            "status_quo": "There has not been any psychedelic NDA, EUA filing, or DEA rescheduling for a mental health indication since the recent (August 2024) FDA rejection of MDMA for PTSD, nor publicly reported plans for submission of any other major psychedelic for mental health to the FDA/DEA in 2025. Many psychedelic candidates remain in late-stage (Phase 2/3) trials, with some progress in Europe. In the US, ketamine is already available (not relevant as it is Class III and approved) but others like psilocybin, LSD, and non-racemic MDMA are still investigational.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent Activity of FDA/DEA and Regulatory Standards",
                    "effect": "The FDA's August 2024 public rejection of MDMA, citing significant study design and durability issues for chronic mental health conditions, signals high regulatory caution and a requirement for more robust, blinded, controlled studies. This decreases probability for near-term traditional NDA/EUA approvals unless political pressure shifts or regulators specifically relax requirements."
                },
                {
                    "factor": "Political & Administrative Shifts",
                    "effect": "Recent articles (July-Oct 2025) highlight renewed political pressure for expedited review (especially from Trump/Kennedy allies), new FDA staff with backgrounds in psychedelic advocacy, and programmatic efforts to speed reviews/reduce requirements. If implemented soon, this could greatly increase the probability of an NDA or even a rescheduling initiated by the DEA, especially if filings are encouraged as a show of progress, regardless of likely approval."
                },
                {
                    "factor": "IND Application Filings and Active US Trials",
                    "effect": "The clearing of Arcadia Medicine's IND for a patented non-racemic MDMA for generalized anxiety is notable, but IND approval is not an NDA/EUA. To trigger a YES, an NDA or EUA must be filed (not just IND). Arcadia's trial is only starting in 2025, making a 2025 NDA unlikely. No major US trial reports in the last month suggest an imminent NDA/EUA for other psychedelics. This decreases the probability of YES barring political fast-tracking or other programs."
                },
                {
                    "factor": "Alternative Pathways: DEA Rescheduling",
                    "effect": "Federal rescheduling (e.g., moving MDMA or psilocybin to Sched II) would resolve YES. Political context and recent administration changes make this plausible—there is political capital in being seen as a scientific reformer, and pressure from veterans/public. No such concrete rescheduling actions reported as of October 2025, but continued signals from HHS/FDA/DEA make a late-2025 move possible, especially as a partial/low-threshold win."
                },
                {
                    "factor": "International Progress and Public/Commercial Pressure",
                    "effect": "Countries in Europe (Spain, Czech Republic) and Australia are granting or about to grant approval for psychedelics, but EU activities do not directly drive US filings. However, international momentum plus large unmet need and big public attention could prompt expedited US action, particularly if the new fast-track policies are implemented as signaled."
                }
            ],
            "no_scenario": "The FDA maintains strict evidentiary standards and does not receive any NDA/EUA filing for a psychedelic for mental health in 2025; alternatively, political changes do not manifest as regulatory leniency or rescheduling, or timelines slip into 2026 (e.g., ongoing trials still running, sponsors waiting on additional data, or only INDs/applications for non-psychedelics filed). Alternatively, all efforts shift into 2026 (e.g., Compass Pathways/psilocybin NDA delayed, new studies for MDMA not ready), and no rescheduling action is initiated by the DEA.",
            "yes_scenario": "A psychedelic drug sponsor, sensing regulatory/political momentum and/or under fast-track/expedited review, submits an NDA or EUA to the FDA for a psychedelic in any DSM-5-indicated mental health area in 2025 (even if later found deficient or not accepted). Alternatively, the DEA (perhaps in response to administration directives or public pressure) reschedules MDMA, psilocybin, or another psychedelic to a less restrictive class before the end of 2025, irrespective of NDA/EUA activity.",
            "final_reasoning": "The base rate for drug approval pathway filings for psychedelics in the US is very low, with the most promising candidate (MDMA for PTSD) having just received a high-profile FDA rejection in August 2024. However, current developments signal an increased probability: the FDA is publicly reconsidering its process, and administrative signals (hiring, programs, public endorsements) point to a lower bar, at least for initial filings.\n\nArcadia Medicine's IND for non-racemic MDMA is a strong sign of continued regulatory willingness to allow trials, but not a guarantee of NDA/EUA filing in <3 months. No evidence exists of an imminent NDA/EUA filing for other agents (e.g. no public Phase 3 results for psilocybin in the US on a timeline compatible with 2025 submission). However, fast-moving political impulses, especially under a potentially new administration eager for a public health 'win' or symbolic move, could push for DEA rescheduling by year end 2025, especially as international examples mount and states increase pressure (Oregon, Colorado models). In policy, filings (i.e. NDA/EUA/DEA rescheduling proposals) can be symbolic moves to mark political progress even if the scientific package is debated.\n\nOn balance, while scientific base rates are low, the political and administrative factors are together strong enough to raise the probability of at least one qualifying filing or rescheduling action before January 2026. The biggest challenge is that there is little direct evidence of an imminent NDA/EUA filing, but a 'Yes' could still resolve if the DEA reschedules—even unilaterally, or as an executive action. I assign an above-typical but not extreme probability of Yes.",
            "final_probability": 62
        },
        "Clinical Trial Management (PhaseIIITrialCompletion)": {
            "time_to_resolution": "Approximately 2.9 months (question closes January 1, 2026; today is October 6, 2025)",
            "perspective_relevance": "As an expert in Clinical Trial Management (with a focus on Phase III completion and regulatory timelines), I bring a granular understanding of the requirements and hurdles for filing an FDA New Drug Application (NDA), Emergency Use Authorization (EUA), and Controlled Substances Act rescheduling in the US. This gives me insight into base rates for trial to filing timelines, as well as how political, regulatory, and scientific shifts influence the likelihood of regulatory filings for psychedelic therapies for mental health within a specified window.",
            "status_quo": "As of late 2023 and most of 2024, psychedelics (such as MDMA and psilocybin) faced high-profile setbacks: the FDA rejected MDMA for PTSD based on concerns with trial design (blinding, durability of effect, safety). No application for psychedelics (other than ketamine/esketamine, already approved) for a DSM-5 mental disorder was filed in the US. Progress has been rapid but unpredictable, with high trial failure rates, but increasing political momentum lately.",
            "perspective_derived_factors": [
                {
                    "factor": "Current Phase III Trial Status and Timelines for Major Psychedelics (MDMA, psilocybin, LSD)",
                    "effect": "Decreases probability mildly; recent FDA rejection of MDMA, and phase III work for psilocybin/others is ongoing but does not appear to be completing imminently. The news scan contains no evidence a major US Phase III is at the NDA/EUA filing threshold before end of 2025."
                },
                {
                    "factor": "Regulatory and Political Climate Shifts Under New Administration",
                    "effect": "Increases probability significantly; the FDA under Makary and influence from RFK Jr./Trump allies is actively fast-tracking review and creating a friendlier regulatory environment for psychedelics, signaling willingness to relax standards or accelerate review/filling."
                },
                {
                    "factor": "Alternative Pathways: EUA or DEA Rescheduling as Backdoors",
                    "effect": "Increases probability moderately; while no NDAs may be ready, the question resolves 'Yes' if *any* application is *filed* or if the DEA reschedules a psychedelic (e.g., MDMA, psilocybin, LSD, ketamine, ibogaine) for a DSM-5 disorder. The increasing political pressure and the FDA's and DEA's openness make this scenario plausible."
                },
                {
                    "factor": "Current Investment and Expansion in Psychedelic R&D",
                    "effect": "Increases probability slightly; investor activity, IND filings (e.g., Arcadia’s non-racemic MDMA for GAD), and new clinical programs suggest a high pace of development, though pre-NDA filings are rare unless phase III data matures suddenly or EUA is pursued."
                },
                {
                    "factor": "Base Rates for NDA/EUA Filing Following Recent Phase III Data",
                    "effect": "Decreases probability moderately; even with accelerated approval systems, the elapsed time from phase III topline to NDA/EUA filing is often 6-12 months or more barring extreme regulatory urgency. Current phase III trials for leading compounds are not clearly finishing or reporting in time for a 2025 NDA/EUA, based on available public data and the news summaries above."
                },
                {
                    "factor": "International Pressure and Precedent",
                    "effect": "Increases probability marginally; approvals and pilot programs in Australia, Czech Republic, and EU increase the US regulatory and reputational pressure to act, especially with state-level push (e.g., Oregon, Colorado) and veterans' advocacy. However, this is indirect and probably more salient for 2026+ filings than the 2025 window."
                }
            ],
            "no_scenario": "Despite intense advocacy and regulatory interest, major US trials do not finish or produce data sufficient for NDA/EUA submission by December 31, 2025. The FDA does not receive any application to approve or emergency authorize psychedelics for DSM-5 disorders, nor does the DEA move to reschedule any qualifying substance. Possible ongoing regulatory and legislative debate, ongoing trials, and groundwork continue, but formal applications wait until 2026 or later.",
            "yes_scenario": "Driven by political and scientific momentum, and possibly by further advocacy from veterans/first responders and states, the FDA receives at least one NDA or EUA for a psychedelic for a mental health indication, even if based on interim/accelerated data from an ongoing phase III trial, or the DEA moves one psychedelic drug to a lower schedule citing new evidence, policy changes, or public pressure. This could be for MDMA (if new trial data accelerate filing), psilocybin (if an applicant pushes based on international data or US compassionate use), or another eligible substance (such as ketamine or ibogaine if new studies/pressure arise). The formal act of *filing* an NDA, EUA, or DEA rescheduling counts, regardless of FDA/DEA approval.",
            "final_reasoning": "My best forecast incorporates the current lack of clearly imminent NDA/EUA filings for mainstream psychedelics. However, the regulatory climate in late 2025 shows unprecedented political and institutional momentum: advocacy from prominent officials, FDA leadership signaling accelerated review, and new financial/political resources directed at breaking regulatory barriers. Alternative routes (e.g., EUA or DEA rescheduling) require only a *filing*, not approval, and the next few months are likely to see energetic pushes by advocacy groups and companies, exploiting new political capital and regulatory flexibility. Base rates from major CNS/mental health NDA/EUA filings are low for such a fast turnaround after phase III readouts or compassionate-use work, but the question’s broad criteria (NDA/EUA/DEA move, mere filing suffices) means only a single high-profile push could suffice. Given these cross-currents, and weighing the statistical base rates against these 'extraordinary' regulatory/political conditions, I arrive at a probability above the historical average, but not so high as to ignore persistent scientific and procedural hurdles. I forecast a 55% chance a psychedelic NDA, EUA, or DEA scheduling application is *filed* for a DSM-5 mental disorder in the US in 2025.",
            "final_probability": 55
        },
        "US Healthcare Policy (PolicyChangeAdvocacy)": {
            "time_to_resolution": "Approximately 2 months and 3 weeks (until the end of December 2025).",
            "perspective_relevance": "As an expert in US Healthcare Policy (PolicyChangeAdvocacy), I am uniquely positioned to interpret the regulatory, political, and advocacy dynamics shaping mental health drug approvals in the US. My expertise informs the likelihood that agencies like the FDA or DEA will take the 'next step' for psychedelic approval, how advocacy, political shifts, and scientific rigor interact, and what realistic regulatory pathways might unfold.",
            "status_quo": "As of October 2025, no New Drug Application (NDA) or Emergency Use Authorization (EUA) for classic psychedelics (MDMA, psilocybin, LSD, etc.) for mental health indications has been filed with the FDA, nor has the DEA federally rescheduled any such substance. The FDA recently rejected MDMA-assisted therapy for PTSD, citing data and methodological concerns.",
            "perspective_derived_factors": [
                {
                    "factor": "Regulatory Conservatism and Scientific Standards",
                    "effect": "Decreases probability. The FDA's recent CRL for MDMA was notably thorough and critical. Even with a new administration, agency culture and the need for robust, reproducible evidence create a high bar. The FDA’s transparency in releasing the CRL suggests ongoing emphasis on safety and methodological rigor."
                },
                {
                    "factor": "Political Shifts and Leadership Signals",
                    "effect": "Slightly increases probability. Statements from top FDA and HHS officials about expediting psychedelic reviews, and bipartisan interest in psychedelics (notably from RFK Jr. and Trump appointees), open up new possibilities. Policy windows are wider—but not wide open."
                },
                {
                    "factor": "Advocacy and Social Momentum",
                    "effect": "Increases probability. Veteran and first-responder advocacy, state-level activity (like in Oregon and Colorado for psilocybin), and substantial philanthropic investments continue to mount pressure for federal action. The continued media coverage gives psychedelic policy unusual salience."
                },
                {
                    "factor": "Clinical Trial Pipeline and Timelines",
                    "effect": "Decreases probability. While there is a robust phase II/III trial pipeline (notably Compass Pathways for psilocybin and various smaller programs), the timeline for data readouts, NDA assembly, and actual filing remains challenging for a 2025 delivery if not already in process."
                },
                {
                    "factor": "Alternate Regulatory Pathways",
                    "effect": "Marginally increases probability. Emergency Use Authorization or DEA rescheduling (potentially triggered by public health, veteran, or addiction arguments) provide mechanisms outside of traditional NDA filings. However, these would be precedential and thus uncertain/unlikely."
                },
                {
                    "factor": "Recent News and Announcements",
                    "effect": "No clear effect. No news articles from October 2025 indicate a pending NDA/EUA for a psychedelic for a mental health indication imminent in Q4 2025. Arcadia's IND on a modified MDMA analog for GAD is notable for pipeline depth, but an IND is far from an NDA and probably precludes 2025 NDA/EUA submission."
                }
            ],
            "no_scenario": "Existing clinical trials do not reach maturity or fail to meet efficacy/safety endpoints by late 2025, companies focus on strengthening evidence after FDA's recent rejection, and FDA/DEA do not receive any qualifying applications for classic psychedelics. Advocates ramp up pressure, but regulatory filings do not materialize before year-end.",
            "yes_scenario": "A sponsor working on a classic psychedelic (potentially MDMA or psilocybin, or an adjacent compound like ibogaine) manages to quickly bolster their data (possibly with already-completed studies), responds to FDA methodological objections faster than anticipated, and files an NDA (or requests EUA). Alternatively, federal rescheduling is initiated—possibly through administrative advocacy or political pressure—prompting the DEA to move a psychedelic to Schedule II or III by the end of 2025.",
            "final_reasoning": "Base rates suggest that regulatory agencies move conservatively, especially after a recent rejection like Lykos/MDMA. The time from the FDA’s rejection in mid-2024 to the end of 2025 is extremely short for running a new pivotal trial, analyzing data, preparing an application, and filing with the FDA/DEA. No public evidence suggests a major psychedelic sponsor is at the NDA-filing stage for mental health—though international momentum is strong, US regulatory science remains rigorous. Political winds have shifted: senior officials are publicly supportive of exploring faster pathways, and advocacy is at an all-time high, possibly making an unexpected move (e.g., DEA rescheduling) slightly more plausible than in prior years. However, there is no reporting suggesting such action is in train before 2026. Based on field precedent, process timelines, and the lack of clear 'NDA/EUA pending' news in October 2025, the probability that the next official step (NDA/EUA filing or DEA rescheduling) takes place before end-2025 is low but nonzero—bolstered mostly by political and advocacy factors, slightly offsetting the strong regulatory inertia. Aggressively, but justifiably, I estimate a probability at the high end of the plausible range for a 'no real-world progress, but might happen' scenario, acknowledging the risk of a surprise file or policy maneuver.",
            "final_probability": 17
        },
        "US Healthcare Policy (CMSCoverageDetermination)": {
            "time_to_resolution": "Approximately 2 months and 3 weeks (question resolves January 1, 2026)",
            "perspective_relevance": "As a US Healthcare Policy and CMS Coverage Determination expert, I understand the interplay between FDA pathways (NDA, EUA), federal drug scheduling, and the downstream implications for health plan coverage once regulatory milestones are reached. I can contextualize regulatory signals, political and administrative shifts, and pay special attention to what constitutes a 'step' such as NDA or EUA filing or DEA rescheduling, even if not acceptance or final approval—key for this question.",
            "status_quo": "No psychedelics besides ketamine/esketamine (already approved for treatment-resistant depression and not strictly viewed as a classic psychedelic under this definition) have an NDA or EUA filed or an ongoing federal rescheduling for mental health indications. The FDA rejected MDMA in 2024, and no clear public indication of another NDA/EUA or DEA rescheduling had occurred as of late 2025.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent FDA stance and regulatory hurdles",
                    "effect": "Decreases probability. The FDA’s August 2024 rejection of MDMA for PTSD cited durability, blinding, and adverse event monitoring issues. This shows a high regulatory bar and the need for further trials, likely pushing NDA/EUA timing past 2025 for ongoing candidates."
                },
                {
                    "factor": "Political/administrative signals under a new HHS/FDA direction",
                    "effect": "Increases probability. There is evidence (new FDA Commissioner Makary, HHS Secretary Kennedy, and public statements) that the FDA is reviewing its psychedelic stance with intent to expedite review, lessen trial requirements, shorten review times, and new pro-psychedelic hires. Strong Congressional, veteran, and state-level advocacy add weight."
                },
                {
                    "factor": "Pipeline maturity and company momentum",
                    "effect": "Slightly increases probability. Several phase 2/3 trials are ongoing (psilocybin, LSD, new MDMA formulations), and some US companies (Arcadia’s IND for novel MDMA, publicized pipeline funding, rapid IND clearance) appear positioned for NDA or EUA filing, even if not full approval. Larger companies are pivoting to mental health indications, reflecting confidence."
                },
                {
                    "factor": "International precedents and policy contagion",
                    "effect": "Marginally increases probability. Australia and the Czech Republic have already approved or scheduled psilocybin/MDMA for psychiatric use; several EU nations have compassionate use or are moving toward approval. US policymakers may be influenced by these precedents, increasing pressure for an FDA or DEA action even absent full domestic phase 3 success."
                },
                {
                    "factor": "Payer and CMS readiness",
                    "effect": "Neutral/irrelevant for resolution. While payer/CMS coverage is not resolved by an NDA/EUA or rescheduling alone, and would require subsequent steps, the filing milestone itself is solely what matters for this forecast."
                },
                {
                    "factor": "Base rate of NDA/EUA/de-scheduling filings for psychedelics in the US",
                    "effect": "Decreases probability. Historically, filings for classic psychedelics have been extremely rare in the US because of Schedule I status and stigma; prior attempts (MDMA) were multi-decade efforts, and most recent psychedelic filings are for medical marijuana or ketamine derivatives instead. The inertia is immense."
                }
            ],
            "no_scenario": "FDA maintains its cautious stance, requiring new, larger or more robust blinded trials for MDMA or psilocybin. Companies do not have sufficient phase 3 data or funding ready to file in 2025. Political support is vocal but bureaucratic inertia or 2024 regulatory disappointment delay any NDA/EUA filings into 2026. DEA does not move to reschedule any psychedelic in 2025, despite advocacy.",
            "yes_scenario": "A company pursuing an NDA or EUA for MDMA, psilocybin, or a non-classical psychedelic as psychiatric treatment files before the end of 2025, possibly taking advantage of new expedited review programs or regulatory flexibility signaled from current FDA/HHS leadership. Alternatively, strong White House/Congressional pressure or changing political winds accelerate a DEA proposal to reschedule psilocybin or MDMA to Schedule II or III, resulting in a formal filing or published intent before year-end.",
            "final_reasoning": "The probability of a 'step forward' (NDA/EUA filing or DEA rescheduling) for US medical psychedelic approvals in 2025 is higher than in past years due to a confluence of: intensified political advocacy (including influential figures and sectors like veterans), FDA/HHS administrative changes and statements about expedited or more permissive regulatory approaches, evidence of new drug development pipelines (Arcadia's unique MDMA formulation, robust VC funding, rapid IND clearance), and precedent abroad. However, the regulatory and evidence bar remains high; the FDA’s 2024 rejection of MDMA for PTSD was forceful, and base rates for NDA/EUA/DEA filings for classic psychedelics in the US are low. No public evidence points to a major company submitting a formal NDA or EUA imminently—though rapid filings late in the year, especially as a 'placeholder' for a Breakthrough pathway or with new data, remain realistic. There is also a realistic (albeit <50%) chance of symbolic DEA scheduling action in response to political pressure, even without full agency consensus, in part due to projected federal elections and public statements. Overall, I judge the likelihood of any of the three triggers (NDA, EUA, or DEA reschedule) being met by January 1, 2026 at around 38%, slightly elevated from base rate but not yet near even odds.",
            "final_probability": 38
        },
        "Psychiatry (EvidenceBasedTherapyAdoption)": {
            "time_to_resolution": "~3 months (Oct 6, 2025 to Jan 1, 2026)",
            "perspective_relevance": "As a superforecaster with expertise in psychiatry and evidence-based therapy adoption, I track regulatory trends, clinical trial rigor, adoption curves, and political pressures for novel psychiatric interventions, including psychedelics. I understand the nuances in clinical trial design (blinding, control groups), typical regulatory hurdles, and the real-world translation of scientific promise into regulatory action.",
            "status_quo": "As of October 2025, the FDA has recently rejected an NDA for MDMA-assisted psychotherapy for PTSD (August 2024), and no psychedelic (as defined) has a filed NDA, EUA, or has been rescheduled by the DEA for a psychiatric indication in the US. Some ketamine (esketamine) is approved, but classic psychedelics (LSD, psilocybin, MDMA, etc.) for DSM-5 mental disorders are not.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent Regulatory Setbacks and Trial Rigor",
                    "effect": "Decreases probability. The recent FDA rejection of MDMA for PTSD, despite high expectations, emphasized insufficiencies in trial design (e.g., blinding, durability, controls), raising the regulatory evidentiary bar and creating a chilling effect for near-term filings."
                },
                {
                    "factor": "Political/Regulatory Acceleration",
                    "effect": "Increases probability. Statements from key officials (HHS Secretary Kennedy, FDA Commissioner Makary), coupled with apparent hiring of psychedelic-friendly staff, suggest a strong political will to accelerate regulatory pathways for psychedelics, potentially lowering historical barriers."
                },
                {
                    "factor": "Trial Pipeline Timelines",
                    "effect": "Decreases probability. Major US trials (e.g., Compass Pathways—psilocybin for depression) are largely still underway or only recently completed. Realistically, assembling and analyzing full pivotal data, then filing an NDA, generally takes >6 months post-data. Probability of a new NDA filed by EOY 2025 is reduced by this delay."
                },
                {
                    "factor": "Potential Alternate Pathways (EUA, DEA Rescheduling)",
                    "effect": "Increases probability. The resolution criteria include not just NDAs, but also EUA filings and controlled substance rescheduling. A politically motivated/de novo DEA move or an emergency use filing—potentially for a crisis like veteran suicide or treatment-resistant depression—remains plausible, though unprecedented."
                },
                {
                    "factor": "Comparative International Adoption/Pressure",
                    "effect": "Marginally increases probability. Recent psychedelic approvals elsewhere (Australia, Czech Republic, pending Spain, Germany's compassionate use) may add modest international pressure, further motivating regulators to act, but the US tends to trail on these issues when safety/abuse risk is high."
                },
                {
                    "factor": "Investor/Industry Momentum and Filings",
                    "effect": "Marginally increases probability. There is robust investment (as noted from Arcadia's financing), and a strong pipeline exists. The question's low bar (filing, not acceptance) means even a strategically premature NDA/EUA could be possible, especially with new political appointees."
                }
            ],
            "no_scenario": "No company files an NDA or EUA for a classic psychedelic for a mental disorder. DEA does not reschedule any psychedelics. Regulatory caution following the FDA's MDMA rejection prevails, and/or pivotal trials do not mature in time for a credible 2025 filing. Political attention focuses more on future reforms than immediate action, and agencies maintain a cautious, methodical pace.",
            "yes_scenario": "A sponsor (potentially one with political ties or pressure, or a fast-moving company) files an NDA or EUA—even for a narrow indication with incomplete data—by the end of 2025, seeking psychiatric use of a psychedelic. Alternatively, a politically motivated DEA rescheduling occurs, possibly focused on MDMA, psilocybin, or ibogaine, possibly justified for crisis populations (e.g., veterans), or through explicit executive or congressional prompting.",
            "final_reasoning": "The probability for a traditional NDA filing remains modest—most pivotal trials (e.g., for psilocybin in depression by Compass Pathways or Usona) are not expected to generate results and file within 2025. The FDA’s rejection of MDMA for PTSD and public statements emphasizing trial rigor indicate institutional risk aversion. However, political winds have shifted dramatically since mid-2025. High-profile public support from Kennedy, Trump allies, and Makary's streamlining of FDA processes creates meaningful tail risk of a politically induced filing or action—perhaps for an EUA or even a DEA rescheduling (since these are also valid resolution paths). Investor sentiment and strategic industry players may encourage premature NDA/EUA filings, especially given the low bar for resolution. The main constraint is the readiness of trial data—regulators still require at least plausible efficacy and safety packets, and sponsors risk reputational harm from underbaked filings. Overall, status quo/procedural inertia remains strong, but non-traditional regulatory action or an ultra-fast filing has become more plausible than it was a year ago, especially with the resolution's relatively easy trigger (filing, not approval, by end of 2025). I judge the probability to be significantly above strict base rates (~5–10% per year in recent history), but well below 50% due to trial un-readiness and remaining conservatism. I estimate a probability of 30%.",
            "final_probability": 30
        },
        "Psychiatry (TranslationalResearchPipeline)": {
            "time_to_resolution": "Approx. 3 months until Jan 1, 2026",
            "perspective_relevance": "As a Psychiatry Translational Research Pipeline expert, my viewpoint is uniquely grounded in an understanding of the scientific rigor, regulatory frameworks, trial design challenges, and the interface between clinical data and regulatory acceptance for psychiatric indications—especially as applied to novel compounds such as psychedelics. I can objectively assess both the scientific and sociopolitical barriers and accelerators, including the nuance of FDA and DEA processes and the influence of broader mental health needs, stakeholder advocacy, and emerging US political will.",
            "status_quo": "At present (Oct 2025), no psychedelic (outside of ketamine/esketamine for depression, which is excluded from this question) has either an NDA or EUA actively filed for treatment of DSM-5-defined mental disorders in the US, nor has the DEA moved to reschedule target psychedelics. The most advanced compound (MDMA for PTSD) was rejected by FDA in Aug 2024, with the agency indicating multiple scientific and trial-design deficiencies that require further study.",
            "perspective_derived_factors": [
                {
                    "factor": "Regulatory Stringency and FDA Rejection of MDMA (Aug 2024)",
                    "effect": "Decreases probability—FDA's detailed and public CRL for MDMA reveals high scientific and data standards and reticence to be perceived as lax; specifically citing study blinding, selection bias, lack of durable effect, and incomplete adverse event reporting."
                },
                {
                    "factor": "Accelerated Political Support and New FDA/HHS Appointees with Pro-Psychedelic Leanings",
                    "effect": "Increases probability—New administration figures (Trump/Kennedy, etc.), FDA Director Makary's emphasis on expediting approval and reducing review windows, and evidence of political will to see progress on psychedelics could lower procedural barriers or encourage expedited filing, even if the ultimate approval bar remains high."
                },
                {
                    "factor": "Global Momentum and Peer Nation Approvals",
                    "effect": "Slightly increases probability—Major steps in Australia (MDMA/psilocybin approved in 2024), Czech Republic, and Spain lend political/advocacy momentum, with US often following after robust data and peer adoption; though lag time is usually years."
                },
                {
                    "factor": "Active Trials and Corporate Readiness",
                    "effect": "Neutral to slightly decreasing—Several compounds are in US clinical trials, but most Phase 3 studies (e.g., psilocybin for depression, LSD for anxiety) are not reporting readouts in time to submit an NDA or request rescheduling in 2025. The US arm of Compass (psilocybin) and MindMed (LSD) have had slow recruitment and delays. The shift in political will could push an NDA or EUA attempt, but the window is narrow."
                },
                {
                    "factor": "Alternate Regulatory Pathways (EUA, rescheduling)",
                    "effect": "Slightly increases probability—The presence of an expedited Emergency Use Authorization route or potential for top-down DEA rescheduling driven by executive influence or public health advocacy may create a procedural path for 'the next approval step' (i.e., a formal application or rescheduling)—even if ultimate approval is not achieved."
                },
                {
                    "factor": "Advocacy Pressure/Desperate Demand in Mental Health",
                    "effect": "Slightly increases probability—Escalating crisis in treatment-resistant mental illness keeps pressure on federal agencies for quick action and might motivate at least a symbolic 'next step'—filing of an NDA or an official rescheduling petition."
                },
                {
                    "factor": "Scientific and Methodological Challenges",
                    "effect": "Substantially decreases probability—Blinding difficulty, high placebo response, short duration of effect, and trial-site heterogeneity remain unsolved. The FDA's emphasis on these as critical flaws in the MDMA rejection, and its demand for a new confirmatory trial, imply a high likelihood that other NDAs/EUAs would also be rejected or delayed, dampening the incentive to file prematurely."
                }
            ],
            "no_scenario": "Despite political tailwinds and global momentum, no sponsor manages to assemble enough data or foresees enough chance of success (especially after the high-profile MDMA rejection) to justify the cost and reputational risk of filing a new NDA or EUA for a psychedelic in 2025. Political appointees urge progress, but the FDA or DEA decline to accept filings without adequate data, and no alternate pathway is utilized. Ongoing trials simply are not ready in time, and sponsors wait for 2026 data. The DEA also does not act independently to reschedule any psychedelic. Thus, the status quo holds for 2025.",
            "yes_scenario": "Buoyed by the change in political climate and public statements by HHS/FDA/DEA leadership, a sponsor (MAPS, Compass Pathways, MindMed, or potentially a new coalition) files a new NDA for MDMA, psilocybin, or LSD for a DSM-5 condition, regardless of immediate likelihood of approval, as a symbolic or tactical move. Alternatively, a different sponsor or public advocacy group requests an EUA, leveraging the post-pandemic precedent for broader EUA applications, or the DEA (under political pressure) files a rescheduling proposal for psilocybin or MDMA, even in the absence of conclusive new data. The filing itself, not acceptance or ultimate approval, suffices for a Yes resolution. The fact that it may ultimately be rejected (again) is irrelevant for the purpose of the question.",
            "final_reasoning": "Base rates indicate that new NDAs/EUAs for psychiatric drugs—especially for controlled substances with reputational or safety baggage—are rare in the absence of robust Phase 3 data and after a public FDA rejection. In 2024–25, no sponsor had an NDA/EUA filing in process for psychedelics for mental disorders, and MDMA's path was set back at least a year by the FDA's demand for a new trial. However, what is different now is a distinct uptick in political will, several appointees expressing public support, and a policy window in late 2025 for agencies to show symbolic movement. The procedural requirements for Yes are low: only a new NDA or EUA needs to be filed, not accepted or approved, or an official DEA rescheduling proposal made. This lowers the bar considerably. Appeal and advocacy pressure, along with the FDA's stated openness to a resubmission for MDMA and the possibility that sponsors could file a 'placeholder' NDA or drive a DEA action (especially targeting veterans or PTSD), makes a Yes outcome plausible, but only if these actors are willing to risk further rejection. Given the timelines—trials not ready, but political pressure and acknowledgment that only a submission, not acceptance, is required—I estimate the probability of a qualifying 'next step' being taken before year-end at roughly 40%.",
            "final_probability": 40
        },
        "Pharmacology (DrugDevelopmentPipeline)": {
            "time_to_resolution": "Approximately 2 months and 3 weeks (until Dec 31, 2025).",
            "perspective_relevance": "As a pharmacology expert specializing in the drug development pipeline, I am attuned to the granular details of how and when applications such as NDAs and EUAs are filed, regulatory nuances, and the typical timelines and obstacles facing psychedelics from preclinical/clinical stages to FDA and DEA consideration. I can differentiate between scientific progress, regulatory signals, and political winds, and parse whether recent developments are substantive or merely incremental.",
            "status_quo": "No psychedelic has received FDA approval for a mental health indication in the US. The August 2024 FDA rejection of MDMA for PTSD (Lykos) is the most recent high-profile decision. To date, no NDA, EUA, or rescheduling at the federal level has occurred for a classic psychedelic for DSM-5-defined mental illnesses, though some local/state-level moves (e.g., Oregon, Colorado, New Mexico) and federal approvals for esketamine (not counted as a classic psychedelic for this question) have occurred.",
            "perspective_derived_factors": [
                {
                    "factor": "Regulatory and Political Shifts Post-2024 Election",
                    "effect": "Increases probability, as there is public evidence of intention from the new FDA leadership (Marty Makary under a possible Trump administration, or HHS Sec. Kennedy) to expedite reviews and consider less stringent requirements for psychedelic therapies. High-profile comments and political pushes from Kennedy and Trump allies support expedited action."
                },
                {
                    "factor": "Recent FDA Rejection and Barriers to Approval",
                    "effect": "Decreases probability: the August 2024 MDMA rejection (with reasons including problems of blinding, selection bias, inadequate long-term effect evidence, safety/adverse event reporting) signals high regulatory hurdles. Moreover, FDA recommended new clinical trials for MDMA, with at least a year or longer likely needed before another NDA. Other programs are not as advanced."
                },
                {
                    "factor": "Alternative Approval Pathways (EUA or Rescheduling)",
                    "effect": "Increases probability: The question allows a Yes outcome if *any* NDA, EUA application for a mental-health use is filed, even if not accepted – or if a DEA rescheduling occurs. EUA could be a political tool if federal administration wants a 'win' even in the absence of robust phase III evidence, and rescheduling could be achieved by administration fiat, regulatory petition, or Congressional action."
                },
                {
                    "factor": "Current Status of Clinical Trials and NDA Readiness for Psilocybin, LSD, DMT, and MDMA",
                    "effect": "Decreases probability: Ongoing trials of psilocybin (e.g., Compass Pathways), LSD (MindMed), and the resubmission timeline for MDMA suggest that none are on track for an NDA submission by end-2025, especially given the need for new or additional trials stipulated by the FDA."
                },
                {
                    "factor": "DEA Rescheduling Momentum",
                    "effect": "Neutral to slightly increases probability: Cannabis scheduling review, political support, and ongoing litigation around DEA policies could nudge psychedelics into rescheduling, especially as a political gesture, but there is little public movement specific to classic psychedelics yet."
                },
                {
                    "factor": "Global and Social Context",
                    "effect": "Marginally increases probability: Approvals and legalization of psilocybin and/or MDMA in Australia, Czech Republic, Switzerland, and advocacy movements (veterans, law enforcement) put symbolic pressure on US regulators. However, FDA and DEA have thus far maintained scientific rigor."
                }
            ],
            "no_scenario": "Despite political change, the FDA and DEA maintain scientific/clinical standards and disallow any accelerated NDA/EUA filings; companies like Lykos, Compass, and MindMed are unable to meet bar for NDA submission by Dec 31, 2025; rescheduling petitions languish; and no NDA/EUA is filed. The only visible progress is further trials or state-level expansions.",
            "yes_scenario": "Due to political directive or regulatory flexibility (FDA under Makary; HHS under Kennedy or Trump), either: (1) a company like Lykos (MDMA) or Compass Pathways (psilocybin) files an NDA for a psychedelic for a DSM-5 disorder, even if FDA judges it incomplete; (2) a sponsor files for an EUA, perhaps citing urgent unmet need in a select group such as veterans with PTSD; or (3) the DEA, under pressure, announces the rescheduling of a psychedelic—most plausibly MDMA or psilocybin—before Jan 1, 2026.",
            "final_reasoning": "The current scientific and regulatory landscape for psychedelic approvals in mental health is challenging—the FDA’s detailed, public rejection of MDMA (citing methodological and safety flaws) set a high bar, and no other pipeline candidate is poised for NDA within 2025. However, this forecasting question allows for a low bar: *filing* (not acceptance) of an NDA/EUA application, or rescheduling, is sufficient. The change in US administration and clear signals from FDA leadership to expedite reviews and 'send a signal' of openness—paired with an explicit willingness to relax requirements—*substantially* increase the probability of some actor filing an NDA or EUA, or the DEA moving on rescheduling (even as a largely symbolic gesture). Political, social, and symbolic motivations increase the chance of a move even without full scientific readiness. Nevertheless, companies may still need sufficient data to justify submissions, and time is short for new pivotal trial completion or rapid response to the FDA’s concerns about MDMA (which now requires an additional trial). There are also legal and institutional inertia factors. On balance, given the permissive resolution criteria, strong political and social winds, and at least plausible timelines for a politically-motivated application or rescheduling, I estimate the probability to be notably above typical base rates for such historic moves, but not extreme given ongoing scientific and process barriers.",
            "final_probability": 62
        },
        "Pharmacology (ClinicalTrialPhases)": {
            "time_to_resolution": "Approximately 3 months (question closes January 1, 2026; today is October 6, 2025)",
            "perspective_relevance": "As an expert in pharmacology with a focus on clinical trial phases and regulatory milestones, I am skilled in assessing the real-world progression of psychedelic compounds through the US approval pipeline. I understand not just the FDA’s evidence requirements, but also typical timelines, historic base rates of NDA/EUA submissions, and the influence of political and regulatory winds on controlled substances in mental health.",
            "status_quo": "Despite public enthusiasm and clinical promise, the FDA rejected the first high-profile NDA for MDMA-assisted therapy in 2024 due to efficacy, safety, and study design issues (blinding, durability). No application for psychedelic approval has been filed in 2025 yet. Historically, NDAs/EUAs for new mental health treatments—particularly for controlled substances—have been rare and slow to progress following a high-visibility regulatory rejection, even when promising phase 2 or 3 results exist.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent FDA rejection of MDMA with specified methodological concerns",
                    "effect": "Decreases probability. The FDA asked for a new trial, meaning additional time and a high bar for resubmission. Sponsors are unlikely to rush a new NDA/EUA filing without new data."
                },
                {
                    "factor": "Continued phase 2/3 development of psilocybin, LSD, and related compounds (mostly in US/EU/UK/Spain)",
                    "effect": "Slightly increases probability. While most programs are promising, timelines suggest NDA/EUA submission is unlikely before late-2026; phase 3 is ongoing but not yet reported as completed/positive in US trials."
                },
                {
                    "factor": "Political momentum and policy signals (e.g., HHS, FDA leadership statements, Trump/Kennedy/RFK Jr. advocates, Texas investment, FDA signaling openness to faster review)",
                    "effect": "Increases probability. Administrative willingness can lower barriers for filing, especially if sponsors are incentivized by political support or emergency pathways."
                },
                {
                    "factor": "Rescheduling by DEA is a valid path to resolution",
                    "effect": "Neutral to slightly increases probability. However, no active DEA rulemaking on psychedelics is publicly underway, and rescheduling is typically predicated on FDA-acknowledged medical use."
                },
                {
                    "factor": "Active IND clearance for a new, potentially safer form of MDMA (AM-1002), but only at phase 1/early phase 2 for GAD (not ready for NDA/EUA till more clinical data)",
                    "effect": "Neutral for 2025. Paradigmatic, but not on a 2025 NDA timeframe."
                },
                {
                    "factor": "International precedents (Australia, Czech Republic, Spain approaching approval, compassionate use in Germany)",
                    "effect": "Slightly increases probability by normalizing the regulatory conversation, but US FDA usually insists on its own clinical data and US-centric process."
                },
                {
                    "factor": "FDA breakthrough therapy designations and market interest",
                    "effect": "Slightly increases probability by enabling faster pathways and investor support, but mostly meaningful in phase 3/filing stages, which are not yet reached for other psychedelics after MDMA."
                },
                {
                    "factor": "Base rate of NDAs/EUAs/DEA rescheduling for Schedule I drugs with positive phase-3 data and strong political push",
                    "effect": "Still quite low (<<20% in any given year) given history with cannabis and other precedents, except when trials are unambiguously positive and sponsors are ready to file."
                }
            ],
            "no_scenario": "No sponsor files an NDA or EUA for a psychedelic for a DSM-5 mental health indication before Jan 1, 2026. Programs remain in phase 2/3 collecting data, or sponsors await new FDA guidance following the MDMA rejection. DEA maintains status quo; no rescheduling occurs due to lack of new regulatory or pivotal data. Sponsors focus on further trials and/or seek new financial support for pivotal phase 3s. The US remains in stasis while international markets (e.g., Australia, Czech Republic) outpace US filings.",
            "yes_scenario": "Despite the recent FDA rejection, a sponsor with a psychedelic—perhaps a new formulation of MDMA, psilocybin, or another compound (e.g., ibogaine)—advances development quickly enough (possibly by leveraging FDA’s new expedited review commitments, administrative advocacy, or a unique data set) to file an NDA or EUA by the December 31, 2025 deadline. Alternatively, the DEA elects to reschedule a psychedelic in response to coordinated advocacy and emerging evidence, even if NDA/EUA is not yet filed.",
            "final_reasoning": "The 2024 MDMA rejection, with the FDA’s strong emphasis on trial design, durability of effect, and safety monitoring, sets a formidable barrier for a rapid NDA/EUA resubmission in 2025, unless sponsors can deliver substantially new data or the FDA abruptly pivots on evidentiary standards. Current leading candidates (e.g., psilocybin for depression, LSD for anxiety) remain in phase 2/3, and public reporting does not suggest imminent NDA/EUA-ready data in a US population within 2025. While the new administration has signaled political support and FDA/DEA are broadcasting openness, regulatory filings themselves still require a credible package that meets at least minimal safety/efficacy standards, and currently no US-based company has declared intent or public progress on a new NDA/EUA for psychedelics by the end of 2025. Rescheduling by the DEA is possible if directed by executive order or in response to a shifting policy environment, but no such action appears imminent, and the base rate for rescheduling based on administrative/executive signals alone—absent a supportive medical use finding from FDA—remains low. My base rate for a psychedelic NDA/EUA/DEA rescheduling in any given year post-phase-3 success is roughly 5-10%; given the increased political and administrative pressure, I adjust that upwards but, critically, I see no reporting of any actual imminent filings. Thus I assign a modest probability recognizing political noise, but still judge a YES outcome as unlikely.",
            "final_probability": 18
        },
        "Public Health Policy (RegulatoryScience)": {
            "time_to_resolution": "Approximately 3 months (question resolves Jan 1, 2026; today is Oct 6, 2025)",
            "perspective_relevance": "As an expert in Public Health Policy and Regulatory Science, I specialize in tracking FDA, DEA, and broader US regulatory developments, as well as understanding the interplay between political influences, stakeholder pressures, and the stringent evidentiary requirements that define medical product approvals or rescheduling. This perspective allows me to assess not just the progress in clinical trials or basic scientific promise, but also the likelihood of regulatory submissions and policy changes — key to this question, since it only requires the *filing* of an NDA/EUA or federal rescheduling, not approval.",
            "status_quo": "After the 2024 rejection of MDMA for PTSD, no psychedelics have FDA approval for mental health indications in the US. Es-ketamine (Spravato) is approved for depression, but standard psychedelics (MDMA, psilocybin, LSD, DMT, etc.) remain Schedule I or otherwise unapproved for mental health, with some progressing in trials. No filings for NDA/EUA or DEA rescheduling of psychedelics for DSM-5 mental disorders have been reported as of this cutoff.",
            "perspective_derived_factors": [
                {
                    "factor": "Regulatory Willingness under New Administration",
                    "effect": "Increases probability. Multiple sources report the FDA, under Commissioner Makary, and HHS, under Secretary Kennedy, are prioritizing psychedelics, launching new accelerated programs and reducing review times for psychiatric drugs, signaling a clear top-down political and bureaucratic push."
                },
                {
                    "factor": "Ongoing Industry and Academic Momentum",
                    "effect": "Neutral to slight increase. There is continued investment (e.g., substantial VC for Arcadia), and companies like Arcadia Medicine have IND clearance (for non-racemic MDMA for GAD), implying the channel for NDA in 2025 is plausible, though timelines for submission are tight as most programs are still in early clinical stages."
                },
                {
                    "factor": "Public and Advocacy Pressure",
                    "effect": "Increases probability. High visibility from veterans, politicians (e.g., Kennedy, Perry), and public figures, combined with mounting mental health crisis rhetoric, increases pressure for at least a regulatory action such as rescheduling or a symbolic NDA/EUA filing."
                },
                {
                    "factor": "Past Rejection & Rigor of Evidence Required",
                    "effect": "Decreases probability. Recent FDA rejection of MDMA PTSD application (Lykos) revealed high evidentiary bar, concerns about study design/blinding, durable efficacy, and selection bias. This limits likelihood of scientific community or major sponsors rushing to file non-comprehensive applications."
                },
                {
                    "factor": "Base Rate of NDA/EUA filings and DEA Rescheduling",
                    "effect": "Decreases probability slightly. Historical base rates for Schedule I → Schedule II/III rescheduling and NDA filings for completely new classes (with social/political baggage) are very low. Most rescheduling actions take years unless there is a major health crisis or sudden political shock."
                },
                {
                    "factor": "Global Regulatory Movement",
                    "effect": "Neutral or slight increase. Approvals/compassionate use in Australia, Czech Republic, and active large Phase 3s in Europe/Spain signal that filings in the US could be made on the basis of foreign data if the US political leadership wants a symbolic step forward. But translation to US filing is not automatic."
                },
                {
                    "factor": "Market Incentives and Commercial Readiness",
                    "effect": "Neutral. Many trials are mid-stage; a commercial sponsor with Phase 2a/b or demonstrating safety in IND could plausibly submit, but big market players are acting cautiously given FDA's recent stance."
                }
            ],
            "no_scenario": "Despite momentum, no company manages to compile adequate data to justify an NDA or EUA by the end of 2025, and the DEA is unwilling to act independently to reschedule without that data. The FDA and DEA maintain high evidentiary standards and force applicants to complete new placebo-controlled studies, as suggested in the MDMA rejection CRL, causing all new applications to slip past 2025.",
            "yes_scenario": "A company, perhaps like Arcadia with IND clearance and rapid trial/investor support, files an NDA (even if 'rolling' or with a small data package) before Jan 2026. Alternatively, under political pressure and new policy, the DEA (prompted by HHS/FDA recommendations) reschedules one or more psychedelics to reflect their evolving status for compassionate, clinical, or research use — even if only for limited indications — thus triggering a 'Yes' outcome. This could also include an EUA filing for a niche population (e.g., GAD, depression, PTSD) amid increased political support.",
            "final_reasoning": "The window for action is tight (less than three months). However, the question asks only whether the *next step* (i.e., the filing of an NDA/EUA or a DEA rescheduling action) occurs, not whether a drug is approved. The recent flurry of political interest, top-level agency moves to expedite psychedelic review, and new players like Arcadia gaining INDs for variants of MDMA targeting GAD make it plausible that at least one filing, whether full or 'rolling,' could occur by year-end as a symbolic stake in the ground. Recent reporting also confirms agency willingness to reduce review time and prioritize submissions, even if only to show support for the field and satisfy public demand. On the other hand, the very recent and publicized FDA rejection of MDMA/ PTSD shows the agency is not bending on evidence, and most major trials will not reach conclusion by late 2025, limiting the number of plausible filings. Furthermore, no direct reporting in the news shows an imminent NDA, EUA, or rescheduling; only movement toward accelerated reviews and trial launches. Based on all these — weighting the increased political/regulatory willingness and pressure against the formidable evidence and timing barriers — the likelihood of at least *one* qualifying step (NDA/EUA filing or DEA rescheduling) by end-2025 is meaningfully elevated but still below even odds. Strongest tailwinds are on the regulatory willingness/political pressure side. Base rates are low, but with the changed environment, I assess the probability at 40%.",
            "final_probability": 40
        },
        "Public Health Policy (HealthTechnologyAssessment)": {
            "time_to_resolution": "Nearly 3 months (until Jan 1, 2026), today is Oct 6, 2025",
            "perspective_relevance": "As a Public Health Policy (HealthTechnologyAssessment) expert, I closely track regulatory movements, the interplay between scientific evidence and policy, and incentives/disincentives at the interface of drug development, reimbursement, and regulatory action. I consider not just clinical trial data but also how regulatory pathways, political developments, and societal trends affect the likelihood of filings or reschedules. Understanding the detailed processes (NDA, EUA, scheduling, etc.) and the practical hurdles (study design, reproducibility, safety monitoring, lobbying, public opinion, etc.) underpins my analysis and gives insight beyond the clinical trial pipeline alone.",
            "status_quo": "As of the last major update (August 2024), the FDA declined to approve MDMA for PTSD due to insufficient efficacy and safety evidence and study design issues. No psychedelic is approved for mental health indication, and none are in the filing stage for NDA or EUA at FDA. While momentum is mounting globally (Australia, Czech Republic, Spain), the US remains at a regulatory impasse with cautious FDA oversight. However, societal/political support has been increasing, with high unmet need and some state-level initiatives. Over the last year, we have not seen submission of an NDA/EUA for any psychedelic and no DEA rescheduling.",
            "perspective_derived_factors": [
                {
                    "factor": "Political Turnover and Pro-Psychedelic Push",
                    "effect": "Increases probability. Clear signals from FDA leadership (Marty Makary), HHS, and political figures (RFK Jr., Trump allies, Kennedy) are calling for accelerated review, deregulation, shorter timelines, and prioritization of psychedelic drug approvals, including explicit references to potentially filing within a year. This, coupled with hiring staff with psychedelic advocacy backgrounds and bipartisan support (veterans' groups, substantial congressional interest—Texas funding for ibogaine), current administration’s messaging is shifting the Overton window and lowering political barriers."
                },
                {
                    "factor": "FDA’s Public Response and Accelerated Approval Pathways",
                    "effect": "Increases probability. FDA has recently committed to releasing detailed Complete Response Letters (CRLs), increasing transparency and signaling to drug developers how to address deficiencies. The agency has also announced a program to shorten review times for drugs with high public health impact, potentially including psychedelics, and may relax evidence requirements in certain contexts, potentially lowering barriers to NDA/EUA filings even if ultimate approval remains a challenge."
                },
                {
                    "factor": "Scientific/Clinical Trial Readiness and R&D Pipeline",
                    "effect": "Modestly increases probability. The pipeline is broad and highly active globally, but most pivotal trials in the US are phase 2 or ongoing phase 3, with standalone breakthrough/fast-track designations not immediately leading to NDA filings. However, multiple candidates (psilocybin, LSD, MDMA derivatives, ibogaine, DMT, etc.) have strong financial/investor backing and recent safety/efficacy data (Arcadia Medicine’s IND clearance for new MDMA, COMPASS phase 3 for psilocybin). Furthermore, the incentives created by political/regulatory signals could drive sponsors to file incomplete or rolling NDAs, or seek EUA, before data are fully mature."
                },
                {
                    "factor": "Barriers from the Scientific/Regulatory Side",
                    "effect": "Decreases probability. FDA remains conservative in its standards (as shown by Lykos MDMA CRL), focusing on durable benefit, abusable potential, difficulty of study blinding, and reproducibility. Large parts of the psychiatric community urge caution, and key regulatory institutions (Royal College of Psychiatrists report, Euronews) emphasize evidence gaps even as they express excitement. Many pivotal studies (e.g., Compass, MAPS) will not complete data collection with sufficient time for FDA review/filing before the end of 2025 unless there’s acceleration."
                },
                {
                    "factor": "Alternative Pathways—DEA Rescheduling and EUA",
                    "effect": "Modestly increases probability. Even if NDA/EUA filings are delayed, a change in the Controlled Substances Act (CSA) scheduling of a psychedelic by the DEA would trigger ‘Yes’ resolution. The new administration’s tone, including calls to relax restrictions and bipartisan political support, raises the probability of this bureaucratic action through political pressure. However, the DEA typically lags behind the FDA in rescheduling without compelling medical evidence unless directed at high political levels."
                },
                {
                    "factor": "Global Policy Shifts and Influence",
                    "effect": "Slightly increases probability. Approvals are unfolding in Europe (Czech Republic, Spain within 2 years; Australia, Switzerland, New Zealand already advanced), raising the probability of cross-national policy transfer or pressure for harmonization. US researchers, investor funds, and advocacy groups are increasingly transnational, fostering a climate where regulatory authorities may act preemptively to avoid being last-movers."
                },
                {
                    "factor": "Base Rate of NDA/EUA Filings for Psychedelics",
                    "effect": "Neutral to slightly negative. Despite the hype, the US base rate is extremely low; last 2 years saw zero NDA/EUA filings for psychedelics in mental health, with prior filings being infrequent. This historical frequency tempers the enthusiastic narrative."
                }
            ],
            "no_scenario": "Despite political shifts and increasing societal support, ongoing challenges prevail. Key sponsors (e.g., Lykos, COMPASS) are unable to finish pivotal trials or assemble sufficiently robust packages in time; FDA maintains high standards or slow review even on fast-track; no group files an NDA or EUA due to lack of mature or convincing data; the DEA does not reschedule absent FDA action. Political talk fails to translate into concrete filings, and global advances have little effect on US regulatory timelines before Jan 1, 2026. The next step occurs only after the question close.",
            "yes_scenario": "Either (1) a sponsor, motivated by the newly supportive political and regulatory climate and taking advantage of proposed streamlined/accelerated FDA pathways, files an NDA or EUA for a psychedelic drug for a DSM-5 mental disorder between now and the end of 2025—regardless of whether the file is complete or adequate for approval, or (2) the DEA, prompted by high-level political interventions, proactively reschedules a psychedelic to a less restrictive schedule before NDA approval, enabling further clinical availability or research. The filings, not acceptance or approval, trigger a Yes resolution. News articles (Arcadia’s IND clearance for novel MDMA, expanded funding and staff at FDA, pressure from Texas/other states, or possibly an attempt from MAPS) suggest one of these is plausible, if still not overwhelmingly likely.",
            "final_reasoning": "While the base rate for NDA/EUA filings or DEA rescheduling of psychedelics for mental health in the US by year-end is historically extremely low, a confluence of recent factors significantly increases the probability relative to any previous year: (1) explicit political prioritization from both major parties and FDA leadership, with promises of accelerated review and reduced evidence requirements; (2) highly visible public and investor support, (3) a global momentum that may embolden US actors; and (4) multiple late-phase trials, fast-track designations, and new candidate INDs. However, substantial regulatory, scientific, and cultural inertia remains, and significant time barriers often prevent rushed filings for complex psychiatric NDAs, particularly in the wake of the Lykos MDMA rejection and strong pushback from the scientific community over rigor and safety (see CRL and Royal College statements). The time window is tight, but—given the lowered bar for Yes (filing, not acceptancee/approval)—it is plausible that at least one actor will seize the political moment to file an NDA/EUA for a psychedelic or that political influence will induce DEA rescheduling. On balance, I assess the probability as much higher than historical base rate (which is ~5%) but not overwhelming; the evidence weighs toward a nontrivial chance of a rushed or symbolic filing even absent full confidence in approval, but numerous hurdles remain and recent news suggest filings are likely being prepared, particularly in a 'race' to capitalize on political opportunity, even with partial data.",
            "final_probability": 38
        },
        "US Law and Regulation (FDAApprovalProcess)": {
            "time_to_resolution": "About 2 months and 3.5 weeks until question closes on December 31, 2025.",
            "perspective_relevance": "I possess detailed expertise in the nuances of the FDA approval process, including New Drug Applications (NDAs), Emergency Use Authorizations (EUAs), drug scheduling under the Controlled Substances Act, and the requirements for psychiatric medication approvals under US law. I also understand the impact of shifting political, regulatory, scientific, and logistical landscapes as they relate to psychedelic medicines for DSM-5-defined mental illnesses.",
            "status_quo": "As of now, the FDA has not approved or received a new NDA or EUA for any classic psychedelic for mental health since rejecting the Lykos MDMA application for PTSD in August 2024. There has also been no federal rescheduling of any classic psychedelic since 2024. If nothing changed, the answer would be No.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent FDA rejection of MDMA for PTSD (Lykos application)",
                    "effect": "Decreases probability, as it highlights the regulatory and evidentiary hurdles for psychedelic approvals and suggests the FDA maintains high standards for efficacy, safety, and trial methodology (esp. blinding issues)."
                },
                {
                    "factor": "Political shift and regulatory climate",
                    "effect": "Increases probability moderately; reports indicate the FDA, under the Trump/Kennedy administration and Marty Makary, is prioritizing psychedelic review, accelerating timelines, hiring pro-psychedelic staff, and publicly signaling willingness to revisit prior rejections."
                },
                {
                    "factor": "Expedited approval pathways (e.g., EUA, NDA, Fast Track practicability)",
                    "effect": "Increases probability somewhat, as public and political pressure could spur at least the *filing* (not necessarily acceptance) of an NDA or EUA for a psychedelic substance even in the absence of immediately approvable data. Companies and advocates may view a filing as a symbolic or political step even if chances of approval are uncertain."
                },
                {
                    "factor": "Recent and upcoming trial progress",
                    "effect": "Neutral to slightly increasing; while several trial milestones in the US and EU are advancing, the available evidence and logistical timelines suggest that no major phase 3 results for classic psychedelics (except possibly already-rejected MDMA) will reach NDA submission readiness in 2025 absent rapid, less evidence-based moves."
                },
                {
                    "factor": "Broader US and international movement (state-level decriminalization, international approvals)",
                    "effect": "Increases probability marginally by building pressure but does not directly drive federal regulatory filings."
                },
                {
                    "factor": "Federal drug rescheduling prospects in 2025",
                    "effect": "Slightly increases probability; while there is political talk, there is currently no evidence or reporting of active federal rulemaking to reschedule classic psychedelics before end of 2025, but a motivated administration might push for rulemaking or DEA waivers, especially for veteran/PTSD groups."
                }
            ],
            "no_scenario": "Despite growing public interest and global research momentum, no US drug sponsor files an NDA/EUA for a classic psychedelic due to insufficient phase 3 data, persistent regulatory concerns (especially blinding, safety/abuse, and durability), and no DEA administrative action is taken to reschedule any psychedelic by December 31, 2025. Political signals do not translate to concrete regulatory activity before the deadline.",
            "yes_scenario": "A pharmaceutical company (or non-profit like MAPS) files a new NDA or EUA for a classic psychedelic, perhaps for a revised version of MDMA, psilocybin, or another agent (e.g., Arcadia's non-racemic MDMA formulation, or ibogaine for PTSD). Alternatively, a newly energized FDA/DEA leadership, under political pressure, initiates a federal rescheduling for one or more psychedelics, potentially using their discretionary authority for an expedited review, even if only preliminary review and not full acceptance.",
            "final_reasoning": "The base rate for novel psychiatric drug NDAs/EUAs, especially for controlled substances with ongoing credibility/gating concerns at the FDA/DEA, is low, particularly within a one-year window. However, the policy environment has become unusually favorable, with high-profile political backers, FDA staff changes, explicit prioritization of psychedelic reviews, and scientific and patient advocacy peaking. The resolution allows for an NDA/EUA *filing*, not acceptance, substantially lowering the threshold and opening the door for symbolic or politically driven filings. There are credible (though not confirmed) reports of companies preparing NDAs for next-generation MDMA and psilocybin. The Trump/Kennedy-Makary regulatory shift could further catalyze action, especially if they seek to make a statement before the 2026 election cycle. While no rescheduling action is yet public, the administration could pursue an emergency or expedited rulemaking if pressure mounts. Given these factors and the question's phrasing (filing, not approval), the probability of at least one qualifying development in the last quarter of 2025 is well above historical base rate—though still short of outright certainty, as significant inertia and procedural time limits persist. I estimate the probability at 68%.",
            "final_probability": 68
        },
        "US Law and Regulation (ScheduleIFederalDrugLaw)": {
            "time_to_resolution": "Approximately 2 months and 3 weeks, until December 31, 2025.",
            "perspective_relevance": "As a US Law and Regulation (ScheduleI/FederalDrugLaw) expert, I closely track FDA and DEA actions, legal definitions, regulatory precedents, and the practical requirements for rescheduling, NDA/EUA applications, and legislative/executive behaviors affecting controlled substances that are considered psychedelics.",
            "status_quo": "No psychedelic is FDA-approved for a mental disorder. In August 2024, the FDA rejected MDMA-assisted therapy for PTSD. Psychedelics such as psilocybin, LSD, and MDMA remain Schedule I. No NDA, EUA, or DEA rescheduling has occurred for classic psychedelics specifically for mental health in the US.",
            "perspective_derived_factors": [
                {
                    "factor": "Current regulatory climate and federal administration posture (Trump/HHS/Kennedy)",
                    "effect": "Increases probability. Recent news points to a shift with political pressure from Kennedy and allies, new FDA prioritization and willingness to expedite/reduce review times for psychedelics, and signals that rescheduling or regulatory action is not out of the question."
                },
                {
                    "factor": "FDA/DEA procedural hurdles and scientific scrutiny standards",
                    "effect": "Decreases probability. The FDA’s recent rejection of MDMA underscores the high evidentiary and trial design bar. Issues with blinding, selection bias, durability of effect, and abuse assessment remain, and new applications must overcome these."
                },
                {
                    "factor": "Base rate of NDA/EUA filings for psychedelics in mental health",
                    "effect": "Decreases probability. Despite growing research and investor buzz, no classic psychedelic NDA/EUA for mental health has gotten to filing in the last several years. The track record is that applications remain rare and most take years to mature from IND to NDA."
                },
                {
                    "factor": "Pipeline status and recent developments",
                    "effect": "No clear effect or mildly increases probability. Arcadia Medicine has IND clearance for a novel non-racemic form of MDMA for GAD, planning a trial in 2025. However, reaching NDA filing in under 12 months from a new IND is extremely rare unless breakthrough or accelerated programs are given, and news does not indicate imminent filing. No evidence of EUA filings either."
                },
                {
                    "factor": "DEA rescheduling as a resolution pathway",
                    "effect": "Increases probability (slightly). The question resolves \"yes\" if the DEA reschedules any psychedelic, not only if the FDA approves or files an NDA/EUA. Political figures (Kennedy, Trump affiliates) and new FDA initiatives increase the chance of a top-down push to have DEA act, especially for certain populations (veterans, under compassionate use), but the process is cumbersome and typically takes many months."
                },
                {
                    "factor": "International regulatory momentum and advocacy",
                    "effect": "Slightly increases probability. Several countries (Czech Republic, Australia) have moved to allow medical psilocybin/MDMA for mental health; the US often lags but is not indifferent to international signals. Advocacy and high-level veterans government support increase pressure."
                }
            ],
            "no_scenario": "Despite increased political will and expedited review promises, neither the FDA nor any sponsor files an NDA or EUA for a psychedelic for mental health by year-end 2025. Ongoing or newly started clinical trials do not mature quickly enough, and procedural/quality hurdles (blinding, durability of effect, safety) mean no application is ready. The DEA, while facing advocacy, does not formally move to reschedule any classical psychedelic, and thus the status quo holds.",
            "yes_scenario": "Political pressure from Trump/Kennedy/federal agencies leads to either (1) the FDA accepting an NDA/EUA filing (even if incomplete or likely to fail later) for a psychedelic for a DSM-5 disorder—possibly spurred by a sponsor hoping to exploit the new regulatory climate and relaxed standards; or (2) the DEA, under White House direction, commencing and executing a rule change to reschedule some psychedelic (e.g., MDMA or psilocybin) to Schedule II/III for a medical mental health use, possibly under pressure to enable clinical access for veterans or in response to legal petitions or international precedents.",
            "final_reasoning": "While the last year saw a setback with the MDMA rejection, the regulatory and political environment has notably shifted, with FDA leadership now signaling openness to accelerated review, reduced standards, and quick-turn rulemaking. High-level political figures (Kennedy, Trump) make public commitments and prompt agency heads to prioritize psychedelics for mental health. Given the question only requires an NDA or EUA to be filed (not accepted) or any DEA rescheduling—not full FDA approval—the bar is lower. There are precedents for late-December filings in response to political momentum. However, the persistent regulatory hurdles, slow-moving science, and lack of clear imminent drug candidates make the scenario closer to a toss-up. With about 3 months left, the window for a surprise (for example, a politically-motivated NDA/EUA filing or a rescheduling petition acted upon rapidly by the DEA) has opened—pushing my probability above strict historical base rates, but not into certainty. Thus, I forecast a probability somewhat above even odds.",
            "final_probability": 65
        }
    },
    "deliberation_probability": [
        67,
        62,
        62,
        55,
        17,
        38,
        30,
        40,
        62,
        18,
        40,
        38,
        68,
        65
    ],
    "deliberation_mean_probability": 47.285714285714285,
    "deliberation_sd": 17.95904987819435,
    "deliberation_probability_result": 47,
    "group_results": {
        "RegulatoryAffairsFdaapplicationsubmission": {
            "forecaster_to_engage": "ClinicalTrialManagementPhaseiiiTrialCompletion",
            "response_type": "critique",
            "response": "While your forecast appropriately incorporates the unprecedented political and administrative momentum behind psychedelic therapeutics, it may underweight how much the regulatory and policy environment has transformed the meaning of 'base rates' in 2025. Historically, the base rate for NDA/EUA filings may be low following phase III completion, but this question allows for a single symbolic filing or DEA scheduling action—irrespective of trial completion or normal FDA pacing—to resolve Yes. With public political direction to agencies to accelerate and symbolic moves likely (as seen, for instance, with cannabis rescheduling), the traditional anchor to scientific or phase completion is less relevant. Additionally, there is now significant pressure on agencies and industry to seize the moment, which historically leads to last-minute filings when institutional windows are perceived to be closing or public advocacy peaks. Your 55% probability reasonably exceeds strict historical base rates, but may be unduly anchored by trial history benchmarks and less so by the new risk calculus for sponsors and agencies incentivized to file 'placeholder' NDAs/EUAs or pursue a rapid rescheduling, even if success is unlikely. Given the low bar for what triggers a Yes, I think an even higher probability—closer to 2:1 odds—is justified."
        },
        "RegulatoryAffairsBreakthroughtherapydesignation": {
            "forecaster_to_engage": "PharmacologyClinicaltrialphases",
            "response_type": "critique",
            "response": "Your analysis robustly details the barriers from within the clinical development process itself, including the significant regulatory and scientific hurdles that remain even after the recent FDA MDMA rejection. However, I believe you may be overemphasizing the traditional evidentiary cadence of psychiatric drug NDAs/EUAs and underestimating the impact of the current political environment—particularly the flexibility now offered by administrative and symbolic regulatory moves. This forecasting question requires only a filing or DEA rescheduling, not approval or scientific consensus, and the bar for a procedural Yes is thus quite low. Political capital invested by high-profile leaders, the explicit FDA signals about expedited reviews, and the incentive for both agencies and sponsors to show progress before year-end markedly reduce the predictive power of historic timelines and standard clinical trial-to-filing lags. While you rightly note almost no direct evidence for imminent NDA/EUA filings, the tail risk of a rapid, even largely symbolic, action is vastly higher in this unique environment. Thus, while your conservative probability (18%) reflects classic base rates, it fails to sufficiently account for the extraordinarily permissive resolution criteria and the unprecedented political and regulatory optics, both of which justify a much higher, perhaps 2-3x, probability of a qualifying step before January 2026."
        },
        "ClinicalTrialManagementIndapplicationprocess": {
            "forecaster_to_engage": "PharmacologyDrugdevelopmentpipeline",
            "response_type": "defense",
            "response": "Your reasoning stands out for its integrated perspective on both regulatory science and the shifting political climate. I think you correctly identify that the real 'action' in late 2025 may not derive from strict scientific progression, but from the confluence of political, symbolic, and policy incentives—a point that classic base rate anchoring can miss. The distinction you draw between the usual evidentiary hurdles and the much lower bar for a valid Yes outcome under the question's resolution criteria is both accurate and important: agencies or sponsors may file to capture political or public momentum, even in the absence of transformative new data. Furthermore, your explicit consideration of executive or agency action (especially rescheduling) as a function of political signaling rather than only scientific readiness is key to estimating correctly here. In summary, your probability balances well the scientific inertia with the marked increase in tail-probability from 'extraordinary' events and seems well calibrated for an environment where filings or DEA moves may be as much about public messaging as about robust clinical progress."
        },
        "ClinicalTrialManagementPhaseiiitrialcompletion": {
            "forecaster_to_engage": "PsychiatryEvidencebasedtherapyadoption",
            "response_type": "defense",
            "response": "Your forecast makes an important and underappreciated point: the primary barrier to a near-term NDA/EUA for psychedelics remains not just the political atmosphere or administrative priority, but the underlying readiness of pivotal trial data and the evidentiary bar for even a symbolic filing. By highlighting the risk sponsors face of reputational and regulatory blowback for a 'premature' NDA, you add useful nuance to the field’s prevailing optimism. Furthermore, your recognition of the difference between FDA/DEA rhetoric and actual real-world filings—especially in a risk-averse therapeutic sector—reminds us that many pipeline candidates (e.g., Compass Pathways, Usona) are unlikely to file incomplete/underbaked dossiers, even in a favorable environment. Your estimate, therefore, is well rooted in the practical realities facing companies, and your emphasis on remaining procedural inertia and trial un-readiness is a needed counterbalance to pure political expectations. While my own probability is somewhat higher due to tail risk and the resolution's moderate bar, your logic is a crucial corrective to overextrapolation."
        },
        "UsHealthcarePolicyPolicychangeadvocacy": {
            "forecaster_to_engage": "RegulatoryAffairsFdaapplicationsubmission",
            "response_type": "critique",
            "response": "Your forecast highlights political and societal momentum and the permissiveness of the question's resolution, concluding that the environment justifies a greater than even chance (67%) of a Yes outcome. However, from a US Healthcare Policy (PolicyChangeAdvocacy) perspective, this reasoning may overweight symbolic possibilities while underweighting the persistent structural friction within federal agencies after a high-profile rejection and enduring regulatory caution. The cannabis example you cite is instructive, but there are meaningful differences in legal precedent, decades of congressional advocacy, and state-level moves that are less mature in psychedelics. The lack of visible imminent trial completions or major sponsors explicitly telegraphing NDA/EUA submissions is a real constraint—even in politically 'hot' moments, regulators require at least the minimum data package or rationale, and missteps here could undermine longer-term acceptance of the field. Symbolic action is possible, but historical policy pushes that translated into real filings or rescheduling (other than cannabis) within such a tight window—especially after an FDA rejection—are vanishingly rare. While your forecast rightly identifies dynamic conditions, it could better acknowledge the high inertia of federal stakeholders around substances with substantial abuse potential and the reputational risk for agencies and sponsors in moving without clear scientific progress. This supports a notably more tempered, but still non-negligible, probability."
        },
        "UsHealthcarePolicyCmscoveragedetermination": {
            "forecaster_to_engage": "PsychiatryTranslationalresearchpipeline",
            "response_type": "defense",
            "response": "Your forecast insightfully recognizes the uniquely low bar for resolution (mere NDA/EUA filing or DEA action, not acceptance), and gives appropriate weight to the current political environment and explicit agency signals about openness to rapid action. You correctly note that, despite the lack of fully mature late-phase trial data, the appearance of a policy 'window' and visible administrative encouragement could lead to actors taking partially symbolic or even contingency-based prospective moves by year-end. Compared to more conservative, base-rate forecasts, your approach judiciously incorporates political tail-risk while also noting that neither scientific unreadiness nor recent setbacks fully preclude a Yes outcome, given the updated incentives and regulatory posture. Your estimate (40%) is well-reasoned as it balances the traditionally low base rates with the possibility that sponsors use this exceptional moment for regulatory engagement—even if only as a placeholder or to secure a public relations victory—rightly capturing a plausible middle position between historic inertia and present volatility."
        },
        "PsychiatryEvidencebasedtherapyadoption": {
            "forecaster_to_engage": "RegulatoryAffairsBreakthroughtherapydesignation",
            "response_type": "critique",
            "response": "Your reasoning places appropriate emphasis on the momentum from political, regulatory, and public interest factors, and you factor in the generous resolution bar requiring only an NDA/EUA filing or DEA scheduling. However, from the perspective of evidence-based therapy adoption in psychiatry, your probability (62%) may be overstated relative to actual industry capabilities within the given timeframe. While regulatory and political signals can accelerate filings, the extent to which sponsors are positioned to assemble even a minimally complete NDA/EUA—following a brutal FDA rejection, and with ongoing trial/data limitations—remains a real bottleneck. Your forecast might underweight that even in a permissive climate, most sponsors (especially major ones likely to be first-movers) are risk-averse about filing an incomplete psychiatric NDA, given potential long-term reputational consequences. You also note international momentum, but the U.S. typically requires domestic, generalizable clinical evidence, with little indication this threshold will be lowered materially for a Yes outcome. The possibility of DEA rescheduling remains, but it is not solely at the agency's discretion and usually follows scientific review. Overall, your forecast may not sufficiently balance these ongoing practical, data-driven, and cultural constraints with the recent uptick in political encouragement, and so 62% may be too high given industry caution, trial status, and regulatory risk aversion."
        },
        "PsychiatryTranslationalresearchpipeline": {
            "forecaster_to_engage": "PublicHealthPolicyHealthtechnologyassessment",
            "response_type": "defense",
            "response": "Your analysis appropriately emphasizes that, despite historically low US base rates for filings or rescheduling of psychedelics for mental disorder indications, the convergence of explicit political prioritization, senior agency leadership support, and international precedent has made 2025 qualitatively different from previous cycles. I especially agree with your point that the window for action is tight but that policy and investor incentives (for instance, wanting to be the 'first mover' in the new regulatory environment) can often produce last-minute or symbolic filings in the final quarter, particularly when the resolution bar is so low (any NDA/EUA/DEA filing suffices, not acceptance or approval). Your discussion of global trends and FDA/DEA rhetoric capture the multiplicity of non-scientific pressures that could motivate a sponsor or the agency to act—even with a nontraditional or placeholder package. This balanced view steers between historical inertia and new, substantial tail-risk, making your moderate (<50%) but higher-than-base-rate probability (38%) both justifiable and reflective of the current dynamics. In sum, your forecast is well-calibrated for an environment suddenly shaped by extra-scientific (policy, advocacy, and international) forces."
        },
        "PharmacologyDrugdevelopmentpipeline": {
            "forecaster_to_engage": "PublicHealthPolicyRegulatoryscience",
            "response_type": "defense",
            "response": "Your forecast effectively demonstrates the importance of integrating both the historically low base rates for psychedelic drug progression in the US and the dramatically changed, politically-driven regulatory environment of late 2025. I agree that the permissive resolution—requiring only a filing or scheduling action, not a drug approval—elevates the likelihood well above historic norms, particularly in an environment where political signaling can motivate 'stake in the ground' filings regardless of scientific readiness. Your discussion of FDA streamlining, accelerated reviews, and the new willingness for agencies to show support for innovation is spot on. Yet you appropriately temper this with a candid recognition of the inertia in scientific and clinical regulatory review, and the absence of reporting on imminent NDAs or rescheduling, which prevents an over-exuberant probability assignment. Overall, your calibration around 40% well captures the elevated—but still uncertain—likelihood that the next step is taken before year-end, due to current tailwind factors. The balance between opportunity and ongoing friction in regulatory progress is accurately reflected in your assessment."
        },
        "PharmacologyClinicaltrialphases": {
            "forecaster_to_engage": "UsLawAndRegulationFdaapprovalprocess",
            "response_type": "critique",
            "response": "Your probability (68%) for a qualifying NDA, EUA, or DEA rescheduling by year-end is thoroughly justified by the visible policy prioritization, political advocacy, and low procedural bar set by the resolution. However, from a Pharmacology (ClinicalTrialPhases) lens, this level of confidence may insufficiently account for several countervailing real-world constraints. Notably, there remains a significant absence of any public signals from major sponsors or the FDA that an actual NDA/EUA filing for a psychedelic compound is forthcoming within the 2025 window; candidates widely cited are largely still in pivotal trial progress or addressing regulatory feedback. Furthermore, the aftermath of the FDA's high-profile MDMA rejection—and ensuing scientific community debate—has increased reputational risk for both sponsors and agencies considering 'premature' filings, which could result in further delays or adverse regulatory precedent, particularly in psychiatry where scrutiny is high. Historical outlier moves on cannabis are not fully generalizable, as the timeline to practical filings was much longer even with intense political will. While there is clear tail risk for a Yes if federal agencies seek a symbolic win, the evidence base for a 'plausible imminent action' is limited and sponsors may see more upside in a robust future submission than in a rushed 2025 attempt. Thus, your probability could benefit from greater caution—perhaps moving closer to moderate odds (30–40%) rather than a strong lean toward Yes."
        },
        "PublicHealthPolicyRegulatoryscience": {
            "forecaster_to_engage": "PharmacologyDrugdevelopmentpipeline",
            "response_type": "defense",
            "response": "Your probability and reasoning align well with the actual questions regulatory policy-makers ask in such fluid environments. You clearly articulate that the possibility for a 'Yes' outcome is elevated by the unusually permissive resolution bar—mere filing or rescheduling, not acceptance or approval—which is often overlooked by base rate analyses. I agree that the existence of political and policy incentives to make late-breaking or even symbolic submissions materially increases tail risk in 2025 despite clinical inertia. You properly caution against overcommitting to a high probability due to a lack of current public evidence of imminent NDA/EUA filings or rescheduling, showing respect for the slower pace of regulatory institutions. This nuanced approach—recognizing unique political winds but responsibly weighing the absence of direct company or agency action—results in a probability (62%) well suited for the current uncertainty landscape, and captures both the inductive signal of new regulatory priorities and the continued gravity of scientific process. Well-defended and balanced."
        },
        "PublicHealthPolicyHealthtechnologyassessment": {
            "forecaster_to_engage": "UsHealthcarePolicyPolicychangeadvocacy",
            "response_type": "defense",
            "response": "Your critique of RegulatoryAffairsFdaapplicationsubmission is well-founded. You correctly highlight that while the current political and advocacy momentum has shifted, entrenched regulatory inertia, agency risk-aversion after a high-profile FDA rejection, and the lack of overt signals from major sponsors or agencies regarding imminent filings all make a purely probability-driven, high bet questionable. The cannabis analogy is instructive but importantly distinct: cannabis benefited from a unique multi-decade, state-driven push, while psychedelics for mental health face more nascent and fragmented support in both Congress and the states, and pivotal trial data/candidate readiness remain low. The recognition that policy 'hype cycles' do not always translate to concrete action within a one-quarter window is critical to realistic forecasting. Your more tempered probability, focused on historical process inertia and risk management by both sponsors and agencies, is a much-needed corrective to forecasts that rely too heavily on short-term political optics. This approach is especially valid in the face of as-yet unmaterialized public filings or clear regulatory guidance toward imminent NDA/EUA or DEA scheduling moves."
        },
        "UsLawAndRegulationFdaapprovalprocess": {
            "forecaster_to_engage": "UsLawAndRegulationScheduleifederaldruglaw",
            "response_type": "critique",
            "response": "Your forecast effectively recognizes the intensifying political momentum and explicit agency signals about openness to scheduling changes or expedited review for psychedelics, and you correctly incorporate the permissive nature of the resolution criteria (mere filing or scheduling change, not approval or acceptance). However, from my perspective on the detailed FDA/DEA processes, I believe your 65% probability may slightly overstate the likelihood that a federal agency actually executes a qualifying move within the remaining weeks of 2025. While the administration's shift and agency rhetoric lower traditional procedural barriers, direct evidence of imminent action such as a published proposed rule, an open comment period, a publicized application submission, or an agency docket entry has not materialized in the news flow since October. Even late-breaking moves from the DEA or FDA usually have some warning via Federal Register notices or media leaks, and so far the clearest signals pertain to reviewing ongoing science and accelerating future approvals, not a concrete, currently unfolding rescheduling or NDA/EUA filing. Sponsors and agencies may remain wary of moving precipitously after the FDA’s recent high-profile rejection, especially without new clinical milestones. Thus, while your outlook is entirely justifiable as a tail-risk, I would assign somewhat more weight to the absence of a public 'pipeline' event and the short runway until year's end, suggesting the probability may be better calibrated slightly below even odds rather than solidly above."
        },
        "UsLawAndRegulationScheduleifederaldruglaw": {
            "forecaster_to_engage": "ClinicalTrialManagementIndapplicationprocess",
            "response_type": "defense",
            "response": "Your defense of the elevated probability for a Yes outcome is well justified. You correctly emphasize the risk of under-valuing political/administrative tailwinds in an environment primed for regulatory symbolism—especially since question resolution hinges only on a filing or rescheduling, not a full approval. As you note, it’s essential to recognize that, in American regulatory history, politically salient 'firsts' or symbolic submissions sometimes do occur rapidly when there’s executive pressure to deliver a visible win or respond to advocacy surges (as occurred, for example, with certain drugs under HIV-accelerated approvals in the 1990s, or the 2023 DEA cannabis rescheduling announcement). The risk calculus for sponsors and agencies changes materially in such an environment, sometimes overriding traditional clinical cadence. By foregrounding the distinction between scientific readiness and political or reputational incentives to file—even without robust phase 3 data—you and 'PharmacologyDrugDevelopmentPipeline' credibly justify a probability in the 55-65% range. This balancing of clinical base rates against contemporary political winds and new regulatory signaling captures the dynamics that will likely determine real-world outcomes before the deadline."
        }
    },
    "revision_results": {
        "Regulatory Affairs (FDAApplicationSubmission)": {
            "my_phase1_final_probability": 67,
            "reasoning_for_revised_probability": "Upon reviewing group deliberation, it is clear that upper-mid forecasts (55-68%) are strongly justified given the permissive resolution criteria and sudden political momentum—especially regarding symbolic filings and possible administrative push for DEA rescheduling. Critiquing 'ClinicalTrialManagementPhaseIIITrialCompletion' reinforced that base rates need heavy adjustment under 2025’s political/administrative signal to agencies to take action. However, the absence of public reporting on imminent filings or rescheduling still acts as a ceiling: there is no concrete evidence today of a pending action. Given most other well-informed forecasters are clustered in the 60-68% band, and that the plausible window for symbolic agency action remains open but not certain, my original forecast remains robust. I considered a slight upward nudge toward 70%, but in the absence of a true 'hint' of a breaking story, my 67% continues to balance the risk of last-minute symbolic filings against persistent process and timing uncertainty. No revision is needed at this time.",
            "revised_probability": 67
        },
        "Regulatory Affairs (BreakthroughTherapyDesignation)": {
            "my_phase1_final_probability": 62,
            "reasoning_for_revised_probability": "After engaging with Clinical Trial Management (Phase III Trial Completion) and reviewing the group's full spectrum of probabilities and reasoning, I observe that even most conservative forecasters acknowledge a non-trivial chance of a symbolic or politically-motivated NDA/EUA filing or DEA rescheduling that does not require the classic clinical-to-filing trajectory. The breadth of arguments reinforces the notion that, in the current political environment and given the extremely low bar for a Yes (filing or policy action, not approval), the procedural hurdle could be cleared more readily through non-traditional channels. While there is no concrete evidence of an imminent NDA/EUA filing, strong signals from agencies and the heightened incentive for policymakers to deliver a 'win' in this field increase the likelihood of some action, even as a placeholder or as a policy gesture. My initial probability was already moderately high, but upon further group review, the tail risk of an expedited or symbolic move appears even greater—especially in late December, given the history of policy actions made right before year-end deadlines. Therefore, I am increasing my probability to further reflect this, in line with the argument that risk is significantly right-tailed and traditional base rates are less relevant. My revised forecast is 70%.",
            "revised_probability": 70
        },
        "Clinical Trial Management (INDApplicationProcess)": {
            "my_phase1_final_probability": 62,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, it is evident that the consensus among subject-matter experts is that the base rate for psychedelic NDA/EUA filings or DEA rescheduling is historically very low, but the current political and regulatory context is unusually permissive. Multiple forecasters—especially those focused on regulatory affairs, drug development, and US law—emphasize that the radical shift in political will, the explicit lowering of procedural and evidentiary bars by key agencies, and the presence of strong public and advocacy incentives all substantially elevate the probability relative to all previous years. Several forecasters critique the reliance on classical clinical trial timelines, noting that the definition for resolution is so permissive that a purely symbolic or hurried filing (even late in December) suffices. The most compelling arguments are that 'extraordinary' political/policy moments can induce agencies or sponsors to file—despite really limited clinical readiness. Given this, while my initial probability already exceeded the historical base rate, I now see that the plausible risk of a last-minute NDA/EUA filing or DEA rescheduling is even higher than I previously judged. The modal probabilities cluster in the 60–70% range, occasionally even higher, and the strongest counterarguments to raising the probability further (i.e., those emphasizing scientific conservatism) do not seem as weighty in the current context. Therefore, I am increasing my probability moderately, to better reflect the sharply lowered bar under current policy conditions.",
            "revised_probability": 68
        },
        "Clinical Trial Management (PhaseIIITrialCompletion)": {
            "my_phase1_final_probability": 55,
            "reasoning_for_revised_probability": "The group deliberation highlighted that the permissive resolution criteria (filing, not acceptance, of NDA/EUA or any DEA scheduling move) dramatically lower the bar for a Yes outcome. Multiple forecasters argue persuasively that historical base rates and phase-to-filing lags are less predictive because the current policy environment encourages filings that are symbolic or politically motivated, even in the absence of fully mature data. Notably, several peers emphasize the credible risk of a last-minute push—either an agency-facilitated rescheduling or a sponsor's NDA as a political gesture—before the end-of-year deadline. This is supported by recent analogs (e.g., cannabis rescheduling filings under political pressure). While I still see substantial scientific and procedural inertia, these collective arguments justify an upward revision to reflect a higher likelihood of at least one qualifying move before January 2026, though not at strong-majority odds due to continued lack of clear imminent filings.",
            "revised_probability": 65
        },
        "US Healthcare Policy (PolicyChangeAdvocacy)": {
            "my_phase1_final_probability": 17,
            "reasoning_for_revised_probability": "After engaging with the group, particularly with the Regulatory Affairs (FDAApplicationSubmission) forecaster, I appreciated the argument that the current policy environment allows for meaningful tail risk—i.e., a politically or symbolically motivated filing or DEA action could occur outside the usual scientific cadence, and that filing or rescheduling (not approval) suffices for a Yes. However, I stand by most of my original reasoning: agency inertia, a lack of clear imminent filings/trial completions, and risk aversion—especially so soon after a high-profile FDA rejection—remain powerful counterweights. The group leans more optimistic, especially regarding a symbolic or last-minute action, and I accept the probability of a surprise filing is somewhat higher than strict process timelines suggest. Ultimately, no commenter provided evidence of any company or agency with a concrete, imminent filing plan, so the situation remains one where a Yes outcome is plausible primarily due to political, not scientific, reasoning. I therefore increase my estimate, but remain cautious, raising my probability to 28%.",
            "revised_probability": 28
        },
        "US Healthcare Policy (CMSCoverageDetermination)": {
            "my_phase1_final_probability": 38,
            "reasoning_for_revised_probability": "Deliberation revealed strong consensus among experienced regulatory and clinical pipeline forecasters that, although scientific and procedural inertia remains high, the dramatically increased political and administrative pressure—coupled with a permissive resolution threshold (filing or rescheduling, not approval)—makes a symbolic or opportunistic NDA/EUA filing or DEA move in 2025 plausibly greater than my initial estimate. Colleagues pointed out that agencies and sponsors may act not based solely on clinical data, but to capitalize on a perceived window for regulatory or political gain. The historical base rates are properly adjusted upward in light of recent events: explicit HHS/FDA signals, ongoing pipeline activity (e.g., Arcadia's IND for non-racemic MDMA), and at least moderately increased institutional willingness. While I still see the probability as below even odds, acknowledging persistent practical and reputational headwinds and lack of public imminent applications, I now judge the risk of a 'Yes' tail-event (symbolic or expedited filing/rescheduling) to be meaningfully closer to parity than initially forecast. Group arguments convinced me the risk of a rapid, policy-driven move is more than one-in-three—probably closer to 45%.",
            "revised_probability": 45
        },
        "Psychiatry (EvidenceBasedTherapyAdoption)": {
            "my_phase1_final_probability": 30,
            "reasoning_for_revised_probability": "Group deliberation revealed a consensus that the risk of a qualifying NDA/EUA filing or DEA rescheduling is higher than historic base rates due to extraordinary political and regulatory tailwinds. Many forecasters, especially those with regulatory or drug development perspectives, pointed to the significance of the resolution's low bar—filing or action, not approval—and the ability of political or symbolic actions to bypass normal evidentiary timelines. However, there was also notable acknowledgment by clinical and policy experts (including my own perspective) that the lack of imminent trial data and sponsors' longstanding reputational caution, especially in the wake of the FDA's MDMA rejection, remain real bottlenecks. In practice, combination of the permissive criteria and ongoing political/policy volatility raises the probability meaningfully above my original estimate. Comparing to peers' consensus (which clustered between 38 and 65%), I now see that my original estimate was overly conservative relative to the real-world potential for a late-breaking, symbolic, or pressure-induced filing. I update upward to reflect the plausible risk that a sponsor or agency acts in Q4 2025—even absent fully mature data—solely to secure a first-mover or political 'win.' Therefore, I revise to 45%.",
            "revised_probability": 45
        },
        "Psychiatry (TranslationalResearchPipeline)": {
            "my_phase1_final_probability": 40,
            "reasoning_for_revised_probability": "Group deliberation revealed a consensus among several highly-informed forecasters who gave probabilities in the 55–68% range, arguing that the unprecedented political momentum, explicit regulatory encouragement, and low bar for resolution make a qualifying NDA/EUA filing or DEA action more likely than I initially judged. Critiques of more conservative, base-rate estimates highlighted the unique, possibly singular, alignment of advocacy, administrative signals, and desire for symbolic action in 2025. However, critiques of higher probability forecasts also noted that scientific and regulatory inertia, sponsor caution, and procedural barriers haven't evaporated, and the lack of evidence for imminent filings or rescheduling means the probability shouldn't reach extreme values. On balance, weighing all arguments, I am persuaded the tail risk of a symbolic filing or reactionary DEA move is meaningfully higher than I set in Phase 1—it is plausible that an agency, at least as a show of progress, will trigger a Yes resolution before year-end, even if 'success' is unlikely. I therefore revise my estimate upward toward consensus, but remain somewhat below the most bullish views, reflecting remaining sponsor reluctance and timing constraints.",
            "revised_probability": 55
        },
        "Pharmacology (DrugDevelopmentPipeline)": {
            "my_phase1_final_probability": 62,
            "reasoning_for_revised_probability": "Group deliberation revealed a consensus among relevant experts (Regulatory Affairs, Clinical Trial Management, Law/Regulation, and Policy) that the probability is notably above historic base rates, but strong scientific, procedural, and institutional inertia still meaningfully constrain the likely speed and success of filings. Several well-argued critiques highlighted that political and regulatory tailwinds dramatically raise the chance of at least a symbolic filing or DEA rescheduling before year-end, and that the resolution's low bar (filing versus approval) justifies a higher-than-normal prediction. However, some critique (notably from US Healthcare Policy and Psychiatry) notes that risk aversion among sponsors, the absence of specific imminent filings, the unique regulatory caution with controlled substances, and continued trial unreadiness temper the magnitude of the shift. In aggregate, there is a group tendency to cluster between 38-68%, with a lean above 50%. I see no compelling new evidence to push much above my original estimate, nor sufficient to warrant a lower stance—my prior reasoning remains robustly supported. In light of this, I am holding my forecast steady.",
            "revised_probability": 62
        },
        "Pharmacology (ClinicalTrialPhases)": {
            "my_phase1_final_probability": 18,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, several expert forecasters convincingly argue that the unusually permissive resolution criteria (mere NDA/EUA filing or DEA rescheduling, not acceptance or approval), heightened political tailwinds, and explicit FDA and executive agency support for expedited action substantially increase the probability above baseline. Multiple perspectives highlight that, in contrast to classic base-rate inertia and scientific unreadiness, agencies or sponsors may be strongly incentivized to make symbolic or placeholder filings—even with partial or imperfect data—before the year ends, especially given precedents for last-minute 'first mover' filings under political spotlight. While I remain skeptical that a true NDA/EUA based on conventional trial readiness will materialize, the risk of a headline-driven, politically-motivated filing or DEA rescheduling (outside the typical evidentiary cadence) is not negligible. Institutional inertia and recent FDA pushback are strong, but the possibility of a tail event within the permissive boundaries is credibly above my initial 18%. Thus, I am revising my probability upward—though with caution, given the lack of direct evidence for an imminent filing or rulemaking, I do not cross into majority odds but align closer to 35%.",
            "revised_probability": 35
        },
        "Public Health Policy (RegulatoryScience)": {
            "my_phase1_final_probability": 40,
            "reasoning_for_revised_probability": "Group deliberation revealed a notable clustering of probabilities in the 55–68% range from experts in Regulatory Affairs and Law, who emphasized the critical importance of the low bar (mere filing/rescheduling suffices) and the potency of the current political/administrative window. Several forecasters persuasively argued that historical base rates are less determinative given both the symbolic and strategic value of filings ahead of potential regulatory change, while others highlighted the incentive for agencies, sponsors, and advocacy groups to file even with limited clinical progress. Across deliberation, the most common counterpoint to my initial position was that unusual moments often prompt last-minute, 'placeholder' filings—further raising tail risk—and that the window for a symbolic move is unusually open. While I remain cautious about procedural inertia and the lack of public evidence for an imminent filing, the balance of expert discussion pushes me toward moderately higher odds. Thus, I am revising my probability up to 50%, acknowledging both persistent barriers and the meaningful likelihood that at least one actor will seek to capitalize on this unique moment with a 'next step' before year's end.",
            "revised_probability": 50
        },
        "Public Health Policy (HealthTechnologyAssessment)": {
            "my_phase1_final_probability": 38,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, the major themes that emerged are: (1) considerable agreement that the current political and administrative context meaningfully elevates the tail risk of a symbolic or minimally complete NDA/EUA filing or DEA rescheduling, compared to historical precedent; (2) persistent friction from regulatory inertia, data readiness, and agency risk aversion—especially post-MDMA rejection—with multiple forecasters highlighting the lack of concrete public evidence of imminent filings; (3) the argument from several experienced forecasters that the relevant base rate, even when updated for political heat, rarely results in actual filings within such a narrow window, and that reputational and scientific process concerns remain powerful constraints. However, others credibly argue for more weight on the possibility of a late-breaking political move, especially given permissive resolution criteria. On balance, the deliberation supports a slightly higher, but still sub-even odds probability, especially since no clear movement (news, sponsor announcements, pre-filing signaling) has emerged in the weeks prior. Thus, after weighing this and the nuances expressed by both cautious and optimistic forecasters, I will revise my probability moderately upward.",
            "revised_probability": 45
        },
        "US Law and Regulation (FDAApprovalProcess)": {
            "my_phase1_final_probability": 68,
            "reasoning_for_revised_probability": "After reviewing both my initial forecast and the group deliberation, I see substantial convergence around the notion that the policy and political environment in late 2025 substantially increases tail risk for at least one NDA/EUA filing or a DEA rescheduling, even in the absence of strong scientific readiness. However, multiple critiques—including highly relevant skepticism by those focused on actual sponsor activity, regulatory inertia, and the absence of public signals about imminent filings or rescheduling—highlight that the last step to a qualifying action often does not materialize simply from rhetoric or political encouragement, especially after a recent, visible FDA rejection. Although the probability is clearly above base rates and a Yes outcome remains plausible given the permissive trigger, continued absence of any public filings, Federal Register activity, or imminent phase 3 readouts may justify a slightly more conservative outlook. I am lowering my forecast moderately to reflect this inertia, the reputational risk for both sponsors and agencies in rushing filings, and the still-real possibility that 2025 closes without a qualifying move. My revised probability is 55%.",
            "revised_probability": 55
        },
        "US Law and Regulation (ScheduleIFederalDrugLaw)": {
            "my_phase1_final_probability": 65,
            "reasoning_for_revised_probability": "After carefully reviewing peer forecasts and the group deliberation, I see most forecasters converge around a probability in the 55-68% range for the possibility that a qualifying NDA/EUA filing or DEA rescheduling for a psychedelic for mental health will occur in 2025. Engagements on both sides of the debate highlight two main factors: (1) the traditional clinical and regulatory inertia, reinforced by the lack of overt signals of imminent filings, suggesting caution; (2) the extraordinary nature of the current political and regulatory environment, which increases the odds of at least a symbolic or strategic move before year-end, given the very low bar for resolution (mere filing, not approval). My initial probability of 65% is well supported by this synthesis: the unique convergence of recent policy, advocacy, and administrative priorities makes a qualifying regulatory event notably likelier than historical base rates, but without overwhelming evidence of an imminent action, it does not warrant a more extreme estimate. The group critique and defenses further reinforced my weighting of political tail risk over clinical trial base rate; however, the lack of new public signals since October argues against moving higher. I therefore maintain my prior forecast at 65%.",
            "revised_probability": 65
        }
    },
    "revision_probability": [
        67,
        70,
        68,
        65,
        28,
        45,
        45,
        55,
        62,
        35,
        50,
        45,
        55,
        65
    ],
    "revision_mean_probability": 53.92857142857143,
    "revision_sd": 13.082367967931173,
    "revision_probability_result": 54,
    "question_details": {
        "id": 38993,
        "title": "Will the next step for the medical approval of psychedelics for mental health be taken in the US in 2025?",
        "created_at": "2025-08-31T06:17:59.351523Z",
        "open_time": "2025-10-06T14:41:16Z",
        "cp_reveal_time": "2025-10-06T16:11:16Z",
        "spot_scoring_time": "2025-10-06T16:11:16Z",
        "scheduled_resolve_time": "2026-01-01T10:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-10-06T16:11:16Z",
        "actual_close_time": "2025-10-06T16:11:16Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "This question is synced with an identical question on Metaculus. The original question opened on 2024-12-20 21:18:00 and can be found [here](https://www.metaculus.com/questions/31134). This question will resolve to the same value as the synced question. The original question's background info at this time is below. \n\nIn August of 2024, the US Food and Drug Administration (FDA) [declined to approved MDMA as a treatment for post-traumatic stress disorder (PTSD)](https://www.nbcnews.com/health/health-news/fda-rejects-psychedelic-mdma-assisted-therapy-ptsd-rcna165531). Prior to the approval MDMA was [often touted as a potentially promising treatment](https://www.psychiatrist.com/news/mdma-assisted-therapy-may-be-the-next-frontier-in-ptsd-treatment/), but ultimately the drug [faced a number of concerns](https://www.vox.com/future-perfect/353752/mdma-fda-approval-hearing-lykos-blinding-misconduct-allegations) about its efficacy results that led to its denial.\n\nOther psychedelic drugs [are in the midst of trials](https://psychedelicalpha.com/data/psychedelic-drug-development-tracker), but trials can often be lengthy and may not produce the necessary results in time for a submission in 2025. [Other possible pathways](https://ondrugs.substack.com/p/the-eua-psychedelics-backdoor-cracks) to psychedelic medical use could include an emergency use authorization (EUA) or federal rescheduling under the Controlled Substances Act.\n\n***\n\nThis question belongs to Vox's Future Perfect Community page and 2025 forecasting tournament. [Learn more and compete for the $2,500 prize pool](https://www.metaculus.com/c/future-perfect/).\n\n`{\"format\":\"metac_closes_in_period\",\"info\":{\"post_id\":31134,\"question_id\":30860}}`",
        "resolution_criteria": "This question will resolve as **Yes** if any of the following happens after December 31, 2024 before January 1, 2026:\n\n* A New Drug Application (NDA) for the treatment of a mental disorder (as defined by the [Diagnostic and Statistical Manual of Mental Illnesses](https://my.clevelandclinic.org/health/articles/24291-diagnostic-and-statistical-manual-dsm-5), the DSM-5) is filed to the FDA for a psychedelic.\n* An application for an Emergency Use Authorization (EUA) for the treatment of a mental disorder (as defined by the DSM-5) is filed to the FDA for a psychedelic.\n* The DEA reschedules any psychedelic under the U.S. Controlled Substances Act to a less restrictive schedule (e.g., from Schedule I to Schedule II).\n\nFor the purposes of this questions, a psychedelic is defined broadly and includes:\n\n* psychedelic indolealkylamines(e.g. LSD, psilocybin, DMT)\n* psychedelic phenylethylamines (e.g. mescaline, MDMA, the 2C series)\n* arylcycloalkylamines with psychedelic or dissociative effects (e.g. PCP, ketamine)\n* Salvinorin A\n\nCannabinoids (e.g. THC) are *not* considered psychedelics for the purposes of this question.",
        "fine_print": "The NDA or EUA application do not need to be accepted, simply filed.",
        "post_id": 39616,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Jaguar Health Completes Meeting with FDA for Advice on Development Pathways to Advance Ongoing Crofelemer Trial for Potential Approval for Treatment of Pediatric Indication Microvillus Inclusion Disease (MVID)**\nJaguar Health, Inc. (NASDAQ:JAGX), through its family company Napo Pharmaceuticals, completed a Type C meeting with the U.S. Food and Drug Administration (FDA) on October 2, 2025, to seek guidance on advancing its clinical development program for crofelemer powder for oral solution in treating microvillus inclusion disease (MVID), a rare pediatric disorder. The ongoing investigator-initiated proof-of-concept trial in the United Arab Emirates (UAE) demonstrated a 37% reduction in total parenteral support (PS), including a 30% reduction in total parenteral nutrition (TPN), following reinitiation of crofelemer dosing after a 12-week drug cessation period—exceeding the previously reported 27% PS reduction at 12 weeks. The FDA meeting was attended by members of Napo’s Scientific Advisory Board, including the principal investigator of the UAE trial. Pravin Chaturvedi, PhD, Chief Scientific Officer and Chair of the Scientific Advisory Board, stated that the FDA discussion was collaborative and indicated potential pathways to support approval, especially if the study is amended and deemed adequately controlled. Lisa Conte, CEO of Jaguar Health, emphasized gratitude for the FDA’s regulatory support and noted that orphan drug designations have been granted by both the FDA and the European Medicines Agency (EMA). The company plans to pursue regulatory discussions in the EU and Middle East/North Africa (MENA) regions to expand access globally. An abstract detailing partial results from the UAE trial has been accepted for presentation at the North American Society for Pediatric Gastroenterology, Hepatology and Nutrition (NASPGHAN) Annual Meeting, November 5–8, 2025, in Chicago. Additionally, Jaguar is supporting two expanded access programs in the U.S. under FDA authorization to treat pediatric MVID patients with intestinal failure. MVID affects an estimated 100–200 patients worldwide and currently has no approved treatments, with a lethal natural history and significant comorbidities.\nOriginal language: en\nPublish date: October 06, 2025 01:00 PM\nSource:[Newswire.com](https://www.newswire.com/news/jaguar-health-completes-meeting-with-fda-for-advice-on-development-pathways-to)\n\n**Cellectar Biosciences Announces European Medicines Agency (EMA) Confirms Eligibility to File for Conditional Marketing Authorization (CMA) for Iopofosine I 131 as a Treatment for Refractory (post-BTKi) Waldenstrom Macroglobulinemia (WM) | Taiwan News | Oct. 6, 2025 19:00**\nCellectar Biosciences, Inc. (NASDAQ: CLRB) announced that the European Medicines Agency's (EMA) Scientific Advice Working Party (SAWP) has confirmed eligibility to file a Conditional Marketing Authorization (CMA) application for iopofosine I 131 as a treatment for refractory (post-BTKi) Waldenstrom macroglobulinemia (WM). The CMA submission is expected in early 2026, with potential European approval and commercial launch in 2027 across 30 EMA member countries. Iopofosine I 131, a first-in-class phospholipid ether-based radioconjugate monotherapy, has received PRIME designation from the EMA for WM patients with at least two prior lines of therapy. The CLOVER WaM Phase 2 study demonstrated an overall response rate (ORR) of 83.6% and a major response rate (MRR) of 58.2% (95% CI, 0.42 to 0.67), with data presented at the 66th Annual American Society of Hematology Conference in December 2024. The SAWP advised that the proposed patient population—post-BTKi refractory patients—meets eligibility criteria for CMA, though it did not assess the sufficiency of safety and efficacy data. The U.S. FDA has granted iopofosine I 131 Breakthrough Therapy, Fast Track, and Orphan Drug Designations. Cellectar plans to submit a New Drug Application (NDA) to the FDA under an accelerated approval pathway once a confirmatory trial is underway, though this depends on securing additional funding. The company emphasized the drug’s advantages: fixed dosing, 'off-the-shelf' supply, long-term isotope supply agreements, orphan drug pricing, and PRIME designation, positioning it as a strong candidate for global partnerships. The unmet medical need in WM is significant, with no FDA-approved treatments for patients progressing on BTKi therapy, and over 5,700 patients in the U.S. requiring third-line or greater therapy. The company's forward-looking statements include risks related to regulatory pathways, funding, and collaboration efforts.\nOriginal language: en\nPublish date: October 06, 2025 11:14 AM\nSource:[Taiwan News](https://taiwannews.com.tw/en/news/6214488)\n\n**Cellectar Biosciences Announces European Medicines Agency (EMA) Confirms Eligibility to File for Conditional Marketing Authorization (CMA) for Iopofosine I 131 as a Treatment for Refractory (post-BTKi) Waldenstrom Macroglobulinemia (WM)**\nCellectar Biosciences, Inc. (NASDAQ: CLRB) announced that the European Medicines Agency's (EMA) Scientific Advice Working Party (SAWP) has confirmed the eligibility to file a Conditional Marketing Authorization (CMA) application for iopofosine I 131 as a treatment for refractory (post-BTKi) Waldenstrom macroglobulinemia (WM). The submission is expected in early 2026, with a potential European approval and commercial launch in 2027 across the 30 EMA-member countries. Iopofosine I 131, a first-in-class, phospholipid ether-based radioconjugate monotherapy, has been granted PRIME designation by the EMA for WM patients who have received at least two prior lines of therapy. The CLOVER WaM Phase 2 study (NCT02952508) demonstrated an overall response rate (ORR) of 83.6% and a major response rate (MRR) of 58.2% (95% CI, 0.42 to 0.67), data presented at the 66th Annual American Society of Hematology Conference in December 2024. The SAWP advised that the proposed patient population—post-BTKi refractory patients—is acceptable for CMA, consistent with over 70% of patients in the CLOVER WaM trial. While the SAWP does not assess data sufficiency for approval, it confirmed eligibility for submission. The U.S. FDA has granted iopofosine I 131 Breakthrough Therapy, Fast Track, and Orphan Drug Designations. A U.S. New Drug Application (NDA) is planned after confirmatory trial initiation, which is contingent on securing additional funding. The company emphasizes the drug’s potential for long-term response, fixed dosing, 'off-the-shelf' supply, and multiple isotope supply agreements, positioning it as a high-value opportunity for global partnerships. The unmet medical need in WM remains significant, with no FDA-approved treatment for BTKi-refractory patients and over 5,700 patients in the third-line or greater treatment category. Cellectar’s forward-looking statements include risks related to regulatory pathways, funding, and collaboration success.\nOriginal language: en\nPublish date: October 06, 2025 11:01 AM\nSource:[GlobeNewswire Press Releases](https://www.globenewswire.com/news-release/2025/10/06/3161577/29076/en/Cellectar-Biosciences-Announces-European-Medicines-Agency-EMA-Confirms-Eligibility-to-File-for-Conditional-Marketing-Authorization-CMA-for-Iopofosine-I-131-as-a-Treatment-for-Refra.html)\n\n**Cellectar Biosciences Announces European Medicines Agency (EMA) Confirms Eligibility to File for Conditional Marketing Authorization (CMA) for Iopofosine I 131 as a Treatment for Refractory (post-BTKi) Waldenstrom Macroglobulinemia (WM) - Cellectar Biosciences (NASDAQ:CLRB)**\nCellectar Biosciences announced that the European Medicines Agency's (EMA) Scientific Advice Working Party (SAWP) confirmed the eligibility to file for a Conditional Marketing Authorization (CMA) for iopofosine I 131 as a treatment for refractory (post-BTKi) Waldenström macroglobulinemia (WM). The CMA application is expected in early 2026, with a potential European approval and commercial launch in 2027 across the 30 EMA member countries. Iopofosine I 131, a first-in-class, phospholipid ether-based radioconjugate monotherapy, has received PRIME designation from the EMA and demonstrates a high overall response rate (ORR) of 83.6% and major response rate (MRR) of 58.2% in the Phase 2 CLOVER WaM trial. The SAWP advised that the data supports submission for the post-BTKi patient population, consistent with over 70% of patients in the trial. While the SAWP does not assess data sufficiency for approval, it confirmed eligibility criteria were met. The U.S. FDA has granted iopofosine I 131 Breakthrough Therapy, Fast Track, and Orphan Drug Designations. Cellectar’s CEO, James Caruso, stated the milestone supports global approval plans, including a U.S. New Drug Application (NDA) under an accelerated pathway, contingent on funding for a confirmatory study. The company’s COO, Jarrod Longcor, highlighted the drug’s favorable profile—including fixed dosing, 'off-the-shelf' supply, long-term isotope agreements, and orphan drug pricing—as a strong value proposition for global partnerships. The CLOVER WaM study results were presented at the 66th Annual American Society of Hematology Conference in December 2024. WM affects an estimated 35,000–45,000 patients in Europe, with no FDA-approved treatments for post-BTKi refractory patients, underscoring a significant unmet medical need.\nOriginal language: en\nPublish date: October 06, 2025 11:00 AM\nSource:[Benzinga](https://www.benzinga.com/pressreleases/25/10/g48037566/cellectar-biosciences-announces-european-medicines-agency-ema-confirms-eligibility-to-file-for-con)\n\n**Spanish Hospitals Validate Psychedelic Treatments for Chronic Depression, Anticipate Approval Within Two Years**\nSpanish hospitals are validating the clinical use of psychedelic drugs—such as psilocybin (found in mushrooms) and 5-MeO-DMT (from ayahuasca)—to treat chronic, treatment-resistant depression, a condition affecting one-third of all depression cases. Clinical trials in Spain are in Phase 3 for psilocybin and Phase 2 for 5-MeO-DMT, with specialists predicting regulatory approval by the Ministry of Health 'no earlier than two years' from now. According to Eduard Vieta, head of psychiatry at Hospital Clínic de Barcelona, psychedelics produce rapid, significant improvements in depression, with some patients achieving full remission after just one or two doses—up to 87.5% in Phase 3 trials with 25 mg of psilocybin. These treatments are administered in hospitals under strict medical supervision. Maria Dueñas from Parc Sanitari Sant Joan de Déu confirmed the significant antidepressant effects of psilocybin in clinical trials. Other psychedelics like LSD and ayahuasca also show efficacy and safety. While no psychedelics are yet approved for prescription, experts believe they will bring a 'radical change' in depression treatment. The future of depression care is moving toward personalized medicine, integrating biological diagnosis, pharmacogenetics, and targeted therapies such as transcranial magnetic stimulation. Specialists like Víctor Pérez and Maria Portella emphasize the importance of individualized, biologically informed treatment. Claudi Camps, director of Mental Health and Addictions in Girona, stresses the need for a holistic approach, recognizing that depression arises from a combination of biological vulnerability, trauma, poverty, and psychosocial stressors. He notes that unresolved childhood trauma can resurface in adulthood, exacerbating depression—highlighting the importance of revisiting past experiences in therapy. Despite progress, chronic and treatment-resistant cases remain challenging, with relapses common after one to two years, though psychedelics and deep brain stimulation are improving outcomes.\nOriginal language: es\nPublish date: October 06, 2025 04:01 AM\nSource:[El Periódico](https://www.elperiodico.com/es/ser-feliz/20251006/hospitales-validan-tratar-depresion-cronica-121660944)\n\n**Jaguar Health Completes Meeting with FDA for Advice on Development Pathways to Advance Ongoing Crofelemer Trial for Potential Approval for Treatment of Pediatric Indication Microvillus Inclusion Disea**\nJaguar Health, Inc. (NASDAQ: JAGX) announced that it completed a Type C meeting with the U.S. Food and Drug Administration (FDA) on October 2, 2025, to seek guidance on advancing its clinical development program for crofelemer powder for oral solution in treating microvillus inclusion disease (MVID), an ultrarare pediatric disorder. The meeting included members of Napo Pharmaceuticals’ Scientific Advisory Board, including the principal investigator of an ongoing open-label investigator-initiated trial (IIT) in the United Arab Emirates (UAE). MVID is a fatal condition affecting 100–200 patients worldwide, requiring life-sustaining parenteral support (PS), which includes total parenteral nutrition (TPN) and IV fluids, with no approved treatments currently available. Results from the UAE IIT show a 37% reduction in PS and a 30% reduction in TPN since reinitiation of crofelemer dosing after a 12-week drug cessation period—exceeding the previously reported 27% PS reduction at 12 weeks. The company’s Chief Scientific Officer, Pravin Chaturvedi, PhD, stated that the FDA’s feedback suggests potential pathways to support approval, possibly through a small, well-controlled study that could evaluate disease progression modification. Jaguar’s CEO, Lisa Conte, expressed gratitude for FDA support and noted that orphan drug designations have been granted by both the FDA and the European Medicines Agency (EMA). The company plans to pursue regulatory discussions in the EU and Middle East/North Africa (MENA) regions to bring crofelemer to patients globally. An abstract of the UAE trial’s partial results has been accepted for presentation at the North American Society for Pediatric Gastroenterology, Hepatology and Nutrition (NASPGHAN) Annual Meeting, November 5–8, 2025, in Chicago. Jaguar is also supporting two expanded access programs in the U.S. under FDA authorization to treat pediatric MVID patients with intestinal failure. Forward-looking statements in the release include expectations about regulatory progress, study amendments, and global access, all subject to risks and uncertainties.\nOriginal language: en\nPublish date: October 06, 2025 01:05 PM\nSource:[StreetInsider.com](https://www.streetinsider.com/ACCESS+Newswire/Jaguar+Health+Completes+Meeting+with+FDA+for+Advice+on+Development+Pathways+to+Advance+Ongoing+Crofelemer+Trial+for+Potential+Approval+for+Treatment+of+Pediatric+Indication+Microvillus+Inclusion+Disea/25422657.html)\n\n**Jaguar Health Completes Meeting with FDA for Advice on Development Pathways to Advance Ongoing Crofelemer Trial for Potential Approval for Treatment of Pediatric Indication Microvillus Inclusion Disease (MVID)**\nJaguar Health, Inc. (NASDAQ:JAGX), through its family company Napo Pharmaceuticals, completed a Type C meeting with the U.S. Food and Drug Administration (FDA) on October 2, 2025, to seek guidance on advancing its clinical development program for crofelemer powder for oral solution in treating microvillus inclusion disease (MVID), a rare pediatric disorder. The ongoing investigator-initiated proof-of-concept trial in the United Arab Emirates (UAE) demonstrated a 37% reduction in total parenteral support (PS), including a 30% reduction in total parenteral nutrition (TPN), following reinitiation of crofelemer dosing after a 12-week drug cessation period—exceeding the previously reported 27% PS reduction at 12 weeks. The FDA meeting was attended by members of Napo’s Scientific Advisory Board, including the principal investigator of the UAE trial. Pravin Chaturvedi, PhD, Chief Scientific Officer and Chair of the Scientific Advisory Board, stated that the FDA discussion was collaborative and indicated potential pathways to support approval, especially if the study is amended and deemed adequately controlled. Lisa Conte, CEO of Jaguar Health, emphasized gratitude for the FDA’s regulatory support and noted that orphan drug designations have been granted by both the FDA and the European Medicines Agency (EMA). The company plans to pursue regulatory discussions in the EU and Middle East/North Africa (MENA) regions to expand access globally. An abstract detailing partial results from the UAE trial has been accepted for presentation at the North American Society for Pediatric Gastroenterology, Hepatology and Nutrition (NASPGHAN) Annual Meeting, November 5–8, 2025, in Chicago. Additionally, Jaguar is supporting two expanded access programs in the U.S. under FDA authorization to treat pediatric MVID patients with intestinal failure. MVID affects an estimated 100–200 patients worldwide and currently has no approved treatments, with a lethal natural history and significant comorbidities.\nOriginal language: en\nPublish date: October 06, 2025 01:00 PM\nSource:[Newswire.com](https://www.newswire.com/news/jaguar-health-completes-meeting-with-fda-for-advice-on-development-pathways-to)\n\n**United States Congenital Hyperinsulinism Treatment Market 2025 | Growth Drivers, Key Players & Investment Opportunities**\nThe United States congenital hyperinsulinism (CHI) treatment market is projected to grow at a high compound annual growth rate (CAGR) from 2023 to 2030, with significant developments in 2025 driving market momentum. Rezolute announced the completion of enrollment in its Phase 3 sunRIZE study for ersodetug, a treatment for CHI, with 62 participants and topline data expected in December 2025. In January 2025, the FDA granted Breakthrough Therapy Designation to ersodetug based on positive Phase 2b results. In Japan, Hanmi Pharmaceutical reported notable improvements in reducing hypoglycemia events from interim Phase 2 results of efpegerglucagon (HM15136) at a joint European congress in May 2025, and highlighted continued progress toward clinical trials and regulatory approvals. Key market players include Novartis AG, Par Pharmaceuticals, Ralington Pharma, Bayer AG, Novo Nordisk, Teva Pharmaceuticals USA, Merck, Sagent Pharma, Flagship Biotech International Pvt. Ltd, and Uno Healthcare. The market is segmented by type (e.g., K ATP-hyperinsulinism, GDH-hyperinsulinism, HNF4A/HNF1A-hyperinsulinism), drug type (e.g., diazoxide, octreotide, nifedipine), route of administration (oral, intravenous, subcutaneous), and distribution channel (hospital pharmacies, retail pharmacies, online pharmacies). Regional analysis covers North America, Europe, Asia-Pacific, South America, and the Middle East & Africa. The report provides comprehensive insights including competitive landscape, supply chain mapping, unmet needs, pricing, market access, and emerging risks. DataM Intelligence, the publisher, offers subscription-based market intelligence with real-time tracking and strategic forecasts.\nOriginal language: en\nPublish date: October 06, 2025 12:53 PM\nSource:[openPR.com - Open Public Relations Free of Charge](https://www.openpr.com/news/4209914/united-states-congenital-hyperinsulinism-treatment-market)\n\n**Arcadia Medicine Announces FDA Clearance of IND Application for a Patented Form of MDMA**\nArcadia Medicine has announced that the U.S. Food and Drug Administration (FDA) has cleared its Investigational New Drug (IND) application for AM-1002, a patented, non-racemic form of MDMA. The company plans to initiate a clinical trial for AM-1002 in patients with Generalized Anxiety Disorder (GAD) in 2025. AM-1002 is engineered to selectively release serotonin and oxytocin—key neurotransmitters for therapeutic effect—while minimizing stimulant effects, neurotoxicity, hyperthermia, and cardiovascular risks. The compound also offers flexible dosing, enabling more precise and adaptable treatment regimens. Arcadia Medicine has raised $9.25 million from investors including Sam Altman, Fred Ehrsam, and Dylan Field, and holds a Composition of Matter patent for non-racemic MDMA, securing exclusive rights to this formulation. Nikita Obidin, founder and CEO, stated that the IND clearance reflects progress in developing a safer, more targeted version of MDMA. Sam Altman praised Arcadia’s work as 'an important step towards a potentially transformative psychiatric treatment,' while Fred Ehrsam expressed excitement over supporting a non-neurotoxic MDMA development. Arcadia is also advancing a broader pipeline, including AM-1004, a mildly entactogenic antidepressant, and AM-1006, a short-acting, subperceptual psychoactive compound for therapeutic use. The company’s mission is to scale safe mental health therapies globally, including potential at-home prescription use.\nOriginal language: en\nPublish date: October 06, 2025 12:37 PM\nSource:[GlobeNewswire Press Releases](https://www.globenewswire.com/news-release/2025/10/06/3161739/0/en/Arcadia-Medicine-Announces-FDA-Clearance-of-IND-Application-for-a-Patented-Form-of-MDMA.html)\n\n**Cellectar Biosciences Announces European Medicines Agency (EMA) Confirms Eligibility to File for Conditional Marketing Authorization (CMA) for Iopofosine I 131 as a Treatment for Refractory (post-BTKi) Waldenstrom Macroglobulinemia (WM) | Taiwan News | Oct. 6, 2025 19:00**\nCellectar Biosciences, Inc. (NASDAQ: CLRB) announced that the European Medicines Agency's (EMA) Scientific Advice Working Party (SAWP) has confirmed eligibility to file a Conditional Marketing Authorization (CMA) application for iopofosine I 131 as a treatment for refractory (post-BTKi) Waldenstrom macroglobulinemia (WM). The CMA submission is expected in early 2026, with potential European approval and commercial launch in 2027 across 30 EMA member countries. Iopofosine I 131, a first-in-class phospholipid ether-based radioconjugate monotherapy, has received PRIME designation from the EMA for WM patients with at least two prior lines of therapy. The CLOVER WaM Phase 2 study demonstrated an overall response rate (ORR) of 83.6% and a major response rate (MRR) of 58.2% (95% CI, 0.42 to 0.67), with data presented at the 66th Annual American Society of Hematology Conference in December 2024. The SAWP advised that the proposed patient population—post-BTKi refractory patients—meets eligibility criteria for CMA, though it did not assess the sufficiency of safety and efficacy data. The U.S. FDA has granted iopofosine I 131 Breakthrough Therapy, Fast Track, and Orphan Drug Designations. Cellectar plans to submit a New Drug Application (NDA) to the FDA under an accelerated approval pathway once a confirmatory trial is underway, though this depends on securing additional funding. The company emphasized the drug’s advantages: fixed dosing, 'off-the-shelf' supply, long-term isotope supply agreements, orphan drug pricing, and PRIME designation, positioning it as a strong candidate for global partnerships. The unmet medical need in WM is significant, with no FDA-approved treatments for patients progressing on BTKi therapy, and over 5,700 patients in the U.S. requiring third-line or greater therapy. The company's forward-looking statements include risks related to regulatory pathways, funding, and collaboration efforts.\nOriginal language: en\nPublish date: October 06, 2025 11:14 AM\nSource:[Taiwan News](https://taiwannews.com.tw/en/news/6214488)\n\n**Cellectar Biosciences Announces European Medicines Agency (EMA) Confirms Eligibility to File for Conditional Marketing Authorization (CMA) for Iopofosine I 131 as a Treatment for Refractory (post-BTKi) Waldenstrom Macroglobulinemia (WM)**\nCellectar Biosciences, Inc. (NASDAQ: CLRB) announced that the European Medicines Agency's (EMA) Scientific Advice Working Party (SAWP) has confirmed the eligibility to file a Conditional Marketing Authorization (CMA) application for iopofosine I 131 as a treatment for refractory (post-BTKi) Waldenstrom macroglobulinemia (WM). The submission is expected in early 2026, with a potential European approval and commercial launch in 2027 across the 30 EMA-member countries. Iopofosine I 131, a first-in-class, phospholipid ether-based radioconjugate monotherapy, has been granted PRIME designation by the EMA for WM patients who have received at least two prior lines of therapy. The CLOVER WaM Phase 2 study (NCT02952508) demonstrated an overall response rate (ORR) of 83.6% and a major response rate (MRR) of 58.2% (95% CI, 0.42 to 0.67), data presented at the 66th Annual American Society of Hematology Conference in December 2024. The SAWP advised that the proposed patient population—post-BTKi refractory patients—is acceptable for CMA, consistent with over 70% of patients in the CLOVER WaM trial. While the SAWP does not assess data sufficiency for approval, it confirmed eligibility for submission. The U.S. FDA has granted iopofosine I 131 Breakthrough Therapy, Fast Track, and Orphan Drug Designations. A U.S. New Drug Application (NDA) is planned after confirmatory trial initiation, which is contingent on securing additional funding. The company emphasizes the drug’s potential for long-term response, fixed dosing, 'off-the-shelf' supply, and multiple isotope supply agreements, positioning it as a high-value opportunity for global partnerships. The unmet medical need in WM remains significant, with no FDA-approved treatment for BTKi-refractory patients and over 5,700 patients in the third-line or greater treatment category. Cellectar’s forward-looking statements include risks related to regulatory pathways, funding, and collaboration success.\nOriginal language: en\nPublish date: October 06, 2025 11:01 AM\nSource:[GlobeNewswire Press Releases](https://www.globenewswire.com/news-release/2025/10/06/3161577/29076/en/Cellectar-Biosciences-Announces-European-Medicines-Agency-EMA-Confirms-Eligibility-to-File-for-Conditional-Marketing-Authorization-CMA-for-Iopofosine-I-131-as-a-Treatment-for-Refra.html)\n\n**Cellectar Biosciences Announces European Medicines Agency (EMA) Confirms Eligibility to File for Conditional Marketing Authorization (CMA) for Iopofosine I 131 as a Treatment for Refractory (post-BTKi) Waldenstrom Macroglobulinemia (WM) - Cellectar Biosciences (NASDAQ:CLRB)**\nCellectar Biosciences announced that the European Medicines Agency's (EMA) Scientific Advice Working Party (SAWP) confirmed the eligibility to file for a Conditional Marketing Authorization (CMA) for iopofosine I 131 as a treatment for refractory (post-BTKi) Waldenström macroglobulinemia (WM). The CMA application is expected in early 2026, with a potential European approval and commercial launch in 2027 across the 30 EMA member countries. Iopofosine I 131, a first-in-class, phospholipid ether-based radioconjugate monotherapy, has received PRIME designation from the EMA and demonstrates a high overall response rate (ORR) of 83.6% and major response rate (MRR) of 58.2% in the Phase 2 CLOVER WaM trial. The SAWP advised that the data supports submission for the post-BTKi patient population, consistent with over 70% of patients in the trial. While the SAWP does not assess data sufficiency for approval, it confirmed eligibility criteria were met. The U.S. FDA has granted iopofosine I 131 Breakthrough Therapy, Fast Track, and Orphan Drug Designations. Cellectar’s CEO, James Caruso, stated the milestone supports global approval plans, including a U.S. New Drug Application (NDA) under an accelerated pathway, contingent on funding for a confirmatory study. The company’s COO, Jarrod Longcor, highlighted the drug’s favorable profile—including fixed dosing, 'off-the-shelf' supply, long-term isotope agreements, and orphan drug pricing—as a strong value proposition for global partnerships. The CLOVER WaM study results were presented at the 66th Annual American Society of Hematology Conference in December 2024. WM affects an estimated 35,000–45,000 patients in Europe, with no FDA-approved treatments for post-BTKi refractory patients, underscoring a significant unmet medical need.\nOriginal language: en\nPublish date: October 06, 2025 11:00 AM\nSource:[Benzinga](https://www.benzinga.com/pressreleases/25/10/g48037566/cellectar-biosciences-announces-european-medicines-agency-ema-confirms-eligibility-to-file-for-con)\n\n**Acute Myeloid Leukemia Treatment Market to Witness Innovative Therapy Advancements, Says Persistence Market Research**\nThe global acute myeloid leukemia (AML) treatment market is projected to grow from US$ 2.6 billion in 2025 to US$ 5.1 billion by 2032, reflecting a compound annual growth rate (CAGR) of 10.0%. This growth is driven by advancements in precision medicine, targeted therapies, and immunotherapies, including FDA-approved agents such as FLT3 inhibitors (midostaurin, gilteritinib), IDH inhibitors (ivosidenib, enasidenib), BCL-2 inhibitors (venetoclax), and antibody-drug conjugates (gemtuzumab ozogamicin). These innovations have significantly improved survival rates—e.g., chemotherapy plus midostaurin increased median overall survival in FLT3-mutated AML from 25.6 to 74.7 months. Combination regimens, such as venetoclax with hypomethylating agents, have achieved complete remission rates exceeding 70%. North America leads with a 38.2% market share due to high incidence rates, advanced healthcare infrastructure, and accelerated FDA approvals, while Europe holds 25.6% and is driven by an aging population and strong clinical research networks. Key challenges include disease heterogeneity, delayed diagnosis, and molecular testing delays that hinder personalized treatment. Emerging opportunities include CAR T-cell therapies, novel combinations (e.g., venetoclax with STING agonists), and targeted treatments for high-risk or refractory AML. Recent developments include Servier India’s launch of ivosidenib (Tibsovo®) in June 2025, Pfizer’s FDA label update for TALZENNA® in November 2024, Lin BioScience’s FDA Fast Track Designation for LBS 007 in November 2024, and Actinium’s positive Phase 3 SIERRA study results for Iomab-B in April 2024. Key players include Astellas Pharma Inc., Bristol Myers Squibb, Daiichi Sankyo, Jazz Pharmaceuticals, Novartis, Pfizer, Rigel Pharmaceuticals, AbbVie, and Servier Laboratories.\nOriginal language: en\nPublish date: October 06, 2025 07:38 AM\nSource:[openPR.com - Open Public Relations Free of Charge](https://www.openpr.com/news/4208761/acute-myeloid-leukemia-treatment-market-to-witness-innovative)\n\n**Spanish Hospitals Validate Psychedelic Treatments for Chronic Depression, Anticipate Approval Within Two Years**\nSpanish hospitals are validating the clinical use of psychedelic drugs—such as psilocybin (found in mushrooms) and 5-MeO-DMT (from ayahuasca)—to treat chronic, treatment-resistant depression, a condition affecting one-third of all depression cases. Clinical trials in Spain are in Phase 3 for psilocybin and Phase 2 for 5-MeO-DMT, with specialists predicting regulatory approval by the Ministry of Health 'no earlier than two years' from now. According to Eduard Vieta, head of psychiatry at Hospital Clínic de Barcelona, psychedelics produce rapid, significant improvements in depression, with some patients achieving full remission after just one or two doses—up to 87.5% in Phase 3 trials with 25 mg of psilocybin. These treatments are administered in hospitals under strict medical supervision. Maria Dueñas from Parc Sanitari Sant Joan de Déu confirmed the significant antidepressant effects of psilocybin in clinical trials. Other psychedelics like LSD and ayahuasca also show efficacy and safety. While no psychedelics are yet approved for prescription, experts believe they will bring a 'radical change' in depression treatment. The future of depression care is moving toward personalized medicine, integrating biological diagnosis, pharmacogenetics, and targeted therapies such as transcranial magnetic stimulation. Specialists like Víctor Pérez and Maria Portella emphasize the importance of individualized, biologically informed treatment. Claudi Camps, director of Mental Health and Addictions in Girona, stresses the need for a holistic approach, recognizing that depression arises from a combination of biological vulnerability, trauma, poverty, and psychosocial stressors. He notes that unresolved childhood trauma can resurface in adulthood, exacerbating depression—highlighting the importance of revisiting past experiences in therapy. Despite progress, chronic and treatment-resistant cases remain challenging, with relapses common after one to two years, though psychedelics and deep brain stimulation are improving outcomes.\nOriginal language: es\nPublish date: October 06, 2025 04:01 AM\nSource:[El Periódico](https://www.elperiodico.com/es/ser-feliz/20251006/hospitales-validan-tratar-depresion-cronica-121660944)\n\n**New Medical Breakthrough Reduces Breast Cancer Progression Risk by 40%**\nIn October 2025, the U.S. Food and Drug Administration (FDA) approved Inluriyo, an innovative oral medication for advanced breast cancer, marking a significant medical breakthrough. The drug, which belongs to the class of estrogen receptor antagonists, reduces the risk of disease progression by up to 40%. Clinical trial data from the phase 3 EMBER-3 study showed that Inluriyo reduced the risk of disease progression or death by 8% compared to traditional hormonal therapies. It works by binding to and degrading estrogen receptors, thereby inhibiting their activity and slowing tumor growth and spread. Patients with metastatic breast cancer carrying the ESR1 mutation—present in about half of those previously treated with hormonal therapy—experienced a median progression-free survival of five months, compared to three months with other treatments. Dr. Komal Jhaveri, clinical director for early drug development at Memorial Sloan Kettering Cancer Center, emphasized the drug’s proven efficacy and oral administration ease, calling it a promising option for patients whose disease progresses after standard treatments. The FDA warns against using the drug during pregnancy due to potential fetal harm. Common side effects observed in trials include [specific side effects not listed in text, but implied to be documented]. Breast cancer is the most common cancer in women globally, often arising from uncontrolled cell division in the breast that can spread to other body parts. Over 80% of cases are invasive, meaning the tumor can spread beyond the breast tissue. While most common in women over 50, it can affect younger women and, rarely, men. This breakthrough, announced during Breast Cancer Awareness Month, represents a major step toward better control of the disease and improved quality of life and health stability for patients worldwide.\nOriginal language: ar\nPublish date: October 05, 2025 02:31 PM\nSource:[العين الإخبارية](https://al-ain.com/article/new-medical-reduces-breast-cancer)\n\n**Highs & Lows: Could the microdosing of psychedelics be a key missing piece in the mental health jigsaw?**\nThe article reports a renewed scientific interest in psychedelics such as LSD, psilocybin, ketamine and MDMA as potential treatments for anxiety, depression, PTSD and other mental‑health disorders. A mid‑stage study released in early September found that microdosing the pharmaceutical LSD MM120 could reduce anxiety for up to three months (study cited in article). WHO data cited in the article show that over a billion people worldwide live with mental‑health conditions; suicide claimed 727,000 lives in 2021; and depression and anxiety cost the global economy $1 trillion annually (WHO 2025 report). It notes that only about one‑third of patients on conventional antidepressants improve (article). The article includes quotes: Pollan says 'Mental health crises will drive acceptance of these unconventional therapies, in large part because the conventional therapies are not working very well' (Pollan to ET); Dr. Ryan L. Henner says 'The data on cannabis remains cloudy for most conditions it is purported to treat' (Henner); David Nutt says 'there is strong public support for these drugs as medicines as modern scientific studies show the ban through the UN conventions of 1960 and 1971 was politically‑, not science‑driven' (Nutt); Vidita Vaidya says 'While we do have ketamine‑assisted therapy in India, we don't have a progressive policy on our own clinical trials to be able to move the envelope for ourselves' (Vaidya). The article also discusses regulatory hurdles: the FDA rejected Lykos Therapeutics' MDMA‑assisted therapy for PTSD because of difficulty blinding studies (FDA rejection cited); the FDA observed that the difficulty to blind these studies made data hard to interpret (FDA observation). It notes that the FDA’s rejection led researchers to double down on blinding (article). It mentions that the Indian Narcotics Act allows medical research but implementation is difficult (Anita Abraham). The article concludes that while psychedelics offer promise, rigorous trials, therapy integration and careful regulation are essential (article).\nOriginal language: en\nPublish date: September 27, 2025 06:47 PM\nSource:[Economic Times](https://economictimes.indiatimes.com/industry/healthcare/biotech/highs-lows-could-the-microdosing-of-psychedelics-be-a-key-missing-piece-in-the-mental-health-jigsaw/articleshow/124186421.cms)\n\n**British doctors: 'Psychedelic drugs are promising'**\nBritish psychiatrists have released a new report stating that psychedelic drugs could one day aid in treating mental illnesses, but the evidence is not yet strong enough to bring them to patients. The report, issued by the Royal College of Psychiatrists, reviews ongoing phase‑III trials across the UK, continental Europe and the United States involving substances such as MDMA, ketamine, LSD and psilocybin. The trials combine the drugs with talk therapy and aim to treat anxiety, depression, post‑traumatic stress disorder (PTSD) and addiction. \n\n\"We are cautious but excited,\" said Oliver Howes, chair of the university’s psychopharmacology committee, during a press briefing. Howes, a molecular psychiatry professor at King’s College London, added, \"There is a lot of activity and this is promising, but there is also a lot of complexity,\" and called for scientific activity and caution. He warned that \"participants can often tell whether they are receiving a real drug or a placebo, which makes blinding difficult,\" and that reproducibility of findings is a challenge. \n\nThe report urges more research into safety, efficacy and long‑term use, and the creation of a central database to monitor drug effects. An EU‑funded trial launched last year tested psilocybin in people with multiple sclerosis and other progressive conditions to see if it could reduce anxiety and depression. Some countries, including Germany, have already started compassionate‑use programmes for psychedelics, allowing patients to access the drugs under strict oversight before formal approval. In the Czech Republic, psilocybin will become legal for treating depression from 2026, though full approval for a broader range of psychedelics in Europe is still years away. Howes advised people not to self‑treat with psychedelics and instead enroll in clinical trials, emphasising that the substances should only be used under psychiatric leadership and a multidisciplinary team.\nOriginal language: tr\nPublish date: September 19, 2025 07:38 AM\nSource:[euronews](http://tr.euronews.com/saglik/2025/09/19/ingiliz-doktorlar-psikedelik-ilaclar-umut-verici)\n\n**Psychedelic medicine shows promise but is not yet ready for prescription**\nA new report by the Royal College of Psychiatrists in the United Kingdom finds that psychedelic drugs such as MDMA, ketamine, LSD and psilocybin may help treat a range of mental‑health conditions—including anxiety, depression, post‑traumatic stress disorder (PTSD) and addiction—but that the evidence is not yet strong enough to recommend routine clinical use.  The study reviewed existing trials and concluded that high‑quality data are lacking, so clinicians should not prescribe these substances outside of controlled research settings.  \"Estamos cautelosamente entusiasmados,\" said Oliver Howes, one of the report’s authors and chair of the college’s psychopharmacology committee, at a press conference.  \"Há uma enorme quantidade de atividade e estes ensaios são promissores, mas há também uma enorme complexidade,\" Howes added, noting the need for sober science and caution.  He urged further research into safety, efficacy and long‑term use, and called for a centralised database to monitor effects.  The report also highlighted challenges such as maintaining blinding in trials, which can lead to placebo effects, and the difficulty of reproducing results.  While the first EU‑funded psychedelic trial last year tested psilocybin for anxiety and depression in patients with multiple sclerosis, and Germany has launched compassionate‑use programmes, the Czech Republic is expected to approve psilocybin for depression in 2026.  Howes cautions against self‑medication and encourages patients to enrol in clinical trials, stating, \"Pensamos firmemente que estas substâncias só devem ser administradas por uma equipa multidisciplinar de psiquiatria.\"\nOriginal language: pt\nPublish date: September 19, 2025 05:55 AM\nSource:[euronews](http://pt.euronews.com/saude/2025/09/19/a-medicina-psicadelica-e-promissora-mas-ainda-nao-deve-ser-receitada-diz-estudo)\n\n**Psychodélicos: Czechs Authorize Psilocybin**\nThe Czech Republic has officially legalized the medicinal use of psilocybin, a decision announced in July by President Petr Pavel. The new law follows a model similar to Australia’s 2024 regulations, where MDMA and psilocybin are approved for treating post‑traumatic stress disorder and treatment‑resistant depression, respectively. Unlike Australia, the Czech law does not include MDMA and restricts psilocybin to synthetic preparations, whereas New Mexico in the United States has allowed the use of natural Psilocybe mushrooms. Only psychiatrists trained in psychotherapy may prescribe psychedelic substances in a clinical setting; general and public hospitals receive automatic authorization to offer the treatment, while other facilities will need special licensing.\n\nThe legislation also decriminalizes cannabis possession. In the United States, a broader biomedical regulation of psychedelic‑assisted psychotherapy (PAP) was expected but was rejected by the FDA in August of the previous year, denying a license for MDMA in post‑traumatic stress disorder from the company Lykos. The change in U.S. administration has opened the possibility of approval for psychedelic treatments, with figures such as Robert Kennedy Jr. and veterans, firefighters, and police officers advocating for their use.\n\nIn a September 11 article in *Psychoactives*, Czech lawyer Tereza Dlestikova critiques the new medical model, arguing that the reform remains incomplete without evidence‑based debate on non‑clinical uses of psychedelics. The Czech law contrasts sharply with U.S. state referendums, such as Oregon (2020) and Colorado (2022), which authorized licensed facilitators to run psilocybin sessions without medical prescription.\n\nKey metrics and facts: • July 2025 – Czech law enacted by President Petr Pavel. • 2024 – Australia authorizes MDMA and psilocybin for PTSD and depression. • New Mexico – permits clinical use of natural Psilocybe mushrooms. • August 2024 – FDA rejects MDMA license for PTSD. • 2020 & 2022 – Oregon and Colorado approve psilocybin centers for non‑therapeutic facilitators.\nOriginal language: pt\nPublish date: September 18, 2025 01:10 PM\nSource:[Folha de S.Paulo](https://www1.folha.uol.com.br/blogs/virada-psicodelica/2025/09/republica-tcheca-autoriza-uso-medicinal-da-psilocibina.shtml)\n\n**Lykos' rejection letter**\nThe Food and Drug Administration (FDA) released a complete response letter (CRL) rejecting Lykos Therapeutics’ application for MDMA‑assisted therapy for post‑traumatic stress disorder (PTSD).  The CRL was one of 89 rejection letters issued last week, and it cited several safety and efficacy concerns.  Lykos failed to provide data on adverse events that would help assess abuse potential, did not demonstrate that treatment effects lasted beyond the eight‑week assessment period after the last dose – a period the FDA says must show durable benefit for a chronic condition – and the study had high rates of prescreening failure and prior MDMA use, raising the possibility of selection bias.  The FDA therefore recommended a new clinical trial to address these gaps.  FDA Commissioner Marty Makary said the agency will promptly release new CRLs and approvals, redacted for trade secrets, to help developers understand the FDA’s reasoning.  \"We want drug developers and inventors to understand exactly how the FDA thinks,\" Makary said in a video on X.  Rick Doblin, founder of the Multidisciplinary Association for Psychedelic Studies, praised the Trump administration for making the CRL public and noted that the FDA “moved the goalposts,” shifting its standards after the study was underway.  Doblin said the public can now see the FDA’s reasoning.  The article also notes that psychedelics advocates, buoyed by comments from Kennedy and Makary about speeding up research, hope for a better chance under the Trump administration than under Biden.  In other news, the Senate Judiciary Committee will hear from former Meta employees about alleged discouragement of harm documentation, and California lawmakers are advancing a bill that would prohibit AI chatbots from presenting themselves as licensed medical professionals.  The bill, supported by a 79‑0 vote, would allow licensing boards to seek injunctions against companies misrepresenting AI as medical experts.\nOriginal language: en\nPublish date: September 09, 2025 02:00 PM\nSource:[POLITICO](https://www.politico.com/newsletters/future-pulse/2025/09/09/lykos-rejection-letter-00551073)\n\n**MAPS Statement on FDA's Public Release of Complete Response Letter for MDMA-assisted Therapy**\nIn August 2024 the U.S. Food and Drug Administration (FDA) issued a Complete Response Letter (CRL) rejecting MDMA‑assisted therapy for posttraumatic stress disorder (PTSD). The FDA has now made that CRL publicly available, a move that MAPS founder and president Rick Doblin praised, saying, 'We commend the FDA, Commissioner Makary, and HHS Secretary Kennedy for making the Complete Response Letter public so the entire field can understand FDA's reasoning.' Doblin criticized the agency for shifting its standards after trials were completed, calling the change a 'devastating truth' and accusing the FDA of 'backpedaling.' He noted that 13 million Americans live with PTSD and that each year of delay increases suicide risk and prolongs suffering. MAPS will continue negotiations with the FDA, accelerate new MDMA research, train therapists worldwide, and launch humanitarian projects in high‑trauma, low‑resource areas. The organization will host a media briefing on September 5 to discuss the CRL. Since its founding in 1986, MAPS has received more than $140 million in donations to advance psychedelic research.\nOriginal language: en\nPublish date: September 05, 2025 12:12 AM\nSource:[GlobeNewswire Press Releases](https://www.globenewswire.com/news-release/2025/09/05/3145062/0/en/MAPS-Statement-on-FDA-s-Public-Release-of-Complete-Response-Letter-for-MDMA-assisted-Therapy.html)\n\n**Psychedelic Drugs Market Research Report 2025-2033 | Rising Demand for Non-Hallucinogenic Psychedelics Expands Patient Base, Breakthrough Regulatory Designations Accelerate Approvals**\nThe psychedelic drugs market is expected to grow from USD 7.4 billion in 2025 to USD 22.6 billion by 2033, with a compound annual growth rate (CAGR) of 15%. This growth is driven by the increasing scientific validation of psychedelics for mental health therapies beyond traditional pharmaceuticals. Key substances under investigation include psilocybin, LSD, MDMA, ketamine, and DMT, showing potential to treat depression, PTSD, anxiety, addiction, and end-of-life distress. The transition from recreational stigma to clinical utility is propelled by escalating mental illness rates, the search for alternative treatments, and a mounting body of evidence supporting psychedelic efficacy in treatment-resistant cases. Regulatory shifts and decriminalization efforts, particularly in North America and Europe, are also advancing this research. Significant investments and strategic alliances are aimed at commercializing psychedelic-assisted therapies effectively and safely. The FDA's breakthrough therapy designations for psilocybin and MDMA-based treatments addressing major depressive disorder (MDD) and PTSD expedited clinical trial timelines, boosting investor confidence. However, legal restrictions and reimbursement barriers continue to impede widespread market adoption.\nOriginal language: en\nPublish date: August 14, 2025 12:17 PM\nSource:[GlobeNewswire Press Releases](https://www.globenewswire.com/news-release/2025/08/14/3133452/28124/en/Psychedelic-Drugs-Market-Research-Report-2025-2033-Rising-Demand-for-Non-Hallucinogenic-Psychedelics-Expands-Patient-Base-Breakthrough-Regulatory-Designations-Accelerate-Approvals.html)\n\n**LSD and MDMA in Therapy: Trump's Health Minister Seeks to Break Tab**\nThe FDA, under the leadership of Marty Makary, is reconsidering its decision to reject MDMA as a treatment for post-traumatic stress disorder (PTSD). This comes after a new study was requested by the authorities, which was a setback for advocates like Rick Doblin, founder of the Multidisciplinary Association for Psychedelic Studies (MAPS). Doblin is optimistic about the development, but also concerned that the public might get the wrong message: 'Now that RFK likes psychedelics, they're allowed.' The FDA has announced a new program to speed up the approval process for medications that benefit public health, including psychedelics. This includes reducing the testing time from six months or more to just one month, and potentially relaxing the requirements for certain medications. The US Department of Health and Human Services and the FDA have also hired new employees with connections to the psychedelic movement. 'This is a very promising sign that the government is aware of the potential of psychedelics and is trying to send a signal that they are willing to allow them,' said Greg Ferenstein, a staff writer at the libertarian Reason Foundation. However, some experts, like Philip Corlett, a psychiatrist at Yale University, are concerned that the hype around psychedelics is outpacing the science. 'If RFK and the new administration are serious about this, they could do a lot to bring it into reality by meeting the standards of medical science,' Corlett said. 'I just don't think that's going to happen.'\nOriginal language: de\nPublish date: July 17, 2025 12:31 AM\nSource:[DIE WELT](https://www.welt.de/politik/ausland/article256412618/LSD-und-MDMA-und-Co-in-Therapien-Trumps-Gesundheitsminister-will-Tabu-brechen.html)\n\n**Robert F. Kennedy Jr. and Trump Allies Push for Psychedelic Therapies Despite FDA Rejection**\nRobert F. Kennedy Jr. and allies of Donald Trump are pushing for the use of psychedelic therapies to treat anxiety and depression, despite the FDA's rejection of MDMA as a treatment for post-traumatic stress disorder (PTSD) during the Biden administration. Kennedy stated, 'This line of therapy has a huge advantage if administered in a clinical setting, and we're working hard to ensure that happens within 12 months.' The FDA has begun to review its stance on psychedelics, with Director Marty Makary calling the review of MDMA and other psychedelics 'a top priority.' Makary also announced measures to speed up the approval of new treatments, including reducing the review time from six months to one and relaxing traditional requirements such as placebo-controlled clinical trials. Greg Ferenstein, an advisor to psychedelic companies and member of the Reason Foundation, stated, 'All these are very promising signs.' Texas has allocated $50 million to study the use of ibogaine, a psychedelic derived from an African plant, as a treatment for addiction and PTSD. The support includes former Republican Governor Rick Perry and veterans who have traveled to Mexico to receive treatment. Marcus Capone, a former Navy SEAL, testified that ibogaine helped him overcome anxiety and depression after 13 years of service. However, not all medical professionals share the enthusiasm, with Philip Corlett, a researcher at Yale, warning that avoiding rigorous clinical trials could be counterproductive. Nora Volkow, director of the National Institute on Drug Abuse, recognized the potential of ibogaine but noted that previous studies were suspended due to 'cardiovascular toxicity.' Despite the controversy, the debate on psychedelics is reopening in the US political center, with the next decision depending on regulators' ability to balance therapeutic promise with scientific evidence.\nOriginal language: es\nPublish date: July 16, 2025 03:21 PM\nSource:[EL IMPARCIAL | Noticias de México y el mundo](https://www.elimparcial.com/mundo/2025/07/16/robert-f-kennedy-jr-y-aliados-de-trump-impulsan-terapias-con-psicodelicos-para-combatir-la-ansiedad-y-la-depresion-pese-a-reves-de-la-fda/)\n\n**New Hope for Mental Health: Can Psychedelic Substances Be a Breakthrough?**\nThe European Commission is already taking action. Within the Horizon Europe program, it has funded the PsyPal study with 6.5 million euros, led by a consortium of 18 research centers and universities, with the University of Groninga as the lead. The researchers aim to verify the effectiveness of psilocybin treatment for various mental disorders: post-traumatic stress disorder, depression in patients with palliative care needs for severe diseases such as ALS or COPD. The study is generating high expectations. The question is: can psychedelic substances really be a new frontier in treating many mental illnesses? Commonly known as drugs, they are illegal and stigmatized, but in therapeutic doses and always associated with psychotherapy, they could be a breakthrough? The University of Trento, with the first Italian conference on the topic, promoted by the Department of Psychology and Cognitive Sciences, asked this question last year. The conference broke a taboo. Following the many clinical trials conducted abroad, which seem to demonstrate their effectiveness, a specific scientific society, Simepsi, was born in Italy about a year ago, led by psychiatrist Mauro D'Alonzo, which deals with training and research on psychedelic medicine. 'If the law passes also in the Senate, it will be the first EU country to introduce them in therapeutic protocols,' says Caterina Bartoli, a doctor and member of Simepsi. In Australia, psilocybin and MDMA are already approved and prescribable. The first is also authorized in New Zealand, while in Switzerland it is regularly used on request from psychiatrists after the green light from a specific commission. 'In reality, the use of these psychoactive substances has a millennial history,' says Tania Re, a psychotherapist and anthropologist who also works in Switzerland in collaboration with psychiatrists. 'It's a history linked to the culture of many indigenous communities and passed down orally from generation to generation. It's crucial to continue to investigate their safety and efficacy, the neurobiological mechanisms and the optimal procedures for a safe and replicable therapy.' 'There are many advanced studies, particularly in the United States and the United Kingdom - explains Bartoli - with a strong increase in scientific publications on the subject. In the US, the phase III of a study on the efficacy of MDMA in treating post-traumatic stress disorder has just been concluded, conducted by the scientific society Maps and the pharmaceutical company Lykos.' The Food and Drug Administration, the US regulatory agency, has asked for further data, although a 70% efficacy has already been demonstrated with just three administrations. In the UK, depression is the focus. In this field, the study by the pharmaceutical giant Compass Pathways, which has also reached phase III, is worth mentioning. The study on the treatment with psilocybin, which would validate the effectiveness of the psychedelic substance, compared to a traditional antidepressant, with a single administration, is being conducted under strict medical control, also to manage any potential side effects, such as headaches, nausea, and increased blood pressure. 'Effects that generally resolve within 24 hours,' continues Bartoli. In Italy, the only substance with psychedelic effects authorized is esketamine, a derivative of ketamine, commonly used in operating rooms. It is used by psychiatrists in the form of a nasal spray. In the US, it is used for treatment-resistant depression and suicidal ideation, while in Italy only for treatment-resistant depression. Since 2017, thanks to a ministerial decree, the use of psychedelic substances is allowed only in exceptional and compassionate cases. However, they are never prescribed. And there are no clinical trials involving Italian universities. 'On the one hand, there is still a lack of knowledge in the field among our doctors, on the other hand, the molecules with psychoactive effects are still perceived as recreational drugs, to get a high,' observes Bartoli. From here, the initiative of the Luca Coscioni association, which has launched an appeal to the government, signed by 170 doctors, researchers, and psychotherapists, to allow the use of these experimental treatments. An appeal accompanied by a signature collection, promoted together with Simepsi, to ask the European Commission to fund research on psychedelics. 'The resistances are not only of an ideological type: a part of the medical class remains anchored to traditional medicine based on psychopharmaceuticals,' says Marco Perduca, coordinator of all the activities of the association related to psychoactive substances.\nOriginal language: it\nPublish date: June 24, 2025 05:50 PM\nSource:[Il Sole 24 ORE](https://www.ilsole24ore.com/art/disturbi-mentali-nuova-speranza-cura-puo-arrivare-sostanze-psichedeliche-AHC8b5NB)\n\n",
    "date": "2025-10-06T15:13:46.191384",
    "summary": "The panel of forecasting experts expresses a range of views on whether the next regulatory step for medical approval of psychedelics for mental health will be taken in the US during 2025. All experts note that the FDA's 2024 rejection of MDMA for PTSD set a high bar for evidence, indicating strong regulatory caution and a need for additional or more robust clinical trials. As of October 2025, no new NDA, EUA filing, or DEA rescheduling for classic psychedelics targeting DSM-5 disorders has been publicly reported.\n\nDespite this, there is broad agreement that the political and regulatory environment has shifted significantly. Many forecasters highlight the new administration's explicit prioritization of psychedelic therapies, public statements from FDA and HHS leadership in favor of accelerated review, increasing advocacy from veterans and influential political figures, and notable activity from companies like Arcadia Medicine (though these are characterized as pipeline developments rather than imminent NDA/EUA filings).\n\nSeveral factors increase the probability of a filing or rescheduling before year-end: unprecedented political will (including signals from figures like RFK Jr., Trump, and FDA Commissioner Makary), pressure from advocacy groups, and global/regional momentum (with approvals in Australia and the Czech Republic). The resolution criteria require only the filing of a qualifying NDA/EUA or formal DEA rescheduling—regardless of acceptance—which most experts note lowers the bar compared to outright approval.\n\nHowever, persistent barriers remain: the lack of mature Phase 3 US trial results for leading candidates like psilocybin, ongoing regulatory conservatism, procedural inertia in FDA/DEA processes, and no clear news of imminent filings. Some experts give weight to the possibility of a symbolic or politically motivated filing or DEA move late in the year, viewing this as plausible but not certain.\n\nProbabilities assigned by the experts are varied but generally elevated compared to historical base rates, reflecting the current unique convergence of scientific, policy, and advocacy factors. Forecasts range from a low of 17-18% (emphasizing scientific and regulatory inertia) to mid-range estimates of 30-40% (weighing political momentum against procedural delays), up to 62-68% from those that put more emphasis on political and bureaucratic willingness to expedite matters. Two forecasters place the odds just above even (65-68%).\n\nThe group consensus thus converges on a moderate-to-high but not overwhelming probability that the next step (NDA, EUA filing, or DEA rescheduling) could occur before the close of 2025—most likely as a result of political pressure or regulatory signaling, but still with substantial uncertainty due to pipeline readiness and enduring FDA/DEA standards. Median probability across forecasters is just above 40%, with the mean closer to 50% due to several higher outliers.",
    "forecasters": [
        "Regulatory Affairs (FDAApplicationSubmission)",
        "Regulatory Affairs (BreakthroughTherapyDesignation)",
        "Clinical Trial Management (INDApplicationProcess)",
        "Clinical Trial Management (PhaseIIITrialCompletion)",
        "US Healthcare Policy (PolicyChangeAdvocacy)",
        "US Healthcare Policy (CMSCoverageDetermination)",
        "Psychiatry (EvidenceBasedTherapyAdoption)",
        "Psychiatry (TranslationalResearchPipeline)",
        "Pharmacology (DrugDevelopmentPipeline)",
        "Pharmacology (ClinicalTrialPhases)",
        "Public Health Policy (RegulatoryScience)",
        "Public Health Policy (HealthTechnologyAssessment)",
        "US Law and Regulation (FDAApprovalProcess)",
        "US Law and Regulation (ScheduleIFederalDrugLaw)"
    ]
}