{
    "deliberation_results": {
        "Wealth Management (Global Wealth Reporting Standards)": {
            "time_to_resolution": "Resolution is expected when the World Inequality Database (WID) publishes global average wealth per adult for 2024, typically in late 2025 or early 2026; less than a year remains until resolution.",
            "perspective_relevance": "As an expert in global wealth reporting standards and wealth management, I recognize that technical distinctions between average and median wealth, the impact of exchange rates, inflation adjustments, and demographic impacts are all critical for interpreting global datasets like those from WID. I can also assess news about regional financial trends to clarify their probable global impact. Familiarity with how major reports (UBS, WID) define, adjust, and publish 'wealth per adult' allows me to critically assess headline numbers and regional disparities.",
            "status_quo": "Historically, global average wealth per adult has increased in the majority of years, except during severe global downturns or major financial shocks. After a slight decrease in 2022 due to market volatility, 2023 saw a return to growth, and early data indicate an acceleration in 2024. The global trend is a year-over-year increase in average wealth per adult, barring a severe, synchronized crisis.",
            "perspective_derived_factors": [
                {
                    "factor": "Global Asset Market Performance (Especially North America)",
                    "effect": "Strong positive effect. The UBS and other wealth reports note that the Americas (primarily the US) saw an 11% increase in total wealth, driving the bulk of 2024's global gains. Global stock market performance (led by the US) and housing price resilience are major contributors."
                },
                {
                    "factor": "Exchange Rates and Dollar Strength",
                    "effect": "Mixed effect. While the dollar was relatively strong and stable in 2024, WID typically reports wealth in USD, so countries with depreciating currencies may see apparent decreases in wealth. However, the strength of USD assets partially offsets this risk."
                },
                {
                    "factor": "Inflation and Real Wealth Adjustments",
                    "effect": "Modest negative effect. In many regions, asset inflation outpaced wage or income growth, but in USD terms and across major asset-holding countries, total real wealth likely increased."
                },
                {
                    "factor": "Regional Disparities and Negative Outliers",
                    "effect": "Slight negative effect. Some emerging and mid-sized economies (Turkey, some Asian/European markets) experienced falling real wealth or rising inequality. However, their combined weight is insufficient to swamp positive momentum in G7 and China."
                },
                {
                    "factor": "Demographic Change and Wealth Concentration",
                    "effect": "Neutral to positive effect. Despite large populations in lower-wealth countries growing faster, the increase in wealth among affluent and fast-growing economies (US, Taiwan, Hungary, etc.) outweighs dilution effects."
                },
                {
                    "factor": "Exceptional Events or Reporting Changes by WID",
                    "effect": "Low-probability negative tail risk. If WID methodological changes or data revisions sharply lowered the estimate, this could tilt the result, but there is no indication of this in the latest reports."
                }
            ],
            "no_scenario": "A global financial crisis, extreme asset market correction, or dramatic downdraft in China or the US could have sharply reduced wealth in USD terms across enough economies to drive the global average down. Alternatively, a major methodological revision from WID could retroactively reduce 2024 global average wealth estimates.",
            "yes_scenario": "The majority of the world (by total wealth, not population) experiences rising asset values (real estate, equity, and financial wealth) in 2024, driven by North America and Oceania, with stable or modest increases in Europe and parts of Asia. Despite declines or stagnation in some markets, strong gains in the US and select other large economies easily outweigh negative outliers. WID reports an increase consistent with the trend in other leading reports.",
            "final_reasoning": "The global average wealth per adult is highly influenced by performances in the US, Western Europe, and China. News and UBS data for 2024 show strong growth in the US and much of the Americas (11% increase), smaller but positive numbers in Europe (0.4%), and middling to modest increases in Asia-Pacific (2.9%). Asset prices, particularly in equities and real estate in high-wealth countries, grew or remained stable throughout 2024. Negative outliers (Turkey, select EMs) do not represent a large enough share of global adult wealth to offset major positive contributors. The historic base rate for a year-over-year increase is high, as demonstrated in wealth reports, and the 2024 data significantly exceeds 2023's parsed summary numbers. There is no sign of a global event reversing these gains. WID's approach is broadly harmonized with other reports (like UBS), which all show global increases for 2024. Given this, and barring last-minute WID methodology surprises, the probability that WID will report an increase in global average wealth per adult for 2024 is very high.",
            "final_probability": 91
        },
        "Macroeconomic Analysis (Economic Indicator Analysis)": {
            "time_to_resolution": "Approximately 4-5 months, assuming WID releases 2024 data by January–February 2026 per historical patterns.",
            "perspective_relevance": "As a macroeconomic and economic indicator analyst, my expertise allows me to interpret both headline statistics and underlying drivers of global wealth change, such as exchange rates, asset prices, demographic shifts, regional growth dynamics, and inflation. Global average wealth per adult is shaped by a complex interplay of these forces. I am able to connect national statistics, survey results, and global reports (like UBS and WID) to arrive at a holistic, base-rate-grounded assessment.",
            "status_quo": "Global average wealth per adult has increased in most years over the past several decades, with rare decreases correlated with major global crises (e.g., 2008, 2022 asset price drops). The long-term average growth has been about 3.4% per annum, per UBS historical series.",
            "perspective_derived_factors": [
                {
                    "factor": "2024 Global Wealth Growth (UBS reports)",
                    "effect": "Increases probability. Multiple reputable sources (UBS, Forbes, Vanguardia) consistently report a 4.6% increase in global wealth in 2024, led by strong gains in the US (+11%), with smaller gains in Asia-Pacific (+2.9%) and EMEA (+0.4%). This is a strong tailwind for average wealth per adult."
                },
                {
                    "factor": "Regional Performance Variance",
                    "effect": "Partially offsets but still net-positive. More than half of 56 markets had declines in average adult wealth in real, dollar-adjusted terms, but large, high-wealth-population regions (US, Canada, Oceania, Switzerland) saw strong gains, which drive the global average due to their outsized weight."
                },
                {
                    "factor": "Currency and Asset Price Fluctuations",
                    "effect": "Reinforces modest increase. The US dollar remained stable or strong, US and Swiss asset markets performed well, and while some regions experienced declines due to local inflation or weaker currencies, these effects do not offset global gains driven by dollar-denominated assets and equities."
                },
                {
                    "factor": "WID vs. UBS Methodology Differences",
                    "effect": "Neutral to slightly positive for increase. While WID and UBS differ in how they aggregate or impute wealth, both tend to move together on directionality. Since UBS, Credit Suisse, and similar wealth reports all show increases, WID is very likely to as well."
                },
                {
                    "factor": "Base Rate of Increases (History)",
                    "effect": "Increases probability. Only egregious global recessions or asset collapses result in declining global average wealth per adult. 2022 was a recent (unusual) negative year; most others (including modest/flat growth years) still showed some increase."
                },
                {
                    "factor": "Inflation and Real vs. Nominal Wealth",
                    "effect": "Minor negative adjustment. High inflation in some EM and European markets caused real wealth declines, but since reporting is typically in nominal USD, headline global average should still be up."
                }
            ],
            "no_scenario": "A 'No' would require that the WID estimate for 2024 global average wealth per adult is at or below 2023's level. This would most likely happen if global equity/bond/real estate prices sharply fell in late 2024, or if USD appreciation wiped out local-currency gains in most non-US regions. However, 2024 data show equity market stability/growth and only isolated regional declines (E.g., Turkey, Russia). Only a late-year financial crisis or massive underperformance in major economies would plausibly cause a global drop, and there is no evidence for these.",
            "yes_scenario": "A 'Yes' outcome follows from the continuation of historical trends: positive performance in major asset markets (US, Switzerland), modest or positive nominal wealth growth in the Americas, Oceania, and resilience in large European and East Asian economies. Robust increases in the US, Taiwan, Australia, and other key regions overpower more modest or negative results in select EMs (Turkey, Argentina, some parts of Europe). The slight majority of countries may see flat/negative changes, but major wealth centers see growth, lifting the global average.",
            "final_reasoning": "All major macroeconomic data and wealth reports (UBS, national statistics, IMF projections) indicate that 2024 was a year of modest but positive global nominal wealth gains, largely driven by the US and key developed markets. While there is legitimate concern about disparities and some regional contractions, the outsized impact of the US, Switzerland, and other millionaire-dense economies make it extremely likely that the headline global average wealth per adult increased. Historical base rates support this, and no evidence in 2024 points to a large wealth-destroying global crisis. UBS specifically reports a 4.6% global increase, and every cited secondary source confirms modest-positive median and average wealth trends, especially in the largest economies. Uncertainties include possible minor deviations in WID calculations or unforeseen data foibles, but these are unlikely to change the fundamental story. For this reason, I maintain a high probability—though not maximal certainty, given the complexity of global aggregations and methodological nuances.",
            "final_probability": 80
        },
        "International Organizations (World Bank Global Economic Prospects)": {
            "time_to_resolution": "Approximately 4 months (likely resolves Jan 2026, after 2024 data publication)",
            "perspective_relevance": "As an expert in International Organizations, specifically the World Bank's Global Economic Prospects, I am well-positioned to assess global macroeconomic, demographic, and distributional trends at a cross-country and aggregate level. I am trained to analyze broad, multi-region data, tease out the effects of currency fluctuations, asset prices, and regional crises, and interpret both base rates and the exceptional signals in wealth survey data.",
            "status_quo": "Global average wealth per adult has increased about 3.4% per year on average over the past century (per UBS/World Bank data), with rare exceptions such as the pandemic-induced drop in 2022. In 2023, global wealth rose 4.2%. UBS data shows another increase in 2024 (+4.6%). Thus, the base rate strongly favors another year of positive growth.",
            "perspective_derived_factors": [
                {
                    "factor": "UBS & Market Anchored Data",
                    "effect": "Strongly increases probability. Multiple news articles reference UBS’s 2025 Global Wealth Report showing global wealth grew 4.6% in 2024, led by North America and robust asset prices. Most cited summary figures are for average and total wealth, but median wealth also reported as up."
                },
                {
                    "factor": "Regional Divergence & Currency Effects",
                    "effect": "Slightly decreases probability. UBS notes over half of the 56 markets saw declines in average wealth per adult (in USD, inflation adjusted), due partly to currency volatility and inflation. However, large growth from US, China, and other major economies heavily outweighs these losses in global aggregate."
                },
                {
                    "factor": "Concentration of Wealth, Distributional Trends",
                    "effect": "Slightly decreases probability. Some data indicate increases at the top end, but growth in the 'millionaires of the middle' also reported, suggesting broad-based increases in wealth, consistent with average per adult increases."
                },
                {
                    "factor": "Macroeconomic Headwinds (Inflation, Stagnation)",
                    "effect": "Slightly decreases probability. US and Europe saw stagnation or modest real income gains, but asset price growth and dollar strength offset this. The underlying structural growth in nominal/global terms remains positive."
                },
                {
                    "factor": "Exceptional National Trends",
                    "effect": "Increases probability. Several key economies—US, China, Switzerland, North America, Oceania—saw robust increases. Vietnam and Taiwan also report increases, and emerging markets like the UAE and Turkey contributed new millionaires. These aggregate results suggest the global trend is up."
                },
                {
                    "factor": "Systematic Bias Toward Upward Trend",
                    "effect": "Strongly increases probability. Over the past 25 years (per UBS/World Bank/WID), the annual progression of median and average wealth per adult has been positive, except in global crises. No such global crisis occurred in 2024."
                }
            ],
            "no_scenario": "A No outcome would occur if, despite headline gains, currency effects and asset price corrections caused a net decline in average wealth per adult globally as measured by WID. This could result from a major emerging market crisis, severe inflation overpowering asset gains, or a sharp global downturn—conditions not reflected in current macro data for 2024.",
            "yes_scenario": "A Yes outcome arises if the global increase in asset values, positive market performance, rising real estate values in major markets, ongoing growth in new millionaires (particularly in the Americas and Asia), and moderate overall inflation yield a net increase in global average wealth per adult, as measured by the WID and summarized by UBS and other major data compilers.",
            "final_reasoning": "UBS and multiple news outlets report a clear global increase in both aggregate and average wealth per adult for 2024 (+4.6%). While dollar-based inflation adjustment and local market downturns led to declines in some regions, the overwhelming weight of North America, China, and select high-growth countries more than offset these. The historical base rate for annual increases is strong and is not contradicted by severe shocks or macro trends for 2024. Despite some possible confusion between average and median trends, all major sources point to at least modest global increases. The only significant risk would be an unanticipated methodological quirk in WID’s calculation or a major, subsequently revealed data error. However, that risk is low given the convergence of multiple independent sources.",
            "final_probability": 80
        },
        "Economics (Neoclassical Growth Theory)": {
            "time_to_resolution": "Approximately 3-4 months (latest data reporting cycle implies likely resolution by December 2025 or early 2026, regarding data for full-year 2024 compared to 2023).",
            "perspective_relevance": "As an expert in Neoclassical Growth Theory, I analyze trajectories of per-adult wealth through the lens of capital accumulation, productivity, population dynamics, and technological progress. Neoclassical theory emphasizes long-run growth driven by capital deepening, labor force changes, and exogenous technology, all affecting aggregate and per-capita outcomes like wealth per adult. This allows me to distinguish between short-term shocks (cyclical) and secular, trend-based movement in global wealth, factoring in cross-country differences and compositional changes.",
            "status_quo": "Historically, global average wealth per adult has risen most years, interrupted only by major global crises (e.g., 2008 financial crisis, 2022-23 correction) due to capital market declines. Latest UBS/wealth reports indicate resumed upward movement in 2024, with average global adult wealth up by 4.6%. If current trends persist, a modest increase is the status quo.",
            "perspective_derived_factors": [
                {
                    "factor": "Capital Market Gains in the Americas",
                    "effect": "Raises probability — North America (esp. US stock and housing recovery) is a disproportionate driver of total global wealth metrics, and 2024 saw strong asset performance in both equities and real estate."
                },
                {
                    "factor": "Regional Divergence",
                    "effect": "Mixed effect — While US and some Asian economies (e.g., Taiwan, South Korea, Vietnam) posted strong gains, over half the countries analyzed saw declines in average wealth per adult (currency, asset prices, or demography). However, the large size of the US offsets many smaller declines."
                },
                {
                    "factor": "Inflation and Real Wealth Adjustments",
                    "effect": "Slightly lowers probability — Adjustments for inflation mean some nominal gains are offset, and real-wealth stagnation in some developed/euro countries tempers global average increases."
                },
                {
                    "factor": "Population Growth/Adult Demographics",
                    "effect": "Raises probability — In most growth regions (Asia, Africa), the working-age/adult population is rising, and in the US, population growth, though slowing, is still positive. Generally, if aggregate wealth rises slightly faster than the adult population, average wealth per adult will still increase."
                },
                {
                    "factor": "Increasing Wealth Concentration",
                    "effect": "Boosts probability for average, not median — The surge in ultra-high net worth individuals and millionaires, especially in the US and some emerging markets, disproportionately lifts average wealth per adult, even when median stagnates."
                },
                {
                    "factor": "FX Movements",
                    "effect": "Marginally lowers probability — In 2024, a strong US dollar means that wealth in weaker-currency nations may appear lower when converted to USD, slightly tempering global average gains."
                }
            ],
            "no_scenario": "A 'No' scenario could arise if asset prices globally collapsed late in 2024 (post-June, not reflected in current news), or if reporting/measurement adjustments by WID include major negative revisions or large FX impacts, causing global average wealth per adult to fall versus 2023. Another such scenario would be if global population growth in middle/lower-income regions outpaces aggregate wealth growth, pulling down the average.",
            "yes_scenario": "The most plausible 'Yes' scenario—as signaled by UBS and other major financial reports—features continued robust asset growth in the US and some Asian economies, offsetting stagnation or declines elsewhere. Even with regional divergence, strong capital gains, especially among the global upper class, are sufficient to lift global average wealth per adult. The distribution remains highly unequal, but the mean increases.",
            "final_reasoning": "Multiple converging lines of evidence from global wealth reports—UBS, media synopses, and regional breakdowns—point to a moderate increase in global average wealth per adult in 2024, despite notable exceptions and uneven distribution. Neoclassical model analysis suggests that, while some regions (Europe, parts of Africa and South America) saw little real increase or even decline due to local inflation, currency effects, and sluggish productivity, these account for a smaller share of global wealth than the surges seen in North America and parts of Asia. Further, as average global adult wealth is disproportionately impacted by the richest nations (especially the US) and the very wealthy, concentrated asset market recoveries and wealth creation at the top (e.g., millionaires, ultra-rich) are enough to outweigh stagnation elsewhere. Inflation and FX dynamics are headwinds, but are not sufficient, given available data, to negate the robust positive growth in capital-heavy economies. Statistical outliers and compositional population effects (recent demographic and wealth shifts) are not of the magnitude needed to undo the observed growth. Grounded in both the neoclassical framework and reporting, I judge the probability of a 'Yes' outcome to be high, though not certain—acknowledging reporting lags and measurement caveats.",
            "final_probability": 80
        },
        "Economics (Kuznets Hypothesis)": {
            "time_to_resolution": "Approximately 3-4 months, or until WID publishes reliable data for 2024 (likely late 2025 or early 2026).",
            "perspective_relevance": "As an expert in Economics with deep knowledge of the Kuznets Hypothesis, my perspective is uniquely relevant. The Kuznets Hypothesis addresses the relationship between economic growth and wealth/income inequality, highlighting that as economies develop, inequality first rises then eventually falls. Understanding this dynamic is paramount when evaluating trends in median and average global wealth, especially during periods of robust growth, stagnation, or crisis. Median wealth per adult, more than mean, signals how broadly growth is distributed and whether rising inequality is eroding broad-based prosperity.",
            "status_quo": "Historically, global average wealth per adult has increased in most years, driven by both real growth and asset price appreciation, with exceptions during major crises (e.g., financial crisis 2008-9, COVID-19 in 2020, or the 2022 global slowdown). Barring an acute global shock, the expectation is for a continued gradual increase.",
            "perspective_derived_factors": [
                {
                    "factor": "Global Real Wealth Growth: Asset and Equity Markets",
                    "effect": "Strongly increases probability. 2024 saw global wealth rise by 4.6% per UBS, driven by the Americas (11%), and US stock markets remained resilient. Resilient asset markets directly lift average adult wealth, especially in high-wealth countries."
                },
                {
                    "factor": "Regional Disparities in Growth",
                    "effect": "Slightly decreases. Europe and Asia-Pacific saw much weaker growth rates (Asia-Pacific: +2.9%, EMEA: +0.4%). When half the markets report declines in average wealth, this counters the aggregate global uptrend, as does weakness in regions like China/Russia and sectors hit by currency devaluations."
                },
                {
                    "factor": "Inflation and Exchange Rate Fluctuations",
                    "effect": "Neutral to positive. Although inflation eroded real gains in many economies, wealth in USD terms often grew or held steady in most high-wealth markets thanks to asset price increases and relative dollar stability. Currency effects negatively affected some regions but did not erase global aggregate gains."
                },
                {
                    "factor": "Demographics and Structural Economic Changes",
                    "effect": "Neutral to positive. Ageing populations and changing cohort sizes can dilute gains, but countries like Vietnam, Taiwan, South Korea, and Hungary saw major rises in median and average wealth, driven by economic reforms and FDI. Global population growth remains more concentrated in lower-wealth regions, muting the average increase but not reversing it."
                },
                {
                    "factor": "Inequality and Median vs. Mean",
                    "effect": "Slightly negative. Wealth concentration means the average can rise even if the median stagnates or falls, but reports indicate that median wealth per adult also rose in most regions (per UBS/Hungary, Lithuania, Sweden, etc.). The Kuznets Hypothesis would anticipate high or rising inequality during periods of technological change and capital market booms, but current evidence suggests broad if uneven gains."
                },
                {
                    "factor": "Global Crises (War, Trade Shocks, Policy Changes)",
                    "effect": "Weakly negative. Ongoing geopolitical tensions and elevated military spending are headwinds but have not, so far, produced a synchronized global downturn in 2024. Trade frictions mainly muting potential upside rather than causing declines."
                }
            ],
            "no_scenario": "Global average wealth per adult would fall if a synchronized asset market crash or widespread currency collapse hit major economies in 2024, erasing nominal gains and outpacing pockets of regional prosperity. For instance, a sharp dollar appreciation plus crashes in US/Europe/China real estate and equities could easily produce negative net global wealth growth even if high-growth regions like Vietnam or India continued to gain. Another scenario: surging inflation devalues assets faster than real gains, particularly in non-dollar markets.",
            "yes_scenario": "The actual scenario appears close to this: Robust equity and asset markets in the US and several developed economies, moderate growth elsewhere, persistent regional disparities, but no major synchronized crash. Per UBS and multiple international press summaries, global wealth per adult in both mean and, often, median terms rose in 2024, with the Americas particularly strong and only some countries seeing real-terms declines. Large countries like the US, China, and much of Europe ultimately show net-positive averages, pulling up the global figure.",
            "final_reasoning": "The overwhelming preponderance of evidence from the 2025 UBS Global Wealth Report and corroborating news sources is that global average wealth per adult increased in 2024 compared to 2023. Global wealth rose 4.6% in nominal terms. The US and China, as key engines, both reported net gains—albeit with regional and demographic disparities. High performance in countries like Hungary, Sweden, and the UAE further supports a broad-based rise. While median figures in some markets fell due to inflation, average wealth (driven by asset-holders) increased globally. Negative factors (local inflation, currency drops, regional crises) did not accumulate enough global weight to overturn gains elsewhere. The Kuznets Hypothesis suggests that, even amidst rising disparities, aggregate wealth should rise unless a true systemic crisis occurs, which 2024 avoided. The base rate for year-on-year global average wealth increase, absent crisis, is well over 80%. With plausible uncertainty regarding outlier events or data revisions, but in light of all available contemporaneous sources, I find good justification for a strong but not absolute probability.",
            "final_probability": 90
        },
        "Finance (Portfolio Theory)": {
            "time_to_resolution": "Approximately 8-9 months, assuming WID releases data on schedule by mid-2026 for calendar 2024.",
            "perspective_relevance": "As a finance (portfolio theory) expert, I analyze wealth measures similarly to aggregate portfolio returns—global average wealth per adult reflects the compounded effects of asset returns (financial markets, real estate), currency fluctuations, debt, macroeconomic growth, and demographic changes. Portfolio theory also stresses the significance of distribution (mean vs. median), volatility, outliers, and rebalancing, which are relevant to interpreting international wealth data.",
            "status_quo": "Historically, global average wealth per adult increases in most years, with only exceptional events (e.g., global financial crisis, 2022 asset declines) resulting in declines. The most recent UBS and WID data indicate 4.6% global wealth growth in 2024.",
            "perspective_derived_factors": [
                {
                    "factor": "Global Asset Price Appreciation",
                    "effect": "Increases probability. Major equity markets (US, developed world), property values, and the rising prevalence of 'daily millionaires' (wealth between $1M-$5M) are cited as drivers of 2024 wealth gains. Portfolio effect: rising tide lifts total wealth holdings."
                },
                {
                    "factor": "Regional Divergence & Currency Effects",
                    "effect": "Decreases probability marginally. UBS notes that in over half of major markets, local average wealth per adult declined (often due to local asset or FX declines), partially offsetting global growth. However, since Americas and North America (where wealth is highly concentrated) had large gains, the overall global average still likely increased."
                },
                {
                    "factor": "Inflation and Real vs. Nominal Adjustments",
                    "effect": "Mixed; neutral overall. While inflation erodes real purchasing power, WID reports are typically in nominal USD terms. Runs of high inflation may dampen real gains but do not negate nominal increases in the absence of asset price collapses."
                },
                {
                    "factor": "Population Demographics and Adult Growth",
                    "effect": "Slightly decreases probability. In regions with fast adult population growth but lower asset appreciation (Asia, Africa), average wealth per adult can stagnate or fall, but concentration in US/EU still dominates overall average."
                },
                {
                    "factor": "Macro Shocks (Conflicts, Trade/Wars, Policy Tightening)",
                    "effect": "Decreases probability slightly. While some markets (Turkey, parts of EMEA) saw large declines, and there are warnings of trade tensions, no evidence suggests a global recession or widespread asset collapse in 2024."
                },
                {
                    "factor": "Structural Wealth Concentration",
                    "effect": "Increases probability. Data indicates ultra-wealthy and upper-middle segments continue accumulating assets, which pushes up the average even when the median or lower percentiles stagnate. Portfolio-theoretic analogy: mean can rise even as most portfolio elements lag."
                }
            ],
            "no_scenario": "A global average wealth per adult decline would require either a systemic worldwide asset price collapse (e.g., a major global recession, synchronized equity/property market crash or dollar surge) or the massive devaluation of USD relative to most currencies, which is not supported by 2024 data. Alternatively, if asset values in China, Europe, and other key regions declined enough to offset American gains, it could theoretically lead to a flat or negative global average—but reported data puts growth at around 4.6%.",
            "yes_scenario": "Continued appreciation in North America, Oceania, and key emerging markets (as per UBS reports), coupled with a general upward trend in the number of global millionaires and asset values, leads the global average wealth per adult for 2024 to surpass that of 2023. This outcome is further assured by the mathematical effect of high-concentration at the top end (US, China, Europe) and the dominance of nominal asset values, even if some markets see declines.",
            "final_reasoning": "Base rates favor increase: Over the last century, global wealth per adult rises in most years except during rare, systemic crises. The 2024 data from multiple UBS and news sources point to overall global wealth growing at 4.6% (in nominal US dollars), notably faster than in 2023, with the strongest growth in North America (US, Canada). Potential mitigating factors (regional declines, weak Europe/Asia, currency headwinds, asset volatility in some EMs) are insufficient to outweigh the impact of sharply rising wealth in the Americas and persistent structural concentration. Global wealth is increasingly a function of top-heavy portfolio effects, with gains at the top end often sufficient to lift the mean even when the median lags. Given strong supporting evidence, and in the absence of any extraordinary negative surprise in WID reporting, the probability that global average wealth per adult increases in 2024 is very high.",
            "final_probability": 85
        },
        "Finance (Asset Price Theory)": {
            "time_to_resolution": "Approximately 4 months (the question concerns whether global average wealth per adult in 2024 is higher than in 2023; it is likely to resolve upon WID data release, which historically occurs late Q4 or early Q1 the following year).",
            "perspective_relevance": "As an expert in finance (asset price theory), my perspective is particularly relevant because global wealth per adult is heavily affected by aggregate asset prices (especially equities, real estate, and bonds), currency movements (as global aggregates are measured in USD), and broad macroeconomic trends, all of which connect directly to asset price theory. This perspective provides insight into the mechanisms driving changes in the calculated global average wealth per adult beyond GDP or household income numbers.",
            "status_quo": "Historically, global average (and median) wealth per adult has increased in most years, with exceptions mainly in crisis years or when USD appreciates sharply versus other currencies. The status quo is continued yearly growth, generally in the 3-5% range in dollar terms, barring major shocks.",
            "perspective_derived_factors": [
                {
                    "factor": "Asset Price Growth",
                    "effect": "Increases probability. Major asset classes (stocks, bonds, real estate) performed strongly in major markets (especially US, which accounts for vast global wealth), driving wealth increases."
                },
                {
                    "factor": "Global GDP and Economic Growth",
                    "effect": "Increases probability. Continued expansion in Asia (notably India and Vietnam), with the US and other developed markets posting modest GDP gains. Growth remains the base expectation."
                },
                {
                    "factor": "Currency Effects",
                    "effect": "Ambiguous. 2024 saw some dollar strength, but not enough to erase wealth gains in USD. While currency movement can translate local asset gains into USD declines (as seen in some past years), in 2024 this effect is moderate."
                },
                {
                    "factor": "Inflation and Real Asset Valuations",
                    "effect": "Ambiguous/slight increase: Inflation eroded real purchasing power in some regions, but nominal asset values often grew faster, and in USD-terms the median global wealth still advanced."
                },
                {
                    "factor": "Distributional Effects / Wealth Inequality",
                    "effect": "Slight decrease: Wealth is highly concentrated; weak performance or losses in the bottom half may drag the median, but most news points to at least small increases for the broad middle in large countries."
                },
                {
                    "factor": "Regional Divergence",
                    "effect": "Little effect overall: Strong Americas offset by weak EMEA/APAC, but net effect is positive since the US is such a large weight. Some markets saw declines, but largest economies (US, some Asian Tigers) advanced."
                },
                {
                    "factor": "Demographic and Survey Effects",
                    "effect": "Ambiguous/neutral: If adult population growth outpaces wealth accumulation in poorer countries, it can drag on average/median, but news points to limited demographic impact in 2024."
                },
                {
                    "factor": "Data/Reporting Timing Risk",
                    "effect": "Slight decrease: If WID data is delayed or methodologies change, the question could void, but base rate for voiding is low."
                }
            ],
            "no_scenario": "A 'No' outcome would result if global asset markets experienced a sharp downturn not already visible in September's reports, or if the US dollar appreciated rapidly enough to translate foreign-currency wealth into USD losses, overwhelming nominal local gains. Alternatively, significant negative shocks in populous regions (e.g., China’s real estate collapse, European financial/stringency crisis) could cause median wealth per adult to stagnate or fall in USD. Evidence of such a scenario is lacking based on news and the UBS/market reports.",
            "yes_scenario": "A 'Yes' outcome is the default, resulting from robust asset price appreciation in the US and key global markets, positive GDP growth in major economies, and at least modest local currency appreciation or stability. The latest UBS data indicate global wealth rose by 4.6% in 2024; even though half the countries saw declines, the US and Americas (with outsized weight in the global median) showed strong gains. Reports highlight rising numbers of millionaires, continued wealth accrual above inflation in developed markets, and moderate overall growth.",
            "final_reasoning": "Drawing on asset price theory, the global median/average wealth per adult is an outcome of asset price appreciation, currency translation, and macroeconomic growth. The 2024 environment saw robust equity markets (particularly in the US), real estate stabilization or increases in key regions, and moderate global economic growth. UBS’s headline is that global wealth increased by 4.6% in 2024, and Americas’ growth (dominated by the US) was especially strong. While some major countries (China, Russia) saw decreases (-6.3%, -8.2%), countries like the US, Taiwan, Hungary, and Australia registered noteworthy increases, and the US alone constitutes about 40% of global millionaires. The news flow consistently notes a rising number of millionaires and moderate increases in wealth at the middle levels, suggesting median is also advancing. While distribution remains highly unequal and gains are more modest for the bottom half, the base rate for a decline is very low outside of crisis years, and no evidence supports a major countervailing dynamic for 2024. Currency effects were moderate but not enough to offset asset market gains. Therefore, the likelihood that WID’s 2024 median per-adult wealth will exceed 2023’s is high. The only major caveats are methodological or definition shifts by WID or unexpectedly severe late-year shocks not captured in available data. I therefore set my probability at 80%.",
            "final_probability": 80
        },
        "Development Studies (Human Development Theory)": {
            "time_to_resolution": "Less than one year, as WID 2024 data is expected before mid-2026.",
            "perspective_relevance": "As an expert in Development Studies with a focus on Human Development Theory, my perspective emphasizes not just economic aggregates but underlying changes in distribution, social equity, demographic trends, and the structural drivers of wealth accumulation, all essential for understanding global wealth metrics and their developmental consequences.",
            "status_quo": "In typical years, average global wealth per adult increases, with developed economies leading the way. A long-term historical trend (approx. 3.4% annually over a century) supports ongoing aggregate wealth growth, although with notable exceptions (e.g., 2022 saw a rare global decline). Recent 2023–2024 reports indicate resumed growth.",
            "perspective_derived_factors": [
                {
                    "factor": "Global Wealth Growth Trend",
                    "effect": "Increases probability. UBS and other major reports indicate global average (and median) wealth per adult grew by ~4.6% in 2024. Most regions, especially the Americas, experienced strong gains. Historical data gives a strong base rate for at least modest annual increases."
                },
                {
                    "factor": "Regional Divergence and Currency Fluctuations",
                    "effect": "Decreases probability slightly. About half of major national markets saw declines in 2024 (in USD terms), due to currency volatility and inflation—even as the global average increased. USD strength/weakness and asset price volatility can bias the metric."
                },
                {
                    "factor": "Inequality Dynamics and Wealth Concentration",
                    "effect": "Increases probability. The most recent wealth growth was driven by gains in higher wealth brackets (particularly 'millionaires of the masses'), and much of the new wealth accrued at the top and upper-middle, raising the global average even when gains were less broad-based."
                },
                {
                    "factor": "Human Development and Welfare Trends",
                    "effect": "No significant effect. While certain countries (Hungary, Taiwan, Spain) saw large median increases, others struggled (Turkey, some parts of Latin America, and sub-Saharan Africa). Broader human development, such as health or education, often lags behind wealth trends and is less correlated to short-term wealth movements."
                },
                {
                    "factor": "Macroeconomic & Geopolitical Headwinds",
                    "effect": "Decreases probability, but not enough to outweigh the global trend. Inflation, regional conflicts, and declining productivity in some regions constricted gains and led to local declines. However, global asset markets and North American outperformance offset these effects."
                },
                {
                    "factor": "Measurement/Reporting Uncertainty",
                    "effect": "Decreases probability slightly. The WID may adjust previous years or struggle with lagging country-level data, possibly revising metrics in ways that affect year-on-year comparisons. Global averages are also sensitive to population data updates."
                }
            ],
            "no_scenario": "Global asset prices (esp. equities and real estate) fall or stagnate in key markets, causing enough contraction in combined global wealth per adult to counterbalance North American and Asian gains; severe exchange rate shifts or unanticipated negative revisions by WID erase apparent nominal gains; persistent inflation in local currencies erodes real USD-denominated wealth to 2023 levels or below.",
            "yes_scenario": "Strong performance by US, China, and emerging markets in asset prices and economic growth, with continued wealth concentration at the top and moderate broad-based gains in developing countries, results in another clear net increase in global average wealth per adult in WID's final 2024 figures; growing millionaire counts and new middle-tier wealth assure the aggregate rises.",
            "final_reasoning": "All major sources, especially the UBS Global Wealth Report, confirm a 4.6% increase in global wealth in 2024, with above-trend growth concentrated in North America and moderate to high regional gains elsewhere. About half of countries experienced declines, but the strength and sheer size of US/China—and ongoing asset price appreciation—offset these losses. WID has traditionally tracked close to UBS, and barring significant data revisions or policy shocks, there is very strong evidence to expect a higher global average wealth per adult for 2024 over 2023. Structural human development considerations (education, health) may lag wealth, and inequality may have grown, but aggregate global wealth per adult almost certainly increased. Only an unexpectedly negative WID adjustment or severe measurement/currency issue could reverse this.",
            "final_probability": 80
        }
    },
    "deliberation_probability": [
        91,
        80,
        80,
        80,
        90,
        85,
        80,
        80
    ],
    "deliberation_mean_probability": 83.25,
    "deliberation_sd": 4.803272693844122,
    "deliberation_probability_result": 83,
    "group_results": {
        "WealthManagementGlobalWealthReportingStandards": {
            "forecaster_to_engage": "Finance (Portfolio Theory)",
            "response_type": "defense",
            "response": "The Finance (Portfolio Theory) forecaster appropriately centers their analysis on portfolio-level effects, which are crucial for 'average' wealth metrics due to the heavy influence of top-end wealth expansion and asset price recovery in major developed markets. Their explicit attention to the persistence of historical base rates (wealth rarely declines year-on-year except in global crises), integration of 2024's robust asset performance, and a nuanced caveat regarding the effect of outlier negative performances (e.g., select emerging markets) is well-justified and strengthens their reasoning. I would further underscore their point that large increases among US-based millionaires, constituting a significant share of total global wealth, are sufficient to support a global average increase even when a substantial number of smaller markets experience stagnation or mild decline. This portfolio-centric analysis is not only theoretically sound but also empirically validated by the 2024 data flows from UBS and other independent aggregators."
        },
        "MacroeconomicAnalysisEconomicIndicatorAnalysis": {
            "forecaster_to_engage": "Economics (Kuznets Hypothesis)",
            "response_type": "critique",
            "response": "The forecaster insightfully applies the Kuznets Hypothesis to explain the coexistence of rising aggregate wealth and increasing inequality, a dynamic evident in the 2024 wealth distribution data. However, their argument somewhat understates the risks presented by concentrated regional downturns or extreme financial shocks—risks that, while not realized in 2024, should remain salient given the rising systemic importance of a few economies (notably, the US and China). While it's correct that negative outliers like Turkey or Russia lack sufficient aggregate weight to turn the global average negative, the increasing dependence of global wealth metrics on a handful of large, highly financialized economies heightens sensitivity to asset price volatility or systemic crises within those hubs. A more robust analysis would also clearly differentiate 'average' from 'median' trends and confront the potential methodological divergences between WID and UBS—especially as WID's adjustment for population growth and data revisions could, in rare cases, obscure headline gains. While the overall probability assessment is reasonable, a fuller risk discussion and explicit consideration of these global concentration dynamics would strengthen the forecast."
        },
        "InternationalOrganizationsWorldBankGlobalEconomicProspects": {
            "forecaster_to_engage": "Finance (Asset Price Theory)",
            "response_type": "defense",
            "response": "The Finance (Asset Price Theory) forecaster provides a robust, empirically anchored framework highlighting the dominant role of asset market performance and currency translation in shaping global average wealth per adult. Their reasoning astutely notes that equity and property gains—especially in the US, which constitutes a disproportionate share of world wealth—are sufficient to drive the global average upward even with stagnation or decline in other regions. The forecaster’s explicit recognition of the impact of exchange rates and the outsized influence of increases at the top end of the distribution is especially pertinent, given that wealth metrics are power-law distributed. I would endorse this approach and add—in support—that their nuanced treatment of the risk posed by late shocks or WID methodological choices aligns with best practices for uncertainty quantification in global reporting. By treating the base rate (rare negative years) as primary and layering on asset price theory insights, this forecast gives a well-calibrated, theoretically sound probability."
        },
        "EconomicsNeoclassicalGrowthTheory": {
            "forecaster_to_engage": "Development Studies (Human Development Theory)",
            "response_type": "critique",
            "response": "While the forecaster rightly emphasizes robust evidence of overall gains in global average wealth per adult from the UBS Global Wealth Report and the outsized contributions of the US and China, the analysis underplays the significance of divergent regional trends and measurement nuance. They assert that WID will almost certainly corroborate UBS on average wealth growth, yet WID's metrics can diverge due to unique methodological choices (such as population definitions, wealth allocation adjustments, and how local inflation/currency effects are integrated). Some difference between 'average' and 'median' is glossed over, and half of the markets analyzed did report per-adult wealth declines. Furthermore, the human development perspective could add value by critically analyzing the consequences of rising inequality and financialization, both of which can inflate average measures without improving material living standards for the typical adult. In sum: the core conclusion is likely directionally accurate, but the forecast would be improved by more skepticism about mechanical alignment in global data sources and a clearer distinction between improving global mean, median, and the broader implications for development metrics."
        },
        "EconomicsKuznetsHypothesis": {
            "forecaster_to_engage": "International Organizations (World Bank Global Economic Prospects)",
            "response_type": "critique",
            "response": "This forecaster provides a well-grounded synthesis of global wealth report summaries with an appropriate base-rate argument, acknowledging that only a methodological surprise or major hidden shock could overturn the high expectation of an increase. However, they underemphasize the possibility of statistical or compositional drift. Given the Kuznets perspective, one must critically examine the structural risk that regional divergence, demographic changes, and rising inequality (potentially exacerbated by asset price inflation) may not neatly aggregate as expected—especially should WID employ a population-weighted approach or make a major data revision retroactively. The brief mention of confusion between median and average glosses over how these divergences have, in prior years and across datasets, produced unexpected headline results (e.g., average rising but median stagnant, or WID using updated PPP/fx rates). While unlikely, a more thorough risk scan of metrics and resolution criteria would strengthen this otherwise strong probability call."
        },
        "FinancePortfolioTheory": {
            "forecaster_to_engage": "Macroeconomic Analysis (Economic Indicator Analysis)",
            "response_type": "defense",
            "response": "This forecast provides a level-headed and appropriately evidence-based assessment, foregrounding the macroeconomic data and UBS/IMF figures that are highly relevant to global wealth calculation. The forecaster wisely cautions about the complexity of aggregating international wealth figures, correctly highlighting the risk of minor methodological uncertainties in WID's calculation, which portends proper calibration rather than excessive confidence. Furthermore, their integration of both regional patterns and the large effect of the US, Switzerland, and other major markets mirrors the insights from finance: portfolio effects and compositional bias are dominant in global wealth metrics. Their ultimate probability is a touch less aggressive than the highest estimates (e.g., Global Wealth Reporting), but this reflects responsible skepticism in the face of multi-source harmonization challenges. The analysis is well-balanced and does not overlook base rates or outlier risks, making it a strong and defensible forecast from a finance/policy intersection perspective."
        },
        "FinanceAssetPriceTheory": {
            "forecaster_to_engage": "Development Studies (Human Development Theory)",
            "response_type": "critique",
            "response": "While your forecast is directionally sound in emphasizing broad-based global asset growth as reported by UBS, it may underappreciate two nuances illuminated by asset price theory. First, you cite strong North American gains and claim that WID nearly always tracks UBS, but this glosses over structurally different methodologies: WID often recalibrates for local asset composition, leverage, and population structure in ways that can mute effects evident in UBS’s largely market-cap and currency-driven averages. Second, your assessment could benefit from more skepticism regarding how persistent inflation and exchange-rate swings—particularly outside the US—may meaningfully dampen the translation of asset price gains into global medians or averages, especially if WID's aggregation places significant weight on slower-growing or depreciating regions. Finally, while equity/value increases among the wealthy can drive the mean up, a human development lens should clarify that this sometimes masks real-world stagnation for the lower deciles, raising the risk that 'average' improvements diverge from median/typical experience. These caveats warrant a slightly less absolute framing."
        },
        "DevelopmentStudiesHumanDevelopmentTheory": {
            "forecaster_to_engage": "Finance (Asset Price Theory)",
            "response_type": "defense",
            "response": "The Finance (Asset Price Theory) forecast excels in integrating asset market performance, currency effects, and compositional imbalances in global wealth, all of which substantially determine short-term changes in average per-adult wealth. Their approach is especially strong in acknowledging that concentrated gains in major asset-holding economies—especially the US—translate into global average increases even when other regions stagnate or contract. This robustness is supported by UBS's 2024 data, which shows world wealth rising despite half of the sampled markets experiencing local declines, and by the persistent outsize impact of top-heavy wealth distributions on averages. The forecaster also judiciously notes the caveat of possible methodological divergences between aggregates (WID versus UBS) and cautions against overconfidence due to reporting or FX swings. This careful calibration between empirical outcomes and model-driven expectations is highly aligned with both development studies and financial theory standards. Their probability estimate effectively reflects the strong base rate and current reporting, supporting the thesis that global average wealth per adult rose in 2024."
        }
    },
    "revision_results": {
        "Wealth Management (Global Wealth Reporting Standards)": {
            "my_phase1_final_probability": 91,
            "reasoning_for_revised_probability": "Upon review, the group consensus was tightly clustered in the 80–90 range, reflecting strong but not absolute certainty. No counterarguments or regional risks sufficient to drive a global average decline were raised—indeed, every synthesis pointed to the overwhelming weight of US, North American, and top-end wealth drives making a fall in average wealth extremely unlikely. Defense of the portfolio theory perspective reiterated that the tail risk for a 'No' outcome depends almost exclusively on unlikely WID methodological discontinuity or a stealth, late-breaking global crisis—which are not present in any evidence. Since my initial probability already reflected these scenarios as very low probability events, and all presented data and domain-expert reasoning converged on strong support for a 'Yes' outcome, there is no basis to reduce my estimate. If anything, the additional confirmation bolsters my confidence—but because my initial judgment (91%) is already on the high end for warranted extremity, I will hold it steady.",
            "revised_probability": 91
        },
        "Macroeconomic Analysis (Economic Indicator Analysis)": {
            "my_phase1_final_probability": 80,
            "reasoning_for_revised_probability": "Upon review of the group deliberation, nearly all domain specialists (Wealth Management, World Bank, Neoclassical and Kuznets theories, Portfolio and Asset Price Theory, and Development Studies) independently arrive at a high probability (80–91%) that WID will record an increase in global average wealth per adult for 2024. No forecaster raises any credible scenario or systemic risk sufficient to drive the probability notably lower. The additional arguments reinforce the dominance of US and asset market performance, and confirm base rates and 2024's strong global asset price recovery. The only caveats are minor: potential methodological outliers for WID or last-minute data revisions, and these are unlikely to offset the clear global trends. Given the convergence across relevant disciplines and fresh review of risk, I will revise my probability upward for clarity and to reflect the weight of expert consensus.",
            "revised_probability": 88
        },
        "International Organizations (World Bank Global Economic Prospects)": {
            "my_phase1_final_probability": 80,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I see strong convergence among all experts, with even higher probabilities (85-91%) assigned by some, especially by those leveraging global reporting standards and portfolio theory. There is broad agreement not only on the direction of global average wealth per adult for 2024 (strongly up) but also on the limited risk posed by regional outliers or methodological surprises. The macroeconomic, asset price, and portfolio-centric perspectives collectively reinforce the expectation that WID will report an increase. The only credible residual risks are unlikely errors related to unforeseen WID adjustments or extreme, as-yet-undisclosed financial shocks, which are not signaled in available data. The increased consensus and lack of strong counterarguments suggest my initial probability was somewhat conservative relative to the strength of evidence.",
            "revised_probability": 87
        },
        "Economics (Neoclassical Growth Theory)": {
            "my_phase1_final_probability": 80,
            "reasoning_for_revised_probability": "The group deliberation reinforced the broad consensus that global average wealth per adult likely increased in 2024, with strong empirical support from multiple major sources. However, it also highlighted the importance of being attentive to data source nuances (especially differences between WID and UBS methodologies), and to the statistical fact that population or measurement adjustments can, in rare cases, yield surprise outcomes. Despite these caveats, no credible evidence of a major global wealth-destroying event or systemic shock was identified, and the data still point to sizeable wealth gains in the largest economies (notably the US), which dominate global averages. The risk from WID's potential methodological variance remains small but nonzero. Weighing the largely consistent evidence but allowing for a minor increase in caution given the methodological caveats, I revise my probability upward by a modest margin in recognition of the strong base rate and aggregate reporting—balancing the slight risk of outlier measurement effects.",
            "revised_probability": 85
        },
        "Economics (Kuznets Hypothesis)": {
            "my_phase1_final_probability": 90,
            "reasoning_for_revised_probability": "Upon reviewing the group deliberation, most expert forecasts converge strongly on a high-probability outcome, citing multiple independent sources (notably UBS) showing a 4.6% global wealth increase in 2024 and clear gains in the key wealth-contributing economies. Defenses reinforce the base rate argument and the outsized role of the US, while critiques appropriately flag minor risks around WID's specific methodology and the possibility of divergence between median and average. However, no forecaster introduced new data substantially challenging the core narrative: although there is valid concern about outlier declines (e.g., Turkey, parts of Europe or Asia), these are dwarfed by record asset price increases and robust portfolio growth at the upper end. There is a residual, low-probability risk that WID’s calculation or a methodological revision produces a surprising result, but given the convergence of evidence, the risk does not warrant a significant downward revision. If anything, the group’s careful calibration and near-unanimity actually slightly increase confidence that a positive global change will be reported.",
            "revised_probability": 92
        },
        "Finance (Portfolio Theory)": {
            "my_phase1_final_probability": 85,
            "reasoning_for_revised_probability": "The group discussion reinforced my initial reasoning. Multiple perspectives (macroeconomics, wealth reporting, growth theory, asset pricing) independently converged on a high probability that average global wealth per adult increased in 2024, with UBS and other major datasets supporting a 4.6% nominal gain. Defenses of my argument (centered on portfolio effects and top-heavy gains) confirmed its soundness, while critiques across the group most often noted only modest methodological or compositional risks—none presenting evidence significant enough to undermine the clear global trend. The only points suggesting caution were the minor possibility of WID methodological surprises or statistical revisions, but these are low-probability events and do not outweigh the overwhelming evidence and base rate. Therefore, the evidence base supporting a Yes outcome is as strong—if not slightly strengthened—following deliberation; so I will modestly raise my forecast.",
            "revised_probability": 88
        },
        "Finance (Asset Price Theory)": {
            "my_phase1_final_probability": 80,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I see broad consensus among expert forecasters from macroeconomics, global wealth reporting, and development studies perspectives, all citing robust evidence for an increase in global average wealth per adult in 2024, led by the US and corroborated by the UBS Global Wealth Report (+4.6%). Many forecasters correctly note strong historical base rates for annual increases and the disproportionate impact of US asset price appreciation. Notably, some critiques highlight possible methodological mismatches between UBS and WID, and mention that currency/FX moves and demographic quirks could potentially surprise to the downside, especially in median metrics or if WID revises historical data. However, the risks cited appear limited and largely theoretical. No forecaster cited credible 2024-specific evidence of a collapse or reversal sufficient to overcome the existing positive aggregate signals. Given this, and the lack of substantive counter-evidence, my subjective probability increases slightly, as the weight of expert synthesis and risk calibration supports confidence.",
            "revised_probability": 85
        },
        "Development Studies (Human Development Theory)": {
            "my_phase1_final_probability": 80,
            "reasoning_for_revised_probability": "The group deliberation broadly reinforced my initial reasoning with nearly all forecasters placing high probabilities (80% or higher) on a Yes outcome, and several providing additional depth about the dominance of top-end wealth growth, historical base rates, and the way the US and major developed countries determine the global average. Key critiques and defenses within the group highlighted that while methodological divergence between UBS and WID remains a remote tail risk, the convergence of independent reporting (UBS, news outlets) and the absence of any systemic crisis in 2024 make such a reversal extremely unlikely. Furthermore, the strongest arguments for caution (e.g., risk of WID using differing population adjustments or abrupt data revisions) were acknowledged by all, but no substantive evidence supports these being decisive for the 2024 reference period. With the new information, the balance of evidence supports a modest probability upgrade: aligning closer to the best-calibrated peers at 85%.",
            "revised_probability": 85
        }
    },
    "revision_probability": [
        91,
        88,
        87,
        85,
        92,
        88,
        85,
        85
    ],
    "revision_mean_probability": 87.625,
    "revision_sd": 2.7222627143085005,
    "revision_probability_result": 88,
    "question_details": {
        "id": 38957,
        "title": "Will global average wealth per adult increase in 2024 compared to 2023?",
        "created_at": "2025-08-31T06:17:40.253360Z",
        "open_time": "2025-09-11T19:01:24Z",
        "cp_reveal_time": "2025-09-11T20:31:24Z",
        "spot_scoring_time": "2025-09-11T20:31:24Z",
        "scheduled_resolve_time": "2025-12-31T22:59:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-09-11T20:31:24Z",
        "actual_close_time": "2025-09-11T20:31:24Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "This question is synced with an identical question on Metaculus. The original question opened on 2025-02-27 12:57:00 and can be found [here](https://www.metaculus.com/questions/35578). This question will resolve to the same value as the synced question. The original question's background info at this time is below. \n\nThe [ <u>World Inequality Database</u> ](https://wid.world/) (WID) tracks inequality and wealth indicators globally. The \"Average national wealth at market value per adult\" measures average wealth per adult in terms of market value, providing insights into global economic changes and wealth distribution. This metric reflects changes in economic conditions, but also dynamics of capital redistribution/concentration.\n\n`{\"format\":\"metac_closes_in_period\",\"info\":{\"post_id\":35578,\"question_id\":35028}}`",
        "resolution_criteria": "The question will be resolved as **Yes** if the [ <u>World Inequality Database</u> ](https://wid.world/) (WID) estimates that the \"[ <u>Median national wealth at market value per adult</u> ](https://wid.world/world/#anweal_p0p100_z/WO/last/eu/k/p/yearly/a/false/48929.56/125000/curve/false/country)\" for 2024 is higher than that in 2023. It will be resolved as **No** otherwise or if the value is equal to or lower.",
        "fine_print": "• If WID does not publish 2024 data by the resolution date, the question will be **void**.\n\n • The comparison will be made with the most recent figure available corresponding to 2023.",
        "post_id": 39580,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Income inequality dipped and fewer people moved, according to largest survey of US life**\nThe U.S. Census Bureau’s American Community Survey shows that from 2023 to 2024 income inequality fell by nearly 0.5 percentage points nationwide, with median household income rising from $80,002 to $81,604. Five Midwestern states—Iowa, Nebraska, Ohio, South Dakota, and Wisconsin—experienced statistically significant decreases in inequality, while North Carolina saw a significant increase. State economists explain the changes: North Carolina’s growth in high‑pay tech jobs and the end of post‑pandemic wage spikes in lower‑pay service roles, South Dakota’s stronger income growth among lower and middle brackets, and Nebraska’s high employment across demographics. In Massachusetts, sluggish growth in high‑pay life‑science and tech jobs has both raised per‑capita income and widened inequality.\n\nDemographically, the U.S. became more diverse: the non‑Hispanic white population fell from 57.1 % to 56.3 %, Asian residents rose from 6.0 % to 6.3 %, and Hispanic residents increased from 19.4 % to 20.0 %. The Black and American Indian/Alaska Native populations remained unchanged at 12.1 % and 1.0 % respectively. Marriage rates declined: men who have never married grew from 37.2 % to 37.6 %, and women from 31.6 % to 32.1 %.\n\nHousing mobility also dropped: only 11 % of residents moved in 2024 versus 11.3 % in 2023, continuing a decade‑long decline driven by rising home‑ownership and rental costs. Median monthly mortgage payments climbed to $2,035 from $1,960, with California ($3,001), Hawaii ($2,937), New Jersey ($2,797), Massachusetts ($2,755), and the District of Columbia ($3,181) reporting the highest costs. Median rent with utilities increased from $1,448 to $1,487.\n\nThe survey, covering 3.5 million households, provides a comprehensive snapshot of U.S. life, noting that 'Income inequality dipped' and that 'fewer people moved' amid rising housing costs.\nOriginal language: en\nPublish date: September 11, 2025 04:01 AM\nSource:[WKMG](https://www.clickorlando.com/news/national/2025/09/11/income-inequality-dipped-and-fewer-people-moved-according-to-largest-survey-of-us-life/)\n\n**UK Beats U.S. For Cross-Border Investment  --  And Offices Lead The Way**\nAccording to Colliers’ first‑half Global Capital Flows report, the UK was the top global destination for cross‑border capital in the 12 months to June, with office assets at the centre of that activity. Europe, the Middle East and Africa is the only region where office investment has overtaken multifamily and industrial, marking a decisive break from global trends. Spain and Italy outperformed their five‑year averages, while the Netherlands lagged, highlighting uneven recovery across the region. The UK also ranked third globally as a source of investment, contributing 9.5% of cross‑border flows in H1, behind only the U.S. and Canada. Global fundraising totals hit $111 B in the first half, or 85% of 2024’s full‑year level. In Europe, allocations have concentrated on the office and industrial sectors; the multifamily sector showed early strength in the first quarter, and data centres attracted 35% of new funds raised, significantly above the 15% average from 2020 to 2024. Monetary policy has added momentum: the eurozone’s inflation rate held at 2% in July, meeting ECB targets, while UK inflation rose to 3.8%. The Bank of England recently cut rates by 25 basis points, yet yield spreads in the region remain more attractive than in the U.S. Colliers Head of Research for Global Capital Markets and EMEA Damian Harrington said, 'EMEA's sector dynamics are shifting,' and added that the resurgence of office investment reflects targeted confidence in core assets, while industrial continues to deliver steady returns.\nOriginal language: en\nPublish date: September 10, 2025 12:36 PM\nSource:[Bisnow](https://www.bisnow.com/london/news/investment/london-offices-lead-out-emea-cross-border-capital-flows-colliers-says-130895)\n\n**Inflation quashed household income gains in 2024, census finds**\nAccording to the U.S. Census Bureau, the median household income in 2024 was $83,730, a slight but not statistically significant increase from $82,690 in 2023. The richest 10% of households saw a 30% rise in pretax income, from $193,700 to $251,000. Black households experienced a 3.3% decline in median income, while Asian and Hispanic households grew about 5%, and white households remained unchanged. Among full‑time, year‑round workers, women earned 80.9% of what men earned, down from 82.7% the previous year. The Gini index, measuring income inequality, did not change significantly from last year. Poverty remained largely unchanged at 10.6%. More than 7 million Americans were pushed into poverty by medical expenses in 2024. The report also noted that inflation offset income gains, leaving most households' real income steady. The article states, 'The richest 10% of households saw their income rise, and women and Black people lost ground,' highlighting the uneven distribution of income changes.\nOriginal language: en\nPublish date: September 10, 2025 09:22 AM\nSource:[The Philadelphia Inquirer](https://www.inquirer.com/business/inflation-income-census-bureau-economy-prices-20250910.html)\n\n**INCOME, POVERTY AND HEALTH INSURANCE COVERAGE IN THE UNITED STATES: 2024**\nThe U.S. Census Bureau released 2024 data showing a real median household income of $83,730, unchanged from the 2023 estimate of $82,690. The official poverty rate fell 0.4 percentage points to 10.6%, with 35.9 million people in poverty. The Supplemental Poverty Measure (SPM) was 12.9%, unchanged from 2023, and Social Security moved 28.7 million individuals out of SPM poverty. Median income rose 5.1 % for Asian households and 5.5 % for Hispanic households, while it fell 3.3 % for Black households; income inequality (Gini) and the 10th‑ and 50th‑percentile incomes remained stable. Among full‑time, year‑round workers, median earnings increased 3.7 % for men, unchanged for women, and the female‑to‑male earnings ratio dropped to 80.9 %. Post‑tax median household income rose 1.8 % to $72,330, and post‑tax Gini was 8.7 % lower than pre‑tax. Health insurance coverage reached 92.0 % (310 million people) in 2024, with private coverage at 66.1 % and public coverage at 35.5 %. Employment‑based insurance covered 53.8 % of the population, followed by Medicare 19.1 %, Medicaid 17.6 %, direct‑purchase 10.7 %, TRICARE 2.8 %, and VA/CHAMPVA 1.2 %. Private coverage increased 0.7 percentage points, while public coverage fell 0.8 percentage points, largely due to a 1.3‑point drop in Medicaid. Private coverage for children under 19 rose to 63.0 % from 61.2 %, and for adults 19‑64 it rose to 74.0 % from 73.1 %. The data were derived from the 2025 Current Population Survey Annual Social and Economic Supplement, with a weighted response rate of 62.0 %.\nOriginal language: en\nPublish date: September 10, 2025 12:00 AM\nSource:[InsuranceNewsNet](https://insurancenewsnet.com/oarticle/income-poverty-and-health-insurance-coverage-in-the-united-states-2024)\n\n**Nation's poverty rate for 2024 shows modest decline, Census survey shows, but analysts say 2025 numbers may reflect economic tumult**\nThe 2025 Census Bureau survey shows the U.S. poverty rate fell to 10.6% in 2024, a modest 0.4 percentage‑point decline from 2023, leaving an estimated 35.9 million people in poverty. The real median household income was $83,730 in 2024, statistically unchanged from $82,690 in 2023. Income gains varied by race: Asian households rose 5.1%, Hispanic households 5.5%, while Black households declined 3.3%. National median incomes were $121,700 for Asians, $92,530 for non‑Hispanic whites, $70,950 for Hispanics, and $56,020 for Blacks. Men’s full‑time, year‑round median earnings increased 3.7% to $71,090, whereas women’s earnings ($57,520) remained flat. The Supplemental Poverty Measure reported a 12.9% poverty rate in 2024, unchanged from 2023. The official poverty threshold for a family of four was $31,812, a figure critics say is too low for high‑cost regions like Long Island. Analysts caution that 2024 data may not capture the economic turbulence expected in 2025. Lawrence Levy remarked, 'As far as the income of everyday Americans goes, the dial hasn't moved much in the last few years, even as the wealthiest got wealthier.' John Rizzo warned, 'With everything that's going on with 2025, I don't think this [2024 data] will tell us much of anything about what to expect next year, which could be significantly worse…' and Jeffrey Reynolds expressed concern over federal budget cuts to SNAP and Medicaid.\nOriginal language: en\nPublish date: September 09, 2025 08:29 PM\nSource:[Newsday](https://www.newsday.com/long-island/census-survey-nations-poverty-rate-xf3c6g1f)\n\n**UK Beats U.S. For Cross-Border Investment  --  And Offices Lead The Way**\nAccording to Colliers’ first‑half Global Capital Flows report, the UK was the top global destination for cross‑border capital in the 12 months to June, with office assets at the centre of that activity. Europe, the Middle East and Africa is the only region where office investment has overtaken multifamily and industrial, marking a decisive break from global trends. Spain and Italy outperformed their five‑year averages, while the Netherlands lagged, highlighting uneven recovery across the region. The UK also ranked third globally as a source of investment, contributing 9.5% of cross‑border flows in H1, behind only the U.S. and Canada. Global fundraising totals hit $111 B in the first half, or 85% of 2024’s full‑year level. In Europe, allocations have concentrated on the office and industrial sectors; the multifamily sector showed early strength in the first quarter, and data centres attracted 35% of new funds raised, significantly above the 15% average from 2020 to 2024. Monetary policy has added momentum: the eurozone’s inflation rate held at 2% in July, meeting ECB targets, while UK inflation rose to 3.8%. The Bank of England recently cut rates by 25 basis points, yet yield spreads in the region remain more attractive than in the U.S. Colliers Head of Research for Global Capital Markets and EMEA Damian Harrington said, 'EMEA's sector dynamics are shifting,' and added that the resurgence of office investment reflects targeted confidence in core assets, while industrial continues to deliver steady returns.\nOriginal language: en\nPublish date: September 10, 2025 12:36 PM\nSource:[Bisnow](https://www.bisnow.com/london/news/investment/london-offices-lead-out-emea-cross-border-capital-flows-colliers-says-130895)\n\n**Inflation quashed household income gains in 2024, census finds**\nAccording to the U.S. Census Bureau, the median household income in 2024 was $83,730, a slight but not statistically significant increase from $82,690 in 2023. The richest 10% of households saw a 30% rise in pretax income, from $193,700 to $251,000. Black households experienced a 3.3% decline in median income, while Asian and Hispanic households grew about 5%, and white households remained unchanged. Among full‑time, year‑round workers, women earned 80.9% of what men earned, down from 82.7% the previous year. The Gini index, measuring income inequality, did not change significantly from last year. Poverty remained largely unchanged at 10.6%. More than 7 million Americans were pushed into poverty by medical expenses in 2024. The report also noted that inflation offset income gains, leaving most households' real income steady. The article states, 'The richest 10% of households saw their income rise, and women and Black people lost ground,' highlighting the uneven distribution of income changes.\nOriginal language: en\nPublish date: September 10, 2025 09:22 AM\nSource:[The Philadelphia Inquirer](https://www.inquirer.com/business/inflation-income-census-bureau-economy-prices-20250910.html)\n\n**Nation's poverty rate for 2024 shows modest decline, Census survey shows, but analysts say 2025 numbers may reflect economic tumult**\nThe 2025 Census Bureau survey shows the U.S. poverty rate fell to 10.6% in 2024, a modest 0.4 percentage‑point decline from 2023, leaving an estimated 35.9 million people in poverty. The real median household income was $83,730 in 2024, statistically unchanged from $82,690 in 2023. Income gains varied by race: Asian households rose 5.1%, Hispanic households 5.5%, while Black households declined 3.3%. National median incomes were $121,700 for Asians, $92,530 for non‑Hispanic whites, $70,950 for Hispanics, and $56,020 for Blacks. Men’s full‑time, year‑round median earnings increased 3.7% to $71,090, whereas women’s earnings ($57,520) remained flat. The Supplemental Poverty Measure reported a 12.9% poverty rate in 2024, unchanged from 2023. The official poverty threshold for a family of four was $31,812, a figure critics say is too low for high‑cost regions like Long Island. Analysts caution that 2024 data may not capture the economic turbulence expected in 2025. Lawrence Levy remarked, 'As far as the income of everyday Americans goes, the dial hasn't moved much in the last few years, even as the wealthiest got wealthier.' John Rizzo warned, 'With everything that's going on with 2025, I don't think this [2024 data] will tell us much of anything about what to expect next year, which could be significantly worse…' and Jeffrey Reynolds expressed concern over federal budget cuts to SNAP and Medicaid.\nOriginal language: en\nPublish date: September 09, 2025 08:29 PM\nSource:[Newsday](https://www.newsday.com/long-island/census-survey-nations-poverty-rate-xf3c6g1f)\n\n**Dazi, Rapporto Coop: 'Timori da conflitti e guerre commerciali'**\nThe preview of the 'Rapporto Coop 2025 – Consumi e stili di vita degli italiani di oggi e di domani' highlights a world increasingly driven by conflict and commercial wars. It reports that military spending reached 2.7 trillion USD in 2024, a 17 % rise over 2022, and that 78 % of opinion leaders surveyed expect more military conflicts in the next 3–5 years, with 18 % fearing a global war. The report notes a decline in globalisation, as half of exporting firms anticipate a drop in trade flows in 2025, and it points to a shift in power: the number of countries trading more with China than the United States rose from 30 to 145 in the last 25 years. Economic growth is projected to be strongest in Asia, with China at +5 % and India at +6 % GDP growth, compared with +1.9 % for the United States and +1 % for the EU. Technological advances, especially AI and humanoid robotics, are seen as potential multipliers of growth, with annual GDP gains that could approach +20 %–+30 %. China leads in patents (5,688 vs 1,483 in the U.S.) and is expected to offer low‑cost humanoids under $15,000. The EU, while economically powerful, is described as a hostage of incomplete governance, with 86 % of respondents supporting a common defence, 78 % favouring fiscal unification, and 75 % backing EU debt issuance. Italy, despite political stability, is projected to grow only 0.5 % annually in 2025–26, with productivity falling by –1.4 % and a widening inequality gap (10 % of the population holding 58 % of wealth). New employment is concentrated in construction, trade, and hospitality, but the labour market remains low‑productivity and low‑wage, with a decline in workers holding a medium‑level licence and a rise in graduates. The report concludes that Italy’s economy is returning to a period of declining productivity and that the country’s wealth is increasingly concentrated in financial and real‑estate returns rather than labour income.\nOriginal language: it\nPublish date: September 09, 2025 12:16 PM\nSource:[Adnkronos](https://www.adnkronos.com/economia/dazi-rapporto-coop-timori-da-conflitti-e-guerre-commerciali_7doScIUhkcqyd0WNagOzhs)\n\n**Taiwan ranks 15th in average wealth per adult | Taiwan News | Sep. 9, 2025 17:04**\nTaiwan has risen to 15th place worldwide in average adult wealth, according to UBS's 2025 Global Wealth Report cited by Taiwan News. The report shows Taiwan's average adult wealth at US$312,075 (NT$9.48 million), surpassing South Korea (20th) and Japan (24th). In the same report, North America leads with US$593,000, followed by Oceania at US$497,000 and Western Europe at US$288,000; Switzerland tops the list, the United States ranks second, and Hong Kong comes third at US$601,000. Taiwan also performed strongly on median wealth, with adult median assets of US$114,871, ranking 17th globally and second only to Hong Kong in Asia. The report notes regional disparities: the Americas grew by over 11% in 2024, while Asia‑Pacific growth was under 3% and Europe, the Middle East, and Africa recorded less than 0.5%; more than half of the 56 surveyed markets experienced declines in average adult wealth. In local currency terms, Denmark registered the highest real average wealth per adult at nearly 13%, and Taiwan grew by more than 5%. The United States and China hold 35% and 20% of global personal wealth, respectively, while Taiwan accounts for 1.3%. Since 2020, South Korea’s average wealth increased by 44%, Norway by 41%, and Taiwan by 35%. The United States leads with 24 million US$ millionaires (39.7% of the world total); Taiwan ranks 15th with nearly 760,000 US$ millionaires. Taiwan’s wealth inequality, measured by the Gini coefficient, is 0.60, ranking it 20th, compared to Brazil’s 0.82. These figures illustrate Taiwan’s significant economic progress and its position among global wealth leaders.\nOriginal language: en\nPublish date: September 09, 2025 09:10 AM\nSource:[Taiwan News](https://taiwannews.com.tw/en/news/6196685)\n\n**OVP’s Three Years: High Interest, Rising Poverty, Growing Wealth Gap**\nThe article argues that the third year of Turkey’s Medium‑Term Programme (OVP) has deepened poverty for workers while enriching capital. It cites a shift from a low‑interest policy in 2021 to a ‘high‑interest’ trajectory after the 2023 elections, with the policy rate rising from 8.5 % to 50 % in mid‑2024 and then to 46 % in March 2025, yet inflation remained around 30 % after three years. In 2023 the state paid 28.4 billion USD in interest; the 2024 burden is projected at 1.2 trillion TL and 2 trillion TL in 2025. Housing rents surged 618 % over three years and bread prices rose 165 %. Unemployment grew from 8.143 million in 2023 to 12.3 million in 2025, a near‑4 million increase. The nominal minimum wage rose from 11 402 TL in July 2023 to 22 104 TL, but its real value fell to 25 131 TL after inflation, a loss of about 3 000 TL for workers. Consumer‑credit volumes jumped 71 % from 1.4 trillion to 2.4 trillion TL, tightening workers’ finances. Pensioners’ share of the population rose from 14 % to 18.5 %, while the share of pension payments in national income fell from 7 % to 6.1 %. The number of people aged 65+ at risk of poverty rose by 1 million to 2.6 million. The article highlights a gap between TÜİK’s inflation figure (64.27 %) and the Istanbul Chamber of Commerce’s cost‑of‑living index (92.97 % in 2022, 74.88 % in 2023). It notes that the number of Turkish billionaires reached 30, with Murat Ülker holding 5.3 billion USD, followed by Şaban Cemil Kazancı (4.4 billion) and Erman İlıcak (3 billion). UBS’s Global Wealth Report 2024 reports 684 k new millionaires worldwide, with Turkey’s share growing 8.4 % to 68 k millionaires. The piece concludes that the ‘rasyonaliteye dönüş’ policy has benefited foreign capital and large firms at the expense of workers, citing the phrase ‘indirim’ patikası and the high‑interest policy as evidence of the government’s priorities. The article uses strong language such as ‘yükselen yoksulluk’ and ‘büyüyen servet uçurumu’ to underscore its critique.\nOriginal language: tr\nPublish date: September 07, 2025 11:59 AM\nSource:[Yeni Evrensel Gazetesi](https://www.evrensel.net/haber/569467/ovpnin-uc-yili-yuksek-faiz-artan-yoksulluk-buyuyen-servet-ucurumu)\n\n**Historic**\nClaudia Sheinbaum, in her first government report, declared that the welfare programs are 'el plan social más ambicioso en la historia de México' and that Mexico is the second country with the lowest inequality in America after Canada, adding '¡Estamos mejor que Cuba!'. The article counters these claims with data: Peru, with a 30 % lower per‑capita GDP, ranks higher in the UN Human Development Index (HDI) – 79 in 2025 versus 81 for Mexico, and 78 versus 76 in 2018. Health coverage data from Cepal show that in 2018 18 % of Mexicans lacked health insurance compared with 24 % in Peru; by 2022 Mexico’s uninsured rate rose to 42 % while Peru’s fell to 14 %. Mexico’s growth was 0.8 % over the last six‑year period, versus 1.7 % for Peru; the Banco de México projects only 0.6 % growth this year. Private investment fell 5 % in Q1 2025 from its Q3 2024 peak, and public investment dropped 24 % because of fiscal constraints. The article cites Tabasco’s growth, driven by public spending on Dos Bocas and the Tren Maya, which did not enhance the region’s potential growth. It also references Venezuela under Chávez, where poverty fell from 42 % in 2000 to 27 % in 2010 but rose to 93 % in 2020, and Bolivia under Morales, which maintained poverty reductions without private investment in natural resources. The piece argues that real wage increases have improved income distribution, yet productivity remains stagnant and formal employment is declining, with 55 % of the workforce in informal jobs. The conclusion stresses that Mexico must achieve higher growth to improve its social indicators.\nOriginal language: es\nPublish date: September 07, 2025 10:32 AM\nSource:[El Siglo de Torreón](https://www.elsiglodetorreon.com.mx/noticia/2025/historico.html)\n\n**The Paradox of the Middle Class: Gaining Weight in Income Distribution but Barely Noticing**\nThe study by CaixaBank Research shows that in Spain the middle‑class share of households grew to 61.5 % in 2023, up 0.4 percentage points from 2022 and 2.3 points from 2007, while the high‑income share fell to 8.1 % from 10.2 % in 2007. The middle‑class income band, defined by the OECD as 75 %–200 % of the median, ranged in 2023 from 14 720 € net per year for a single‑person household to 39 260 € for a two‑adult, two‑child household. In contrast, the high‑class band was 86 837 € for the same household size. Real incomes for the middle and low classes rose faster than for the high class over the last year and since 2007, with the middle class at 41 225 € net per year for a two‑adult, two‑child household. The article attributes this growth to an expanding economic cycle and policies such as a 46.8 % rise in the minimum wage between 2018 and 2023 and pension revaluations linked to inflation. Josep Mestres, economist at CaixaBank Research, notes that real‑income growth for a typical four‑person household was 4 % for the middle class, 6.9 % for the low class and 2.6 % for the high class between 2007 and 2023, and that the average annual real increase for a middle‑class household was only 132 € per month, describing it as a “very small advance in living standards.” The article concludes that while Spain’s middle class is expanding, the overall relative position of households is still heavily influenced by housing status and that the European trend of a slightly shrinking middle class contrasts with Spain’s growth.\nOriginal language: es\nPublish date: September 07, 2025 03:04 AM\nSource:[El Confidencial](https://www.elconfidencial.com/economia/2025-09-07/pradoja-clase-media-gana-peso-pero-apenas-lo-nota_4203620/)\n\n**HESAP ORTADA - Fatoş Özut Kırtay**\nThe article presents a series of statistics that portray Turkey as lagging behind European Union (EU) countries in several economic and social indicators. It claims that indirect taxes account for 65 % of total tax revenue in Turkey, compared with an EU average of 33 % (source: article). Natural gas prices rose 83 % in Turkey last year, versus a 23 % increase worldwide (source). Food inflation reached 30 % in June 2025, placing Turkey at the top of OECD countries, where no other member has a double‑digit food inflation rate (source). Income inequality is highlighted: the richest 1 % hold 40 % of the national wealth, and Turkey ranks first in Europe for unequal income distribution (source). The article also cites that Turkey’s 1 trillion 111 billion lira interest payments and 493 billion lira health spending in the first half of 2025 exceed education spending by 55 % and health spending by 125 % respectively (source). It notes that the average net monthly income in Turkey is 953 Euro, far below the EU average of 2 464 Euro (source). Other figures include a 27.7 % informal employment rate (highest in Europe), a 19.2 % weekend workforce participation versus 37.9 % in Turkey (source), and a 99 % annual education inflation rate (leading among EU members) (source). Housing prices have risen 17‑fold over the past decade, and child labour exceeds 2 million workers (source). The article concludes that Turkey is “leading” in several negative metrics, implying that Europe envies Turkey’s performance.\n\nThe article’s tone is strongly negative and presents these statistics as facts without critical context, using phrases such as 'Türkiye Avrupa'da vergi adaletsizliğinin en yüksek olduğu ülke' and 'Türkiye, Avrupa'da 100 bin kişi başına cezaevinde olan kişi sayısında lider durumda' to emphasize Turkey’s shortcomings.\n\nQuotes used in the article include: 'Türkiye Avrupa'da vergi adaletsizliğinin en yüksek olduğu ülke' and 'Türkiye, Avrupa'da 100 bin kişi başına cezaevinde olan kişi sayısında lider durumda.'\nOriginal language: tr\nPublish date: September 03, 2025 07:03 AM\nSource:[gebzehaber.net](https://www.gebzehaber.net/hesap-ortada-8382yy.htm)\n\n**Vietnam's 80-year rise: From poverty to global economic prominence**\nVietnam celebrated its 2025 National Day by announcing that its economy has become the 34th largest worldwide, with a 2024 GDP of $476.3 billion. The country’s per‑capita income rose to $4,700 in 2024, approaching upper‑middle‑income status. In a single autumn day in 2025, Vietnam broke ground on 250 major infrastructure projects with an investment of 1.28 quadrillion VND (≈$52.5 billion). The article attributes the transformation to the 1986 Doi Moi reforms, noting that GDP grew from $8 billion in 1986 to $476.3 billion in 2024—a 60‑fold increase. It cites Nguyen Bich Lam, former General Director of the General Statistics Office, who said, 'Doi Moi has been the engine of economic development for four decades, abolishing the old command economy.' The article also reports that in 2023 GDP reached 10.32 quadrillion VND and in 2024 exceeded 11.5 quadrillion VND, and that gross national income rose from 39.28 trillion VND in 1990 to nearly 10 quadrillion VND in 2023. Foreign direct investment (FDI) disbursement in the first half of 2025 rose 8.1 % year‑on‑year to $11.7 billion, while pledged FDI grew 32.6 % to $21.5 billion. The article quotes business leaders such as Phan Minh Thong and Chau Minh Thi praising the government’s pro‑business policies. It also notes that Vietnam’s export turnover reached $405.53 billion in 2024, about 85 % of GDP. The piece concludes with a discussion of new administrative reforms, four resolutions (57, 59, 66, 68), and projections that sustained 9 % GDP growth from 2026‑2030 could lift per‑capita GNI to $22,600 by 2045.\nOriginal language: en\nPublish date: September 03, 2025 01:18 AM\nSource:[VietNamNet News](https://vietnamnet.vn/en/vietnam-s-80-year-rise-from-poverty-to-global-economic-prominence-2438708.html)\n\n**Inequality Is Not a Natural Law but a Political Choice**\nThe article argues that inequality is a political choice, not a natural law, and calls for systemic change. It cites that the ten richest individuals earned an average of $100 million per day in 2024, while 60 % of their wealth comes from inheritance, market power and tax privileges, not innovation. It notes a net outflow of $263 billion from the Global South to the richest 1 % in 2024, and that more than 2.8 billion people worldwide live on less than $6.85 a day, with 65 % of countries experiencing rising income inequality. The piece quotes economists such as Mariana Mazzucato, who describes the financial sector as a closed system that extracts value, and Thomas Piketty, who warns that inherited wealth erodes democratic legitimacy. It highlights recent protests, including the 2025 Economic Blackout in the U.S. and May 2025 May Day demonstrations, as evidence of growing public frustration. The author calls for progressive capital taxes, inheritance and gift taxes, and strong anti‑tax‑avoidance measures, framing them as democratic fundamentals rather than radical proposals. The article stresses that without structural fiscal reforms, inequality will deepen, fueling social unrest and authoritarian tendencies. It concludes that a political revolution—prioritising public interest over profit—is necessary for a fairer global order, especially as the upcoming UN Social Development Summit in Doha (Nov 2025) seeks a new consensus on social justice and inclusive multilateralism.\nOriginal language: nl\nPublish date: August 26, 2025 08:06 AM\nSource:[MO*](https://www.mo.be/opinie/ongelijkheid-is-geen-natuurwet-maar-het-gevolg-van-politieke-keuzes)\n\n**UBS Report: Hungary Leads Europe in Citizens' Well-being Growth**\nAccording to the UBS 'Global Wealth 2025' report, Hungary showed the largest increase in citizens' well-being in Europe over the past year, followed by Lithuania and Sweden. In contrast, Turkey saw a significant decline of 20.9%. The report states that the median wealth per adult increased in most European countries between 2023 and 2024. Hungary had the highest real growth in median wealth per adult, at 18.6%. Significant growth of over 15% was also seen in Lithuania (16.9%), Sweden (15.3%), Italy, and Latvia (both 15%). Among the top five European economies, Italy showed the highest real growth in median wealth per adult, at 15%. The lowest growth was seen in the UK, at 5.3%. France (10.3%), Germany (9.5%), and Spain (9%) were in between. Outside of Europe, significant growth was seen in South Korea (13.9%), Australia (10.7%), Canada (9.6%), and Japan (8.6%). The US saw a small growth of 2.3%, while China and Russia saw a notable decline of 6.3% and 8.2% respectively. 'The decline in real median wealth per adult in this period was mainly driven by high inflation in the respective countries, especially in Austria, Belgium, and the Netherlands, as well as in Italy, although to a lesser extent,' the report notes. 'Growth in the number of adults also contributed to this, primarily in the Netherlands and to a lesser extent in Switzerland.' \nOriginal language: uk\nPublish date: July 30, 2025 12:23 AM\nSource:[ГЛАВКОМ](https://glavcom.ua/world/world-economy/v-jakikh-krajinakh-jevropi-bahatijut-najshvidshe-rejtinh-ubs-1070718.html)\n\n**US Remains World Leader in Wealth, But Concentration of Wealth Remains a Concern**\nThe United States remains the world's leader in wealth, with over 23.8 million millionaires, representing nearly 40% of the global total, according to a new report by UBS. The country added over 379,000 new millionaires in 2024, with a 1.5% annual increase. China continental came in second, with a 2.3% increase to 6.3 million millionaires. Turkey saw the largest percentage increase, with its millionaire population rising 8.4% to 87,000. The global number of millionaires increased by over 684,000 to nearly 60 million, driven largely by the rise in property values. However, the volatility of the US dollar and commercial uncertainty weigh on the prospects for wealth creation in the US for 2025. UBS economist James Mazeau said, 'It's too early to say if wealth growth in the US will slow down this year.' A weaker dollar could actually boost wealth in countries without dollars. Mazeau also noted that US housing prices have remained resilient and that stocks could end 2025 above current levels. 'This year could be lower than last year, but that doesn't mean we'll see a change in fortune and see negative wealth creation,' he said. 'I don't think the growth engines are dead in the US, not at all.' The wealth remains concentrated, even among the ultra-rich. UBS found that 60 million millionaires worldwide have a combined wealth of $226.47 trillion, nearly half of the world's total wealth. The top 2,860 individuals qualify as ultra-high net worth individuals, controlling $15.7 trillion in assets. The top 15,000 individuals, each with over $100 billion in assets, have a total of $2.4 trillion. Even among the ultra-rich, Mazeau noted, 'We see concentration of wealth or, I'd say, inequality of wealth.' He attributed the concentration to the superior performance of the technology sector and the rise of 'mega tech entrepreneurs.' While the US represents nearly 40% of the world's millionaires, Luxembourg and Switzerland have a higher density of wealth. In both countries, more than one in seven adults has assets worth at least $1 million, according to UBS. Some regions, including Japan, experienced decreases in the number of millionaires, and Japan lost 33,000 due to demographic changes. Meanwhile, Singapore, Qatar, Greece, and Poland significantly increased their ranks, while the wealth of ultra-high net worth individuals fell dramatically in the Netherlands and Uruguay. The 'millionaires of the masses' surpass the ultra-rich in total wealth. UBS emphasized that most wealth gains are occurring at the middle levels. The number of people with between $1 million and $5 million, the so-called 'millionaires of the day,' has quadrupled since 2000 and now stands at around 52 million. Together, they control more wealth than all ultra-high net worth individuals. 'Often, the increase in wealth is overlooked and is directed towards the middle of the herd,' Mazeau said. He added that limited data on those in the range of $50 million to $1 billion distorts public perceptions of wealth inequality. With the expansion of global wealth and the emergence of new trends in asset ownership, UBS expects the composition of the world's rich to continue evolving, even if volatility and policy changes create obstacles along the way.\nOriginal language: es\nPublish date: June 19, 2025 01:18 PM\nSource:[Invezz](https://invezz.com/es/noticias/2025/06/19/el-numero-mundial-de-millonarios-alcanza-los-60-millones-informa-ubs-hogar-de-ee-uu-para-el-40/)\n\n**Global Wealth Grows 4.6% in 2024, Led by US and China**\nGlobal wealth grew 4.6% in 2024, four-tenths more than in 2023, driven by growth in wealth in America (11%), according to the new UBS report on wealth in major economies. Switzerland again topped the list, followed by the US, which rose to second place. The median wealth per adult citizen rose to $687,166 in Switzerland, while in the US, two places ahead of 2023, it was $620,654, according to a ranking in which Hong Kong again occupied third place and Luxembourg fell two places to fourth. The UK remained in 13th place, with an average wealth of $339,700, France fell to 16th (301,503), Germany to 19th (256,715), and Spain and Italy occupied 22nd and 23rd places, with average wealth of $233,739 and $214,663 respectively. The 16th edition of the report, published by UBS in 2023, noted that despite the overall increase, half of the 56 markets studied experienced a decline in median wealth per adult. In the chapter dedicated to millionaires in the world (almost 60 million with combined assets of $226 billion, according to UBS), it was indicated that the number of people in this situation increased by 1.2% last year, or 684,000 more people with a wealth of over $1 million. Almost 40% of them (23 million, 379,000 more than in 2023) are in the US, while China occupies second place in this ranking, with 6.3 million, followed by France (2.8 million), Japan (2.7 million) and Germany (2.6 million). The UK, also with 2.6 million, is in sixth place, while Italy is ninth (1.3 million), Spain 12th (1.2 million) and in Latin America, both Brazil (433,000) and Mexico (399,000) are among the 25 countries with the most millionaires. According to the study, the largest segment of the population in the world is that of adults with a wealth between $10,000 and $100,000 (1.57 billion people, 41% of the total), which has surpassed for the first time this decade the number of people who do not exceed $10,000 (1.55 billion, 40%). At the top of the pyramid, 2,860 people in the world have wealth between $1,000 and $50,000 million, 16 between $50,000 and $100,000 million, and 15 exceed those $100,000 million. According to the UBS report, global wealth has grown on average 3.4% annually over the past century, although there have been exceptions such as in 2022, when it experienced a decline of 3%. The Swiss bank expects that in the coming years the upward trend will continue, led by the US, China, Latin America and Oceania. The report expects that in the next 20 or 25 years, $83 billion in wealth will be transferred, of which $74 billion will be inherited by descendants and the rest will be transferred horizontally between spouses. The US will lead these transfers, worth $29 billion, followed by Brazil ($9 billion) and China ($5 billion).\nOriginal language: es\nPublish date: June 19, 2025 08:47 AM\nSource:[Portafolio.co](https://www.portafolio.co/internacional/la-riqueza-global-crecio-4-6-en-2024-lideran-suiza-y-ee-uu-633375)\n\n**UAE Adds 13,000 New Millionaires in 2024, Bringing Total to 240,343**\nAccording to the 16th edition of the Global Wealth Report 2025 by UBS, the UAE added around 13,000 new millionaires in 2024, bringing the total number of high-net-worth individuals in the country to 240,343. The total wealth of these individuals is estimated to be around $785 billion, with an average wealth of $147,663 per adult. The UAE saw a growth of 5.8% in the number of millionaires in 2024, making it the second-fastest growing market in the world in attracting high-net-worth individuals after Turkey, which saw a growth of 8.4% in the number of millionaires. The report also expects the UAE to see wealth transfer transactions worth $19 billion in the coming period, whether between generations or between spouses, which is equivalent to 1.4% of the country's total private wealth. Globally, wealth saw a growth of 4.6% in 2024, after a growth of 4.2% in 2023, reflecting its continued upward trend. However, the growth rate was uneven. Neil Zelken, Head of Wealth Management for the Middle East at UBS Global Wealth Management, said, 'This year's UBS report highlights the growing role of the Middle East in global wealth dynamics, particularly for the UAE and Saudi Arabia, which are seeing an increase in the number of millionaires and a significant growth in average wealth, with the UAE's average wealth increasing by over 23% since 2020. As we expect total wealth transfers of around $122 billion, the two markets are entering a critical phase of intergenerational transfer.' The value of wealth increased significantly in North America, with the Americas accounting for the largest share of the increase, exceeding 11%, due to the stability of the US dollar and the recovery of financial markets. In 2024, adults in North America were the wealthiest, with an average wealth of $593,347, followed by Oceania ($496,696) and Western Europe ($287,688). However, when measured in US dollars and adjusted for inflation, more than half of the 56 markets surveyed did not contribute to the global wealth growth last year, with the average wealth of adults declining significantly. Switzerland continued to lead the list of countries in average wealth per adult, followed by the United States, Hong Kong, and Luxembourg. Denmark, South Korea, Sweden, Ireland, Poland, and Croatia recorded the highest increases in average wealth, with all of them growing by double-digit numbers (in local currencies). The United States, China, and France had the largest number of millionaires with their wealth valued in US dollars, with the United States accounting for around 40% of the world's millionaires. Over the past 25 years, global wealth has seen a sustained and significant growth, with a compound annual growth rate of 3.4% since 2000. The report highlights a growing category of millionaires, often overlooked, known as 'daily millionaires' who have investable assets between $1 million and $5 million. The number of these individuals has increased more than four times since 2000, reaching around 52 million people worldwide at the end of last year. A daily millionaire is an individual who has a net worth of $1 million or more, lives a normal life, and has a regular job. It does not require them to be exceptionally wealthy or famous, but rather ordinary people who have achieved this level of wealth through smart financial habits and wise investments. The total value of the wealth of this category is around $107 trillion, and the value of their assets approaches that of individuals with wealth exceeding $5 million, valued at around $119 trillion. The growth of this category is largely due to rising property prices and exchange rate effects. Despite regional differences, the long-term upward trend in the category of daily millionaires is clear worldwide. Over the next 20 to 25 years, it is expected that more than $83 trillion will be transferred, with 9 trillion dollars expected to be transferred horizontally between spouses, and 74 trillion dollars between generations. It is expected that the United States will have the largest wealth transfer transactions (over $29 trillion), followed by Brazil (around $9 trillion), and China (over $5 trillion).\nOriginal language: ar\nPublish date: June 18, 2025 08:40 PM\nSource:[البيان](https://www.albayan.ae/economy/business/uae-economy/119311)\n\n**Global Wealth Increases by 4.6% in 2024, According to UBS Report**\nAccording to the UBS Global Wealth Report 2025, global wealth has increased by 4.6% in 2024, driven by a 11% growth in wealth in the Americas. Switzerland topped the list, followed by the United States. The average wealth per adult citizen in Switzerland was $687,166, while in the US it was $620,654. The UK maintained its 13th position with an average wealth of $339,700, while France fell to 16th with $301,503, and Germany ranked 19th with $256,715. Spain and Italy ranked 22nd and 23rd, respectively, with average wealth of $233,739 and $214,663. Despite the increase, half of the 56 markets analyzed saw a decline in average wealth per adult. The report also found that the number of millionaires worldwide increased by 1.2% in 2024, with 60 million people holding combined assets of $226 trillion. The US accounted for around 40% of these millionaires, with China, France, Japan, and Germany following. Brazil and Mexico led the list of 25 countries with the most millionaires in Latin America. The report also noted that the segment of the population with wealth between $10,000 and $100,000 saw a significant increase, surpassing the number of people with less than $10,000 in wealth. UBS predicts that in the next 20-25 years, there will be a significant transfer of wealth of $83 billion, with women set to benefit from changes in both intragenerational and intergenerational wealth transfer.\nOriginal language: es\nPublish date: June 18, 2025 06:24 PM\nSource:[Vanguardia](https://vanguardia.com.mx/dinero/aumenta-la-riqueza-global-en-un-46-en-2024-segun-un-informe-de-ubs-PB16352841)\n\n**Global Wealth Grows 4.6% in 2024, Led by Switzerland and the US**\nGlobal wealth grew by 4.6% in 2024, led by Switzerland and the US, according to a new report by UBS on wealth in major economies. The report found that the average wealth per adult citizen increased to $687,166 in Switzerland and $620,654 in the US, with Hong Kong ranking third and Luxembourg falling to fourth. The UK remained in 13th place with an average wealth of $339,700, while France fell to 16th ($301,503) and Germany to 19th ($256,715). Spain and Italy ranked 22nd and 23rd, respectively, with average wealth of $233,739 and $214,663. The report noted that despite the overall increase, half of the 56 markets studied experienced a decline in average wealth per adult. The number of millionaires worldwide increased by 1.2% to 59.8 million, with combined assets of $226 trillion. The US accounted for nearly 40% of these individuals, followed by China, France, Japan, and Germany. The report also found that the segment of the population with wealth between $10,000 and $100,000 grew to 1.57 billion people, surpassing those with wealth below $10,000 for the first time. The report predicts that global wealth will continue to grow, led by the US, China, Latin America, and Oceania, with a transfer of $83 trillion in wealth expected over the next 20-25 years, with 74 trillion being inherited by descendants and the rest transferred horizontally between spouses.\nOriginal language: es\nPublish date: June 18, 2025 02:45 PM\nSource:[Forbes México](https://forbes.com.mx/la-riqueza-mundial-crecio-un-4-6-en-2024-liderada-por-suiza-y-eu/)\n\n**Global Wealth Increases by 4.6% in 2024, with Switzerland Maintaining Top Spot**\nAccording to a recent UBS study, global wealth has increased by 4.6% in 2024, following a 4.2% growth in 2023. The Swiss have maintained their top spot, with a median wealth of $687,200 per adult (net of debt). The United States ranks second, followed by Hong Kong, Luxembourg, and Australia. The ranking changes when considering median wealth, with Luxembourg, Australia, and Belgium leading the way. The number of millionaires has increased by 1.2% in 2024, with the United States, China, and France having the largest number of individuals with a net worth of over $1 million. The report also highlights the growth of the 'EMILLI' segment, which includes individuals with investable assets between $1 and $5 million. This group has quadrupled in size since 2000, reaching around 52 million people globally. 'The last 25 years have seen a marked and constant growth of wealth globally, both overall and in the main regions,' said UBS experts. 'From 2000, the annual progression has been 3.4%.' The report projects a continued increase in median wealth over the next five years, driven by the United States, China, Latin America, and Oceania. 'Wealth is not just an economic measure, but a social and political force,' said UBS economist Paul Donovan. 'As we face the fourth industrial revolution and increasing public debt, how wealth is distributed and transferred will influence opportunities, policies, and progress.'\nOriginal language: it\nPublish date: June 18, 2025 01:36 PM\nSource:[www.Bluewin.ch](https://www.bluewin.ch/it/attualita/borsa-economia/nel-2024-la-ricchezza-mondiale-aumentata-al-primo-posto-svizzeri-2746075.html)\n\n**Global Wealth Grows by 4.6% in 2024, Led by North America**\nAccording to the annual 'Global Wealth Report' by UBS, the global wealth of individuals grew by 4.6% in 2024, reaching approximately $470 trillion ($406 trillion euros). This is an acceleration from the 4.2% growth in 2023. The largest increase was seen in North America, with a 11.4% growth, driven by strong financial markets. In contrast, the average wealth of adults in the Asia-Pacific region grew by 2.9%, while in Europe, the Middle East, and Africa, it only increased by 0.4%. In over half of the 56 markets studied, the value of financial assets and real estate decreased. Switzerland topped the wealth ranking list, with an average adult wealth of $687,000 in 2024. The United States followed, while Germany ranked 19th with $257,000 and Austria ranked 21st with $244,000. UBS predicts further growth in the average wealth per adult over the next five years, led by the United States, China, Latin America, and Oceania.\nOriginal language: de\nPublish date: June 18, 2025 12:00 AM\nSource:[oe24.at](https://www.oe24.at/businesslive/so-viel-vermoegen-besitzt-der-durchschnittliche-oesterreicher/637670113)\n\n",
    "date": "2025-09-11T19:10:24.514373",
    "summary": "All seven forecasting experts agree that it is highly probable the global average wealth per adult will increase in 2024 compared to 2023, based on available data and historical trends. Their forecasts, drawing on various economic, financial, and developmental frameworks, consistently cite the following key themes:\n\n1. Base Rate/Historical Trend: In most years, global average wealth per adult tends to rise, with only rare exceptions during systemic crises (e.g., 2008, 2022). This persistent upward trajectory forms a strong baseline for expecting a positive 2024 outcome.\n\n2. UBS and Market Data Consensus: Reports by UBS and secondary media sources consistently indicate a 4.6% increase in global wealth in 2024, especially driven by strong asset price growth in North America (notably an 11% increase in the US). This trend is echoed by other data compilers like Forbes and supported by macroeconomic indicators.\n\n3. Regional Divergence: While over half of the analyzed countries saw local declines in wealth per adult (often due to inflation or currency movements), these declines are outweighed at the global level by robust gains in the largest and wealthiest economies (US, Canada, some parts of Asia, Switzerland).\n\n4. Currency and Inflation Effects: Fluctuations in exchange rates and high inflation in some countries somewhat offset global gains, but the reporting—typically in nominal USD—means that strong US and dollar-denominated asset performance still lifts the global average.\n\n5. Wealth Concentration: The growth is especially marked among high-wealth individuals, with increasing numbers of millionaires and large gains at the upper end pulling up the global average even as some regions and median measures stagnate.\n\n6. Risk Factors: The biggest uncertainties identified are potential late methodological or reporting changes by WID, extreme late-in-year shocks, or substantial currency crises. Experts generally judge such risks as low given current evidence.\n\nProbabilities expressed by experts are uniformly high, ranging from 80% to 91% in favor of 'yes'—that global average wealth per adult increases in 2024. All recognize some downside tail risk, but see no sign in available economic or financial data of a reversal large enough to offset strong gains in major wealth centers. Regional weaknesses, increased inequality, and local crises are assessed as important but not decisive at the global aggregate level, particularly given the outsized influence of North America in the global figures.\n\nIn sum, the expert consensus clearly expects that global average wealth per adult will be higher in 2024 than in 2023, supported by multiple convergent lines of economic, financial, and reporting evidence.",
    "forecasters": [
        "Wealth Management (Global Wealth Reporting Standards)",
        "Macroeconomic Analysis (Economic Indicator Analysis)",
        "International Organizations (World Bank Global Economic Prospects)",
        "Economics (Neoclassical Growth Theory)",
        "Economics (Kuznets Hypothesis)",
        "Finance (Portfolio Theory)",
        "Finance (Asset Price Theory)",
        "Development Studies (Human Development Theory)"
    ]
}