{
    "deliberation_results": {
        "Military Strategy (Doctrine of National Emergency)": {
            "time_to_resolution": "Approximately 23 days until November 5, 2025.",
            "perspective_relevance": "As an expert in Military Strategy focused on the Doctrine of National Emergency, I bring essential contextual understanding of when and why states sustain, lift, or refine emergency powers—including martial law—during protracted wars. Ukraine’s situation uniquely combines military necessity, national mobilization, civil resilience, sovereignty threats, political legitimacy, and international signaling. This lens is critical for predicting martial law's extension, emphasizing the interplay of military imperatives, public mood, elite consensus, and outside actors.",
            "status_quo": "Martial law has been continuously in force since February 2022, extended every 90 days. There is no indication of a cessation of hostilities or a durable peace agreement in the immediate future, and both the presidency and the Rada (parliament) have routinely renewed the measure as a matter of wartime procedure.",
            "perspective_derived_factors": [
                {
                    "factor": "Strategic military stalemate and ongoing war",
                    "effect": "Strongly increases probability. Doctrine and precedent dictate martial law remains until existential hostilities subside or a peace deal is in place. Current frontline and negotiation deadlock suggest war will continue past November 5, 2025."
                },
                {
                    "factor": "Political legitimacy under martial law",
                    "effect": "Increases probability. Although fatigue exists over delayed elections, survey data show only 11% favor holding elections while war continues. A critical mass supports continuation of the status quo for now; Zelensky still commands 60% approval, sufficient for parliamentary support."
                },
                {
                    "factor": "Parliamentary and elite signals",
                    "effect": "Moderately increases probability. While minor parliamentary dissent is increasing (e.g., MP Anna Skorohod’s opposition), all prior extensions passed handily. No major coordinated elite movement signals credible threat to block renewal."
                },
                {
                    "factor": "International support and signaling",
                    "effect": "Slightly increases probability. Western backers have tolerated martial law as necessary for wartime governance. EU/NATO accession arguments are used by critics but have not translated to external pressure for lifting martial law in absence of peace."
                },
                {
                    "factor": "War weariness and public discontent",
                    "effect": "Slightly decreases probability. Desertion, economic hardship, and nascent opposition (both societal and within the Rada) introduce risk, particularly of symbolic protest votes. However, masses do not demand a return to peacetime procedures in current threat environment."
                },
                {
                    "factor": "Potential surprise breakthrough in negotiations or military collapse",
                    "effect": "Decreases probability. If a credible and substantial ceasefire or collapse were to occur before November 5, martial law might lapse or be reformed. However, current signals—stalemated negotiations, systemic attrition—make such a scenario unlikely within the time window."
                }
            ],
            "no_scenario": "In the event of a dramatic and credible ceasefire/peace agreement announced in the last week of October 2025, martial law might not be renewed. Alternatively, if a political crisis or elite revolt (e.g., within Rada or key ministries) forced through a legislative or judicial override against Zelensky’s wishes—combined with sudden mass civil unrest—martial law could lapse. However, there is currently little evidence to support this outcome. Even opposition MPs are only beginning to express reservations, not outright revolt.",
            "yes_scenario": "Hostilities persist at current or greater intensity; Russia continues strikes on Ukrainian territory; no meaningful ceasefire is in sight. Parliament reconvenes and—as in all prior cycles—approves another 90-day extension as a procedural wartime necessity, with most MPs and the public deferring elections and civil liberties issues to post-conflict timeframes.",
            "final_reasoning": "We are three weeks from expiry. The doctrine of national emergency compels retention of martial law while existential military threat persists, unless a clear peace or defeat emerges. All signals—military (ongoing fighting, continued evacuations, Russian strikes), political (opposition only calling for postwar normalization, Zelensky retaining legitimacy), and procedural (parliamentary inertia)—point to extension. History (base rate): Ukraine has extended martial law 16 times; there is no precedent for letting it lapse under ongoing external attack. War exhaustion and minor legislative dissent are rising, but are insufficient to override entrenched doctrine, especially as the majority of public and elite actors appear to accept temporary civil restriction as necessity in context of war survival. I therefore assess an extremely high likelihood Ukraine extends martial law beyond November 5, 2025.",
            "final_probability": 97
        },
        "Comparative Law (Martial Law Legal Standards)": {
            "time_to_resolution": "Approximately 23 days (until November 5, 2025)",
            "perspective_relevance": "As an expert in Comparative Law with a focus on Martial Law Legal Standards, I bring insight into the legal rationales, historical parallels, legislative processes, and typical government behaviors regarding martial law, especially in democracies facing existential threats. This expertise is crucial to assess both legal/constitutional constraints and the socio-political calculus surrounding martial law extension in Ukraine.",
            "status_quo": "Since February 2022, martial law has been consistently renewed by the Ukrainian government in response to ongoing Russian aggression, with each extension essentially treated as automatic due to the war’s persistence. Elections are suspended, mobilization continues, and the government’s legitimacy is mostly rooted in defense imperatives.",
            "perspective_derived_factors": [
                {
                    "factor": "Continuing Armed Conflict/Stalemate",
                    "effect": "Strongly increases probability. As the war shows no signs of ending soon, the Ukrainian government will see martial law as indispensable for national security, troop mobilization, and social order. The frontlines remain active; neither negotiations nor a ceasefire are imminent."
                },
                {
                    "factor": "Legal Precedent and Parliamentary Practice",
                    "effect": "Increases probability. The repeated, routinized extensions of martial law have established a strong precedent. The Ukrainian Verkhovna Rada (parliament) has shown no effective institutional resistance to executive requests to extend martial law, as long as the war continues."
                },
                {
                    "factor": "Public and Political Attitudes toward Elections and Martial Law",
                    "effect": "Moderately increases probability. Polling indicates that Ukrainians largely accept the need for martial law until the war ends (only 11% favor elections now), and while President Zelenskyy’s popularity has dipped since wartime highs, he still holds substantial public legitimacy. Political opposition criticizes extensions for 'authoritarianism,' but this is in the minority and lacks enough leverage to block extensions."
                },
                {
                    "factor": "International Pressure and Western Legitimacy Concerns",
                    "effect": "Slightly decreases probability. Prolonged martial law and postponed elections could eventually alienate Ukraine’s Western backers and strain the official narrative of liberal democracy, particularly for EU and NATO integration goals. However, given the existential threat, allies have until now accepted martial law as unavoidable."
                },
                {
                    "factor": "Potential Military or Political Breakthroughs",
                    "effect": "Decreases probability only if a major change occurs—e.g., peace deal, armistice, or internal political crisis—by November 5. All current indicators point to continued deadlock and attritional conflict, making this a remote scenario."
                },
                {
                    "factor": "Comparative Historical Precedent",
                    "effect": "Increases probability. Countries under existential military threat tend to maintain martial law or similar emergency regimes for the duration of hostilities (e.g., Israel, South Korea during invasions, Finland during WWII), often suspending elections and certain liberties as tolerated by the public."
                }
            ],
            "no_scenario": "A scenario resulting in a 'No' would require a dramatic and rapid shift, such as a surprise diplomatic breakthrough leading to a durable ceasefire or peace settlement before November 5, or a sudden loss of parliamentary support (perhaps triggered by overwhelming popular protests or an elite split) that blocks martial law renewal. Current data shows no such trends: frontline stalemate persists, negotiations are deadlocked, and the parliament has consistently complied with executive proposals.",
            "yes_scenario": "The much more likely scenario is that, as the current period nears expiration, President Zelenskyy will again propose extending martial law for another 90 days, citing ongoing hostilities, and the Rada will almost certainly comply. With no ceasefire or peace in sight, martial law’s continuation is justified under both legal precedent and public expectation. Parliamentary opposition may voice criticism, but cannot muster the votes or public momentum to block extension; Western allies may grumble but will continue to tolerate extensions as long as the war rages.",
            "final_reasoning": "All available evidence supports the expectation that martial law will be extended again. Legally, the precedent is entrenched and there are no parliamentary or constitutional obstacles. Practically, the war remains at a stalemate with intense hostilities; there is no imminent peace process or ceasefire. Politically, while opposition voices criticize authoritarian drift and election postponement, these carry little sway against the overwhelming logic of national defense in wartime emergency. Public polling still heavily supports retaining martial law until the war ends. International partners may press for normalization but continue to accept Kyiv’s security rationale. Given typical state behavior under martial threat and Ukraine’s consistent legal and parliamentary patterns, extension is overwhelmingly likely barring a dramatic and unforeseen breakthrough.",
            "final_probability": 95
        },
        "Regional Security Analysis (Black Sea Regional Security)": {
            "time_to_resolution": "Approximately 23 days (until November 5, 2025)",
            "perspective_relevance": "As an expert in Black Sea Regional Security, I have in-depth understanding of the complex interplay between ongoing military threats, national mobilization, Ukrainian political legitimacy, domestic pressures, and how international perceptions of martial law and war footing affect the viability and survival of states bordering and interacting with the Black Sea. My focus brings granular appreciation of how security imperatives in the region (especially in a grinding war context) shape state decisions to maintain extraordinary measures such as martial law.",
            "status_quo": "Ukraine has continually extended martial law in 90-day increments since the start of the Russian invasion. As of now, the martial law is set to expire November 5, 2025, but has never been allowed to lapse during active conflict. There are no signs that the security situation or the legal/constitutional debate has reached decisive change.",
            "perspective_derived_factors": [
                {
                    "factor": "Ongoing high-intensity conflict and absence of a ceasefire",
                    "effect": "Strongly increases probability. With both sides locked in a stalemate and military activity remaining high, the main original rationale—defense against invasion—remains fully operative."
                },
                {
                    "factor": "Domestic political legitimacy and opposition pushback",
                    "effect": "Slightly decreases probability. Multiple MPs and political actors, as well as increasing critical mass in civil society, signal discomfort and criticize martial law as tool to avoid elections and entrench power. However, only 11% of Ukrainians currently desire elections during wartime, and Zelenskyy maintains majority public trust (60%)."
                },
                {
                    "factor": "Public mood/electoral politics",
                    "effect": "Marginally decreases probability, but only postwar. Most Ukrainians express desire for elections and leadership change once the war ends, but a clear majority accept the lack of elections as legitimate necessity while Russia is at war. Presently, status quo is tolerated."
                },
                {
                    "factor": "International support and scrutiny (especially from U.S. and EU)",
                    "effect": "Neutral to slightly increases probability. While foreign partners crave Ukrainian democracy and transparency, current war footing plus ongoing aid flows and security imperatives outweigh those concerns. Criticism of 'authoritarianism' is not matched by credible pressure to roll back martial law without a peace deal."
                },
                {
                    "factor": "Russian conduct and intentions",
                    "effect": "Increases probability. As Russia continues military pressure and signals no real shift toward ceasefire or withdrawal, Ukraine needs legal/regulatory flexibility for mobilization, defense, and internal security—making martial law indispensible in the government's eyes."
                },
                {
                    "factor": "Base rates of emergency law persistence in similarly embattled states",
                    "effect": "Strongly increases probability. Countries in prolonged existential wars (e.g., Israel in past wars, Armenia/Azerbaijan during recent conflicts) tend to renew such powers uninterrupted until clear de-escalation or peace."
                },
                {
                    "factor": "Elite and legislative consensus",
                    "effect": "Moderately increases probability. Until now, martial law extensions have passed easily. While recent parliamentarians are voicing opposition, institutional incentives (power retention, national security narrative, risks of sudden elections) mean most decision-makers will support extension while war continues."
                }
            ],
            "no_scenario": "A No outcome would require a major strategic shift: either a sudden, durable ceasefire/peace agreement with Russia (which seems unlikely given front-line stalemate and no diplomatic breakthrough), a breakdown in elite consensus making parliamentary approval of extension impossible (which current trends don’t support), or a dramatic rise in public unrest/opposition forcing the government to relinquish emergency powers out of fear for regime survival (no signs of this, as public tolerance for martial law remains high).",
            "yes_scenario": "A Yes outcome materializes if the current dynamics persist—stalemated war, lack of negotiations, continued Russian strikes, military pressures requiring mobilization, consistent renewal of martial law by parliament despite grumblings. Government will argue that legal and existential justifications remain, even as opposition reluctantly acquiesces and public puts postwar politics ahead of current safety. A routine parliamentary extension or continued status quo would suffice.",
            "final_reasoning": "All key factors (military context, elite incentives, historical base rates, popular legitimacy) point strongly toward the extension of martial law. The security situation remains volatile and unresolved; the war’s end is not in sight; the majority of the public and mainstream political actors accept martial law as a necessity for survival, even amid rising opposition. While criticism of 'authoritarianism' and war exhaustion is mounting, none of these trends have so far translated into concrete legal obstacles or a sufficient popular backlash to block extension, and there is no evidence of imminent ceasefire or peace that would allow authorities to relax emergency powers. Given the base rate of similar regimes at war, and absent a sudden reversal on the battlefield or at the negotiation table, extension is all but certain.",
            "final_probability": 95
        },
        "Political Science (Democratic Resilience Theory)": {
            "time_to_resolution": "23 days until November 5, 2025",
            "perspective_relevance": "As an expert in Political Science specializing in Democratic Resilience Theory, my perspective is uniquely relevant: I focus on how democracies withstand crises such as war, evaluating the legitimacy, institutional constraints, and long-term consequences of executive emergency powers, including martial law extensions. This helps assess whether Ukraine will maintain, lift, or transition away from martial law.",
            "status_quo": "Ukraine has continuously extended martial law in 90-day increments since February 2022. The current period expires November 5, 2025. Both political and military elites treat extended martial law as the default wartime governance structure. Parliamentary and presidential elections remain on hold, justified as necessary due to ongoing hostilities.",
            "perspective_derived_factors": [
                {
                    "factor": "War Stalemate and Security Situation",
                    "effect": "Strongly increases probability of martial law extension. All credible reporting indicates the military situation remains at a deadlock with high-intensity fighting; neither side is close to victory nor to peace talks. The war justifies continued emergency powers, especially as the frontline situation remains highly unstable."
                },
                {
                    "factor": "Public and Elite Attitudes toward Pre-War Elections",
                    "effect": "Increases probability. Polls show only 11% of Ukrainians want elections before the war ends, with a clear majority accepting continued wartime governance (martial law suspension of elections), while Zelenskyy retains around 60% trust. Although some opposition is surfacing, the public generally does not demand democratization or rapid normalization at this stage."
                },
                {
                    "factor": "Democratic Institutional Constraints",
                    "effect": "Slightly decreases probability but not decisively. There is emerging domestic criticism (e.g., MPs refusing to back future extensions) and claims Zelenskyy is pursuing 'authoritarianism.' However, criticism is mainly focused on post-war political arrangements and corruption—not on an immediate, organized push to halt martial law before the war ends."
                },
                {
                    "factor": "Western and International Pressures",
                    "effect": "Neutral to slightly decreases probability. Western partners have some concern about democratic backsliding, but as of late 2025, they overwhelmingly support Ukraine’s wartime emergency measures. There is little evidence of coordinated, high-pressure campaigns to force Ukraine to resume regular elections or governance at this moment."
                },
                {
                    "factor": "Possibility of Sudden Peace Deal or Major Ceasefire",
                    "effect": "Strongly decreases probability—but is a very low-likelihood event by early November. Negotiations remain stalled, the war is predicted by analysts to drag on, and no major summit is expected before the expiration date."
                },
                {
                    "factor": "Elite Fracture or Coup",
                    "effect": "Very slightly decreases probability. While there is protest within the Rada and signs of elite frustration, there is no credible sign of an imminent split that could deny Zelenskyy the ability to extend martial law."
                },
                {
                    "factor": "Precedent and Base Rate",
                    "effect": "Strongly increases probability. Ukraine has extended martial law 16 consecutive times without interruption or political crisis; in comparable post-Soviet and other states at war, martial law is almost never lifted until hostilities stop."
                }
            ],
            "no_scenario": "A major, unexpected peace breakthrough or unconditional ceasefire is achieved through U.S.-Russia mediation or internal Ukrainian negotiation, making martial law redundant and unlocking suspended democratic elections. Alternatively, a sudden parliamentary revolt or shock elite split blocks Zelenskyy’s extension motion in the Rada, ending martial law abruptly—but no current evidence supports such events.",
            "yes_scenario": "The military situation and negotiations remain deadlocked; Russia continues military operations; there are no credible diplomatic breakthroughs. Parliament, despite vocal opposition from a small number of MPs, approves martial law extension as it has reliably done since 2022, supported by prevailing majority sentiment and public acceptance. Zelenskyy’s government faces no insurmountable procedural or legitimacy barriers.",
            "final_reasoning": "Ukraine’s democratic legitimacy is under mild, but not critical, threat from martial law extensions. However, the realities of ongoing high-intensity conflict, relative political unity, a public used to wartime governance, and overwhelming base rate precedent for such measures make an extension beyond November 5, 2025, extremely likely. There is no credible sign of a decisive peace deal, elite fracture, or political push for rapid normalization in the next three weeks. The only plausible off-ramp—an extraordinary diplomatic breakthrough—has extremely low odds as per the news and expert analysis. Considering these factors, Democratic Resilience Theory suggests martial law is durable under existential threat, especially given elite unity and ongoing public support.",
            "final_probability": 97
        },
        "Political Science (Civil-Military Relations)": {
            "time_to_resolution": "23 days",
            "perspective_relevance": "As an expert in Political Science specializing in Civil-Military Relations, I focus on the dynamics between civilian leadership, political legitimacy, military necessity, and the institutionalization of emergency powers. Ukraine’s civil-military relationship is critical here: martial law is both a tool for national defense and a lever that concentrates political authority, overriding ordinary democratic processes such as elections. Understanding historical precedents for military emergency rule, the conditions under which such rule is continued or lifted, and elite/public attitudes toward exceptional authority inform a rigorous, base-rate-driven forecast.",
            "status_quo": "Martial law in Ukraine has been continuously extended in 90-day increments since February 2022 and is currently set to expire November 5, 2025. There is a history of automatic renewal so long as significant hostilities with Russia persist.",
            "perspective_derived_factors": [
                {
                    "factor": "Ongoing major hostilities",
                    "effect": "Increases probability. Cross-referencing war reporting and recent news shows no major peace settlement or enduring ceasefire; experts predict a protracted war of attrition. The Ukrainian security environment remains acute, justifying martial law on military necessity grounds."
                },
                {
                    "factor": "Political legitimacy and public support",
                    "effect": "Slightly decreases probability, but limited impact pre-resolution. While surveys indicate waning enthusiasm for Zelenskyy post-war, there is still a 60% approval rating and the vast majority of the public opposes wartime elections, validating the continuation of martial law for now."
                },
                {
                    "factor": "Institutional inertia",
                    "effect": "Strongly increases probability. Once martial law is imposed, historical base rates (globally and with reference to Ukraine since 2022) show emergency regimes are rarely lifted mid-conflict. Parliament and executive have repeatedly collaborated on routine, uncontentious renewals."
                },
                {
                    "factor": "Domestic and international elite contestation",
                    "effect": "Weakly decreases probability. Increasing opposition within the Rada and EU/NATO integration concerns point to pressure against continued suspension of normal democracy. However, such opposition seems disunited and ineffective absent a change in the war’s status."
                },
                {
                    "factor": "Potential for breakthrough in diplomacy",
                    "effect": "Decreases probability only if a truce or clear roadmap to peace is reached. However, the news points to ongoing deadlock in negotiations, even amid some diplomatic overtures. No imminent end to hostilities is forecast."
                },
                {
                    "factor": "Military necessity & mobilization regime",
                    "effect": "Strongly increases probability. Multiple sources indicate significant battlefield attrition and need to sustain mobilization across society, which is only legal under martial law. Reports of high desertion and mobilization fatigue are, if anything, an argument for the executive to maintain these powers, not relinquish them."
                }
            ],
            "no_scenario": "A No outcome would require a substantive change of circumstance, specifically: (1) a political settlement or functioning durable ceasefire between Ukraine and Russia before November 5, 2025, with associated demobilization and clear public shift to support elections; or (2) a successful parliamentary or mass elite challenge which blocks or votes down extension of martial law, forcing a return to peacetime constitutional order—despite incomplete security guarantees.",
            "yes_scenario": "A Yes outcome follows if the status quo persists: No significant peace agreement is reached, war continues, political opposition is disunited or lacks sufficient strength to block renewal, and government cites enduring national security imperatives to pass a further 90-day extension, as has happened 16 times consecutively.",
            "final_reasoning": "Base rates for wartime emergency rule throughout history, and specifically in Ukraine since February 2022, strongly favor extension in the continued absence of a peace settlement. The frontlines remain in strategic deadlock with active fighting, substantial civilian and infrastructure attacks, and substantial mobilization requirements. Both executive and parliamentary institutions have shown a pattern of uncontentious renewals, and even mounting parliamentary dissent is limited by public reluctance to hold elections during war. International criticism (authoritarian drift) is mostly linked to concerns about Ukraine’s post-war alignment and is unlikely to override perceived national survival imperatives. There is, as yet, no clear indication of circumstances (ceasefire, truce, or decisive elite rebellion) that would end martial law in less than one month. I weight the plausibility of a breakthrough surprise low (<10%); all key path dependencies favor an extension.",
            "final_probability": 94
        },
        "International Relations (Security Dilemma)": {
            "time_to_resolution": "Approximately 3 weeks (question resolves on November 5, 2025; forecast made on October 13, 2025).",
            "perspective_relevance": "As an expert in International Relations with a focus on the security dilemma, my perspective emphasizes how persistent external threats, perceptions of insecurity, and fear of exploitation/miscalculation incentivize states to maintain extraordinary domestic security measures like martial law. The ongoing military standoff and uncertainty in Ukraine create strong incentives, as predicted by security dilemma logic, for continuity in restrictive governance to avoid perceived vulnerability.",
            "status_quo": "Since February 2022, Ukraine has continuously extended martial law in response to Russian aggression. The situation at the front remains a protracted war of attrition, with neither side obtaining a decisive advantage or signaling imminent diplomacy that could remove the core security threats. Unless a major political-military breakthrough occurs, the default expectation is that martial law will be extended.",
            "perspective_derived_factors": [
                {
                    "factor": "Ongoing military conflict and security dilemma",
                    "effect": "Greatly increases probability. The war’s persistence and both sides’ inability to find a settlement ensure Ukraine faces an acute security dilemma—relaxing martial law could expose vulnerabilities if the adversary remains hostile. Base rate of martial law extensions in active or frozen conflicts is extremely high."
                },
                {
                    "factor": "Domestic political legitimacy and opposition",
                    "effect": "Modestly decreases. While surveys show declining enthusiasm for Zelenskyy post-war, only 11% support elections during wartime. Most citizens appear to accept martial law under current security threats, despite rising opposition criticism—parliamentary dissent is increasing, but not dominant."
                },
                {
                    "factor": "External pressure (Western partners, Russia)",
                    "effect": "Slightly decreases. There is international concern (including accusations of authoritarian drift), but Western countries prioritize Ukraine’s survival and combat effectiveness. Formal insistence on elections or lifting martial law is not presently strong, especially absent a ceasefire."
                },
                {
                    "factor": "Legal/institutional inertia",
                    "effect": "Increases. Sixteen consecutive extensions have established a routinized precedent, with existing legislative mechanisms to renew martial law for 90-day increments. No procedural barriers are evident for another extension."
                },
                {
                    "factor": "Military/political developments (ceasefire or settlement)",
                    "effect": "Would sharply decrease IF occurred, but such events are not in evidence. Negotiations are deeply stalled, and frontline changes have yielded only minor territory shifts in 2025; no imminent breakthrough is reported."
                }
            ],
            "no_scenario": "A 'No' outcome could plausibly occur if—within the next three weeks—Ukraine and Russia reach a ceasefire or meaningful de-escalation (possibly mediated by the U.S. or EU), reducing the immediate threat environment. This could give Zelenskyy’s administration the space to allow martial law to expire, either under significant international/factional pressure or to pivot toward domestic political normalization (e.g., reinitiating plans for elections). There is currently minimal indication of such a breakthrough or compelling pressure for immediate liberalization.",
            "yes_scenario": "A 'Yes' outcome occurs if, as is strongly indicated by present events, the frontline remains militarily active or tense, negotiations are stalled, and no ceasefire or lasting de-escalation occurs. In this case, the government will justify maintaining martial law, highlighting security risks, demoralization/desertion, recent infrastructure strikes, and incomplete mobilization as reasons. Parliament passes the 17th extension, in keeping with the established pattern.",
            "final_reasoning": "The preponderance of evidence supports a strong expectation of martial law extension past November 5, 2025. Fundamentally, the ongoing war generates an acute, unresolved security dilemma for Kyiv: given persistent and significant Russian threat (active fighting, missile/drone strikes, and infrastructure attacks), removing extraordinary security measures would be contrary to core state survival logic. Domestic discontent with the postponement of elections is present but not great enough to override perceived security needs; in fact, only a small minority supports elections before a ceasefire, and Zelenskyy retains sufficient legitimacy to pass another extension. The opposition in parliament is notable but not sufficient to block renewal, and established practice ensures legal/institutional ease in renewal. There is no evidence of an imminent ceasefire or diplomatic resolution, and international partners are not pressing for removal of martial law now. Base rates for martial law persistence in similarly unresolved, high-intensity conflicts are very high (80-90%+). Consequently, the probability of extension is near-certain, though not absolute due to the small chance of a shock diplomatic or internal political event in the next three weeks.",
            "final_probability": 96
        },
        "International Relations (International Conflict Theory)": {
            "time_to_resolution": "Approximately 23 days (until November 5, 2025).",
            "perspective_relevance": "International Conflict Theory emphasizes the resilience of emergency powers under existential threat, states’ tendency to centralize authority during protracted conflict, and the domestic-political incentives for leaders to extend states of exception when the war status quo persists. These theories illuminate how the institutional, material, and legitimacy conditions in Ukraine inform the likely decision about martial law.",
            "status_quo": "Ongoing martial law extensions every 90 days since February 2022; elections indefinitely postponed; government cites continued existential Russian threat as justification.",
            "perspective_derived_factors": [
                {
                    "factor": "Ongoing Military Stalemate/Conflict",
                    "effect": "Increases probability. The stalemate and continued hostilities create strong incentives for Kyiv to maintain martial law, both for mobilization and central control."
                },
                {
                    "factor": "Public Opinion and Regime Legitimacy",
                    "effect": "Slightly increases probability. While public trust in Zelenskyy has declined from wartime peak, 60% approval and only 11% favoring elections before war’s end suggest limited domestic pressure to repeal martial law, as most Ukrainians recognize continued existential risk."
                },
                {
                    "factor": "Parliamentary Support and Domestic Dissent",
                    "effect": "Slightly decreases probability. The most recent parliamentary vote to suspend local elections until martial law ends, and some MPs voicing opposition, indicate mounting, but still minority, resistance to repeated extensions."
                },
                {
                    "factor": "International Pressure and Integration Goals",
                    "effect": "Slightly decreases probability. Accusations of authoritarianism and concerns about EU/NATO integration due to prolonged martial law may eventually exert pressure, but so far, major Western states prioritize Ukraine’s sovereignty/security over procedural democracy in the circumstances of war."
                },
                {
                    "factor": "Precedent and Base Rate",
                    "effect": "Strongly increases probability. Ukraine has extended martial law 16 times, and there are no historical cases since 2022 of not renewing while conflict is ongoing. Precedent base rate is extremely high unless battlefield or diplomatic breakthrough occurs."
                },
                {
                    "factor": "Peace Negotiations and Ceasefire Prospects",
                    "effect": "Decreases probability, but weakly. Hopes for negotiations persist, especially with signals from Trump–Putin, yet both sides are entrenched and analysts (e.g., ISW) expect continuing attrition; peace before November 5 is highly unlikely absent sudden, drastic events."
                }
            ],
            "no_scenario": "In an unlikely breakthrough, direct negotiations between Russia, Ukraine, and Western powers (facilitated by US/Trump administration mediation) lead to an actual, sustained ceasefire and commencement of peace talks. Ukraine’s government, bolstered by Western security guarantees, lets martial law expire to resume normal constitutional order as a signal to the domestic and international audience. Elections are scheduled and government restores peacetime legal norms.",
            "yes_scenario": "The most realistic scenario is ongoing war of attrition with no ceasefire by November 5, 2025. The Zelenskyy administration, citing continued Russian aggression, energy infrastructure threats, and the necessity of mobilization, proposes the 17th extension. The Rada passes it (perhaps with louder but still minority dissent), martial law is extended through at least early 2026, and elections remain postponed.",
            "final_reasoning": "The war remains very much unresolved, with military and political dynamics stuck in an attritional stalemate. There are no credible signs of a near-term ceasefire or comprehensive settlement between now and the November 5 deadline. Public legitimacy for martial law—while eroding—is still workable, and there is no mass opposition or majority parliamentarian bloc against extensions. The base rate is near 100%, as Ukraine has never failed to renew during the war, and only 11% of the public supports elections before a peace deal. Even with growing war fatigue, the justifications for maintaining martial law remain—in Ukrainian legal-political logic—a national security imperative. While modest international and domestic pressure is mounting, neither appears decisive in the short window left. There may be slightly more overt parliamentary opposition, but this is unlikely to prevent renewal. Thus, the rational forecast is a very high probability of extension.",
            "final_probability": 96
        },
        "Slavic and East European Studies (Post Soviet State Transformation)": {
            "time_to_resolution": "Approximately 3 weeks until resolution (question resolves on or after November 5, 2025; today is October 13, 2025).",
            "perspective_relevance": "As an expert in Slavic and East European Studies focusing on Post-Soviet State Transformation, I have deep knowledge of martial law’s use in post-Soviet transitions, the durability of emergency regimes, war-related state-building, and patterns of executive power during crises in the region. I am also familiar with the interplay between military necessity, public legitimacy, and international pressures in Ukraine, as well as base rates drawn from Ukrainian history and the broader post-Soviet space.",
            "status_quo": "Martial law has been in continuous effect since February 24, 2022 and extended every 90 days (16 times so far) due to the ongoing Russian war. There is no practical precedent post-2022 for lifting martial law while the conflict endures or is stalemated.",
            "perspective_derived_factors": [
                {
                    "factor": "Military Stalemate/Ongoing Hostilities",
                    "effect": "Increases probability. As long as active conflict or credible threat exists, the government has legal and normative cover to extend martial law, especially with frontline insecurity and continued Russian attacks."
                },
                {
                    "factor": "Political Utility of Martial Law for Incumbent Leadership",
                    "effect": "Increases probability. Martial law suspends elections and gives the executive extraordinary powers. Zelenskyy’s legitimacy is being debated, but public opinion still grants him broad wartime leeway. Opponents in parliament challenge extensions, but regime stability is currently prioritized."
                },
                {
                    "factor": "Public Opinion and Social Fatigue",
                    "effect": "Marginally decreases probability. Fatigue over martial law is noted, with growing calls for postwar accountability and normalcy. However, surveys consistently show strong (if waning) public legitimacy for wartime executive powers, and little support for elections until war’s end (only 11%)."
                },
                {
                    "factor": "International Pressures (Western Support, Russian Negotiation Rhetoric)",
                    "effect": "Neutral to slightly increasing probability. Western partners have criticized authoritarian drift, but continue aid and do not condition support on immediate restoration of elections. Russia’s use of martial law as a negotiation wedge paradoxically encourages Ukraine to maintain strict regime continuity to avoid perceived internal division."
                },
                {
                    "factor": "Base Rates in Ukraine and Post-Soviet States",
                    "effect": "Strongly increases probability. In post-Soviet/Eastern European states under existential security threat, emergency regimes have exceptionally high persistence—emergency rules are seldom lifted with a stalemated/active war and without clear security guarantees."
                },
                {
                    "factor": "Parliamentary/Elite Pushback",
                    "effect": "Slightly decreases probability. Some MPs (e.g., Anna Skorohod) have publicly opposed martial law extensions. Still, parliamentary votes have consistently favored extensions by wide margins, with elite interests tied to regime continuity during crisis."
                }
            ],
            "no_scenario": "A substantive ceasefire or meaningful, durable progress in peace negotiations is announced before November 5, leading to a government move to restore constitutional order and lift martial law in order to (1) prepare for elections, (2) rebuild public legitimacy, and (3) assure Western partners of a return to democratic procedures. Alternatively, an unexpected domestic political upheaval (such as mass unrest, a parliamentary/congressional vote against extension that cannot be overridden, or a sudden major change in the military balance making martial law unnecessary) could see parliament refuse to extend martial law.",
            "yes_scenario": "Continuing military stalemate (as described in most articles), persistent Russian attacks, no breakthrough in negotiations, and the government (with parliamentary backing) citing ongoing existential risk to security as the basis for extending martial law for the 17th time, likely for another 90 days. Criticism is voiced by opposition parties and some civil society elements, but the overwhelming logic of ‘not changing horses midstream’ holds sway, and the extension passes. Government uses ongoing conflict to justify postponement of elections.",
            "final_reasoning": "The overwhelming weight of evidence—both directly in these news articles and from structural analysis—points toward another extension of martial law beyond November 5, 2025. Active hostilities continue, no credible peace settlement looms, and base rates for lifting emergency regimes in these conditions are extremely low, especially given the political utility martial law confers in suspending elections and controlling domestic threats. Some parliamentary and civil society dissent is manifesting, and public war fatigue is growing, which slightly lowers the probability from absolute certainty, but these remain marginal compared to the durable status quo. International pressure remains insufficient to trigger imminent change. The risk for a surprise No is largely tied to a sudden peace breakthrough, which news coverage and expert commentary currently judge as highly unlikely before November 5, 2025.",
            "final_probability": 95
        }
    },
    "deliberation_probability": [
        97,
        95,
        95,
        97,
        94,
        96,
        96,
        95
    ],
    "deliberation_mean_probability": 95.625,
    "deliberation_sd": 1.0606601717798212,
    "deliberation_probability_result": 96,
    "group_results": {
        "MilitaryStrategyDoctrineOfNationalEmergency": {
            "forecaster_to_engage": "PoliticalScienceDemocraticResilienceTheory",
            "response_type": "critique",
            "response": "Your approach leans a bit too heavily on 'relative political unity' and 'wartime habituation' as if these factors are structural guarantees against short-term disruption. Democratic Resilience Theory is useful, but in the context of mass mobilization and protracted existential warfare, it consistently underestimates the degree to which elite bargaining and military necessity—not democratic habit—drive emergency extension. You mention 'mild, but not critical, threat' to legitimacy, but the reality is that in the face of war, democratic norms are often rapidly hollowed out by the imperatives of survival, especially when the legal base rate for martial law continuation is near-absolute. Your frame risks misreading the tempo of elite-institutional adaptation and public tolerance for extraordinary measures under attack; Ukraine is less an experiment in resilience right now and more in hard-nosed national security calculus. Don't let the trappings of theoretical balance obscure the overwhelming force of doctrine and history here."
        },
        "ComparativeLawMartialLawLegalStandards": {
            "forecaster_to_engage": "InternationalRelationsSecurityDilemma",
            "response_type": "defense",
            "response": "The International Relations (Security Dilemma) perspective gets to the core of why martial law's extension is near-certain: existential threats compel states to retain emergency powers essentially regardless of internal legitimacy grumbling or minor parliamentary protests. When faced with a live, proximate adversary like Russia, the overriding logic of state survival prevails—making all other factors, including the Western preference for democratic processes, subordinate. The analysis rightly weights both legal and empirical base rates, demonstrating that the persistence of martial law is a rational response to enduring external threat. It is not public opinion or diluted parliamentary dissent that matters in these conditions, but the relentless logic of the security dilemma."
        },
        "RegionalSecurityAnalysisBlackSeaRegionalSecurity": {
            "forecaster_to_engage": "SlavicAndEastEuropeanStudiesPostSovietStateTransformation",
            "response_type": "critique",
            "response": "You get close to the core with your structural analysis and focus on post-Soviet patterns, but you let the specter of public war fatigue and 'growing parliamentary and civil dissent' dent your probability too much. In the post-Soviet context—especially in wartime—public fatigue rarely translates into concrete institutional or legal change until the existential danger subsides. The idea that elite control over media, suppression of opposition, and crisis politics do anything but enhance the staying power of martial law is, if anything, understated in your reasoning. The risk of a sudden breakthrough is properly noted, but your weight on 'some' dissent as a meaningful factor is overblown given Ukrainian elite and security service discipline under fire. In short: inertia and security logics remain far more dominant here, making your 95% probability arguably a bit too tamely reasoned for the real on-the-ground incentives."
        },
        "PoliticalScienceDemocraticResilienceTheory": {
            "forecaster_to_engage": "ComparativeLawMartialLawLegalStandards",
            "response_type": "defense",
            "response": "This analysis nails the hierarchy of decision pressures: legal precedent, institutional comfort with the status quo, and the war’s unremitting logic all make extension overwhelmingly likely. Comparative law delivers a critical reminder that emergency norms are not simply abstract ideals—when codified and repeatedly ratified in the face of ongoing existential threat, they harden into political habit. Your forecast rightly downplays the rhetorical bite of critics and foregrounds the lack of any meaningful procedural or constitutional friction. The only slight gap is perhaps not underlining how state behavior under siege almost universally defaults to continuity of emergency powers, something your perspective definitely implies. In sum: you recognize the difference between legalistic squabbles and the durable logic of martial law under fire. Well-argued."
        },
        "PoliticalScienceCivilmilitaryRelations": {
            "forecaster_to_engage": "RegionalSecurityAnalysisBlackSeaRegionalSecurity",
            "response_type": "defense",
            "response": "Your reasoning is solid—perhaps the sharpest blend of empirical base rate analysis and sober appreciation for wartime elite incentives here. You’re right to stress that historical precedent and ongoing security imperatives trump elevated, often Western-tinged anxieties about 'authoritarian drift' or 'rising but contained' opposition. In wartime Ukraine, the unity of the national security apparatus, cross-factional political inertia, and deep popular risk-aversion regarding elections converge overwhelmingly in favor of extending martial law. Anyone who lets themselves be swayed by amplified dissent risks confusing democratic aspirations with the much starker military-political logic at play. Your argument is not only persuasive but steeped in a realistic regional understanding: the war’s unresolved nature means the reversion to peacetime norms is simply not on the table."
        },
        "InternationalRelationsSecurityDilemma": {
            "forecaster_to_engage": "MilitaryStrategyDoctrineOfNationalEmergency",
            "response_type": "critique",
            "response": "You're leaning so hard on the doctrine of national emergency it borders on deterministic dogma. Yes, existential threat 'compels' emergency measures, but if you strip away nuance, you miss the interplay of agency, legitimacy calculus, and conditional elite unity that's central to how and why martial law survives. Your 'all signals point to extension' brush-off underplays the seeds of ongoing elite bargaining and the subtle, cumulative impact of war fatigue—both inside the Rada and in civil society—that could, in a surprise scenario, tip the scales. Moreover, your historical base rate invocation is a crutch: even among high-threat cases, truly infinite extension always bumps up against legitimacy crises eventually. Doctrine matters, but it's not invincible—if the regime gets rattled by economic collapse, mass protest, or fragmentation in the officer corps, doctrine alone won't save extension. You'd do well to at least nod at these destabilizing undercurrents, even if you still put the probability sky-high."
        },
        "InternationalRelationsInternationalConflictTheory": {
            "forecaster_to_engage": "ComparativeLawMartialLawLegalStandards",
            "response_type": "defense",
            "response": "This forecast cuts to the heart of the matter: the repeated entrenchment of martial law is both a function of legal-institutional inertia and a direct product of the war’s unresolved status. Comparative law provides the right framework to assess how, under persistent existential threat, extensions become more than exceptional—they become the default political-legal order. Criticisms about 'authoritarian drift' are acknowledged but, critically, shown to be functionally irrelevant in the absence of either a peace breakthrough or a collapse in elite consensus. By refusing to be distracted by normative Western standards or isolated dissent, this analysis accurately mirrors the pattern of state behavior in extreme security crises—not just in Ukraine, but across historical cases. The near-certainty in their probability is justified and the argument stands out for both clarity and empirical rigor."
        },
        "SlavicAndEastEuropeanStudiesPostSovietStateTransformation": {
            "forecaster_to_engage": "MilitaryStrategyDoctrineOfNationalEmergency",
            "response_type": "critique",
            "response": "You treat the doctrine of national emergency as if it's an immutable law of physics, not a contingent set of practices deeply shaped by bureaucratic negotiations, elite interests, and—critically—the presence of war fatigue and logistical strain. Your framing glosses over the cracks showing in Ukraine's system: mounting cases of desertion, open parliamentary dissent (however minor), and unmistakable public appetite (though not majority) for postwar normalization. While you nod to these, you don't meaningfully account for how such tensions historically precede—or even trigger—surprise regime pivots under pressure, especially in the post-Soviet space where leadership sometimes overestimates the duct tape holding the system together. Yes, the overwhelming odds favor extension, but dogmatism about 'entrenched doctrine' risks missing the fact that all it takes is one crisis of confidence, or domestic legitimacy backlash, to test even the most deeply rooted emergency regime. You owe your audience a more nuanced scenario analysis, even if you still end up close to certainty."
        }
    },
    "revision_results": {
        "Military Strategy (Doctrine of National Emergency)": {
            "my_phase1_final_probability": 97,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, especially the forecast by the Democratic Resilience Theory expert, it is clear that no major counterpoint or overlooked risk has emerged. My critique of their focus on democratic resilience versus emergency doctrine strengthened my original rationale: martial law extension is far more tied to national security imperatives and elite calculus than moderate trends in public or institutional sentiment. All other forecasters are also clustered between 94 and 97, citing identical historical base rates, deeply entrenched procedural momentum, and lack of decisive elite or military rupture. No new information has emerged in the deliberation to diminish the overwhelming likelihood of extension. Therefore, I maintain my initial very high probability.",
            "revised_probability": 97
        },
        "Comparative Law (Martial Law Legal Standards)": {
            "my_phase1_final_probability": 95,
            "reasoning_for_revised_probability": "Group deliberation, notably from the Military Strategy and Security Dilemma perspectives, reinforced the overwhelming dominance of the existential military threat and established legal routines in driving policy, even more than I had emphasized. No new credible evidence for a rapid peace breakthrough or institutional defection—and base rates for extension remain virtually absolute. On the other hand, critique of over-emphasizing democratic resilience rightly underscores that, under current realities, parliamentary or public resistance remains deeply secondary to the unyielding imperative of national defense. Thus, if anything, the deliberation marginally increases my already high confidence, suggesting the odds are very slightly closer to certainty.",
            "revised_probability": 97
        },
        "Regional Security Analysis (Black Sea Regional Security)": {
            "my_phase1_final_probability": 95,
            "reasoning_for_revised_probability": "Upon reviewing the group deliberation, I noted widespread concurrence among experts from varied perspectives—military doctrine, legal standards, security dilemma, international conflict theory, and post-Soviet transformation—that the overwhelming force of precedent, the logic of state survival, and the current ongoing war leave almost no plausible scenario for martial law to lapse in the next three weeks. My initial rationale was disciplined by recognition of mounting civil/political dissent and war fatigue, but almost all other forecasters were even more emphatic that these factors are marginal while existential threats persist. Critiques around not overweighing 'democratic resilience' or signs of parliamentary restiveness further convince me that the chance of a 'No' outcome is very remote absent a shock event—which is inconsistent with all available news and analyses. Therefore, I see a stronger consensus for a more extreme forecast.",
            "revised_probability": 97
        },
        "Political Science (Democratic Resilience Theory)": {
            "my_phase1_final_probability": 97,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, my overall assessment remains nearly unchanged. The discourse affirms that all relevant perspectives—legal, military, political, and regional—land on the same conclusion: the prevailing security environment and the Ukrainian elite’s patterns overwhelmingly support extension of martial law. Critiques correctly point out that any signals of public or parliamentary fatigue are currently only rhetorical and lack the institutional force to produce a different outcome. No substantive new risks to the baseline scenario have been introduced by peers; if anything, the dominant tone was that my own approach may slightly overemphasize the theoretical resilience angle, but even those critiques argue for even firmer confidence in extension. No additional evidence of a credible short-term path to peace or elite rupture has emerged. Therefore, I will hold my original calculated extremely high probability, nudging it up one point to reflect the consistent consensus that any scenario for a 'No' outcome is even less likely than I initially acknowledged.",
            "revised_probability": 98
        },
        "Political Science (Civil-Military Relations)": {
            "my_phase1_final_probability": 94,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, there is strong and nearly unanimous expert consensus across all relevant domains—military strategy, international relations, comparative law, regional analysis—that the extension of martial law is a near-certainty. No new information or arguments surfaced that would suggest a greater likelihood of a 'No' outcome; if anything, the high confidence articulated by the Military Strategy and Political Science (Democratic Resilience) perspectives affirms that base rates and institutional inertia are even more dominant than I initially weighted. Any effect of elite dissent or public fatigue is confirmed to be marginal or less impactful than I may have signaled. Thus, I now see the probability as marginally higher, reflecting the overwhelming convergence of logic and base rate historical analogs.",
            "revised_probability": 96
        },
        "International Relations (Security Dilemma)": {
            "my_phase1_final_probability": 96,
            "reasoning_for_revised_probability": "Group deliberation strongly reinforced the logic underpinning my initial forecast: every major perspective—military strategy, comparative law, regional security, and international relations—converges on the overwhelming probability of martial law extension, citing a high base rate, persistent existential threats, and stable elite/institutional alignment. Critiques in the group highlighted the dangers of neglecting weak signals of potential destabilization, such as parliamentary dissent or civic fatigue; however, these were widely dismissed as insufficient to alter the near-certainty established by the security imperative and political routine.\n\nNo forecaster credibly argued for a probability meaningfully below 94-97%. In fact, scrutiny of other arguments (especially those relying solely on doctrine or base rates) suggests a .5–1 percentage point ceiling for remaining uncertainty, reserved solely for unforeseen 'black swan' events (e.g., sudden collapse of unity, diplomatic shock). As no such destabilizing factors are present or credibly forecast, I see no reason to lower my estimate.\n\nHowever, in light of the sharpness of the group consensus and the logical possibility—however remote—of a rapid breakdown in parliamentary or elite consensus in the closing days before November 5, nudging the probability a single point upwards to 97 (in line with the highest consensus in the group, and maximizing calibration-reward tradeoff for this contest) is justified.",
            "revised_probability": 97
        },
        "International Relations (International Conflict Theory)": {
            "my_phase1_final_probability": 96,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, the robust consensus among experts rooted in military doctrine, legal precedent, regional security dynamics, and comparative state behavior strongly reinforces the initial logic for an extremely high forecast. Defenses of the comparative law and security dilemma perspectives highlight that criticisms related to democratic backsliding or parliamentary dissent remain relatively marginal given the ongoing existential threat and the wartime state's overwhelming incentive to preserve emergency powers. Critiques of other forecasts that pushed for even higher probabilities due to institutional inertia and security imperatives bolster my initial assessment. There is a near-unanimity (94-97%) that—absent an unforeseen and drastic breakthrough—the extension is all but assured. Given this, I see no compelling reason to revise my probability downward. If anything, the cohesion of group expertise would nudge me slightly higher, but in the interest of well-calibrated forecasting (and to retain some allowance for tail risk: surprise system shock, elite fracture, or black swan negotiation), I will hold at 96%.",
            "revised_probability": 96
        },
        "Slavic and East European Studies (Post Soviet State Transformation)": {
            "my_phase1_final_probability": 95,
            "reasoning_for_revised_probability": "Having reviewed the group deliberation, I find broad consensus across diverse methodological perspectives (military, legal, political science, international relations) on a near-certain extension of martial law. None can identify a plausible mechanism for a sudden collapse of elite consensus or a diplomatic breakthrough before the deadline. Critiques of over-reliance on doctrine and base rates are fair—reminding us to consider war fatigue, elite fissures, and legitimacy shocks—but even these voices acknowledge that the probability of rapid institutional change is very low given Ukraine's entrenched pattern and unresolved war context. If anything, the group slightly strengthens my confidence: the ever-mounting emergency logic and lack of a strong counter-catalyst mean the tail-risks for a 'No' outcome remain extremely slim.",
            "revised_probability": 96
        }
    },
    "revision_probability": [
        97,
        97,
        97,
        98,
        96,
        97,
        96,
        96
    ],
    "revision_mean_probability": 96.75,
    "revision_sd": 0.7071067811865476,
    "revision_probability_result": 97,
    "question_details": {
        "id": 39837,
        "title": "Will Ukraine extend martial law beyond November 5, 2025?",
        "created_at": "2025-10-08T17:48:42.243010Z",
        "open_time": "2025-10-13T15:30:00Z",
        "cp_reveal_time": "2025-10-13T17:00:00Z",
        "spot_scoring_time": "2025-10-13T17:00:00Z",
        "scheduled_resolve_time": "2025-11-05T22:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-10-13T17:00:00Z",
        "actual_close_time": "2025-10-13T17:00:00Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "President Volodymyr Zelenskyy declared [martial law](https://en.wikipedia.org/wiki/Martial_law_in_Ukraine#2022_martial_law) in Ukraine on February 24, 2022, in response to the Russian invasion of Ukraine that began earlier that day. As the [ensuing war](https://en.wikipedia.org/wiki/Russo-Ukrainian_war_\\(2022%E2%80%93present\\)) has dragged on, the government has extended martial law [16 times](https://newsukraine.rbc.ua/news/ukraine-prolongs-martial-law-mobilization-1752577500.html). (At first, each declaration of martial law was good for thirty days, but since May 2022, martial law has been extended for 90-day periods.)\n\nOne consequence of this lengthy period of martial law is that national elections, which would have occurred [in 2023](https://en.wikipedia.org/wiki/Next_Ukrainian_parliamentary_election), have been postponed indefinitely. Nevertheless, [some observers](https://www.saisjournal.eu/article/98-George-Kent-War-and-Democracy.cfm) argue that the rule of law in Ukraine remains strong.\n\nThe current period of martial law is scheduled to expire on [November 5, 2025](https://newsukraine.rbc.ua/news/zelenskyy-signs-extension-of-martial-law-1753442234.html), unless the government again renews it.\n\n`{\"format\":\"metac_reveal_and_close_in_period\",\"info\":{\"post_id\":40227,\"question_id\":39761}}`",
        "resolution_criteria": "This question will resolve as Yes if Ukraine extends martial law beyond November 5, 2025.",
        "fine_print": "",
        "post_id": 40285,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Half of Ukrainians Say Zelenskyy Should Step Down After War Ends**\nA survey by the Kyiv International Institute of Sociology (KIIS) revealed that 36% of Ukrainians believe President Volodymyr Zelenskyy should leave politics and 15% believe he should face prosecution after the end of the war with Russia, totaling 51% who support his departure or legal consequences. Only 41% believe he should remain in politics, with just 25% supporting him holding a top leadership position. Additionally, 69% of respondents said former President Petro Poroshenko, a political rival, should also leave politics or face prosecution. The study concludes that 45% of respondents want both Zelenskyy and Poroshenko to exit politics after the war. Despite the criticism, Zelenskyy maintains 60% public trust, a significant rise from 37% before the war in February 2022, when it surged to 90% in May 2022 and has remained around 60% since. The institute notes that while there is criticism regarding the lack of pre-war elections and the extension of Zelenskyy’s term under martial law, he still holds sufficient public legitimacy. Russia has cited the legality of Zelenskyy’s extended term as a barrier to peace negotiations. Only 11% of respondents believe a presidential election should be held before the war ends.\nOriginal language: ko\nPublish date: October 13, 2025 10:58 AM\nSource:[KBS](https://news.kbs.co.kr/news/pc/view/view.do?ncd=8379436)\n\n**Half of Ukrainians Say Zelenskyy Should Step Down After War Ends | Yonhap News Agency**\nA survey by the Kyiv International Institute of Sociology (KIIS) revealed that half of Ukrainian citizens believe President Volodymyr Zelenskyy should either leave politics or face prosecution after the end of the war with Russia. According to the results, 36% of respondents said Zelenskyy should step down from politics, and 15% said he should be prosecuted. Only 41% believed he should remain in politics, with just 25% supporting his continued leadership in top positions. Additionally, 69% of respondents said former President Petro Poroshenko, a political rival of Zelenskyy, should also leave politics or be prosecuted. The research institute concluded that 45% of respondents want both Zelenskyy and Poroshenko to exit politics after the war. Zelenskyy, who was elected in 2019 and whose term ended in May 2023, has extended his rule under a state of emergency due to the ongoing war and has not held a presidential election. In January 2025, he approved sanctions against Poroshenko, including travel bans and asset freezes. Russia has criticized Zelenskyy’s extended term as a barrier to peace negotiations. However, only 11% of respondents supported holding a presidential election before a ceasefire. Despite this, Zelenskyy’s approval rating remains at 60%, having risen from 37% before the war in February 2022 to 90% in May 2022, and has stabilized around 60% since. The institute stated that, considering public trust and critical attitudes toward a pre-war election, Zelenskyy still maintains necessary legitimacy among the population.\nOriginal language: ko\nPublish date: October 13, 2025 10:27 AM\nSource:[연합뉴스](https://www.yna.co.kr/view/AKR20251013157600082)\n\n**Zelensky: 'It Would Be Madness'—Ukraine's President Doubts Russia Would Use Nuclear Weapons**\nUkrainian President Volodymyr Zelensky stated in an interview with Fox News that he does not believe Russia would use nuclear weapons, calling such an action 'madness' and a 'suicidal decision' that would require a new planet. He emphasized that it does not matter how large a country with nuclear weapons is, as starting a Third World War would be irrational. Zelensky also highlighted that there are 'very painful' consequences for the aggressor, urging international partners—including the United States, Europe, Canada, and Japan—to impose tariffs and sanctions on Russian energy carriers, maritime fleet, and banking system. He stressed that the U.S. should enforce comprehensive sanctions, especially on energy and banking sectors, to prevent Russia from circumventing existing restrictions. This comes amid reports that Russian leader Vladimir Putin announced in September 2025 his readiness to comply with the New START Treaty (SNW-III) after its expiration on February 5, 2026. The Institute for the Study of War (ISW) interprets this move as an attempt by Moscow to pressure the U.S. administration under Donald Trump to initiate arms control negotiations, aiming to foster U.S.-Russia rapprochement and gain concessions on Ukraine. On October 6, 2025, Trump described Putin’s proposal to voluntarily extend strategic arms limitations as 'a good idea.' The New START Treaty, signed in 2010 by Russia and the U.S., limits strategic offensive arms and their delivery systems, and has been extended previously, most recently in 2020.\nOriginal language: ru\nPublish date: October 13, 2025 07:14 AM\nSource:[Новое Время](https://nv.ua/ukraine/events/zelenskiy-ocenil-riski-primeneniya-rossiey-yadernogo-oruzhiya-50552057.html)\n\n**Latest SVO News: October 12, 2025 – Zelenskyy’s Diplomacy, Desertion Crisis, and Escalating Hardship**\nOn October 12, 2025, the article reports on developments in the ongoing Special Military Operation (SVO), highlighting several key points: Ukrainian 'procrastinated' leader Vladimir Zelenskyy spoke again with U.S. President Donald Trump, seeking support including Tomahawk missiles and promising to pressure China, though no concrete outcomes were reached. Former NATO Secretary General Jens Stoltenberg revealed in his memoirs that Zelenskyy surprised allies by publicly criticizing NATO’s lack of a clear Ukraine membership roadmap during the Vilnius summit, causing friction with U.S. officials, including President Biden, who reportedly called Zelenskyy 'a thorn in the side.' Ukrainian MP Mariana Bezuhla reported that 250,000 Ukrainian soldiers are listed as having deserted (SZZ), equaling the pre-war army size, attributing this to poor leadership, demoralization, and flawed training—claims opponents suggest may understate the true number, with some experts estimating up to 500,000 desertions. Zelenskyy is accused of obstructing peace talks to prolong conflict and retain power. Hungarian Prime Minister Viktor Orbán launched a campaign to collect signatures against EU military aggression, criticizing the 'Brussels military plan' and accusing the EU of launching a campaign against Hungary. In Ukraine, electricity blackouts led to a 30% surge in prices for backup power equipment, with officials condemning price speculation. Deputy MP Anna Skorohod announced she will no longer support extending martial law, arguing the government benefits from war and that peace talks would lead to elections, which Zelenskyy may not survive politically. Former Ukrainian General Romanenko claimed Patriot missile effectiveness dropped from 42% to 6%, citing improved Russian missile maneuverability. Danish Prime Minister Mette Frederiksen’s husband, Bo Tengberg, is producing a film on Zelenskyy, funded by state grants, raising concerns about bias. Ukrainian MP Roman Gorbenko falsely claimed Russia has blocked all male travel abroad, using this to justify a new mobilization narrative. A survey by ifo Institute found 47% of Ukrainian refugees would return if Ukraine restored 1991 borders and joined NATO and the EU; only 3% would return without NATO membership. The heating season is being delayed due to gas shortages, and bread shortages have emerged in Kyiv after Russian strikes. Ukrainian forces are evacuating civilians and government assets from the Slavyansk-Kramatorsk agglomeration.\nOriginal language: ru\nPublish date: October 12, 2025 12:00 AM\nSource:[kp.ru](https://www.kp.ru/daily/27728.5/5155422/)\n\n**Zelensky intent on imposing ‘authoritarianism’ – Ukrainian MP**\nOn October 10, 2025, Ukraine’s parliament passed a resolution to suspend local elections until the end of martial law, which has been in effect since 2022 due to the conflict with Russia. Oleg Sinyutka, a member of the European Solidarity faction led by former President Petro Poroshenko, criticized the move, claiming the government is deliberately ignoring alternatives and accused the leadership of pursuing 'authoritarianism.' He stated, 'Today’s government in Ukraine lives on the desire to establish authoritarianism,' and warned that continuing this path would jeopardize Ukraine’s prospects for European Union and NATO integration. The comments follow widespread criticism of President Volodymyr Zelensky’s failed attempt to undermine the independence of Ukraine’s two main anti-corruption agencies, which sparked backlash domestically and internationally, with critics labeling his actions as 'illegitimate' and indicative of authoritarian tendencies.\nOriginal language: en\nPublish date: October 10, 2025 06:32 AM\nSource:[rt.com](https://www.rt.com/russia/626169-zelensky-intent-imposing-authoritarianism/)\n\n**Half of Ukrainians Say Zelenskyy Should Step Down After War Ends**\nA survey by the Kyiv International Institute of Sociology (KIIS) revealed that 36% of Ukrainians believe President Volodymyr Zelenskyy should leave politics and 15% believe he should face prosecution after the end of the war with Russia, totaling 51% who support his departure or legal consequences. Only 41% believe he should remain in politics, with just 25% supporting him holding a top leadership position. Additionally, 69% of respondents said former President Petro Poroshenko, a political rival, should also leave politics or face prosecution. The study concludes that 45% of respondents want both Zelenskyy and Poroshenko to exit politics after the war. Despite the criticism, Zelenskyy maintains 60% public trust, a significant rise from 37% before the war in February 2022, when it surged to 90% in May 2022 and has remained around 60% since. The institute notes that while there is criticism regarding the lack of pre-war elections and the extension of Zelenskyy’s term under martial law, he still holds sufficient public legitimacy. Russia has cited the legality of Zelenskyy’s extended term as a barrier to peace negotiations. Only 11% of respondents believe a presidential election should be held before the war ends.\nOriginal language: ko\nPublish date: October 13, 2025 10:58 AM\nSource:[KBS](https://news.kbs.co.kr/news/pc/view/view.do?ncd=8379436)\n\n**Half of Ukrainians Say Zelenskyy Should Step Down After War Ends | Yonhap News Agency**\nA survey by the Kyiv International Institute of Sociology (KIIS) revealed that half of Ukrainian citizens believe President Volodymyr Zelenskyy should either leave politics or face prosecution after the end of the war with Russia. According to the results, 36% of respondents said Zelenskyy should step down from politics, and 15% said he should be prosecuted. Only 41% believed he should remain in politics, with just 25% supporting his continued leadership in top positions. Additionally, 69% of respondents said former President Petro Poroshenko, a political rival of Zelenskyy, should also leave politics or be prosecuted. The research institute concluded that 45% of respondents want both Zelenskyy and Poroshenko to exit politics after the war. Zelenskyy, who was elected in 2019 and whose term ended in May 2023, has extended his rule under a state of emergency due to the ongoing war and has not held a presidential election. In January 2025, he approved sanctions against Poroshenko, including travel bans and asset freezes. Russia has criticized Zelenskyy’s extended term as a barrier to peace negotiations. However, only 11% of respondents supported holding a presidential election before a ceasefire. Despite this, Zelenskyy’s approval rating remains at 60%, having risen from 37% before the war in February 2022 to 90% in May 2022, and has stabilized around 60% since. The institute stated that, considering public trust and critical attitudes toward a pre-war election, Zelenskyy still maintains necessary legitimacy among the population.\nOriginal language: ko\nPublish date: October 13, 2025 10:27 AM\nSource:[연합뉴스](https://www.yna.co.kr/view/AKR20251013157600082)\n\n**Zelensky: 'It Would Be Madness'—Ukraine's President Doubts Russia Would Use Nuclear Weapons**\nUkrainian President Volodymyr Zelensky stated in an interview with Fox News that he does not believe Russia would use nuclear weapons, calling such an action 'madness' and a 'suicidal decision' that would require a new planet. He emphasized that it does not matter how large a country with nuclear weapons is, as starting a Third World War would be irrational. Zelensky also highlighted that there are 'very painful' consequences for the aggressor, urging international partners—including the United States, Europe, Canada, and Japan—to impose tariffs and sanctions on Russian energy carriers, maritime fleet, and banking system. He stressed that the U.S. should enforce comprehensive sanctions, especially on energy and banking sectors, to prevent Russia from circumventing existing restrictions. This comes amid reports that Russian leader Vladimir Putin announced in September 2025 his readiness to comply with the New START Treaty (SNW-III) after its expiration on February 5, 2026. The Institute for the Study of War (ISW) interprets this move as an attempt by Moscow to pressure the U.S. administration under Donald Trump to initiate arms control negotiations, aiming to foster U.S.-Russia rapprochement and gain concessions on Ukraine. On October 6, 2025, Trump described Putin’s proposal to voluntarily extend strategic arms limitations as 'a good idea.' The New START Treaty, signed in 2010 by Russia and the U.S., limits strategic offensive arms and their delivery systems, and has been extended previously, most recently in 2020.\nOriginal language: ru\nPublish date: October 13, 2025 07:14 AM\nSource:[Новое Время](https://nv.ua/ukraine/events/zelenskiy-ocenil-riski-primeneniya-rossiey-yadernogo-oruzhiya-50552057.html)\n\n**'It would be madness.' Zelenskyy says he doesn't believe Russia would use nuclear weapons**\nPresident of Ukraine Volodymyr Zelenskyy stated in an interview with Fox News that he does not believe Russia would use nuclear weapons, calling such an action 'madness' and a 'crazy decision' that would lead to the destruction of the planet. He emphasized that the idea of starting a Third World War with nuclear weapons is unthinkable. Zelenskyy also urged international partners, including the United States, Europe, Canada, and Japan, to impose tariffs and sanctions on Russian energy resources, maritime fleet, and banking system to prevent Russia from circumventing existing sanctions. He stressed that the U.S. should impose comprehensive sanctions, especially on energy and banking sectors, to cut off Russia’s financial lifelines. The statement comes amid reports that Russian leader Vladimir Putin claimed in September 2025 that Russia is willing to abide by the New START Treaty (SALT-III) after February 5, 2026, when the treaty’s current term expires. The Institute for the Study of War (ISW) interprets this as a strategic move to pressure U.S. President Donald Trump’s administration into initiating arms control talks, aiming to weaken Western unity and gain concessions on Ukraine. On October 6, 2025, Trump described Putin’s proposal as 'a good idea.' The New START Treaty, signed in 2010 by Russia and the U.S., regulates strategic offensive arms, including strategic nuclear weapons and their delivery systems, and has been extended multiple times, most recently in 2020.\nOriginal language: uk\nPublish date: October 13, 2025 06:35 AM\nSource:[Новое Время](https://nv.ua/ukr/ukraine/events/zelenskiy-ociniv-riziki-zastosuvannya-rosiyeyu-yadernoji-zbroji-50552057.html)\n\n**Stalemate on Frontlines and Stalled Negotiations Signal Prolonged War in Ukraine**\nThe war in Ukraine remains at a stalemate on both military and political fronts, with Russia and Ukraine failing to achieve their objectives through military force alone. Efforts by the U.S. to mediate have not yielded results, following the initial momentum after the August 2024 summit between Russian President Vladimir Putin and U.S. President Donald Trump in Alaska. Analysts predict active combat will continue for several more months, as neither side is ready for negotiations. Russian President Putin acknowledged that Russia has captured only 4,900 square kilometers (about 1% of Ukraine’s total area of approximately 603,000 km²) since the start of 2025, a limited gain despite claims of strategic initiative. Meanwhile, increasing U.S. signals suggest potential delivery of Tomahawk cruise missiles to Ukraine, with Trump recently discussing the possibility with Ukrainian President Volodymyr Zelenskyy. Analyst Maxim Yalyi interprets this as Trump distancing himself from a diplomatic settlement, recognizing Ukraine and Europe’s refusal to accept Russian ceasefire terms. Russian expert Konstantin Blokhin confirms a strategic deadlock, predicting the war will become a protracted war of attrition with no clear end in sight. Both sides are resorting to unconventional tactics: Ukraine targets Russian oil refineries to disrupt funding and influence Russian public opinion, while Russia strikes Ukrainian energy infrastructure to plunge cities into darkness. Despite Putin’s stated goal of achieving all military objectives, internal Russian discourse reveals growing doubts about the necessity of enforcing Ukraine’s neutrality or preventing NATO membership. Expert Alexander Kolbin argues that Ukraine’s potential NATO membership no longer poses a significant threat to Russian security, given past Western-armed strikes on Russian territory. Meanwhile, speculation persists over a possible partial mobilization in Russia, though political considerations—especially the upcoming 2026 State Duma elections—may delay such a move. Russia has already passed laws facilitating year-round conscription and raising the draft age to 30, but these do not yet extend to contract soldiers. The conflict, according to experts, has entered a phase of strategic exhaustion, with both sides relying on attrition rather than decisive breakthroughs.\nOriginal language: ar\nPublish date: October 13, 2025 01:00 AM\nSource:[العربي الجديد](https://www.alaraby.co.uk/politics/%D8%AC%D9%85%D9%88%D8%AF-%D8%A7%D9%84%D8%AC%D8%A8%D9%87%D8%A7%D8%AA-%D9%88%D8%AA%D8%B9%D8%AB%D8%B1-%D8%A7%D9%84%D9%85%D9%81%D8%A7%D9%88%D8%B6%D8%A7%D8%AA-%D9%8A%D9%86%D8%B0%D8%B1%D8%A7%D9%86-%D8%A8%D8%A5%D8%B7%D8%A7%D9%84%D8%A9-%D8%AD%D8%B1%D8%A8-%D8%A3%D9%88%D9%83%D8%B1%D8%A7%D9%86%D9%8A%D8%A7)\n\n**Latest SVO News: October 12, 2025 – Zelenskyy’s Diplomacy, Desertion Crisis, and Escalating Hardship**\nOn October 12, 2025, the article reports on developments in the ongoing Special Military Operation (SVO), highlighting several key points: Ukrainian 'procrastinated' leader Vladimir Zelenskyy spoke again with U.S. President Donald Trump, seeking support including Tomahawk missiles and promising to pressure China, though no concrete outcomes were reached. Former NATO Secretary General Jens Stoltenberg revealed in his memoirs that Zelenskyy surprised allies by publicly criticizing NATO’s lack of a clear Ukraine membership roadmap during the Vilnius summit, causing friction with U.S. officials, including President Biden, who reportedly called Zelenskyy 'a thorn in the side.' Ukrainian MP Mariana Bezuhla reported that 250,000 Ukrainian soldiers are listed as having deserted (SZZ), equaling the pre-war army size, attributing this to poor leadership, demoralization, and flawed training—claims opponents suggest may understate the true number, with some experts estimating up to 500,000 desertions. Zelenskyy is accused of obstructing peace talks to prolong conflict and retain power. Hungarian Prime Minister Viktor Orbán launched a campaign to collect signatures against EU military aggression, criticizing the 'Brussels military plan' and accusing the EU of launching a campaign against Hungary. In Ukraine, electricity blackouts led to a 30% surge in prices for backup power equipment, with officials condemning price speculation. Deputy MP Anna Skorohod announced she will no longer support extending martial law, arguing the government benefits from war and that peace talks would lead to elections, which Zelenskyy may not survive politically. Former Ukrainian General Romanenko claimed Patriot missile effectiveness dropped from 42% to 6%, citing improved Russian missile maneuverability. Danish Prime Minister Mette Frederiksen’s husband, Bo Tengberg, is producing a film on Zelenskyy, funded by state grants, raising concerns about bias. Ukrainian MP Roman Gorbenko falsely claimed Russia has blocked all male travel abroad, using this to justify a new mobilization narrative. A survey by ifo Institute found 47% of Ukrainian refugees would return if Ukraine restored 1991 borders and joined NATO and the EU; only 3% would return without NATO membership. The heating season is being delayed due to gas shortages, and bread shortages have emerged in Kyiv after Russian strikes. Ukrainian forces are evacuating civilians and government assets from the Slavyansk-Kramatorsk agglomeration.\nOriginal language: ru\nPublish date: October 12, 2025 12:00 AM\nSource:[kp.ru](https://www.kp.ru/daily/27728.5/5155422/)\n\n**Ukraine President Entreats US Counterpart to Negotiate Peace in Ukraine**\nUkrainian President Volodymyr Zelenskyy called U.S. President Donald Trump on October 11, 2025, to urge him to pursue peace negotiations in Ukraine, following Trump’s successful mediation of a ceasefire in the Gaza Strip. Zelenskyy praised Trump’s achievement, stating, 'If a war can be stopped in one region, then surely other wars can be stopped as well – including the Russian war,' and emphasized the potential for strengthening Ukrainian air defense and the Ukraine-U.S. relationship. The call occurred amid ongoing U.S. efforts to end the war between Russia and Ukraine, which has been Europe’s worst conflict since WWII. These efforts peaked with a Trump-Putin summit in Alaska on August 15, 2025, followed by a White House meeting with Zelenskyy and European allies. Despite this, negotiations remain stalled due to sharply divergent positions. Recently, Trump has expressed growing frustration with Russian President Vladimir Putin, who has accused Europe of undermining peace efforts and prolonging the conflict. In early November 2025, a Ukrainian delegation led by Prime Minister Yulia Svyrydenko will travel to the U.S. to discuss additional sanctions on Moscow, energy cooperation, and enhanced air defense support.\nOriginal language: en\nPublish date: October 11, 2025 08:24 PM\nSource:[Qatar News Agency](https://qna.org.qa/en/news/news-details?id=ukraine-president-entreats-us-counterpart-to-negotiate-peace-in-ukraine&date=11%2F10%2F2025)\n\n**Day 1,326 of the War: Ukraine's Defense, Diplomacy, and Domestic Developments on October 11, 2025**\nOn October 11, 2025, the 1,326th day of the war, Ukrainian President Volodymyr Zelenskyy held a phone call with U.S. President Donald Trump, discussing Russian attacks on Ukraine’s energy infrastructure, potential cooperation on strengthening Ukraine’s air defense, and the possible transfer of Tomahawk missiles. According to Axios, the U.S. is considering this transfer, though no final decision has been confirmed. Ukrainian special operations forces conducted a long-range drone strike on the Bashnafta-UNPZ oil refinery in Ufa, Russia—1,400 km from Ukraine—causing fires at an oil processing unit. The UK delivered hundreds of air defense missiles to Ukraine five months ahead of schedule. Canadian Senator Sten Kutcher stated that lasting peace with Russia is only possible through Ukraine’s victory, citing historical precedent. On the front lines, 108 clashes occurred, with intensified Russian pressure on Pokrovsk and Olexandriya. Ukraine’s air defense intercepted 54 out of 78 drones launched by Russia between October 10 and 11. The Ukrainian military reported destroying three tanks, 13 armored vehicles, and 41 pieces of equipment on the Drobopilsky direction. The 30th Naval Infantry Corps destroyed four artillery systems targeting Kherson. Partisan agents from the 'ATESH' movement disrupted a Russian offensive near Vovchansk. Russian troop and equipment movements toward Berdyansk were observed. In a separate incident, Russian airstrikes killed at least two people and injured five in Kostiantynivka. Two energy workers were killed and three injured in a drone strike on a power company vehicle in Semenivka, Chernihiv Oblast. Russian aircraft dropped 125 bombs and three missiles on border regions of Russia and occupied Ukrainian territories since January 2025. President Zelenskyy signed legislation for medical compensation for soldiers released from captivity, imposed sanctions on Russian arms suppliers, awarded the Order of Saint Olga I degree to UAE’s Rym Al Hashimi, and synchronized Ukraine’s sanctions with Japan’s. The President’s Office and UAE’s minister discussed investments in Ukraine’s energy, infrastructure, and agriculture. Ukraine celebrates the Day of Logistics Specialists. Journalist Viktoriia Roshchina, killed in Russian captivity, was named a recipient of the 'World Press Freedom Hero' award. The government launched a national information system for coordinating evacuation and aid for people from temporarily occupied and frontline areas. Ukraine and the Netherlands signed a memorandum for joint deep-strike drone production in the Netherlands with €110 million in investment under the 'Build with Ukraine' initiative. Ukraine and the UK agreed to create a working group to coordinate projects under the LYRA defense technology partnership at the DFNC3 forum. On October 26, Ukraine will switch to winter time. The Cabinet of Ministers passed measures to simplify business operations, including automated inspections and expanded credit programs. Zakarpattia collected over 21 million UAH in tourism fees in the first nine months of 2025, a 40% increase from 2024. Internationally, Trump announced a 100% increase in U.S. tariffs on Chinese goods starting November 1 in response to China’s export restrictions on rare earth materials. Estonia closed the Saatse Boot border crossing due to increased Russian military activity. Poland reported a tripling of Russian cyberattacks on critical infrastructure this year. French President Emmanuel Macron reappointed Gabriel Attal as Prime Minister after consultations. Italian Prime Minister Giorgia Meloni and Spanish Prime Minister Pedro Sánchez will attend a Gaza-focused international summit in Egypt on October 13. A drone attack on a displacement camp in El Fasher, Sudan, killed at least 60 people, marking one of the deadliest attacks since the RSF siege began 18 months ago. Belarus began a military readiness drill involving multiple units. In Russia, a VAT increase from 20% to 22% and a lowered income threshold will raise prices on e-commerce platforms by 10% to 25%, potentially leading to a 20% reduction in delivery points by 2026. A Russian court extended the pre-trial detention of five members of the 'Third Jankoy Group' of Hizb ut-Tahrir until January 13.\nOriginal language: uk\nPublish date: October 11, 2025 04:40 PM\nSource:[УКРІНФОРМ](https://www.ukrinform.ua/rubric-ato/4046362-bitva-za-ukrainu-den-tisaca-trista-dvadcat-sostij.html)\n\n**'Incredible Achievement' by Trump: Zelensky Says Ukraine War Could End**\nUkrainian President Volodymyr Zelensky stated in a post on social media platform X (formerly Twitter) that his conversation with former U.S. President Donald Trump was 'positive and productive,' praising Trump's 'incredible achievement' in securing a Middle East agreement. Zelensky suggested that if a war can be halted in one region, others—including the war with Russia—can also end. He reported that Trump demonstrated willingness to support Kyiv, and they discussed strengthening Ukraine’s air defense and concrete agreements in progress, with 'solid ideas' on how to enhance security. Zelensky emphasized that true diplomacy from Russia is necessary, which may be achieved 'through force.' He concluded by thanking Trump. A Ukrainian delegation, including Prime Minister Ioulia Svyrydenko, is set to travel to the United States next week to discuss potential sanctions and defense matters. Russia invaded Ukraine on February 24, 2022, citing the need to protect pro-Russian separatists in the east and to 'denazify' Ukraine, which has been independent since 1991 and has increasingly aligned with Europe and the West. Moscow demands Ukraine cede four regions—Donetsk, Lugansk, Kherson, and Zaporíjia—plus Crimea (annexed in 2014) and permanently renounce NATO membership. Ukraine and its allies reject these terms, insisting on a 30-day unconditional ceasefire before peace talks. Russia argues such a ceasefire would allow Ukraine to rearm using Western military aid. On the same day, ABC News reported that U.S. troops supervising the Israel-Hamas ceasefire agreement have arrived in the region. A day earlier, the White House confirmed the deployment of 200 U.S. military personnel from the Central Command (CENTCOM), specialized in transport, planning, logistics, security, and engineering, to work with international partners, private sector representatives, and NGOs.\nOriginal language: pt\nPublish date: October 11, 2025 11:15 AM\nSource:[noticiasaominuto.com.br](https://www.noticiasaominuto.com.br/mundo/2322907/feito-incrivel-de-trump-zelensky-diz-que-guerra-na-ucrania-pode-acabar)\n\n**Zelensky intent on imposing ‘authoritarianism’ – Ukrainian MP**\nOn October 10, 2025, Ukraine’s parliament passed a resolution to suspend local elections until the end of martial law, which has been in effect since 2022 due to the conflict with Russia. Oleg Sinyutka, a member of the European Solidarity faction led by former President Petro Poroshenko, criticized the move, claiming the government is deliberately ignoring alternatives and accused the leadership of pursuing 'authoritarianism.' He stated, 'Today’s government in Ukraine lives on the desire to establish authoritarianism,' and warned that continuing this path would jeopardize Ukraine’s prospects for European Union and NATO integration. The comments follow widespread criticism of President Volodymyr Zelensky’s failed attempt to undermine the independence of Ukraine’s two main anti-corruption agencies, which sparked backlash domestically and internationally, with critics labeling his actions as 'illegitimate' and indicative of authoritarian tendencies.\nOriginal language: en\nPublish date: October 10, 2025 06:32 AM\nSource:[rt.com](https://www.rt.com/russia/626169-zelensky-intent-imposing-authoritarianism/)\n\n**Zelensky Approves Extension of Martial Law and Mobilization**\nUkrainian President Volodymyr Zelensky has signed laws to extend the state of war and mobilization in Ukraine for another 90 days, until November 5 of this year. According to the laws, the state of war will be extended from August 7, 2025, at 5:30 AM, for 90 days, and the mobilization period will also be extended for the same period. These decisions were made due to the ongoing armed aggression of Russia against Ukraine. This is the 16th time the Ukrainian parliament has approved the extension of the state of war and mobilization. Ukraine first introduced a state of war on February 24, 2022, after Russia's full-scale invasion.\nOriginal language: uk\nPublish date: July 25, 2025 10:40 AM\nSource:[Украинская сеть новостей](https://ua.korrespondent.net/ukraine/4802156-zelenskyi-skhvalyv-prodovzhennia-voiennoho-stanu)\n\n**Zelensky Approves Extension of Martial Law and Mobilization in Ukraine**\nUkrainian President Volodymyr Zelensky has signed laws extending the state of emergency and mobilization in Ukraine for another 90 days, until November 5, 2023. According to the Ukrainian parliament's website, the laws were passed on July 25, 2023. Zelensky stated, 'In accordance with the laws, the state of emergency has been extended for 90 days, and the mobilization period has also been extended for the corresponding period.' The decision was made due to Russia's ongoing armed aggression against Ukraine. This is the 16th time the state of emergency and mobilization have been extended. Ukraine first introduced martial law on February 24, 2022, after Russia launched a full-scale invasion.\nOriginal language: ru\nPublish date: July 25, 2025 10:40 AM\nSource:[Корреспондент.net](https://korrespondent.net/ukraine/4802156-zelenskyi-odobryl-prodlenye-voennoho-polozhenyia)\n\n**Zelensky Proposes Extension of Martial Law and General Mobilization**\nUkrainian President Volodymyr Zelensky has proposed a 90-day extension of martial law and general mobilization, which are set to expire on August 7. According to the Parliament's press service, the initiative aims to extend both measures until November 5. This would be the 16th time the measures have been extended since their introduction in February 2022, amidst the ongoing conflict with Russia. Zelensky's move is part of efforts to maintain a strong military presence in the country.\nOriginal language: es\nPublish date: July 14, 2025 01:47 PM\nSource:[新华网](https://spanish.xinhuanet.com/20250714/7b921509bb2e4aa2a483c5c67eae376c/c.html)\n\n**Zelenskyy Seeks to Extend Martial Law in Ukraine**\nUkrainian President Volodymyr Zelenskyy has submitted two draft laws to the Ukrainian parliament to extend martial law and general mobilization for an additional 90 days, until November 5. According to Ukrainian news agency Ukrinform, Zelenskyy proposes to extend martial law and general mobilization from August 7 to November 5. Both drafts are currently under review by the Committee on National Security, Defense, and Intelligence in the Ukrainian parliament. Martial law has been in effect in Ukraine since the start of the Russian military operation on February 24, 2022. 'The situation in the country remains extremely difficult, and we must be prepared for any scenario,' Zelenskyy said, 'We will not let our guard down and will continue to work tirelessly to protect our people and our state.'\nOriginal language: ar\nPublish date: July 14, 2025 12:16 PM\nSource:[اليوم السابع](https://www.youm7.com/story/2025/7/14/%D8%B2%D9%8A%D9%84%D9%8A%D9%86%D8%B3%D9%83%D9%89-%D9%8A%D8%B7%D9%84%D8%A8-%D9%85%D9%86-%D8%A7%D9%84%D8%A8%D8%B1%D9%84%D9%85%D8%A7%D9%86-%D8%AA%D9%85%D8%AF%D9%8A%D8%AF-%D8%A7%D9%84%D8%A3%D8%AD%D9%83%D8%A7%D9%85-%D8%A7%D9%84%D8%B9%D8%B1%D9%81%D9%8A%D8%A9-%D8%AD%D8%AA%D9%89-5-%D9%86%D9%88%D9%81%D9%85%D8%A8%D8%B1/7054878)\n\n**Ukraine's Zelensky Proposes Extension of Martial Law and General Mobilization**\nUkrainian President Volodymyr Zelensky has submitted a bill to the Parliament to extend the martial law and general mobilization by 90 days. According to the Parliament's press service, this proposal would extend these measures until November 5, after their scheduled expiration on August 7. The martial law and general mobilization have been extended 15 times since their introduction in February 2022 in response to the ongoing conflict with Russia. 'This proposal prolongs these two measures until November 5, after their date of expiration on August 7,' said the Parliament's press service.\nOriginal language: fr\nPublish date: July 14, 2025 11:57 AM\nSource:[Les nouvelles à travers la Chine et le monde](http://french.xinhuanet.com/20250714/1a9a3f18dc8d48249874b24c67e2ddb4/c.html)\n\n**Zelensky Seeks to Extend Martial Law and General Mobilization in Ukraine**\nUkrainian President Volodymyr Zelensky has submitted two draft laws to the Ukrainian parliament to extend martial law and general mobilization for an additional 90 days, until November 5. According to Ukrainian news agency Ukrinform, Zelensky proposes to extend martial law and general mobilization from August 7 to November 5. Both drafts are currently under review by the Committee on National Security, Defense and Intelligence in the Ukrainian parliament. Martial law has been in effect in Ukraine since the start of the Russian military operation on February 24, 2022.\nOriginal language: ar\nPublish date: July 14, 2025 10:17 AM\nSource:[Albawaba](https://www.albawabhnews.com/5232174)\n\n**Zelensky Extends Martial Law and General Mobilization for Three More Months**\nUkrainian President Volodymyr Zelensky has referred laws to extend martial law and general mobilization for three more months to parliament. This is the 16th time the parliament has voted to extend these laws, which will now remain in effect until August 6. Due to martial law, Ukraine has not held presidential and parliamentary elections on time. Zelensky's presidential term officially ended on May 20 last year, but he is making every effort to stay in power, including trying to eliminate potential political opponents and delay a peaceful settlement. Martial law and general mobilization were declared in Ukraine on February 24, 2022, and have been extended several times since then. Following issues with military conscription, a law tightening mobilization rules came into effect in Ukraine on May 18, 2024, with mobilization activities often being carried out using violence in recent months.\nOriginal language: ar\nPublish date: July 14, 2025 08:31 AM\nSource:[RT Arabic](https://arabic.rt.com/world/1692393-%D8%B2%D9%8A%D9%84%D9%8A%D9%86%D8%B3%D9%83%D9%8A-%D9%8A%D8%AD%D9%8A%D9%84-%D8%A5%D9%84%D9%89-%D8%A7%D9%84%D8%A8%D8%B1%D9%84%D9%85%D8%A7%D9%86-%D9%82%D9%88%D8%A7%D9%86%D9%8A%D9%86-%D8%AA%D9%85%D8%AF%D9%8A%D8%AF-%D8%A7%D9%84%D8%A3%D8%AD%D9%83%D8%A7%D9%85-%D8%A7%D9%84%D8%B9%D8%B1%D9%81%D9%8A%D8%A9-%D9%88%D8%A7%D9%84%D8%AA%D8%B9%D8%A8%D8%A6%D8%A9-%D8%A7%D9%84%D8%B9%D8%A7%D9%85%D8%A9-%D9%84%D9%85%D8%AF%D8%A9-%D8%AB%D9%84%D8%A7%D8%AB%D8%A9-%D8%A3%D8%B4%D9%87%D8%B1/)\n\n**Zelensky Proposes Extension of Martial Law and Mobilization**\nPresident Volodymyr Zelensky has submitted to the Ukrainian Parliament draft laws to extend the state of war and mobilization for another 90 days, until November 5, 2025. According to 'Glavkom' citing the parliament's website, the current laws on the extension of the state of war and mobilization, signed by the President on April 18, expire on August 6. Voting on the new draft laws in the Ukrainian Parliament will take place this week.\nOriginal language: uk\nPublish date: July 14, 2025 07:36 AM\nSource:[ГЛАВКОМ](https://glavcom.ua/country/politics/zelenskij-vnis-u-radu-zakonoprojekti-pro-prodovzhennja-vojennoho-stanu-ta-mobilizatsiji-1067996.html)\n\n**Zelensky Submits Bill to Extend Martial Law and Mobilization in Ukraine**\nUkrainian President Volodymyr Zelensky has submitted to the Verkhovna Rada (Ukrainian parliament) a bill to extend the martial law and general mobilization for another 90 days, until November 5, 2025. This move aims to prolong the previously introduced emergency measures, which have been in effect since February 24, 2022, when martial law was first declared in Ukraine. According to the data published on the official website of the Ukrainian parliament, the documents are now under consideration.\nOriginal language: ru\nPublish date: July 14, 2025 07:33 AM\nSource:[kp.ru](https://www.kp.ru/online/news/6469618/)\n\n",
    "date": "2025-10-13T15:38:42.382716",
    "summary": "All experts forecast an extremely high probability that Ukraine will extend martial law beyond November 5, 2025. The consensus is rooted in several core factors: ongoing high-intensity conflict with Russia and the lack of any imminent ceasefire or diplomatic breakthrough; consistent patterns in Ukraine and similar states to maintain emergency regimes for the full duration of existential threats; and broad (if somewhat eroding) public support for wartime governance, as only a small minority favor holding elections under current conditions. While some opposition within parliament and civil society has grown more vocal, there is no indication of a cohesive or effective movement able to block the extension, and President Zelenskyy still retains majority legitimacy. International partners are concerned about democratic backsliding but prioritize Ukrainian security and have not imposed serious conditionality on support. Each expert notes that a sudden peace deal or dramatic elite/political split before the deadline could produce a 'No,' but all agree such scenarios are highly unlikely. Final probabilities assigned by the experts range from 94% to 97% in favor of a 'Yes'—that is, Ukraine will extend martial law beyond November 5, 2025.",
    "forecasters": [
        "Military Strategy (Doctrine of National Emergency)",
        "Comparative Law (Martial Law Legal Standards)",
        "Regional Security Analysis (Black Sea Regional Security)",
        "Political Science (Democratic Resilience Theory)",
        "Political Science (Civil-Military Relations)",
        "International Relations (Security Dilemma)",
        "International Relations (International Conflict Theory)",
        "Slavic and East European Studies (Post Soviet State Transformation)"
    ]
}