{
    "deliberation_results": {
        "IntelligenceAnalysis (IndicatorsAndWarningsMethod)": {
            "time_to_resolution": "Approximately 1.5 months (from November 17, 2025, to January 1, 2026).",
            "perspective_relevance": "Applying the Intelligence Analysis (Indicators and Warnings) method allows for systematic tracking of coup risk factors, early warning signs, and regional coup contagion effects. This perspective highlights base rates, active coup plotting indicators, and environmental stressors not always apparent to conventional analysis. It values both observable triggers and underlying systemic conditions, integrating both open-source intelligence and regional historical patterns.",
            "status_quo": "Military regimes are entrenched in several African (especially Sahel) states post-mid-2020s coup wave, with periodic coup attempts in both Africa and Latin America. However, most government transitions in the last six months have involved either managed elections, constitutional changes, or failed/aborted coup attempts. No successful coup has been reported in Africa or Latin America since August 2025.",
            "perspective_derived_factors": [
                {
                    "factor": "Base Rate of Successful Coups in Africa/Latin America (5–10 month horizon)",
                    "effect": "Increases probability moderately. Historically, Africa has had 2–3 coups/year, but with risk clustering (waves), which are currently subsiding after a sharp peak (2020–2023). Rapid succession coups are less likely absent a clear regional contagion, but with regimes unstable and mid-level military unrest evident, the base rate remains non-trivial."
                },
                {
                    "factor": "Current Political Instability and Early Warning Indicators (Recent coup attempts, military purges, or credible insider threats)",
                    "effect": "Increases probability. Recent news highlights: failed coup plot in Nigeria (over 40 military detained in October), failed coup attempt in Mali in August 2024, rumors of fissures inside Sahel militaries, and large-scale security and economic crises in Mali/Burkina Faso/Niger. These indicate active internal threats and weak civilian/military cohesion—fertile ground for plots."
                },
                {
                    "factor": "Junta Consolidation/Authoritarian Lockdown and Foreign Support",
                    "effect": "Decreases probability slightly. Entrenched military juntas in Mali, Burkina Faso, Niger, and Central African Republic have proven adept at coup-proofing via repression, internal purges, mercenary (Wagner/Africa Corps) protection, and dissolving opposition parties. Russian and Turkish security partnerships offer additional insurance. Self-coup scenarios (leaders illegally extending power) are also somewhat dampened where the system is already militarized."
                },
                {
                    "factor": "Active Insurgency or Civil War Environment",
                    "effect": "Slightly increases probability. Where states are collapsing (Mali, Burkina Faso), overstretched militaries and fragmented security structures heighten coup risk. Terrorist gains can both weaken junta control and provide justification for hardline or opportunistic takeovers."
                },
                {
                    "factor": "Upcoming Political Events (Elections/Transitions) and Elite Discord",
                    "effect": "Moderately increases probability. Guinea-Bissau, Benin, and Central African Republic are highlighted for engineered electoral processes, exclusion of opposition, or constitutional manipulation. These raise the risk of either classic or self-coup, especially as outgoing presidents maneuver successors and opposition becomes more radicalized. However, extreme elite consolidation (as in Benin) also sometimes reduces risk."
                },
                {
                    "factor": "Regional/International Pressure or Loss of Patronage Networks",
                    "effect": "Slightly decreases probability. With ECOWAS/West African regional organizations weakened by withdrawals and Russia filling the security gap, there is less external pressure for change or conditions incentivizing new coups (outside of the risk posed by loss of regional trade)."
                }
            ],
            "no_scenario": "Despite internal unrest and external military presence in many vulnerable states (e.g., Mali, Burkina Faso, Niger), no coup plot overcomes both regime loyalty structures and foreign-provided security. Regional and international actors maintain a status quo despite intermittent crackdowns, purges, and rising insurgent activity; any plot is foiled or fails to seize and consolidate power, and engineered elections or term extensions (e.g., Benin, Central African Republic, Guinea-Bissau) proceed without illegal military intervention. Latin America remains relatively stable post-Bolivia 2024 attempt, with no major coup efforts erupting.",
            "yes_scenario": "Internal discontent, especially within Sahel militaries, erupts in a successful ouster of an incumbent junta or self-coup in a regime facing deteriorating security, economic hardship, or elite splits (Mali, Burkina Faso, Niger, Guinea-Bissau, Central African Republic, Benin). Alternatively, an incumbent civilian leader in Francophone Africa or Latin America undertakes a self-coup to illegally extend power as elections near. Mid- to senior-level military dissent aligns with popular dissatisfaction or lost foreign support, leading to a rapid, successful seizure of both government and military control (even for a brief period). This could be enabled by distraction (jihadist surge, economic collapse) or weakening of coup-proofing structures.",
            "final_reasoning": "The base rate for successful coups in Africa remains significant, with the major wave (2020–2023) only partially receded and risk of aftershocks still present. Multiple warning indicators are active: 1) open plotting and foiled attempts in Nigeria and Mali, 2) severe instability and elite fractures in Mali, Burkina Faso, and Guinea-Bissau (especially given the engineered exclusion of major parties and manipulation of constitutional rules), and 3) continued reports of purges and failed mutinies. Although juntas in the Sahel have employed aggressive coup-proofing, foreign mercenary deployments, and repression, this can breed further discontent (history shows junta-on-junta coups remain common, as in Burkina Faso). While not every warning indicator is equally acute, the short timeframe (six weeks) still straddles several high-risk transitions—both procedural (elections, term transitions) and acute (security and economic collapse in Mali and Burkina Faso). Latin America appears less volatile in the immediate term. Estimated base rate, recent attempts, elite discord, and ongoing insurgent pressure yield a probability somewhat above base historical frequency, but not to highly confident extremes, as regime hardening and coup-proofing are also very apparent.",
            "final_probability": 32
        },
        "IntelligenceAnalysis (PoliticalRiskAssessment)": {
            "time_to_resolution": "Approximately 1.5 months (from November 17, 2025, to January 1, 2026)",
            "perspective_relevance": "As an intelligence analyst specializing in political risk assessment, my expertise is identifying early-warning indicators of state instability, understanding factionalism within security apparatuses, and contextualizing both structural/historical coup base rates with emerging real-time signals (e.g., elite defections, security breakdowns, foreign influence, economic shocks). My approach combines quantitative data (historical frequency) with qualitative insights, including recent shifts in elite cohesion, region-specific triggers, and international power dynamics.",
            "status_quo": "Over the past five years, Africa—particularly the Sahel—has experienced a significant uptick in both attempted and successful coups, while Latin America has seen fewer outright military takeovers but persistent instability. As of mid-November 2025, no successful coup has been recorded in either region since August 2025, and the last wave crested with Niger (2023), Gabon (2023), and recent coup attempts in Guinea-Bissau, Sierra Leone, and Nigeria (all failed or contained).",
            "perspective_derived_factors": [
                {
                    "factor": "Historical base rates",
                    "effect": "Increase: Africa, especially the Sahel, has seen >1 successful coup per year since 2020, with historical base rates for such a short window (~4 months) in both regions lying around 10–15%. Recent surges make the Sahel a regional outlier."
                },
                {
                    "factor": "Current regional instability, military regimes, and erosion of legitimacy",
                    "effect": "Increase: Multiple countries (Mali, Burkina Faso, Niger) remain under military juntas, suffering legitimacy crises, internal military dissatisfaction, worsening insurgencies, and dramatic economic decline—classic preconditions for 'coup-within-coup' scenarios."
                },
                {
                    "factor": "Elite cohesion and coup-proofing",
                    "effect": "Decrease: High levels of purges, internal surveillance, and elite realignments (such as Nigeria’s staff reshuffle after the coup scare, recent purges/arrests in Mali and Niger) temporarily dampen immediate coup risk, as would ongoing Russian advisory/security presence."
                },
                {
                    "factor": "Foreign involvement and external security guarantees",
                    "effect": "Decrease: Russia’s 'Africa Corps', Turkish arms, and diplomatic alliances act as both deterrents (raising coup cost/risk) and potential enablers for elite recalibration—though currently more stabilizing in effect, especially for entrenched Sahel juntas."
                },
                {
                    "factor": "Deteriorating security and governance (jihadist expansion, economic crisis)",
                    "effect": "Increase: The rapid expansion of jihadist groups, visible collapse of state authority (especially in Mali and Burkina Faso), and rising civilian/military casualties produce pressure-cooker conditions that could trigger a desperate power grab by rival military factions."
                },
                {
                    "factor": "Populist/constitutional self-coups and electoral manipulation",
                    "effect": "Increase: The recent constitutional manipulation in Benin, electoral exclusion in Guinea-Bissau, and ambiguous transitions elsewhere elevate risk for a self-coup, especially if an incumbent tries to illegally overshoot term limits/stage a 'legal' power grab before 2026."
                },
                {
                    "factor": "Public fatigue, protest activity, and international observation",
                    "effect": "Decrease: Where opposition is suppressed, and social protest is violently quelled, the immediate risk of a mass-backed putsch falls, though underlying tension accumulates for the future."
                },
                {
                    "factor": "Recent failed/foiled coups and warning signals",
                    "effect": "Increase: Nigeria’s October 2025 failed coup and ongoing military arrests signal volatility; recent coup attempts in Mali (2024, 2025), Guinea-Bissau, and mutinies in Niger suggest potential for cascading military action as purges spark revenge cycles."
                }
            ],
            "no_scenario": "In both Africa and Latin America, heavy-handed repression, foreign military backing, and aggressive coup-proofing by regimes succeed in preventing any organized military or elite faction from seizing control. Opposition is suppressed through arrests, surveillance, and elite co-optation, discouraging conspiracy formation. Elections are manipulated successfully (e.g., Guinea-Bissau, Benin), but incumbents stop short of illegal/violent power grabs that would trigger the coup definition. Recent coup scares act as cautionary tales, and the late-year holiday period further dampens immediate risk.",
            "yes_scenario": "One of the following occurs: (A) A rival military faction in Mali, Niger, or Burkina Faso attempts a 'palace coup' as current juntas lose legitimacy due to security deterioration or failed promises, with Russia/Turkey providing plausible deniability or shifting support to the new regime; (B) A self-coup unfolds in Latin America or West Africa, where an incumbent, fearing regime loss, dissolves parliament or delays transition unconstitutionally, deploys the military, and quashes resistance (as seen historically in Guinea, Sudan, or Peru’s self-coup attempt, but this time successfully); (C) A rapidly escalating security, economic, or legitimacy crisis triggers mutiny in a fragile African state (e.g., Guinea-Bissau, Benin, Cameroon), capitalizing on recent patterns of elite defection and external actors’ distraction.",
            "final_reasoning": "Base rates for successful coups in Africa from 2020–2025 are around 1 per 4–6 months in the Sahel, much higher than historical global or even continental averages. Present warning indicators in several states—ongoing military dissatisfaction, legitimacy crises, jihadist expansion, failed and foiled coups (notably in Mali, Guinea-Bissau, and Nigeria)—suggest a structurally elevated coup risk. However, multiple counter-forces: active coup-proofing, high-level purges, ongoing external support (notably Russia, Turkey), and limited windows for organized elite conspiracy (given current instability and mutual suspicion) argue for modest reduction in probability relative to the last 12–18 months. Latin America remains far less likely, with most recent events falling short of the 'successful coup' threshold. Given the 1.5-month window, successful coups are low-frequency but not rare events in Africa, especially under present conditions. Aggregating all factors, I judge the probability at 28%—higher than base rates for most of modern history, but reflecting tangible short-term countermeasures and the limited window.",
            "final_probability": 28
        },
        "SecurityStudies (CivilMilitaryRelations)": {
            "time_to_resolution": "Approximately 6 weeks (until January 1, 2026)",
            "perspective_relevance": "As an expert in Security Studies with a focus on Civil-Military Relations, my forecasts draw on an understanding of the structural, institutional, and psychological dynamics within armed forces and political elites in coup-prone regions. I leverage familiar base rates for coups, analysis of regime-military relations, recent and historical coup triggers, the effects of external military actors, and regional network effects. My assessment also weighs current vulnerabilities in civil-military equilibrium and contextualizes them within ongoing events and historical precedent.",
            "status_quo": "Status quo is that several African and some Latin American states are ruled by military juntas installed via coups; there is ongoing instability, but recent months have seen attempted or rumored coups foiled (e.g., in Nigeria, Mali), not successful regime changes. As of November 2025, no new successful coups have occurred since the question's open date (August 21, 2025). Base rates suggest a nontrivial likelihood, but with lower frequency than during coup waves.",
            "perspective_derived_factors": [
                {
                    "factor": "High Base Rate of Coups in Africa",
                    "effect": "Increases probability. The period 2020-2023 saw an uptick in successful military takeovers in Africa, and historically, sub-Saharan Africa, especially the Sahel and West Africa, display the world’s highest coup rates. The base frequency in recent years has been 2-3 per year, with clusters in the second half of years."
                },
                {
                    "factor": "Recent Failed Coup Attempts and Countermeasures",
                    "effect": "Decreases probability slightly. Multiple high-profile failed or foiled coups in Nigeria (October 2025), Guinea-Bissau (2023), and continued regime purges (Mali, Burkina Faso) suggest that incumbent juntas are becoming more adept at coup-proofing—arresting officers, monitoring the ranks, reliance on external security contractors."
                },
                {
                    "factor": "Junta Fatigue, Factionalization, and Regime Vulnerability",
                    "effect": "Increases probability. News highlights deepening splits in Mali, Burkina Faso, Niger, and the erosion of legitimacy and institutional trust; popular support for juntas is wavering as insurgency, economic crisis, and repression worsen. This increases temptation for officers or rival factions to attempt to seize power."
                },
                {
                    "factor": "Jihadist Insurgency and Security Collapse",
                    "effect": "Increases probability. Severe degradation of security in Mali and the Sahel, with the threat of capital cities (e.g., Bamako) under siege, destabilizes regimes and creates opportunities for coups, especially if military failure and public discontent converge."
                },
                {
                    "factor": "Foreign Support/External Military Presence (Russia via Wagner/Africa Corps etc.)",
                    "effect": "Decreases probability modestly in regime capitals, Increases probability in periphery. Regimes in Mali, Burkina Faso, and CAR rely on Russian mercenaries or formal troops for regime security. This coup-proofing likely limits risk of sudden internal toppling in capitals but may drive dissident factions to attempt more desperate actions elsewhere."
                },
                {
                    "factor": "Increasing Autocratization via Constitutional Manipulations (Benin, Guinea-Bissau, Central African Republic, etc.)",
                    "effect": "Increases probability slightly. When incumbents pursue anti-democratic reforms and exclude opposition, they risk provoking military or elite backlash, especially when the judiciary and opposition are neutralized and succession is contested."
                },
                {
                    "factor": "Regional Coup Contagion and Networks",
                    "effect": "Increases probability. Coups cluster temporally and regionally. Continued instability in West Africa, especially after 2023, and weakening ECOWAS deterrence, raises the likelihood that one attempted coup will trigger others, or that factions coordinate cross-border."
                },
                {
                    "factor": "Short Forecast Window (6 weeks)",
                    "effect": "Decreases probability. Coups are rare events and compressing the forecast period reduces the chance, all else equal. While the base annual rate is above 1, in a 6-week window, chance is around 10-15% by base rate, depending on how 'hot' the current moment is."
                },
                {
                    "factor": "Latin America: Low Short-Term Coup Vulnerability",
                    "effect": "Decreases probability. While there have been attempts (Bolivia 2024, Brazil/Peru 2022–23), most Latin American militaries are much less coup-prone than their African counterparts, with higher institutionalization and external constraints."
                }
            ],
            "no_scenario": "Despite ongoing instability, regime purges, and worsening economic/security situations, existing juntas in Mali, Burkina Faso, Niger, Guinea, or CAR continue to suppress dissent, arrest plotters, and maintain control with help from outside (e.g., Russia’s Africa Corps). Similarly, autocratic incumbents in Guinea-Bissau or Benin enforce their hold through elite manipulation rather than being toppled by coups. Jihadist groups may take territory but do not directly stage or enable a swift military coup that topples a regime and consolidates power within the window. Latin America remains stable with only scattered political unrest or failed putsch attempts.",
            "yes_scenario": "A fissure develops within the armed forces of Mali or Burkina Faso, triggered by battlefield losses, elite rivalries, or economic pain—possibly catalyzed by discontent officers bypassing coup-proofing measures. The coup succeeds because external (e.g., Russian) forces are either complicit, neutralized, or absent. Alternatively, in Guinea-Bissau, exclusion of key political players and ongoing electoral manipulation provoke a successful self-coup by the incumbent, or a military intervention. A rapid and credible collapse of regime control, with a new group consolidating government and military power before the end of 2025, is recognized by major media. In an unlikely scenario, rapid state breakdown in a small Latin American state (e.g., after a major scandal or violence) leads to a successful coup.",
            "final_reasoning": "Historically, the base rate for coups in Africa is elevated; the region faces repeating waves—with increased numbers from 2020-2023. The current 2025 newsflow shows foiled attempts (Nigeria, Mali), continued deep tensions (Mali, Burkina Faso, Niger), adverse security trends (Bamako at risk), and eroding junta legitimacy—which all point to a high underlying risk. However, in the immediate window (mid-Nov to Jan 1), existing juntas have survived previous acute threats by relying on surveillance, repression, and Russian/mercenary security. The absolute number of historically successful coups in any 6-week period is low, but above zero during recent upticks. Latin America, despite unrest, is unlikely to see a sudden regime change due to more robust civilian control and fewer recent military uprisings of the classic type. My best forecast, integrating heightened but plateauing coup climate in Africa, junta adaptation, short horizon, and regional contagion, is that the risk is materially above the 5% baseline but not above 20%. The chance hinges almost entirely on West African juntas (especially Mali and Burkina Faso) and—less likely—on Guinea-Bissau or Benin if political crises escalate drastically.",
            "final_probability": 13
        },
        "InternationalRelations (RegionalSecurityComplexTheory)": {
            "time_to_resolution": "Approximately 1.5 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in International Relations with a focus on Regional Security Complex Theory (RSCT), I analyze how states and non-state actors' security concerns are interlinked within particular regions, making security dynamics such as coups more contagious within security complexes like West Africa or the Sahel than in isolated polities. This theory illuminates the role of extraregional actors (e.g., Russia, Turkey), internal fragmentation, and regional regime patterns on the prospects for coups.",
            "status_quo": "Over the past few years, Africa—particularly the Sahel and West/Central Africa—has experienced a marked increase in successful coups, with several countries currently under military rule. Latin America, while historically coup-prone, has seen relatively few outright military takeovers in recent decades, with most disruptions falling short of the clear coup threshold.",
            "perspective_derived_factors": [
                {
                    "factor": "Coup Clustering in Regional Security Complexes",
                    "effect": "Increases probability. Recent coups in Mali, Burkina Faso, Niger, and Gabon, plus attempted coups in Nigeria and Guinea-Bissau, indicate a coup 'contagion' effect amplified by weakened regional norms, unresolved military transitions, and eroded democratic legitimacy within West Africa and the Sahel subcomplexes."
                },
                {
                    "factor": "External Support and Shifting Alliances",
                    "effect": "Increases probability. The increasing Russian (Africa Corps) and Turkish involvement in local regimes has provided embattled juntas with resources to consolidate or, paradoxically, deepened internal cleavages as rival factions contest such foreign patronage, raising coup risks. The expulsion of Western actors (France, UN) also removes traditional stabilizing influences."
                },
                {
                    "factor": "Extreme State Fragility and Jihadist Pressures",
                    "effect": "Increases probability. The collapse of state authority, insurgent advances (e.g., Al-Qaeda-aligned JNIM in Mali), and deteriorating economies (e.g., Mali, Burkina Faso, Guinea-Bissau) create incentives for military or elite interventions amid existential threats and regime infighting."
                },
                {
                    "factor": "Short Time Window and Recent Preemptions",
                    "effect": "Decreases probability. Many recent coup attempts (e.g., Nigeria Oct 2025, failed plot in Mali 2024, unrest in Burkina Faso) have been foiled, with leaders now highly vigilant, purging militaries and increasing patronage to stave off further plots. The extremely short window until Jan 1, 2026 limits the probability—only a few plausible opportunities remain."
                },
                {
                    "factor": "Latin America: Lower Base Rate, Institutional Resilience",
                    "effect": "Decreases probability. Despite tensions in countries like Bolivia, Brazil, and Peru, security forces remain mostly under civilian control, and populations have demonstrated resistance to overt military rule; therefore, the base rate for outright successful coups in Latin America remains low compared to the Sahel."
                },
                {
                    "factor": "Electoral Manipulation and 'Self-coups' as Bypass Mechanism",
                    "effect": "Slightly increases probability. Some African regimes (e.g., Guinea-Bissau, Benin) are hollowing out democracy without classic coups, sometimes resorting to 'self-coup' tactics, which could satisfy resolution criteria if an incumbent cancels or overturns electoral results or dissolves institutions."
                }
            ],
            "no_scenario": "Military regimes in Mali, Burkina Faso, and Niger solidify their current fragile power arrangements through purges, foreign support (Russian/Turkish), and increased repression, deterring further coup attempts in the short window. Jihadist insurgencies escalate but don't trigger palace putsches; elections in Guinea-Bissau, Benin, and elsewhere are manipulated but avoid outright military or executive takeovers due to international and domestic pressures. Latin America remains tense after the Bolivian attempt, but security and institutional resilience prevent a successful coup before year's end.",
            "yes_scenario": "A fragment within the military or elite (e.g., in Mali, Burkina Faso, Niger, Guinea-Bissau, or even Gabon/Chad) exploits a security crisis, elite infighting, or declining economic conditions to stage a successful coup (either classic or self-coup). For example, weakening cohesion within a Sahel junta (perhaps exacerbated by disputes over external patronage) triggers a sudden putsch, or a Latin American leader (e.g., in Bolivia or Venezuela) attempts to dissolve parliament or refuse to step down, qualifying as a self-coup under the criteria.",
            "final_reasoning": "The historical base rate for successful coups in Africa has averaged about 2-3 per year over the last five years, heavily concentrated in the Sahel and West Africa. There have been both classic and self-coups, often cascading through regional security complexes, especially where civilian state legitimacy is weak, and power is fragmented. News suggests persistent elite fragmentation in Mali, Burkina Faso, Niger, and Guinea-Bissau, with several failed or aborted attempts as recently as October-November 2025. Factors increasing coup risk—ongoing elite contestation, fraying military discipline, mounting jihadist/security crises, and reliance on foreign support—remain high, although the shortening time frame and recent crackdowns dampen possibilities. Regional Security Complex Theory suggests that coup activity often clusters and has not fully run its course in current risk regions; however, since several major regime axes are now dominated by juntas, the opportunities for further coups may be narrowing as power consolidates and purges occur. Latin America appears considerably less vulnerable to a successful coup (with the exception of a possible self-coup scenario, but no imminent crisis is reported there right now). Given the extreme recency of failed and successful attempts in West Africa, the ongoing regional and external pressures, and the five-week window, an elevated but not extreme probability is justified.",
            "final_probability": 43
        },
        "Political Science (CoupTrapTheory)": {
            "time_to_resolution": "Approximately 1.5 months (question closes on January 1, 2026; today is November 17, 2025).",
            "perspective_relevance": "As an expert in Political Science specializing in CoupTrapTheory, my perspective is crucial for assessing the risk of coups given cycles of military intervention, regime legitimacy, and the presence of 'coup traps'—situations where prior coups condition a state to become more vulnerable to future ones. By focusing on institutional weakness, recent precedent, regional contagion, factionalism in militaries, and exogenous influences, I provide a rigorous, academic approach grounded in both contemporary developments and historical base rates.",
            "status_quo": "The status quo is that, on average, there have been multiple coup attempts and several successes per year across Africa in the 2020s. Latin America has been somewhat quieter but not coup-free. As of today, there has not been a successful coup since the opening of the forecasting window (August 21, 2025).",
            "perspective_derived_factors": [
                {
                    "factor": "Base Rate of Recent Coups in Africa/Latin America (2020-2025)",
                    "effect": "Increases probability — Africa, especially the Sahel, has seen a heightened frequency of coups since 2020, with at least 7 successful military takeovers and numerous attempts. Latin America has had a lower base rate but recent attempted coups (Bolivia, Brazil, Peru). Base rate over a ~4.5 month period is likely between 0.5–1 successful coups in Africa, and <0.1 in Latin America."
                },
                {
                    "factor": "Entrenched Military Juntas and Factionalism",
                    "effect": "Increases probability — In Mali, Burkina Faso, Niger, and Guinea-Bissau, there is evidence of declining legitimacy, internal military splits, and stress between regimes and populations, creating a fertile environment for counter-coups or mutinies."
                },
                {
                    "factor": "Security Deterioration and Insurgencies (Sahel Jihadism, Loss of Rural Control)",
                    "effect": "Increases probability — Security crises drive perceptions of regime weakness, embolden military challengers, and historically have precipitated coups to 'restore order' or protect elite privilege."
                },
                {
                    "factor": "Presence of External Actors (Russia, Wagner, Turkey)",
                    "effect": "Ambiguous — Russian and Turkish support bolsters incumbents (potentially coup-proofing), but also makes militaries more politicized and creates rivalries that could prompt internal challenges (especially if some factions resent foreign ties)."
                },
                {
                    "factor": "Failed or Rigged Elections / Political Manipulation",
                    "effect": "Increases probability — In Guinea-Bissau and Benin, exclusion of opposition, erosion of pluralism, and growing public cynicism increase coup risks, as history shows autocratic backsliding is often followed by attempted military interventions (either to restore 'order' or on behalf of excluded parties)."
                },
                {
                    "factor": "Recent Failed Coup Attempts and Preemptive Purges",
                    "effect": "Slightly decreases probability in short term — Recent crackdowns in Nigeria and Mali following failed plots make further immediate attempts less likely due to increased surveillance, fear, or temporary cohesion."
                },
                {
                    "factor": "Seasonal/Temporal Considerations",
                    "effect": "Neutral — Although coups can occur any time, end-of-year periods sometimes see increased vigilance or clampdowns (e.g., during holidays or major events), but evidence is mixed."
                }
            ],
            "no_scenario": "Despite instability in Sahelian Africa and political turbulence in parts of Latin America, incumbent regimes maintain sufficient control, with military factions deterred by surveillance, recent purges (Nigeria, Mali), or external backers (Russia, Turkey), and no organized coup succeeds in seizing both political and military power before January 1, 2026. Temporary stability may be reinforced by the high cost of failure observed in recent failed plots.",
            "yes_scenario": "A faction within a military regime (e.g., in Mali, Burkina Faso, or Guinea-Bissau) or a disaffected, lower-ranked coalition ousts the ruling group—potentially amid escalating insurgent violence, contested election results, or popular outrage over authoritarian maneuvers (e.g., in Benin, Guinea-Bissau, or elsewhere). External powers could tacitly support a move, or internal triggers like worsening security, economic collapse, or overt manipulation spark military action that quickly consolidates.",
            "final_reasoning": "Analyzing recent data and news, coup risks remain acutely elevated in the West African Sahel, particularly in Mali, Burkina Faso, Niger, and to a lesser extent Guinea-Bissau, due to severe insecurity, eroding legitimacy, recent counter-coup attempts, and high levels of elite disunity—consistent with CoupTrap theory, which predicts repeated military interventions after precedent is set. The presence of Russian (Africa Corps) and Turkish support slightly raises the bar for successful external coups but does not eliminate internal factionalism, as evidenced by recent purges and failed attempts. Latin America is much less likely to experience a coup in this period; recent attempts have been quickly suppressed and civilian governments, though contested, face less immediate risk of military overthrow. The historic base rate for successful coups in Africa exceeds 1 per year since 2020 (with bursts of 2–3 per year in some stretches), and attempted/failure data imply a substantial risk even in a six-week window. Considering current events—multiple failed coup plots, disputed elections, moving out of ECOWAS, and mounting security crises—the probability is well above baseline, but widespread post-plot purges and external support provide a counterweight. I estimate a robust but not certain chance: 34%.",
            "final_probability": 34
        },
        "Political Science (ComparativeAuthoritarianism)": {
            "time_to_resolution": "Approximately 6 weeks (until January 1, 2026)",
            "perspective_relevance": "As an expert in comparative authoritarianism, I focus on the structural causes of coups—such as elite fragmentation, personalist vs. collegial regimes, international patronage, popular legitimacy, and civil-military relations. This allows me to distinguish between real coup risks and surface instability, particularly in regions with entrenched military governments or hybrid regimes using democratic institutions in performative ways.",
            "status_quo": "If nothing changes, there will not be a successful coup in either Africa or Latin America before January 1, 2026. Despite instability, most recent coups have occurred in countries that are either recently military-ruled or have consolidated autocratic power. Latin America shows attempted coups but little recent success; many African states with historic instability now have military regimes in place.",
            "perspective_derived_factors": [
                {
                    "factor": "Recency of successful coups in Africa",
                    "effect": "Increases probability slightly—African states, especially in the Sahel (Mali, Burkina Faso, Niger), have seen multiple successful coups in the past five years, indicating an elevated baseline."
                },
                {
                    "factor": "Military regime consolidation",
                    "effect": "Decreases probability—military-junta states tend to prioritize coup-proofing after coming to power, purging rivals and installing loyalists, making subsequent coups less likely in the short term."
                },
                {
                    "factor": "Elite disunity and grievances among officers",
                    "effect": "Increases probability—cases like Nigeria and Burkina Faso report deepening officer rank and strategy disputes, which increases coups' risk despite efforts to consolidate."
                },
                {
                    "factor": "Popular dissatisfaction/opposition exclusion",
                    "effect": "Increases probability—the erosion of legitimacy, pervasive economic hardship, and exclusion of opposition (examples: Benin, Guinea-Bissau, Mali) create conditions where would-be coup plotters perceive an opening."
                },
                {
                    "factor": "External military/influence/mercenary involvement",
                    "effect": "Ambiguous—Russian presence (Wagner/Africa Corps) both coup-proofs (by backing existing juntas) and heightens elite contest (through shifting alliances or overreach, e.g. Mali)."
                },
                {
                    "factor": "Jihadist insurgency and security collapse",
                    "effect": "Increases probability—a security crisis can erode regime legitimacy and provide rationale for dissatisfied officers or rival security services to strike (notably in Mali)."
                },
                {
                    "factor": "Recent patterns in Latin America",
                    "effect": "Decreases probability—recent events (Peru, Brazil, Bolivia) were attempts rather than successes; strong institutional constraints and international condemnation make successful coups hard in the region."
                },
                {
                    "factor": "Short time to resolution",
                    "effect": "Decreases probability—coups, while clustering, are still rare events; a 6-week window shrinks the probability even in an elevated-risk context."
                }
            ],
            "no_scenario": "Junta regimes in Mali, Burkina Faso, and Niger remain stable, relying on foreign (Russian) support, internal purges, and suppression of dissent. Elite disunity is suppressed in the short run. Latin American states experience instability and contested elections (e.g., Guinea-Bissau, Benin) but not outright military or self-coup takeovers before January 1, 2026. Jihadist insurgencies escalate but fall short of facilitating a palace coup. No credible report emerges of a military, self, or external-supported coup establishing full control.",
            "yes_scenario": "Deteriorating security or elite conflict provokes a breakdown within a military regime: for example, a faction in Burkina Faso or Mali, discontented with current leadership's handling of the insurgency, mounts a successful putsch (possibly with or without Russian acquiescence). Alternatively, crisis within Nigeria's officer corps or a cascading event in Guinea-Bissau or Benin leads to military takeover or incumbent refusal to transfer power following a failed election. For Latin America, a highly unlikely but not impossible scenario is a dramatic self-coup or breakdown in countries like Bolivia or Venezuela.",
            "final_reasoning": "Base rates show that Africa, especially the Sahel, experiences coup clusters, but most target fragile civilian governments or weak juntas within a year or two of the initial takeover. As of late 2025, most at-risk countries (Mali, Burkina Faso, Niger, Chad) already have entrenched military rulers who have recently engaged in coup-proofing and face international scrutiny or military support from Russia. While news reports indicate recent attempted coups (e.g., Nigeria's foiled plot), and fractured elite and security environments (e.g., in Burkina Faso and Mali), such efforts are usually anticipated and repressed in the immediate aftermath of prior coups.\n\nAdditionally, external involvement simultaneously bolsters coup-proofing and introduces potential for patronage conflicts but is unlikely to resolve in just six weeks. Latin America, despite sporadic attempts, features much stronger baseline constraints against successful coups, and recent events (Brazil, Peru, Bolivia) have not yielded regime overthrows. The news signals ongoing instability (contested or hollow elections, weak legitimacy, e.g., Guinea-Bissau, Benin), increasing latent risk for the medium term, but historical base rates for a new successful coup in any one country over a mere six-week period are low, albeit not negligible due to current African trends.\n\nGiven all factors, and noting that attempted but failed coups would not count, the most likely scenario remains 'No'. However, given recent histories and elevated signals in a handful of Sahelian and Gulf of Guinea states, the risk is meaningfully above zero. I judge the probability at 13%.",
            "final_probability": 13
        },
        "Political Science (PoliticalInstitutionalism)": {
            "time_to_resolution": "44 days (from November 17, 2025, to January 1, 2026)",
            "perspective_relevance": "As an expert in Political Institutionalism, I focus on the resilience or fragility of formal and informal rules that organize political competition and succession. I pay special attention to civil-military relations, legitimacy of ruling coalitions, elite cohesion, institutional constraints, and external actors’ roles. My argumentative advantage is in evaluating the relative strength of executive institutions versus security actors, and in noting that entrenched patterns (base rates) are powerful unless explicit mechanisms produce institutional breakdown.",
            "status_quo": "In both Africa and Latin America, the last several years have seen frequent coup attempts (especially in Africa’s Sahel zone), with several successful coups in Mali, Burkina Faso, Guinea, Niger, and Gabon between 2020 and 2023. Currently, military juntas have consolidated in Mali, Niger, and Burkina Faso, with signs of internal dissent but without an imminent coup reported. Latin America has seen coup or self-coup attempts in Peru (2022), Brazil (2023), and Bolivia (2024), but no successful military takeovers. The baseline outcome, absent significant change, is ‘No—no successful coup before January 1, 2026.’",
            "perspective_derived_factors": [
                {
                    "factor": "Base rate of successful coups, especially in Africa (Sahel subregion)",
                    "effect": "Increases probability: Africa has experienced an uptick in successful coups this decade (Sahel: 2020 Mali, 2021 Guinea, 2022 Burkina Faso, 2023 Niger, 2023 Gabon), suggesting a weakened regional taboo and increased likelihood over any given six-month interval."
                },
                {
                    "factor": "Consolidation and militarization of newly established juntas",
                    "effect": "Decreases probability: Once military coups consolidate and purge opposition within the state apparatus, the risk of secondary coups can decrease as key rivals are eliminated, repression intensifies, and external actors (e.g., Russia) provide security reinforcement."
                },
                {
                    "factor": "Elite/military fissures and popular unrest (institutional fragility)",
                    "effect": "Increases probability: Reports of dissension within Mali/Burkina Faso/Niger armed forces, problems of legitimacy, and continued poor economic performance increase the risk of intra-military coups and mutinies (as seen by the failed coup attempt in Mali in 2024 and recent mass detentions in Nigeria for a coup plot)."
                },
                {
                    "factor": "Role of external military actors and proxies (Russia’s Africa Corps, e.g., Wagner)",
                    "effect": "Decreases probability: The presence of Russian personnel and advanced materiel in Mali, Burkina Faso, and Niger is designed to bolster current juntas, increasing regime survival and coup-proofing, though it could foster nationalist backlash or factional rivalries if relationships break down."
                },
                {
                    "factor": "Institutional and constitutional manipulations (self-coup risk)",
                    "effect": "Increases probability: Benin’s extension of terms, Guinea-Bissau’s exclusion of opponents, and deteriorating judicial independence increase the risk of self-coup (e.g., disputed elections and leaders refusing to step down or remaining through illegal means), particularly if opposition is barred or suppressed."
                },
                {
                    "factor": "Short time horizon to resolution",
                    "effect": "Decreases probability: With just six weeks to go, the window for a successful coup is narrow, and most coups are typically preceded by escalating signals/rumors."
                },
                {
                    "factor": "Base rates in Latin America",
                    "effect": "Decreases probability: While there have been recent tense moments, successful military coups are rare in Latin America in the 21st century, with self-coups or institutional crises more likely than classic coups. The region’s militaries are generally less politically dominant than in Africa’s Sahel."
                }
            ],
            "no_scenario": "Despite ongoing unrest, elite splits, and regional instability in the Sahel, the current military regimes (particularly in Mali, Burkina Faso, Niger) manage to suppress internal coups, maintain sufficient support from their security forces, and receive continued backing from external patrons (Russia). In Benin, Guinea-Bissau, or other fragile states, opposition is unable to organize a coercive seizure of power, and even if protests escalate, leaders avoid an overtly unconstitutional consolidation of power that would qualify as a self-coup under the definition. Latin America avoids successful military intervention, even in tense post-electoral situations.",
            "yes_scenario": "A faction within the military in a Sahelian country—such as Mali, Burkina Faso, or Niger—overthrows the current junta or transitional president, establishing control within days/weeks and ending resistance. Alternatively, in West Africa (e.g., Guinea-Bissau), a pre- or post-election crisis sees the incumbent refuse to cede power in an illegal fashion (self-coup) and succeeds in consolidating authority for the immediate future. In Latin America, an unexpected military-led coup or self-coup (e.g., following an annulled or disputed election in a country with weak institutions) successfully places a non-elected group in power, but this remains less likely based on trends.",
            "final_reasoning": "Recent years’ coup surge in Africa’s Sahel boosts the base rate, and the reported coup attempts in Nigeria and institutional decay in Guinea-Bissau and Benin highlight deep fragility. However, the empirical frequency of successful coups in any given six-month period remains below 10% over the African continent as a whole, with some clustering. The presence of external military forces (Russian Africa Corps) could cut both ways—increasing regime survival, but potentially triggering rival factions. Yet most currently exposed regimes have consolidated power and are on high alert, especially post-2023 coups, and transitions often feature crackdowns. Latin America, while turbulent, is statistically much less likely to see a successful coup in this window. The window to 2026 is short. There are indicators of danger (arrests in Nigeria, constitutional crises in Benin/Guinea-Bissau), but no single country has ‘red-alert’ warning signals of an imminent successful coup at this moment, and failed coup attempts in 2024/2025 have not led to successful takeovers. Therefore, a careful estimate combining an elevated African base rate and a short time horizon yields a probability higher than the global average for normal peacetime years but still below a coin flip. Given the history and current rumblings, I estimate a 23% probability of a successful coup (classic or self) in Africa or Latin America before January 1, 2026.",
            "final_probability": 23
        },
        "Sociology (SocialMovementTheory)": {
            "time_to_resolution": "Approximately 1.5 months (from November 17, 2025 to January 1, 2026)",
            "perspective_relevance": "Drawing on Social Movement Theory provides a nuanced understanding of how mass mobilization, elite fractures, military discontent, structural grievances, and international alignments can create enabling conditions or barriers for coups. Sociology offers key insights into contentious dynamics (protest waves, state legitimacy), resource mobilization, opportunity structures, and the interplay between formal/informal institutions and social actors that precede coups.",
            "status_quo": "Africa, especially West Africa and the Sahel, has experienced a high rate of coups in recent years, primarily in Mali, Guinea, Burkina Faso, Niger, Chad, Gabon, and Sudan. Latin America experiences infrequent but notable coup attempts, none of which have succeeded in the same period. Since late 2023, militaries in the Sahel are entrenched; civil society is repressed, with opposition marginalized or co-opted. Despite attempted coups and 'coup scares' (e.g., Nigeria October 2025), most regimes are presently holding onto power.",
            "perspective_derived_factors": [
                {
                    "factor": "Elite Fragmentation and Military Cohesion",
                    "effect": "Elite fragmentation—including infighting within military regimes or between military and civilian actors—raises coup risk, especially where coalitions are brittle. Recent news notes coup attempts and purges (e.g., Nigeria, Mali 2024 coup attempt), suggesting persistent but not escalating instability. However, tightly consolidated juntas, as in Burkina Faso and Mali, have thus far managed internal dissent through repression, suggesting a moderate net increase in risk."
                },
                {
                    "factor": "Popular Grievances and Social Movement Suppression",
                    "effect": "Mass civilian discontent, driven by economic hardship, insecurity (e.g., jihadist violence), rights abuses, and exclusion from political processes (Benin, Guinea-Bissau), theoretically increases coup risk by creating openings and legitimacy for military intervention. However, the persistent repression and lack of mass mobilization (opposition is excluded, surveilled, imprisoned) have so far prevented street movements from aligning with armed actors. This factor slightly increases risk but is partially counteracted by regime/societal exhaustion."
                },
                {
                    "factor": "International Involvement and External Support",
                    "effect": "Presence of Russian troops and the Africa Corps, as direct successors to the Wagner Group, strengthens embattled juntas via military resources, technical support, and political legitimacy, reducing the prospects for anti-junta coups but potentially provoking internal regime contests (e.g., rival security factions). Turkish and Chinese engagement adds further complexity. This decreases the likelihood of successful outside-supported coups, but foreign involvement may deepen internal fractures or provide pretext for so-called 'self-coups.'"
                },
                {
                    "factor": "Opportunity Structure (Elections, Succession, Transitions)",
                    "effect": "No major, open succession crises, contested elections, or civil society mobilizations are imminent in the next six weeks. While Guinea-Bissau has an approaching (flawed) presidential election, the ruling clique has locked out the main opposition, reducing the likelihood of opportunistic coups during electoral uncertainty but increasing long-term risk. Benin has extended term limits without immediate effect; the most restive Sahel regimes (Mali, Burkina Faso, Niger) have delayed or abandoned transitions, increasing short-term regime resilience."
                },
                {
                    "factor": "Contagion and Historical Base Rates",
                    "effect": "Africa's recent coup trend is well above the long-term average: over half a dozen successful coups since 2020, and several major attempts or scares in 2024-2025. Base rates suggest at least one coup every 6-12 months in Africa, overwhelmingly centered on the Sahel. Latin America remains an outlier: despite polarization (Peru 2022, Bolivia 2024) and street turmoil (Brazil 2023), militaries have remained under civilian control in practice. Base rates reinforce material risk, especially for Africa."
                }
            ],
            "no_scenario": "The entrenched military regimes in Mali, Burkina Faso, and Niger suppress internal dissent and preempt plotters through intelligence and purges, relying on Russian support to insulate themselves. No opportunistic faction or popular movement can achieve the necessary mass or elite support to unseat the incumbent. Guinea-Bissau's fraudulent election proceeds with limited protest; in Latin America, elites maintain cohesion despite discontent. No successful coups occur before January 1, 2026.",
            "yes_scenario": "Internal splits within a Sahel junta (e.g., Burkina Faso, Mali, Niger) lead to a rapid, overt military coup by dissatisfied officers—potentially responding to economic hardship, loss of territory to jihadists, or stalled transitions. Alternatively, another coup attempt in Nigeria or Guinea-Bissau gains traction from mid/high-level officers amid leadership crises or election-related instability. A peripheral country (e.g., Guinea-Bissau, Central African Republic) experiences a swift, successful putsch due to elite fracturing or loss of external support.",
            "final_reasoning": "Social Movement Theory emphasizes that coups generally require elite splits, precipitating grievances, diminished regime legitimacy, and constraining or permissive international environments. The current regional constellation in Africa reflects (a) ongoing severe grievances and insecurity, (b) documented elite tension/purges (Mali, Nigeria), and (c) persistent, if not rising, coup risk given the recent tempo. Latin America, by contrast, has not seen a successful coup in over a decade and is not exhibiting significant coup enabling structures at the present. Critically, while several African states show repression and instability, most incumbent juntas have maintained cohesion and foreign (Russian, Turkish) backing, blunting immediate risk. Guinea-Bissau's defective election could trigger a destabilizing event but the opposition is already sidelined and the security sector is under executive control. Therefore, the short time horizon (six weeks), relative absence of scheduled transitions, and current regime resilience suggest a higher-than-baseline but less-than-even risk—driven almost exclusively by the African Sahel. Thus, a coup is plausible but not probable before January 1, 2026.",
            "final_probability": 28
        },
        "Sociology (EliteTheory)": {
            "time_to_resolution": "Approximately 1.5 months (from November 17, 2025, to January 1, 2026)",
            "perspective_relevance": "As an expert in Elite Theory (Sociology), my approach focuses on competition and circulation among elites, the fragility of institutional legitimacy, the control of coercive apparatuses (military/security), and the structural incentives for elite groups to defend, capture, or overthrow existing power systems. Coups are fundamentally elite-driven phenomena: they reflect breakdowns in elite cohesion, legitimacy crises, or opportunities for excluded/marginalized elite factions to seize power. This perspective is especially pertinent to Africa and Latin America, where state institutions are often weaker, militaries and security actors are politicized, and external actors (major powers, mercenaries) mediate or manipulate elite competition.",
            "status_quo": "The status quo is one of high coup activity in Africa, especially in the Sahel (Niger, Mali, Burkina Faso, Guinea, Gabon), with recent attempts also in Nigeria. Latin America sees more failed or quasi-coup attempts (Peru, Brazil, Bolivia). Most recent coups in Africa resulted in entrenched military rule or elite reshuffles rather than short-term returns to democracy. In the absence of further elite splits, robust opposition, or acute external shocks, the near-term status quo would be continued control by current juntas and diminished likelihood of new, successful coups in these high-risk states. Latin America remains relatively stable at present.",
            "perspective_derived_factors": [
                {
                    "factor": "Elite fragmentation within military regimes",
                    "effect": "Increases probability. Recent reports from Mali, Burkina Faso, and Niger indicate cracks in elite cohesion (failed coup in Mali 2024, dissent in Burkina Faso/Niger, internal mutinies in Nigeria), raising the risk of new elites attempting to displace incumbents if a window of opportunity emerges."
                },
                {
                    "factor": "Legitimacy crises and declining popular support for juntas",
                    "effect": "Increases probability. Economic hardship, human rights abuses, and security failures undermine regime legitimacy, emboldening rival elites or factions to justify seizure of power as a route to restore order and popular support."
                },
                {
                    "factor": "Presence and interests of foreign patron states and mercenaries",
                    "effect": "Increases probability, but with nuance. Russian 'Africa Corps'/Wagner provides some stabilizing force for client juntas in Mali, Burkina Faso, Niger, but also creates risk: if external backers shift support, encourage differentiation among factions, or suffer setbacks, coups may occur. Additionally, external actors can provide both the means and incentives for coups."
                },
                {
                    "factor": "Regional trends and recent base rate",
                    "effect": "Increases probability. The last five years have seen at least nine successful coups in Africa, and in prior years, multiple per year (especially in the Sahel). The empirical base rate suggests at least one successful coup every 6-12 months somewhere in Africa, with clusters and contagion effects possible."
                },
                {
                    "factor": "Proximity to elections or transitions",
                    "effect": "Increases probability. Guinea-Bissau, Benin, and the Central African Republic all face controversial elections or constitutional transitions, which are classic triggers for coups if elites feel threatened by exclusion or manipulated outcomes (see Guinea-Bissau 2025, Benin’s constitutional revision, CAR’s third-term bid)."
                },
                {
                    "factor": "Degree of elite consolidation and repression",
                    "effect": "Decreases probability. Where elites have succeeded in purging rivals (e.g., juntas in Mali, Burkina Faso) and co-opted key security services with external backing, the window for an immediate coup may be narrowed, at least temporarily."
                },
                {
                    "factor": "Elite learning and coup-proofing",
                    "effect": "Decreases probability somewhat. After waves of coups, incumbents often adapt by redistributing patronage, shuffling security chiefs, and increasing surveillance for conspiracies (as seen in Nigeria and Mali)—short-term, this may reduce coup probability."
                },
                {
                    "factor": "Latin America baseline stability",
                    "effect": "Decreases probability moderately. Despite deep issues in some states, recent coup attempts in Latin America (Bolivia 2024, Peru 2022, Brazil 2023) have failed, indicating robust elite consensus against extra-constitutional moves in most cases."
                }
            ],
            "no_scenario": "A No outcome (no successful coup) occurs if the current military juntas in Mali, Niger, Burkina Faso, et al. suppress dissent or manage elite splits through purges and control over coercive instruments; if rising elite contestation does not translate into effective action (as with failed coups in Mali, Nigeria, and Burkina Faso recently); and if elite-pact transitions (e.g., Benin, Guinea-Bissau/CAR) are managed through elite bargains rather than direct overthrows, partly due to enhanced coup-proofing and external support. In Latin America, political contests remain within elite-institutional channels.",
            "yes_scenario": "A Yes outcome arises if, for example, a splinter group in Mali, Burkina Faso, Niger, or Guinea-Bissau attempts and succeeds in a palace coup (removing the incumbent junta head and establishing effective control, dissolving resistance in 1-2 weeks) amid deepening security and legitimacy crises, external patronage shifts, or unforeseen elite splits. Alternatively, an incumbent leader (in Africa or Latin America) attempting a self-coup (illegally extending their rule at transition) might be overthrown by another elite faction or the military. Fragile constitutional transitions (e.g., Benin’s new system, Guinea-Bissau’s exclusionary election) or strongman succession crises (e.g., CAR late 2025 presidential bid) could also trigger successful coups if rival elites are marginalized and perceive institutional avenues as fully blocked.",
            "final_reasoning": "African states (especially Mali, Burkina Faso, Niger, Guinea, Guinea-Bissau, the CAR, Sudan, Chad) are at elevated risk of further successful coups due to ongoing elite fragmentation, acute legitimacy crises, security deterioration (jihadist expansion), and the precedent of rapid coup cycles in recent years. Elite Theory suggests that coups are initiated when elite bargains break down and excluded factions believe security, external support, and legitimacy can be rapidly seized. While the presence of Russian (and to some extent Turkish/Chinese) advisors has enabled some junta stabilization (and thus, a short 'coup-proofing' effect), it has not fundamentally resolved elite vulnerability if cracks open at the top. Recent reports confirm coup/putschist sentiment, attempts, and detentions in Nigeria and Mali, suggesting elite splits are active, even if attempts have lately failed. The coup base rate for Africa (as measured from Powell/Thyne, VOA, and recent years) is roughly 1-2 successful coups/year, with clustering observed. Latin America remains relatively low risk short-term due to elite consensus and effective containment of populist or militarist uprisings. The timeframe (1.5 months) is short, which decreases probability from the annual average somewhat, as plotting and conducting a full coup (and consolidating control) is not trivial, especially when recent attempts have been disrupted and elite-purge strategies are ongoing. Still, the structural conditions—especially in the Sahel, Guinea-Bissau, CAR, and perhaps Benin—are unusually volatile, and just one elite failure/circulation event will be enough for a Yes outcome. My best estimate, reflecting both elite theory logic and base rates, is that there is a moderately high (~34%) chance that at least one successful coup will occur in Africa or Latin America within the forecast window, with Africa strongly more likely.",
            "final_probability": 34
        },
        "AreaStudiesAfrica (AfricanStateFragility)": {
            "time_to_resolution": "About 6 weeks (question resolves January 1, 2026; today is November 17, 2025)",
            "perspective_relevance": "As an expert in AreaStudiesAfrica with a focus on African State Fragility, I bring insight into military politics, coup risk factors, regional instability trends, and the interaction between governance, foreign intervention, and armed actors. Africa currently represents the global epicenter of military coups, and nuanced knowledge of recent events, elite dynamics, and regional spillovers is essential for forecasting. Additionally, close attention to base rates and the changing fragility landscape in the Sahel, Gulf of Guinea, and West Africa amplifies early warning cues.",
            "status_quo": "Since 2020, Africa has witnessed a marked increase in successful coups, especially in the Sahel. As of November 2025, the most recent major successful coups were in Niger (2023) and Gabon (2023), but attempted coups and rumors have persisted in several states (e.g., Mali, Niger, Nigeria, Guinea-Bissau). No successful coup has been reported between August 21 and today, but tension, elite splits, and instability remain high in Mali, Burkina Faso, Niger, Guinea-Bissau, and elsewhere. In Latin America, recent years have brought failed or abortive coups (Peru, Brazil, Bolivia), but the last classic military success remains distant.",
            "perspective_derived_factors": [
                {
                    "factor": "Elevated Coup Base Rate in Africa",
                    "effect": "Increases probability. Africa currently leads the world in successful and attempted coups, with multiple fragile military regimes in the Sahel (Mali, Burkina Faso, Niger) and persistent cycles of elite turnover and military dissatisfaction."
                },
                {
                    "factor": "Sahel Fragility and Internal Dissension",
                    "effect": "Increases probability. Mali, Burkina Faso, and Niger exhibit documented internal fissures within their new military juntas: failed/foiled coup attempts, public dissatisfaction, economic distress, ongoing insurgency, and mutual mistrust among officers. This creates a high-risk environment for factional coups."
                },
                {
                    "factor": "Role of External Actors (Russia, Wagner/Africa Corps)",
                    "effect": "Mixed, moderate increase. Russian security guarantees may help some juntas consolidate, but the influx of mercenary forces and rising human rights abuses also generate internal resentment and legitimacy crises, heightening coup triggers. Russian support does not immunize regimes from intra-military contestation."
                },
                {
                    "factor": "Escalating Insurgency and Erosion of Regime Control",
                    "effect": "Increases probability. Jihadist gains (esp. in Mali) and deteriorating security can undermine military regimes’ legitimacy, spark recriminations within the officer corps, and trigger putsch attempts as new factions promise to restore order or blame rivals for setbacks."
                },
                {
                    "factor": "Short Time Window (6 weeks)",
                    "effect": "Decreases probability. Successful coups are rare in any single week; the shorter the time window, the less likely a rare event, even in a high-base-rate environment. However, recent months have seen frequent warning signs."
                },
                {
                    "factor": "Coup Fatigue and International Attention",
                    "effect": "Mildly decreases probability. After multiple coups, there may be greater elite caution, and even successful plotters may hesitate if they perceive regime change fatigue or international opprobrium."
                },
                {
                    "factor": "Relative Stability in Latin America",
                    "effect": "Decreases probability. While there is political polarization, military organizations in most Latin American countries remain less coup-prone in the current period than West and Central Africa. The base rate is low over a 6-week window."
                }
            ],
            "no_scenario": "The status quo persists through the end of 2025, despite turbulence. Juntas in Mali, Burkina Faso, and Niger survive persistent infighting, opposition, and insurgency for at least 6 more weeks, aided by continued support from Russia and weakened civilian opposition. No military or other elite group successfully removes and consolidates power over an incumbent regime in Africa or Latin America in this time frame. Failed or foiled coup trials may occur (as so far in Nigeria and Guinea-Bissau), but do not rise to successful regime change.",
            "yes_scenario": "A successful military coup—defined as new actors seizing and retaining command over both state and military apparatus with resistance subdued—unfolds in one of the fragile African regimes, most likely within the Sahel. Possibilities include an intra-junta putsch in Mali (against Goita), a toppling of Traoré in Burkina Faso by rival officers, or a crackdown-turned-coup in Guinea-Bissau following disputed elections. Alternatively, an unexpected coup erupts in a hitherto relatively stable but politically contentious state—for example, a disgruntled officer corps in Gabon or Chad moves against the incumbent. Less likely, but possible, is a classic self-coup or contested transfer of power in a Latin American state such as Bolivia, Ecuador, or Venezuela.",
            "final_reasoning": "The base rate for coups in Africa has sharply risen, especially in the Sahel, where recent years have brought cluster coups and persistent institutional fragility. Contemporary evidence (late 2025) highlights severe fissures in Mali’s junta, exposure of coup attempts in Nigeria and Guinea-Bissau, open regime legitimacy crises, and spiraling security threats that frequently serve as coup motivators. The short resolution window does temper probability: on average (Powell & Thyne dataset), successful coups in Africa occur about 1-2 times per year since 2020, equating to a rough 3-4% monthly chance, but current conditions justify an upward adjustment. Multiple warning articles in October and November specifically reference failed or foiled coup plots (most recently in Nigeria, Guinea-Bissau, and Mali), high levels of regime paranoia, and fundamental elite and social grievances in the Sahel. External Russian involvement both mildly hardens regime survival and increases coup-triggering grievances. Latin America, by contrast, remains relatively stable, but cannot be totally ruled out. Weighing the extraordinary turbulence, abundant warning signs in Mali/Burkina/Niger/Guinea-Bissau, and global base rate, against the limited time window, I estimate a high but not near-certain probability of a successful coup before January 1, 2026.",
            "final_probability": 38
        },
        "AreaStudiesAfrica (NeoPatrimonialism)": {
            "time_to_resolution": "Approx. 1.5 months (from Nov 17, 2025 to Jan 1, 2026)",
            "perspective_relevance": "My expertise in Area Studies Africa, especially neo-patrimonialism, is crucial in this context. Many African and some Latin American states show neo-patrimonial characteristics: the centrality of personalist leadership, blurred state-society boundaries, political personalization, weak formal institutions, and the primacy of informal networks. These factors inform both coup risk and the mechanisms through which elites or the military attempt (successfully or not) to seize power. Neo-patrimonial regimes tend to breed institutional distrust and elite competition, while their reliance on patronage and the weakness of legitimacy make them susceptible to both internal and external shocks. This approach allows me to contextualize apparent stability or instability beyond surface electoral or constitutional changes, accounting for how real power is distributed and resisted.",
            "status_quo": "Recent years (2020-2025) saw a sharp uptick in successful coups in Africa (e.g., Mali 2020, 2021; Burkina Faso 2022; Niger 2023; Gabon 2023) but only failed or attempted coups in Latin America. In 2024-2025, coup activity seems to have plateaued: some failed coups (e.g., Nigeria 2025, Mali 2024) but no clear recent successes since Gabon in Aug 2023. Status quo is tense standoff: fragile authoritarian-military regimes under pressure, coup risk remains above historical median.",
            "perspective_derived_factors": [
                {
                    "factor": "Neo-patrimonial power consolidation",
                    "effect": "Decreases probability. Regimes that have recently experienced coups (e.g., Mali, Burkina Faso, Niger, Chad) are engaged in heavy power consolidation: repressing opposition, patronage to key officers, purges and counter-intelligence. This, in the short term, increases regime resilience even if unpopular and fragile long-term."
                },
                {
                    "factor": "Elite and military disunity (factionalism/’coup trap’ effect)",
                    "effect": "Increases probability. Evidence from Mali, Burkina Faso, and Nigeria suggests persistent elite fragmentation, dissatisfied junior officers, and power struggles. When patronage flows are squeezed, competition rises, fueling coup plots. Failed attempts (Nigeria 2025, Mali 2024) indicate ongoing, unresolved tensions."
                },
                {
                    "factor": "External Support and Foreign Mercenaries",
                    "effect": "Decreases probability. Russian Africa Corps/Wagner and Turkish support (e.g., for Mali and Burkina Faso) bolster ruling juntas with both security services and personal security, complicating local plots and acting as coup-proofers, even if at the cost of further alienating segments of national armies and populations."
                },
                {
                    "factor": "Jihadist militancy & state collapse risk",
                    "effect": "Ambiguous or increases. In Sahelian states like Mali and Burkina Faso, massive territory loss, economic crisis, and state legitimacy erosion can provoke palace coups as the military blames ruling elites for failures, or—alternatively—cause state collapse without a clear coup outcome if security/command disintegrates."
                },
                {
                    "factor": "Coup contagion and the legacy of recent normalization",
                    "effect": "Increases probability. The normalization of military rule with regional legitimization, and the waning bite of external sanctions (ECOWAS weakened), lower the psychological barrier for further coups in neighboring fragile states (e.g., Guinea-Bissau, Central African Republic, Guinea, Chad)."
                },
                {
                    "factor": "Current regional disruption fatigue",
                    "effect": "Decreases probability. Having just completed coup cycles, many potential plotters in core risk states may prefer to wait for electoral transitions, as repression is heightened and vigilance is at peak."
                },
                {
                    "factor": "Latin America base rates",
                    "effect": "Decreases probability. Although attempted coups and contested legitimacy remain (e.g., Peru, Bolivia, Brazil), no outright successful military takeovers since 2009 (Honduras). Democratic resilience is relatively stronger, so risk is far lower than Africa."
                }
            ],
            "no_scenario": "Despite evident stress, no coup plot manages the surprise/gains sufficient insider support or external greenlight before Jan 1, 2026. Juntas in Mali, Burkina Faso, Niger suppress mutinies and fend off palace intrigues, often using repressive and foreign-backed means. Latin America remains tense, but civil-military boundaries are not violated to a full regime change. Factionalism and grievances persist, but elites prefer to avoid the risks of full-fledged coups in the extreme short term—perhaps awaiting post-election periods or the next opportunity window.",
            "yes_scenario": "A successful coup occurs in the ‘red zone’ states (Mali, Burkina Faso, Guinea-Bissau, Central African Republic, Sudan, or Guinea) where intra-regime disputes escalate, a commander or rival faction seizes the capital or moves at a moment of perceived or real weakness (security breakdown, unpopular decision, failed repression, external trigger, or financial collapse). For instance, in Mali, worsening crisis/insurgent gains provoke a palace coup according to the ‘coup trap’ dynamic. Alternatively, in Guinea-Bissau, elite exclusion mobilizes dissatisfied military factions to depose Embalo. In Latin America, an extreme outlier—Peru, Bolivia, or a weak Central American state—experiences military intervention (but this is quite unlikely).",
            "final_reasoning": "The base rate for successful coups in Africa has been markedly elevated since 2020, with roughly 1-2 per year (4 in 2021-2023, then declining). The period since August 2023 (Gabon’s coup) lacks confirmed successful coups, but several failed or attempted coups have occurred (Mali Aug 2024, Nigeria Oct 2025). This signals both underlying stress and increased vigilance/repression. In Latin America, base rates are close to zero for outright military-led regime change in the 21st century. Most at-risk African countries remain junta-led states recently coup-proofed with heavy foreign military security and elite purges; their risk is substantial but the window is now narrow (just 6 weeks). Elite dissatisfaction is real, and the precedent for coups is set, so sudden regime collapse or a high-risk plot with internal buy-in is possible, especially in Sahel states or Guinea-Bissau. However, heightened security, foreign mercenaries, and current counter-coup measures reduce odds in this short interval. My estimate: A non-trivial chance (~1 in 7) of a successful coup somewhere, driven by insecurity and unresolved fractures (especially in Mali, Burkina Faso, Guinea-Bissau); the probability is higher for Africa than Latin America, and the minimal interval before Jan 1, 2026, is a limiting but not decisive factor.",
            "final_probability": 15
        },
        "AreaStudiesLatinAmerica (LatinAmericanMilitaryIntervention)": {
            "time_to_resolution": "Approximately 6 weeks (from Nov 17, 2025 to Jan 1, 2026)",
            "perspective_relevance": "As an expert in Area Studies with a focus on Latin American military intervention, I bring deep familiarity with the institutional patterns, historical coup dynamics, and political-military ties in both Africa and Latin America. This includes tracking how external support, internal military cohesion, civil-military relations, and governance failures trigger coups, as well as the recent uptick in military takeovers in francophone Africa and occasional, lower-probability attempts in Latin America. My expertise is highly relevant because the base rate for coups is much higher in Africa—especially the West African Sahel—than in Latin America, and the question is tightly time-bound (just 6 weeks), demanding a nuanced risk assessment.",
            "status_quo": "In the short-term absence of shocks, Africa—especially the Sahel—remains under a series of entrenched military regimes which have survived multiple plots, while Latin America is relatively coup-resistant despite occasional flare-ups. Recent weeks: no coups have succeeded, though several regimes remain brittle and there have been credible coup attempts and ongoing insurgency risks.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent base rate of coups in Africa (especially the Sahel)",
                    "effect": "Strongly increases probability: Since 2020, Africa—especially the Sahel—has exhibited a high frequency of successful coups, often under conditions of military disunity and governance collapse."
                },
                {
                    "factor": "Short time window until the question resolves",
                    "effect": "Decreases probability: Only ~6 weeks left; even in high-base-rate years, successful coups still typically happen less frequently than monthly."
                },
                {
                    "factor": "State of play in key African countries (Mali, Burkina Faso, Niger) with recent or current juntas",
                    "effect": "Slightly increases probability: There are visible cracks—internal disputes, economic distress, and failed plots—but recent successes at repressing dissent and external military presence (notably Russia's Africa Corps) seem to be propping up existing regimes for now."
                },
                {
                    "factor": "Legitimacy crises and manipulation in other African states",
                    "effect": "Slightly increases probability: Guinea-Bissau, Cameroon, Central African Republic face declining legitimacy and institutional decay, raising the risk of attempted coups, but outright success is still hard in a limited window."
                },
                {
                    "factor": "Patterns in Latin America",
                    "effect": "Decreases probability: Recent years have seen coup attempts (Peru, Brazil, Bolivia), but strong civilian control, international deterrence, and lack of appetite in the officer corps have prevented successful outcomes."
                },
                {
                    "factor": "External stabilizers (Russia, Turkey, or even religious mediation) and international scrutiny",
                    "effect": "Decreases probability: Robust presence of Russian and Turkish security support, and visibility of recent coups, mean juntas are more alert to threats, while clergy and some civil society actors provide stabilizing counter-narratives in moments of tension."
                },
                {
                    "factor": "Parallels with past end-year periods",
                    "effect": "Slightly decreases probability: Historically, successful coups in Africa display weak seasonality, but several recent coups (Burkina Faso, Guinea, Niger, Gabon) occurred outside of the December–January window."
                }
            ],
            "no_scenario": "Military regimes in Mali, Burkina Faso, Niger, CAR, Gabon, Guinea, and Sudan maintain their hold, using internal purges, external (Russian/Turkish) military support, repression, and surveillance to neutralize coup threats. Legitimacy crises in other fragile states (Cameroon, Guinea-Bissau, CAR) do not escalate; coup attempt plots get exposed or deterred via carrots (reshuffling, co-optation) or sticks (arrest, exile). Latin America remains stable, with no successful military seizure of the executive, despite fractious politics in Bolivia, Brazil, and Peru.",
            "yes_scenario": "A faction within the military or key paramilitary actors, possibly provoked by worsening economic distress, internal rifts among junta leaders, or backlash against perceived foreign domination (as in Mali or Burkina Faso), overpowers regime loyalists in a rapid, well-coordinated move, quickly captures the capital, and neutralizes rivals with enough speed to forestall external or popular resistance. Alternatively, an unexpected political rift or failed succession maneuver in a fragile African or Latin American state leads to a breakdown in elite consensus, granting a window for a successful forcible seizure of power.",
            "final_reasoning": "The base rate of successful coups in Africa since 2020 is high—approximately 2–3 per year, especially in the Sahel—while the base rate in Latin America remains very low. The environments most likely to produce a coup in the next 6 weeks are African states with recent or ongoing instability. Indicators: There have been recent coup attempts (e.g., Nigeria, Mali failed coup 2024), demonstrations of military unrest, and governing fatigue in several juntas. However, these regimes are currently on high alert and well-entrenched, and the last few months show more purges than successful overthrows. The presence of Russian and Turkish military support is currently contributing to regime resilience. Although the short time horizon reduces the likelihood, the volatility and brittleness of several states in Africa, along with increasing intra-military tensions, means the probability cannot be discounted. Latin America is unlikely to see a successful coup in this period based on both the base rate and current events. Taking all factors into account—especially the combination of high Sahel volatility, short window, and external support for regimes—a coup in either continent remains plausible but below even odds for the 6-week period. A reasonable probability estimate, given base rates and the short window, is 28%.",
            "final_probability": 28
        },
        "AreaStudiesLatinAmerica (DemocraticBreakdownTheory)": {
            "time_to_resolution": "About 1.5 months (resolves January 1, 2026; today is November 17, 2025)",
            "perspective_relevance": "As an expert in Area Studies Latin America with a specialization in Democratic Breakdown Theory, I offer a deep understanding of the historical and structural drivers underpinning coups, the role of elite and military actors, and the regional institutional and social trends affecting regime stability. Comparing Africa and Latin America, I place current events in the context of shifting coup base rates and the effectiveness of contemporary coup-proofing, foreign intervention, and social pressures in both regions.",
            "status_quo": "Africa has recently seen an above-average frequency of successful coups, especially in the Sahel. Latin America, by contrast, has witnessed mostly coup attempts and institutional weakening, but not outright successful coups. The status quo in both regions leans toward authoritarian drift or semi-authoritarian consolidation rather than regime collapse assuming no major shocks.",
            "perspective_derived_factors": [
                {
                    "factor": "Coup Base Rates (Recent Trend)",
                    "effect": "Increases probability. Africa experienced 8 successful coups 2020-2024, with at least one credible attempt every few months. Latin America’s base rate is much lower, with only failed/aborted coups in the past 20 years (exceptions: Honduras 2009). Base rate for Africa, especially Sahel, is notably elevated now."
                },
                {
                    "factor": "Current Stability of Military Regimes Amid Internal Splits",
                    "effect": "Increases probability. Significant fissures reported within Mali, Niger, Burkina Faso militaries. Internal coup-proofing mechanisms (purges, foreign support) reduce some risk but have not fully succeeded, as seen in reports of coup attempts and news of widespread dissatisfaction."
                },
                {
                    "factor": "Institutional Coup-Proofing/Foreign Support",
                    "effect": "Decreases probability. Russia (Africa Corps/Former Wagner), Turkey, and China’s involvement have improved regime security (hardware, intelligence, elite protection, suppression of opposition) for current juntas, making quick successful coups harder."
                },
                {
                    "factor": "Insurgency/State Collapse Risk",
                    "effect": "Neutral to slightly increases probability. Collapse or imminent fall of a capital like Bamako could spell regime loss, but if triggered by jihadist insurgency rather than internal coup plotters, it may not meet the technical coup definition for the purposes of resolution—civil war/slippage to anarchy less likely to count."
                },
                {
                    "factor": "Regional Trends and Democratic Backsliding",
                    "effect": "Increases probability. Clear signals of institutional erosion in Sahel, ongoing state fragmentation, and weakened regional organizations (ECOWAS withdrawals, reduced external deterrence) accelerate trend toward military solutions."
                },
                {
                    "factor": "Electoral Manipulations/Self-Coups (Latin America)",
                    "effect": "Slightly increases probability, but effect is marginal in time frame. Peru 2022 and Bolivia 2024 attempts show potential for self-coup, but region’s militaries (e.g., Brazil 2023; Bolivia 2024) have so far shown reticence. Benin and Guinea-Bissau exhibit hollowing of democracy, but less likely to tip over within 6 weeks."
                },
                {
                    "factor": "Timeframe",
                    "effect": "Decreases probability. The short window (1.5 months) means even in high-risk environments, base rates have a diluted effect—most coups cluster around event triggers or high instability, neither of which are peaking at this moment compared to mid-2023."
                }
            ],
            "no_scenario": "Despite continued dissatisfaction and regime fragility, existing juntas in Mali, Burkina Faso, Niger, and Guinea-Bissau fend off internal rivals through purges, repression, and foreign support. No new fissure emerges strong enough to trigger a rapid, outright successful ouster of the executive within the short timeframe. In Latin America, civilian-military relations hold despite electoral or institutional tensions.",
            "yes_scenario": "A faction within the military or security services in Mali, Burkina Faso, or Niger overthrows the ruling junta in a rapid, overt action, taking control of the capital and armed forces, with the coup plotters installing a new leader and quickly consolidating control amidst confusion or amid an ongoing or escalating jihadist offensive that weakens junta authority. Alternatively, an unexpected self-coup or military intervention in a 'second-tier' at-risk regime (e.g., Guinea-Bissau) results in a successful seizure of power and international media confirmation.",
            "final_reasoning": "The probability of a successful coup (as defined) in Africa or Latin America before January 1, 2026 is elevated relative to longer-term historical averages, especially due to the ongoing instability and fracturing of military regimes in the Sahel. Recent news signals continued military dissatisfaction, credible allegations of attempted coups (e.g., Nigeria October 2025), and stress fractures in regimes' ability to maintain security. However, robust foreign backing and intensified coup-proofing efforts (Russian, Turkish support, internal purges following attempts) temper the odds for a successful outcome in such a short window. Latin America remains a relatively lower risk for classic coups, but not zero, given ongoing institutional erosion and the possibility of self-coup in fragile democracies. On a base rate for Africa of ~4-6 successful coups/year recently, calibrating for short window and existing 'coup fatigue' plus increased internal policing, the probability for the remainder of 2025 is non-trivial but not overwhelming.",
            "final_probability": 27
        }
    },
    "deliberation_probability": [
        32,
        28,
        13,
        43,
        34,
        13,
        23,
        28,
        34,
        38,
        15,
        28,
        27
    ],
    "deliberation_mean_probability": 27.384615384615383,
    "deliberation_sd": 9.367839145523916,
    "deliberation_probability_result": 27,
    "group_results": {
        "IntelligenceanalysisIndicatorsandwarningsmethod": {
            "forecaster_to_engage": "InternationalrelationsRegionalsecuritycomplextheory",
            "response_type": "critique",
            "response": "You’re leaning way too hard on regional cluster theory, and your 43% estimate is completely overblown for a six-week window—especially after a bust of failed or foiled coup attempts in the last quarter. Yes, the West African coup cluster has legs, but even in the worst recent run (2021–2023), you didn’t get a successful coup every month, let alone in the middle of a major crackdown phase. Most of the at-risk states are now under recalibrated, alert juntas who’ve learned (painfully) from the last wave and slammed their security state into overdrive—plus, Russian Africa Corps boots are on the ground. You’re also underweighting the inertia that follows a rapid spate of coups: after the dust settles, so does coup risk, at least in the immediate term. And Latin America? Please—no credible actors, no buildup. The short window and current regime consolidation reality mean your regional contagion logic overshoots the mark; base rates plus signal suggest elevated odds, but not a near-coin-flip. Bring your number down to reality and stop chasing ghosts."
        },
        "IntelligenceanalysisPoliticalriskassessment": {
            "forecaster_to_engage": "PoliticalScienceCouptraptheory",
            "response_type": "defense",
            "response": "Political Science (CoupTrapTheory) nails the core mechanics at play: coup cycles breed copycats, but they also provoke hyper-vigilant regime responses—purges, surveillance, and sometimes even outside military support—that don’t simply evaporate after the last failed plot. The 34% figure strikes the right register: high enough to respect the violently unsettled current in the Sahel, but not frothing with panic like the 43% crowd. This approach isn’t just base-rate worship; it accounts for the unique instability of coup-stacked juntas, the way coups often beget more coups (until the regime reaches peak paranoia), and—critically—that external actors now have skin in the game. It recognizes that repression breeds more elite fissures, so the status quo is not nearly as locked down as the junta-controlled press would have us believe. If anything, the rationale here could be made even bolder given the streak of brewing failed/foiled attempts, but the estimate remains grounded, balancing the cyclical logic with the realities of coup fatigue clouds and the constricting calendar. One of the most defensible takes on the board."
        },
        "SecuritystudiesCivilmilitaryrelations": {
            "forecaster_to_engage": "PoliticalScienceComparativeauthoritarianism",
            "response_type": "defense",
            "response": "Comparative Authoritarianism gets it right: after several years of hyperactivity thanks to the Sahel coup wave, we’re actually in a phase of post-coup consolidation, not open season. Your recognition that junta-led regimes—especially those propped up by external security guarantees—are much harder to overturn in the short run than is often assumed, is spot on. Latin America’s risk is practically a rounding error for this window, and your method appropriately weights the structural barriers and the time crunch; getting precise about the difference between \"lots of instability\" and \"imminent successful coup\" is essential here. Those hawking probabilities in the 30s and 40s are overcounting the churn in attempted but *unsuccessful* putsch activity. Even with so many alarm bells ringing, a coup that both kicks out a sitting executive and actually consolidates control remains a rare beast in only six weeks. This is a sober, empirically informed approach, and your 13%—while arguably a bit conservative—captures the main logic anchoring the current risk environment."
        },
        "InternationalrelationsRegionalsecuritycomplextheory": {
            "forecaster_to_engage": "AreastudiesafricaAfricanstatefragility",
            "response_type": "critique",
            "response": "You’re letting the state fragility narrative inflate your estimate past the point of reasonable near-term risk. Sure, structural cracks and institutional rot in Mali, Burkina Faso, and Guinea-Bissau are well established. But your argument glosses over the short-term dampening effect of all the recent, preemptive purges and the hardening of coup-proofing regimes after multiple scare events in 2024 and 2025. Just because the system is brittle doesn’t mean it’s automatically on the verge of shattering *again* right now—if anything, the pattern is more often: big cluster, then a chill as regimes watch their backs obsessively. Also, your mention of multiple failed or foiled attempts in the last quarter actually supports the view that would-be plotters are running out of both time and room to maneuver, not that another success is imminent. If you’re going to put the probability 'high but not near-certain,' you need to grapple with how coup timing ebbs in the wake of elite crackdowns and external security surges, rather than just assuming another domino must soon fall."
        },
        "PoliticalScienceCouptraptheory": {
            "forecaster_to_engage": "SociologySocialmovementtheory",
            "response_type": "defense",
            "response": "Social Movement Theory brings a crucial corrective to coup panic: mass grievances and elite splits are NECESSARY, not sufficient, for a coup to actually cross the finish line—especially in a short horizon like this. The 28% estimate rightly captures that, for all the Sahel's instability and failed plots, it's the rare conjunction of fractured elites, regime loss of control, AND a permissive international environment that turns a shaky regime into a toppled one. Most coups don't come out of nowhere; they're the end result of momentum and opportunity, neither of which seem to be at a boiling point in most at-risk polities right now (thanks in no small part to surveillance crackdowns and external mercenary presence). This isn’t the time for lazy extrapolation from 'lots of tension.' Instead, it’s about the intersection of conditions—and that’s exactly what Social Movement Theory keeps front and center. Rational, contextual, and a needed check on the base-rate alarmists."
        },
        "PoliticalScienceComparativeauthoritarianism": {
            "forecaster_to_engage": "AreastudiesafricaNeopatrimonialism",
            "response_type": "defense",
            "response": "This neopat crowd understands that the real coup engine is neither pure chaos nor pure structure, but rather the friction between deeply personalized, extractive states and their own predatory security machines. Your 15% probability sensibly accounts for the simultaneous truth that coup-proofed juntas are hardest to surprise in the immediate aftermath of crackdowns, and yet, by design, are always vulnerable just beneath the surface—if, and only if, elite divisions break through. Unlike the hand-wavers tossing around 30-to-40% odds, you smartly recognize that the post-2023 environment is less about accelerating collapse and more about periodic eruptions when the patronage machine jams up. The time horizon here is everything: even the most brittle regimes can usually gridlock their own militaries for weeks to months with purges, paranoia, and external rent-seeking. Your estimate keeps the powder dry for a slightly longer window, but doesn't blink at the lurking possibility. That's the kind of balance most panicky structuralists here are missing."
        },
        "PoliticalSciencePoliticalinstitutionalism": {
            "forecaster_to_engage": "AreastudieslatinamericaLatinamericanmilitaryintervention",
            "response_type": "critique",
            "response": "You're hedging too little on the wide divergence between African and Latin American coup environments. Sure, your 28% estimate takes the Africa base rate seriously, but you don't sufficiently correct for the statistical insulation of Latin America—where not only has the classic military takeover nearly vanished for decades, but recent so-called 'coup risks' (Bolivia, Brazil, Peru) have never even sniffed full regime capture. Worse, your probability seems derivative rather than analytical: it's just the mean of recent African risk plus the fact that 'things are tense.' That's lazy. The African picture does have hot spots—no serious person denies that—but you understate both the power of elite paranoia/coup-proofing after the 2023-25 purges and the drag from the region's rapid recent pace (historically, multiple post-coup years are followed by a lull). And on the Latin side, you fail to spell out any plausible scenario, instead just tacking it on 'because it's technically possible.' Your analysis would improve by properly partitioning the regional risks—Africa's short-term is elevated but not sky-high; Latin America's is functionally zero. Lumping them together dilutes analytic precision and inflates your estimate."
        },
        "SociologySocialmovementtheory": {
            "forecaster_to_engage": "SociologyElitetheory",
            "response_type": "critique",
            "response": "Elite theory always loves to shout about fractures and bargains breaking down, but you're inflating the probability by acting as if every whiff of elite tension or failed putsch is a near-guarantee of full regime collapse in a matter of weeks. Yes, fractured juntas are volatile—but they're also learning, violently, how to keep their own praetorians under control. The argument misses that after multiple failed coups and high-profile purges, the appetite for risk drops hard; plotters either flee, get locked up, or keep their heads down until the dust settles. External support (Russia, Turkey) hasn't just hardened the status quo, it's actively buying regimes critical breathing space, and the pace of successful coups always trails the noise of failed plots. Your 34% is too hot for the tight window and current climate of hyper-surveillance, especially when crackdowns are in full swing. This moment is one of nervous stagnation, not imminent elite circulation—unless you can point to a specific anti-junta faction ready to move, you’re selling drama, not clarity."
        },
        "SociologyElitetheory": {
            "forecaster_to_engage": "AreastudiesafricaAfricanstatefragility",
            "response_type": "critique",
            "response": "The state fragility logic is persuasive for long-run structural risk, but it's a blunt instrument for a six-week horizon with hardening juntas everywhere you look. The reality is, after the string of successful and failed coups in the Sahel, we're in a crackdown-induced valley, not another surge. You overemphasize fragility as immediate combustibility, neglecting how recent purges, external mercenaries, and hyper-alert militaries plug the cracks—at least for now. Sure, grievances are snowballing and legitimacy is in the basement, but it takes more than background decay for a new elite to stage, execute, and consolidate a takeover right under the noses of paranoid incumbents in this window. Your estimate sails past the empirically justified upper bound for such a short interval. If anything, the chance for sudden collapse is highest after a few uneventful months, once the pressure from repression itself generates fresh factional plotting—not at peak regime vigilance."
        },
        "AreastudiesafricaAfricanstatefragility": {
            "forecaster_to_engage": "AreastudiesafricaNeopatrimonialism",
            "response_type": "defense",
            "response": "The neopat take cuts through the noise, refusing both the Chicken Little shrillness of the high predictors and the lazy calm of pure base-rate watchers. You get that the Sahel's coup machine isn't just a matter of structural weakness or 'momentum'—it's about the constant dance between patronage, elite buyoffs, and the ever-lurking threat of military insubordination. By pegging the risk at a measured 15%, you actually treat the time horizon with respect instead of just extrapolating wild odds from a multi-year cluster. It's exactly the right call to highlight that coup-proofing and foreign mercenary backstopping don't make juntas invulnerable forever, but they sure do gum up the machinery for exactly this type of short-term window. The real risk lies in that slow poison: tomorrow’s acute danger comes out of today’s repressive calm, not during it. Those aiming 30%+ are falling for the misread that more turmoil always means more coups—when, in fact, hyper-paranoia keeps the gate shut, just until the palace guards get sleepy again. Well-calibrated and rooted in real African power dynamics."
        },
        "AreastudiesafricaNeopatrimonialism": {
            "forecaster_to_engage": "AreastudieslatinamericaDemocraticbreakdowntheory",
            "response_type": "critique",
            "response": "Your reasoning pays lip service to Latin America’s much lower risk for a successful coup but doesn’t rigorously enforce it in your estimate. There’s no plausible actor or mobilization for a full regime capture in Latin America, and recent events (Peru, Bolivia, Brazil) are textbook failed uprisings or institutional jostling—nowhere near what would count as a successful coup under the definition given. Including Latin America in your weighting at all just serves to artificially boost your number. Furthermore, your Africa estimate feels far too 'average'—you basically slice the recent boom years and apply a haircut for the time window, without fully grappling with the fact that, post-mass-purge, post-foreign reinforcement, and after multiple failed putsches, the window is neither 'average' nor a repeat of the 2021-2023 tempo. The smarter money says that, in a world of crackdowns, 'coup risk' is actually mostly risk of paralysis—not regime turnover—at least for another few weeks. You’d be right to stay elevated over pre-2020 base rates but marking the odds much above 20% signals more analyst FOMO than disciplined scenario work."
        },
        "AreastudieslatinamericaLatinamericanmilitaryintervention": {
            "forecaster_to_engage": "AreastudieslatinamericaLatinamericanmilitaryintervention",
            "response_type": "critique",
            "response": "You're suffering from region-blind analysis by assigning similar risk frameworks to Africa and Latin America: that's an analytical cop-out. While your base rate math for Africa is reasonable, you pad your probability by tacking on a hypothetical Latin America risk that historical and contemporary evidence just doesn't support. Latin American militaries don't just lack the will for classic coups right now—they face genuine institutional, international, and societal barriers. The odds of a surprise self-coup or military regime change are functionally nil this calendar year; saying otherwise boosts your headline number but not your forecast accuracy. Worse, you fail to factor in the concrete, chilling effect of past purges, coup fatigue, and Russian/Turkish security freezes, all of which conspire to keep even fragile Sahel states locked down for a spell. A genuine regionally differentiated risk assessment should have produced a figure in the teens, not the upper twenties. This kind of analytic sloppiness is what lets panic outweigh probability."
        },
        "AreastudieslatinamericaDemocraticbreakdowntheory": {
            "forecaster_to_engage": "AreastudieslatinamericaLatinamericanmilitaryintervention",
            "response_type": "critique",
            "response": "You're suffering from region-blind analysis by assigning similar risk frameworks to Africa and Latin America: that's an analytical cop-out. While your base rate math for Africa is reasonable, you pad your probability by tacking on a hypothetical Latin America risk that historical and contemporary evidence just doesn't support. Latin American militaries don't just lack the will for classic coups right now—they face genuine institutional, international, and societal barriers. The odds of a surprise self-coup or military regime change are functionally nil this calendar year; saying otherwise boosts your headline number but not your forecast accuracy. Worse, you fail to factor in the concrete, chilling effect of past purges, coup fatigue, and Russian/Turkish security freezes, all of which conspire to keep even fragile Sahel states locked down for a spell. A genuine regionally differentiated risk assessment should have produced a figure in the teens, not the upper twenties. This kind of analytic sloppiness is what lets panic outweigh probability."
        }
    },
    "revision_results": {
        "IntelligenceAnalysis (IndicatorsAndWarningsMethod)": {
            "my_phase1_final_probability": 32,
            "reasoning_for_revised_probability": "Having reviewed the group deliberation, especially the critique of InternationalRelations (RegionalSecurityComplexTheory)'s nearly coin-flip probability and the broader range of peer estimates (mostly 13–38%), I find my original 32% remains defendable but perhaps slightly high. Group consensus clearly trends below 35%, reflecting shared skepticism that even with continued risk, the consolidation phase in Sahelian juntas—backed by foreign mercenaries and tight surveillance—makes a successful coup in the next six weeks harder than the prior annualized base rate suggests. The most compelling new input is the extent of real-world regime vigilance post-failed coup attempts (notably in Nigeria and Mali). However, my approach remains somewhat more responsive to the tangible signals of coup plotting and elite fractures—and I continue to consider the risk as moderately elevated above median peer estimates, but not near even odds. Consequently, I'll moderately reduce my estimate for precision and group calibration.",
            "revised_probability": 28
        },
        "IntelligenceAnalysis (PoliticalRiskAssessment)": {
            "my_phase1_final_probability": 28,
            "reasoning_for_revised_probability": "On review of group deliberation, I see that most informed forecasters cluster in the 23–34% range, with a few notable outliers. The highest estimate at 43% is successfully critiqued as an overreaction to regional contagion theory—recent coups aren't occurring every month, and most current juntas are actively coup-proofing. Meanwhile, the lower range (13–15%) underappreciates the persistent volatility and the time-lagged effects of elite purges and failed plots in perpetuating underlying instability, especially in the Sahel. The consensus among experienced analysts using base rates, news reporting, and coup-cycle theory lands solidly in the high-20s to mid-30s. My original 28% is well supported: recent systemic shocks, ongoing fissures, and failed coups keep risk elevated, but hyper-vigilance, elite paranoia, and foreign military support dampen successful coup odds within the next six weeks. Therefore, I see no compelling reason—evidentiary or theoretical—to revise my estimate.",
            "revised_probability": 28
        },
        "SecurityStudies (CivilMilitaryRelations)": {
            "my_phase1_final_probability": 13,
            "reasoning_for_revised_probability": "After reviewing my initial forecast and group discussion, I observe significant clustering of probabilities in the 23-34% range from forecasters using risk, elite, and trap-centric theories, with only the outlier of 43% (which drew heavy critique for overweighting cluster/contagion effects). Several defensible approaches—Comparative Authoritarianism, Neo-Patrimonialism, and my own—converge at the lower end (13-15%), citing regime consolidation, coup-proofing, and the very short window as decisive limiters. The strongest argument for a slightly higher estimate is the historically elevated base rate for Africa in recent years and cascading regional warning indicators; however, even critics of the low estimate agree that the abnormally high numbers of attempted/foiled coups haven’t translated into actual regime changes in late 2025. No new, compelling evidence has emerged in deliberation to warrant a sharp upward move: the pro-revision arguments reiterate familiar signals (instability, elite fractures) but fail to overcome the strong inertial forces and security environment now in place. Therefore, although the weighted wisdom of the group suggests my probability was a bit on the conservative side, I still find the structural and temporal constraints (six-week window, active security crackdowns, and attrition of previous coup-prone targets) justify a forecast near the bottom of the group range, so I’ll revise only slightly upward to account for the ongoing, clustered coup risk in Africa.",
            "revised_probability": 15
        },
        "InternationalRelations (RegionalSecurityComplexTheory)": {
            "my_phase1_final_probability": 43,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, compelling critiques from 'IntelligenceAnalysis (IndicatorsAndWarningsMethod)' and my own engagement with 'AreaStudiesAfrica (AfricanStateFragility)' highlight I was over-weighting the effect of regional contagion and clustering, especially in the immediate (6-week) term. Multiple recent foiled or failed attempts, visible regime paranoia, and aggressive purge/coup-proofing activity not only indicate elevated threat, but also signal that regimes are locking themselves down, which empirically tempers near-term risk. Forecasters emphasizing consolidation phases after waves of successful coups, as well as the logistical and conspiratorial difficulty of pulling off a full-on successful coup under a heightened security state and foreign (Russian, Turkish) patronage, make a strong case for moving probability meaningfully below coin-flip—even with continued structural fragility and warnings. While the coup base rate remains above normal and risk is material, a more tempered, reality-anchored estimate is justified.",
            "revised_probability": 28
        },
        "Political Science (CoupTrapTheory)": {
            "my_phase1_final_probability": 34,
            "reasoning_for_revised_probability": "After group deliberation, my prior probability was at the high end but supported by other structural analysts (EliteTheory, AfricanStateFragility) and defended by IntelligenceAnalysis (PoliticalRiskAssessment). However, I note that several area and Civil-Military Relations specialists (ComparativeAuthoritarianism, Neopatrimonialism, SecurityStudies) effectively stress that the phase following a coup cluster is almost always characterized by heightened repression and preemptive purges, dampening the near-term risk even as underlying fragility remains. Recent foiled attempts in Mali, Nigeria, and Guinea-Bissau suggest effective surveillance/suppression, likely making a successful plot much harder to organize and execute before January 1, 2026. The resolution window is now extremely short—less than six weeks—and classic coups rarely cluster with such frequency in this close interval once regimes clamp down. Latin America’s risk remains negligible. Weighing all this, I conclude the base and structural risks are still elevated relative to the global norm, but the immediate/short time horizon is more constraining than I weighted in Phase 1. I adjust my forecast moderately downward.",
            "revised_probability": 26
        },
        "Political Science (ComparativeAuthoritarianism)": {
            "my_phase1_final_probability": 13,
            "reasoning_for_revised_probability": "Group deliberation confirmed my core logic—especially from SecurityStudies (CivilMilitaryRelations), whose defense of a low probability aligns with both recent empirical base rates for extremely short windows and the practical constraints facing coup plotters after a wave of crackdowns. The most persuasive critiques against higher probabilities emphasized how coup clustering is usually followed by a lull while consolidated regimes implement paranoia-fuelled purges and coup-proofing. The lower-end estimates from AreaStudiesAfrica (NeoPatrimonialism) echoed the necessity of distinguishing between chronic instability and the acute, rare event of a successful coup. Although there were strong defenses for slightly higher probabilities rooted in CoupTrap logic, no new warning indicator, either structural or event-driven (e.g., imminent leadership transition, real-time mutiny leakage, dramatic shift in external patronage), compels a meaningful upward revision at this time. The ongoing lack of a clear 'red-alert' state, combined with the extreme shortness of the forecast window and reinforced regime vigilance, means my original estimate is best. I therefore elect to keep my estimate at 13%.",
            "revised_probability": 13
        },
        "Political Science (PoliticalInstitutionalism)": {
            "my_phase1_final_probability": 23,
            "reasoning_for_revised_probability": "The group discussion reinforced several key points central to my initial reasoning: The overwhelmingly elevated base rate of coups in Africa's Sahel remains important, but the short six-week window heavily suppresses the probability of a successful coup, as recent months have seen junta consolidation, vigilant crackdowns, high-profile purges, and persistent coup-proofing often managed or supported by external actors. Critiques of higher (~30-40%) probabilities were persuasive, emphasizing how coup clusters produce subsequent lulls rather than immediate repeated overthrows, especially when regimes are highly alert. At the same time, I did not find arguments for a dramatically lower probability (e.g., sub-15%) compelling, since the underlying structural vulnerabilities, documented recent plot attempts, and elite fissures—especially in the Sahel and Guinea-Bissau—keep risk materially elevated over historical peacetime baselines. Discussion also affirmed that Latin America's risk remains functionally negligible in this window. Thus, the collective wisdom and polemics support holding my probability steady: slightly above several group means but less than those emphasizing regional contagion or failed-attempts-as-warnings. No substantial adjustment is warranted by the new arguments.",
            "revised_probability": 23
        },
        "Sociology (SocialMovementTheory)": {
            "my_phase1_final_probability": 28,
            "reasoning_for_revised_probability": "Group deliberation reveals a strong consensus (apart from one significant outlier at 43%) that the probability for a successful coup in Africa or Latin America before January 1, 2026, is elevated but not close to even odds. Nearly all approaches agree that the Sahel is the sole plausible locus, that crackdowns, purges, and external support (especially from Russia), as well as recent thwarted coup attempts, have induced a state of regime hyper-vigilance and generally reduced short-term coup likelihood. Several participants (CoupTrapTheory, ComparativeAuthoritarianism, Neopatrimonialism) emphasize that, while structure and grievances are acute, the history of coup clustering is characteristically followed by a lull in success, and the timeline is very short. No new information emerged to indicate a specific, imminent high-risk country or faction poised to act before the deadline. My critique of higher estimates (notably EliteTheory and RegionalSecurityComplexTheory) is reinforced by the group, and lower estimates (13-15%) seem somewhat too cautious in light of ongoing instability and failed attempts. Balancing all these, my original 28% remains appropriate—a little below the modal group probability, but squarely within the clustered majority and well-supported by both structure and recent events.",
            "revised_probability": 28
        },
        "Sociology (EliteTheory)": {
            "my_phase1_final_probability": 34,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, the case for a modest reduction in probability is persuasive. Multiple analysts highlight that, although coup risk is chronically elevated in the Sahel due to elite fragmentation, structural decay, and precedent, the recent sequence of failed and foiled coup attempts has triggered a period of heightened regime vigilance, massive purges, and heavy external coup-proofing—especially Russian mercenary presence. This typically suppresses immediate coup risk by intimidating or capturing plotters and leaves an interval where regimes are harder to surprise. Several critiques also correctly note that successful coups—especially those that consolidate control rapidly—are rare even in the highest base-rate environments over a ~6-week interval, and that after a coup cluster the tempo usually drops before another flare, not lessens. The consensus among the empirically cautious is that the base rate justifies elevated risk, but the current moment is less combustible than the ongoing state fragility alone would suggest. I am incorporating this by reducing my probability from 34% to 28%, matching the more restrained and empirically grounded estimates, while still reflecting substantial risk given current conditions.",
            "revised_probability": 28
        },
        "AreaStudiesAfrica (AfricanStateFragility)": {
            "my_phase1_final_probability": 38,
            "reasoning_for_revised_probability": "The group deliberation reinforced several key points: while structural and elite fragility in Mali, Burkina Faso, Niger, and Guinea-Bissau fuel persistent medium-term coup risk, the current short window (6 weeks) falls squarely within a harsh crackdown, widespread internal purges, and acute coup-proofing—especially with Russian and Turkish mercenary support. Peers highlighting post-coup regime hardening, reduced elite mobility, and the recurrence of failed attempts underscored that successful coups remain rare in such a narrow period, even at an elevated regional base rate. The low probabilities argued by neopat, comparative authoritarianism, and civil-military specialists demonstrated the empirical rarity of a successful, consolidated coup in the immediate aftermath of dust-up crackdowns and suggested my 38% was top-heavy for this interval. While the risk is higher than the historic peacetime average (the Sahel remains volatile and a single success would not be shocking), realistic assessment of coup-fatigue, plotter risk aversion, and the power dynamic shift point to a recalibration. Acknowledging these critiques, and in light of a lack of 'red-alert' imminent crisis in any single polity, I am revising my probability downward but maintaining a meaningfully elevated risk relative to normal: 25%.",
            "revised_probability": 25
        },
        "AreaStudiesAfrica (NeoPatrimonialism)": {
            "my_phase1_final_probability": 15,
            "reasoning_for_revised_probability": "After reviewing the group’s forecasts and critiques, I see broad consensus that the risk of a successful coup before January 1, 2026 is elevated over long-term baselines but not at historic highs, with nearly all forecasters acknowledging (1) the powerful effect of recent purges, surveillance, and coup-proofing, and (2) the fact that the time window is so short that, despite multiple active risk nodes, the bulk of risk is 'bottled up' for now. The most credible and empirically grounded estimates range between 13% and 23%, with 28%+ predictions either failing to account for the post-crackdown dip typical after a coup cluster or overestimating the conversion rate from elite tension/attempted coups to full regime change. Critiques of higher estimates reinforce my view that, in a neo-patrimonial logic, 'the moment after the first wave of coups is often the hardest for a second'—juntas are at peak paranoia and external support to clamp down is strongest. No new developments suggest a near-term collapse is imminent in any state; rather, we see classic 'paralytic' authoritarian stabilization. On the other hand, repeated warnings (from attempted coups, institutional breakdown, and unresolved elite conflict) warrant keeping the odds above very low/no-risk levels. Ultimately, my 'softly elevated but not high' posture is validated, so I maintain my probability essentially unchanged.",
            "revised_probability": 15
        },
        "AreaStudiesLatinAmerica (LatinAmericanMilitaryIntervention)": {
            "my_phase1_final_probability": 28,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I am convinced that my initial forecast was already well-calibrated, leaning neither into base-rate panic nor underestimating the fragility of several Sahel states. The strongest critiques highlighted the need to partition African and Latin American risk more sharply—something I did in my initial logic. Those arguing for figures in the 30s or 40s overstate the likelihood that major crackdowns, heightened vigilance, and foreign security support will be rapidly circumvented in just six weeks; the historical record and current elite dynamics both suggest a short-term lull post-crackdown. On the flip side, there is consensus that regime brittleness, elite dissatisfaction, and recent failed plots mean risk is not trivial. Latin America remains highly insulated. The middle-high teens (13-15%) seem overly conservative, given the structural volatility present and the rapidity with which coups have unfolded in the Sahel in recent years. Given all this, and the lack of dramatic new specific warning signs since my initial assessment, I retain my initial 28% probability.",
            "revised_probability": 28
        },
        "AreaStudiesLatinAmerica (DemocraticBreakdownTheory)": {
            "my_phase1_final_probability": 27,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, especially the critiques placing heavy weight on recent and ongoing elite purges, hyper-vigilant coup-proofing, and external security backing in Africa, I recognize that my original estimate—while below the high-end 30–40% crowd—still leaned somewhat too heavily on the fragility and elevated base rates of the past few years. Several strong arguments pointed out that in the immediate aftermath of a wave of coups and failed attempts, the likelihood of yet another successful takeover drops sharply due to regime paranoia, preemptive crackdowns, and a chilling effect even within coup-prone militaries. Additionally, the consensus is that Latin America’s probability is functionally zero for this window, which I factored in as low but not negligible. My critique and those of others reinforce that the current environment is more likely one of stasis and repression than sudden regime circulation, especially for a six-week interval. Accordingly, I am revising my estimate downward to 19%, reflecting a still elevated but clearly sub-one-in-five risk.",
            "revised_probability": 19
        }
    },
    "revision_probability": [
        28,
        28,
        15,
        28,
        26,
        13,
        23,
        28,
        28,
        25,
        15,
        28,
        19
    ],
    "revision_mean_probability": 23.384615384615383,
    "revision_sd": 5.8100267001460715,
    "revision_probability_result": 23,
    "question_details": {
        "id": 38793,
        "title": "Will there be a successful coup in Africa or Latin America before January 1, 2026?",
        "created_at": "2025-08-31T05:07:57.159527Z",
        "open_time": "2025-11-17T23:03:13Z",
        "cp_reveal_time": "2025-11-18T00:33:13Z",
        "spot_scoring_time": "2025-11-18T00:33:13Z",
        "scheduled_resolve_time": "2026-01-01T06:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-11-18T00:33:13Z",
        "actual_close_time": "2025-11-18T00:33:13Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "This question is synced with an identical question on Metaculus. The original question opened on 2025-08-21 12:00:00 and can be found [here](https://www.metaculus.com/questions/39292). This question will resolve to the same value as the synced question. The original question's background info at this time is below. \n\nAccording to [Powell & Thyne (2011, p. 252)](https://www.uky.edu/~clthyn2/powell-thyne-JPR-2011.pdf), a coup is \"illegal and overt attempts by the military or other elites within the state apparatus to unseat the sitting executive.\" In recent years, some of the coups in Africa have been:&#x20;\n\n* [Mali August 2020](https://en.wikipedia.org/wiki/2020_Malian_coup_d%27%C3%A9tat)\n* [Mali May 2021](https://en.wikipedia.org/wiki/2021_Malian_coup_d%27%C3%A9tat)\n* [Niger March 2021](https://en.wikipedia.org/wiki/2021_Nigerien_coup_attempt) (attempt)\n* [Niger July 2023](https://en.wikipedia.org/wiki/2023_Nigerien_coup_d%27%C3%A9tat)\n* [Gabon August 2023](https://en.wikipedia.org/wiki/2023_Gabonese_coup_d%27%C3%A9tat)\n* [Chad January 2025](https://en.wikipedia.org/wiki/2025_N%27Djamena_attack) (possible attempt)\n* [Burkina Faso January 2022](https://en.wikipedia.org/wiki/January_2022_Burkina_Faso_coup_d%27%C3%A9tat)\n* [Burkina Faso September 2022](https://en.wikipedia.org/wiki/September_2022_Burkina_Faso_coup_d%27%C3%A9tat)&#x20;\n* [Guinea September 2021](https://en.wikipedia.org/wiki/2021_Guinean_coup_d%27%C3%A9tat)\n\nLatin America has had the following coup attempts in recent years:\n\n* [Peru self-coup attempt](https://en.wikipedia.org/wiki/2022_Peruvian_self-coup_attempt), December 2022\n* [Brazil Congress attack](https://en.wikipedia.org/wiki/2023_Brazilian_Congress_attack), January 2023\n* [Bolivia coup attempt](https://en.wikipedia.org/wiki/2024_Bolivian_coup_attempt), June 2024\n\nSee also: [VoA by the numbers Coups in Africa](https://projects.voanews.com/african-coups/)\n\n`{\"format\":\"metac_closes_in_period\",\"info\":{\"post_id\":39292,\"question_id\":38638}}`",
        "resolution_criteria": "This question resolves as **Yes** if there is a successful coup d’état in any country on the African continent or Latin America after August 21, 2025 and before January 1, 2026, according to [credible](https://www.metaculus.com/faq/#definitions) media reports. If this does not occur, this question resolves as **No**.",
        "fine_print": "Latin America is defined as any country in North America or South America whose primary language is Spanish, Portuguese or French.\n\nA coup d’état (often shortened to \"coup\") is [defined](https://en.wikipedia.org/wiki/Coup_d'%C3%A9tat) as an event in which a state's military or other components of its power structure overthrow the existing political authority.&#x20;\n\nA \"successful\" coup is defined as a coup in which the group or person attempting to seize power establishes control over both the government and military, and will be considered to have succeeded once any significant resistance to their authority has ceased.&#x20;\n\nA self-coup, [defined](https://en.wikipedia.org/wiki/Self-coup) as a political leader, having come to power through legal means, remaining in power through illegal means, will count. This includes scenarios in which an incumbent leader refuses to relinquish power after an election.\n\nExternal support for a coup, such as is described [here](https://africacenter.org/spotlight/africas-coups-and-the-role-of-external-actors/), will count as long as the mercenaries or other external actors are acting in support of a perpetrator from within the state.\n\nCivil wars, mutinies, rebellions or popular uprisings will not count, nor will changes to a country's constitution that restrict a country's democratic norms.",
        "post_id": 39416,
        "aggregations": {
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Kremlin Allegedly Stations Troops in Six African Countries Amid Wagner Group Reorganization and Human Rights Allegations**\nAccording to Russian state media reports, Russian military personnel are stationed in six African countries: Mali, Burkina Faso, Niger, Equatorial Guinea, the Central African Republic, and Libya. These forces are part of the Russian 'Africa Corps,' subordinated to the Russian Ministry of Defense, with most soldiers having previously participated in the 'special military operation' in Ukraine. The presence includes military equipment such as aircraft, helicopters, and armored vehicles, along with Wagner Group flags. The Wagner Group, which was dissolved after the death of its leader Yevgeny Prigozhin in a mysterious plane crash in August 2023, has been reorganized into a formal military unit. The group has been accused of severe human rights violations in Mali, including the abduction, detention, torture, and killing of hundreds of civilians between 2022 and 2024. A May 2025 investigation by the journalist network Forbidden Stories, based on testimonies from Malian refugees in Mauritania, documented six locations where Wagner operatives held civilians, including former UN bases. Torture methods included waterboarding, beatings, and cigarette burns, with victims reporting similarities to abuses in Ukraine. The Wagner Group has also provided military training, political advisory services, and security for leaders in Mali, where a military junta led by General Assimi Goita has ruled since 2020 and shifted allegiance from France to Russia.\nOriginal language: de\nPublish date: November 17, 2025 08:07 PM\nSource:[N-tv](https://www.n-tv.de/politik/Kreml-soll-Truppen-in-sechs-afrikanischen-Laendern-stationiert-haben-id30033579.html)\n\n**Benin Revises Constitution to Extend Terms and Create Senate Amid Political Controversy**\nThe National Assembly of Benin adopted a comprehensive constitutional revision early Saturday morning after a long night of deliberation. The new text establishes a Senate and extends presidential, parliamentary, and mayoral terms from five to seven years. According to La Nation, this reform will take effect starting with the next general elections, meaning it does not apply to President Patrice Talon’s current term, which ends in May 2026. The presidential movement claims the revision aims to strengthen institutional stability, transparency, and democratic vitality. However, concerns persist: La Nouvelle Tribune notes that while the reform is framed as a move toward political calm and development, critics argue it may deepen political fractures and discourage opposition participation. The main opposition party, the Démocrates, was excluded from local and presidential elections due to insufficient endorsements, raising suspicions about the process. Aujourd'hui reports that Talon, stepping down after his second term, is reshaping the political landscape in favor of his chosen successor, Romuald Wadagni, who now faces no significant challenger. The Pays, a Burkinabé outlet, questions the timing of the reform, suggesting it is a politically calculated maneuver to entrench Talon’s system, neutralize weakened opposition, and shield the elite from judicial accountability. The extension of mandates to seven years is seen as reducing political pluralism and diminishing electoral frequency, effectively locking in the current power structure. The creation of a Senate, where members are appointed or automatically included—such as former presidents—is viewed as a strategic move to ensure lifelong political privilege. Ledjely from Guinea highlights that the reform, despite initial optimism over Talon’s pledge not to seek a third term, now appears to undermine democratic progress, especially given the exclusion of opposition figures and the continued detention of political prisoners like Reckya Madougou. The overall outcome suggests a democratic victory that may be more illusory than real.\nOriginal language: fr\nPublish date: November 17, 2025 07:36 AM\nSource:[RFI](https://www.rfi.fr/fr/podcasts/revue-de-presse-afrique/20251117-%C3%A0-la-une-le-b%C3%A9nin-r%C3%A9vise-sa-constitution)\n\n**Teams Already Eliminated from the 2026 World Cup Qualifications**\nAs of November 15, 2025, numerous national teams have been officially eliminated from the qualification process for the 2026 FIFA World Cup, which began in September 2023 and will conclude in March 2026. Eliminated teams from Asia include Mongolia, Maldives, Guam, Sri Lanka, Macao, Cambodia, Timor-Leste, Brunei, Bhutan, Laos, India, Afghanistan, Syria, Myanmar, Thailand, Singapore, Malaysia, China, Chinese Taipei (Taiwan), Turkmenistan, Hong Kong, Vietnam, Philippines, Tajikistan, Pakistan, Yemen, Nepal, Lebanon, Bangladesh, North Korea, Bahrain, Kyrgyzstan, Kuwait, Palestine, Indonesia, Oman, and others. In Africa, eliminated nations include Eritrea (which withdrew), Burkina Faso, Sierra Leone, Guinea-Bissau, Ethiopia, Djibouti, Sudan, Togo, Mauritania, South Sudan, Benin, Lesotho, Rwanda, Zimbabwe, Libya, Angola, Mauritius, Eswatini, Niger, Tanzania, Zambia, Congo, Gambia, Kenya, Burundi, Seychelles, Uganda, Mozambique, Guinea, Botswana, Somalia, Namibia, Liberia, Malawi, Equatorial Guinea, São Tomé and Príncipe, Madagascar, Mali, Comoros, Central African Republic, Chad, Gabon, Cameroon, and others. From Europe, teams eliminated include Luxembourg, Slovenia, Greece, Belarus, Azerbaijan, Georgia, Bulgaria, Hungary, Armenia, Finland, Lithuania, Malta, Cyprus, San Marino, Israel, Estonia, Moldova, Kazakhstan, Liechtenstein, Serbia, Latvia, Andorra, Montenegro, Gibraltar, and others, with some disqualified due to the war in Ukraine. In Oceania, eliminated teams are the Cook Islands, Samoa, American Samoa, Tonga, Solomon Islands, Papua New Guinea, Vanuatu, Samoa, Tahiti, Fiji, and others. In CONCACAF, eliminated nations include Turks and Caicos Islands, U.S. Virgin Islands, Cayman Islands, Antigua and Barbuda, Cuba, Grenada, Saint Christopher and Nevis, Bahamas, Aruba, Barbados, Saint Lucia, Guyana, Montserrat, Belize, Dominican Republic, Dominica, British Virgin Islands, Saint Vincent and the Grenadines, Anguilla, Puerto Rico, Guatemala, El Salvador, Trinidad and Tobago, Bermuda, Nicaragua, and others. In CONMEBOL, Chile, Peru, and Venezuela have been eliminated. The list is subject to change as the qualification rounds progress. The article was published on November 15, 2025, by Sopitas.com, and includes a call to support Mexico.\nOriginal language: es\nPublish date: November 15, 2025 09:47 PM\nSource:[sopitas.com](https://www.sopitas.com/deportes/selecciones-eliminadas-mundial-2026-eliminatorias-conmebol-europa-asia-africa-concacaf-oceania/)\n\n**Is Africa Coming Under Mysterious Attacks As Primate Ayodele Foretold?**\nThe article discusses rising political instability across Africa, citing recent military coups in Niger Republic and an attempted coup in Sierra Leone, as well as regional tensions involving the Economic Community of West African States (ECOWAS) and military juntas in Burkina Faso, Guinea Bissau, and Mali. It claims that ECOWAS ordered the Niger junta to restore democratic rule, prompting a warning from other West African military regimes that any forceful intervention would be viewed as war and provoke retaliation. The article frames the situation as a potential continental conflict, suggesting Africa is heading toward internal warfare. It references Primate Elijah Ayodele, a self-proclaimed prophet, who in January 2023 and February 2023 foretold a 'mysterious attack' on Africa, describing it as an unexplainable crisis, widespread insecurity, and a war between African nations. Ayodele also warned that the presence of foreign powers—such as China, Russia, the U.S., the UK, and Israel—could turn Africa into a geopolitical testing ground. The article concludes by posing the question: 'Will it be right to say Africa is coming under a mysterious attack as foretold by Primate Ayodele?' The claims are presented without independent verification, relying solely on the prophet’s statements and current geopolitical developments.\nOriginal language: en\nPublish date: August 02, 2023 09:18 AM\nSource:[topcelebrities.com.ng](https://topcelebrities.com.ng/is-africa-coming-under-mysterious-attacks-as-primate-ayodele-foretold/)\n\n**The Blogs: Mali: Al-Qaeda's Next Fallen State**\nAl-Qaeda has not been defeated but has repositioned itself from Afghanistan to Africa, with Mali on the brink of becoming the terror network's most significant resurgence in a generation. According to the article, after France's withdrawal in 2022 and the UN's departure in 2023, Al-Qaeda's local affiliate, Jama'at Nusrat al-Islam wal-Muslimin (JNIM), systematically filled the power vacuum in Mali, dismantling state authority, enforcing sharia, taxing populations, and encircling the capital Bamako by 2025. This marks Mali as the third country in a generation to fall under Islamist rule, following Afghanistan under the Taliban and Syria under HTS. The article frames this not as a sudden collapse but as a methodical construction of a jihadist proto-state. Al-Qaeda has reconstituted a pan-African insurgent network across Burkina Faso, Niger, Nigeria, Somalia, Mozambique, Libya, Algeria, Sudan, and Chad, creating a transcontinental ecosystem stronger than its Middle East presence. The U.S. drone campaign has constrained but not eliminated Al-Qaeda’s Yemeni branch (AQAP), which could gain a sanctuary if Mali falls. A jihadist-controlled Mali would collapse Africa’s security architecture, enable a contiguous jihadist corridor from Mauritania to Somalia, and destabilize North Africa, threatening Israel’s intelligence and counterterrorism alliances. It would also empower Iran’s proxies, trigger a new migration wave into Europe, and erase the West’s strategic foothold in the Sahel. The article concludes that Mali’s fall would mark the beginning of a new jihadist era, not in Kabul or Raqqa, but in Africa’s overlooked expanses where Al-Qaeda has quietly prepared its most dangerous resurrection. The piece cites 'The Times of Israel' as the source and was published on November 17, 2025.\nOriginal language: en\nPublish date: November 17, 2025 10:01 PM\nSource:[The Times of Israel](https://blogs.timesofisrael.com/mali-al-qaedas-next-fallen-state/)\n\n**Kremlin Allegedly Stations Troops in Six African Countries Amid Wagner Group Reorganization and Human Rights Allegations**\nAccording to Russian state media reports, Russian military personnel are stationed in six African countries: Mali, Burkina Faso, Niger, Equatorial Guinea, the Central African Republic, and Libya. These forces are part of the Russian 'Africa Corps,' subordinated to the Russian Ministry of Defense, with most soldiers having previously participated in the 'special military operation' in Ukraine. The presence includes military equipment such as aircraft, helicopters, and armored vehicles, along with Wagner Group flags. The Wagner Group, which was dissolved after the death of its leader Yevgeny Prigozhin in a mysterious plane crash in August 2023, has been reorganized into a formal military unit. The group has been accused of severe human rights violations in Mali, including the abduction, detention, torture, and killing of hundreds of civilians between 2022 and 2024. A May 2025 investigation by the journalist network Forbidden Stories, based on testimonies from Malian refugees in Mauritania, documented six locations where Wagner operatives held civilians, including former UN bases. Torture methods included waterboarding, beatings, and cigarette burns, with victims reporting similarities to abuses in Ukraine. The Wagner Group has also provided military training, political advisory services, and security for leaders in Mali, where a military junta led by General Assimi Goita has ruled since 2020 and shifted allegiance from France to Russia.\nOriginal language: de\nPublish date: November 17, 2025 08:07 PM\nSource:[N-tv](https://www.n-tv.de/politik/Kreml-soll-Truppen-in-sechs-afrikanischen-Laendern-stationiert-haben-id30033579.html)\n\n**Russian Military Active in Six African Countries, State TV Reports**\nAccording to a report by Russia's state television, the Russian military is active in six African countries, marking a rare official acknowledgment of Moscow's military presence on the continent. This expansion comes amid Western isolation following Russia's full-scale invasion of Ukraine, prompting Moscow to strengthen its political, economic, and military ties with African nations in recent years. A state TV correspondent reported on Sunday that Russian military officers and soldiers are operating in six African countries, though the specific nations were not named except for Mali. Reports indicate the deployment of additional Russian troops or military trainers in Burkina Faso, Niger, Equatorial Guinea, the Central African Republic, and Libya. The African Corps, a unit linked to Russia's Ministry of Defense, has taken over the roles previously held by the Wagner Group, a private military company, across Africa, according to diplomatic sources in the Sahel region. The Wagner Group was dismantled and restructured after the mysterious plane crash that killed its leader, Yevgeny Prigozhin, in August 2023, following a brief rebellion against Moscow. Wagner forces had previously fought in Ukraine and were deployed across Africa. The state TV report confirmed the African Corps is under Russia's Ministry of Defense and stated that most deployed personnel are 'veterans of the special military operation'—Russia’s term for the war in Ukraine. Footage from the report showed a flag resembling Wagner’s skull emblem at a base in Mali, as well as Russian Su-25 aircraft conducting airstrikes and heavy Russian military equipment, including helicopters and armored personnel carriers. Moscow claims its forces are helping African governments combat extremist insurgencies.\nOriginal language: ar\nPublish date: November 17, 2025 03:33 PM\nSource:[صحيفة الشرق الأوسط](https://aawsat.com/node/5209797)\n\n**Azhar Observatory: Rise in Terrorist Activity in West Africa During October 2025, but with Decline in Civilian Casualties and Kidnappings**\nThe Azhar Observatory reported a rise in terrorist activities in West Africa during October 2025, with 4 attacks in Nigeria, 1 in Niger, and none in Senegal or Benin. Despite the increase in operations, civilian casualties dropped significantly from 141 in September to 74 in October—a 52.5% decrease—and kidnappings fell from 45 to 5, a reduction of nearly 89%. Injuries totaled 35 in October, compared to zero in September, indicating a shift from large-scale massacres to limited or targeted attacks. Nigeria remained the epicenter, with Boko Haram and ISWAP (Islamic State West Africa Province) continuing to operate, though with reduced casualties. Niger recorded only one attack with no fatalities, signaling improved border security following intensified joint operations with Nigeria and Chad. Senegal and Benin reported no terrorist activity, reflecting continued relative stability in the Gulf of Guinea region. The October data marked a strategic shift from September’s pattern of killing 100 terrorists without arrests, toward more precise operations combining on-the-ground neutralization and intelligence-led arrests. The increase in military operations, neutralization rates, and arrests reflects improved security coordination among Sahel countries and Nigeria, particularly through the West African Sahel Group. The Azhar Observatory emphasized the need to strengthen early warning systems, border surveillance, intelligence sharing, regional cooperation, and rehabilitation programs to combat radicalization, especially in northern Nigeria and eastern Burkina Faso.\nOriginal language: ar\nPublish date: November 17, 2025 12:30 PM\nSource:[cairo24.com](https://www.cairo24.com/2319396)\n\n**Benin Revises Constitution to Extend Terms and Create Senate Amid Political Controversy**\nThe National Assembly of Benin adopted a comprehensive constitutional revision early Saturday morning after a long night of deliberation. The new text establishes a Senate and extends presidential, parliamentary, and mayoral terms from five to seven years. According to La Nation, this reform will take effect starting with the next general elections, meaning it does not apply to President Patrice Talon’s current term, which ends in May 2026. The presidential movement claims the revision aims to strengthen institutional stability, transparency, and democratic vitality. However, concerns persist: La Nouvelle Tribune notes that while the reform is framed as a move toward political calm and development, critics argue it may deepen political fractures and discourage opposition participation. The main opposition party, the Démocrates, was excluded from local and presidential elections due to insufficient endorsements, raising suspicions about the process. Aujourd'hui reports that Talon, stepping down after his second term, is reshaping the political landscape in favor of his chosen successor, Romuald Wadagni, who now faces no significant challenger. The Pays, a Burkinabé outlet, questions the timing of the reform, suggesting it is a politically calculated maneuver to entrench Talon’s system, neutralize weakened opposition, and shield the elite from judicial accountability. The extension of mandates to seven years is seen as reducing political pluralism and diminishing electoral frequency, effectively locking in the current power structure. The creation of a Senate, where members are appointed or automatically included—such as former presidents—is viewed as a strategic move to ensure lifelong political privilege. Ledjely from Guinea highlights that the reform, despite initial optimism over Talon’s pledge not to seek a third term, now appears to undermine democratic progress, especially given the exclusion of opposition figures and the continued detention of political prisoners like Reckya Madougou. The overall outcome suggests a democratic victory that may be more illusory than real.\nOriginal language: fr\nPublish date: November 17, 2025 07:36 AM\nSource:[RFI](https://www.rfi.fr/fr/podcasts/revue-de-presse-afrique/20251117-%C3%A0-la-une-le-b%C3%A9nin-r%C3%A9vise-sa-constitution)\n\n**Guinea-Bissau’s presidential poll failed credibility test**\nGuinea-Bissau’s upcoming presidential election on 23 November 2025 has failed a credibility test, according to social scientists analyzing the country’s deepening democratic erosion. The article highlights a regional crisis across Africa, citing fraudulent elections in Cameroon (where 92-year-old Paul Biya won 53.7% amid widespread allegations of fraud), Tanzania (where President Samia Suluhu Hassan claimed 98% of votes in a poll met with unprecedented protests and a crackdown), and Côte d’Ivoire (where President Alassane Ouattara secured a fourth term with nearly 90% of the vote, despite a constitutional two-term limit). These outcomes have fueled public cynicism and weakened democratic norms. In Guinea-Bissau, President Umar Sissoco Embalo has undermined electoral legitimacy through repeated constitutional manipulations: he assumed office in February 2020 despite a pending legal challenge, dissolved parliament in May 2022 and again in December 2023, and delayed legislative elections until late 2024 due to alleged logistical issues. The supreme court, after its chief judge fled citing death threats, declined to rule on the 2020 dispute, leading to Ecowas recognition of Embalo’s government. Embalo initially pledged not to seek re-election but reversed course in March 2025. A mediation team from Ecowas withdrew after threats of expulsion. Most critically, the PAIGC—the country’s oldest and most influential party—was barred from the presidential race after its candidate, Domingos Simoes Pereira, was rejected by the supreme court for late document submission, marking the first time in history the party has been excluded from a presidential election. Guinea-Bissau’s Electoral Democracy Index from V-Dem has declined sharply, even surpassing drops seen after past coups and assassinations. The article argues that Embalo’s tactics—removing viable opponents, manipulating timelines, using the security sector coercively, and weakening judicial independence—mirror regional patterns of hollowing out elections without abolishing them. The 2025 election risks reversing decades of fragile democratic progress, illustrating how performative elections can entrench power while eroding accountability.\nOriginal language: en\nPublish date: November 17, 2025 12:00 AM\nSource:[newsdrum.in](https://www.newsdrum.in/international/guinea-bissaus-presidential-poll-failed-credibility-test-10781223)\n\n**Teams Already Eliminated from the 2026 World Cup Qualifications**\nAs of November 15, 2025, numerous national teams have been officially eliminated from the qualification process for the 2026 FIFA World Cup, which began in September 2023 and will conclude in March 2026. Eliminated teams from Asia include Mongolia, Maldives, Guam, Sri Lanka, Macao, Cambodia, Timor-Leste, Brunei, Bhutan, Laos, India, Afghanistan, Syria, Myanmar, Thailand, Singapore, Malaysia, China, Chinese Taipei (Taiwan), Turkmenistan, Hong Kong, Vietnam, Philippines, Tajikistan, Pakistan, Yemen, Nepal, Lebanon, Bangladesh, North Korea, Bahrain, Kyrgyzstan, Kuwait, Palestine, Indonesia, Oman, and others. In Africa, eliminated nations include Eritrea (which withdrew), Burkina Faso, Sierra Leone, Guinea-Bissau, Ethiopia, Djibouti, Sudan, Togo, Mauritania, South Sudan, Benin, Lesotho, Rwanda, Zimbabwe, Libya, Angola, Mauritius, Eswatini, Niger, Tanzania, Zambia, Congo, Gambia, Kenya, Burundi, Seychelles, Uganda, Mozambique, Guinea, Botswana, Somalia, Namibia, Liberia, Malawi, Equatorial Guinea, São Tomé and Príncipe, Madagascar, Mali, Comoros, Central African Republic, Chad, Gabon, Cameroon, and others. From Europe, teams eliminated include Luxembourg, Slovenia, Greece, Belarus, Azerbaijan, Georgia, Bulgaria, Hungary, Armenia, Finland, Lithuania, Malta, Cyprus, San Marino, Israel, Estonia, Moldova, Kazakhstan, Liechtenstein, Serbia, Latvia, Andorra, Montenegro, Gibraltar, and others, with some disqualified due to the war in Ukraine. In Oceania, eliminated teams are the Cook Islands, Samoa, American Samoa, Tonga, Solomon Islands, Papua New Guinea, Vanuatu, Samoa, Tahiti, Fiji, and others. In CONCACAF, eliminated nations include Turks and Caicos Islands, U.S. Virgin Islands, Cayman Islands, Antigua and Barbuda, Cuba, Grenada, Saint Christopher and Nevis, Bahamas, Aruba, Barbados, Saint Lucia, Guyana, Montserrat, Belize, Dominican Republic, Dominica, British Virgin Islands, Saint Vincent and the Grenadines, Anguilla, Puerto Rico, Guatemala, El Salvador, Trinidad and Tobago, Bermuda, Nicaragua, and others. In CONMEBOL, Chile, Peru, and Venezuela have been eliminated. The list is subject to change as the qualification rounds progress. The article was published on November 15, 2025, by Sopitas.com, and includes a call to support Mexico.\nOriginal language: es\nPublish date: November 15, 2025 09:47 PM\nSource:[sopitas.com](https://www.sopitas.com/deportes/selecciones-eliminadas-mundial-2026-eliminatorias-conmebol-europa-asia-africa-concacaf-oceania/)\n\n**BAMEX 2025 Opens in Bamako: Strong Turkish and Moroccan Participation Debunks Rumors of Siege on Malian Capital**\nThe BAMEX 2025 International Defense and Security Exhibition opened in Bamako, Mali, from November 12 to November 14, 2025, countering widespread rumors of a siege on the capital by terrorist groups such as Jama’at Nasr al-Islam wal Muslimin (JNIM). The event, hosted at the Alioune Blondin Beye Peacekeeping School, aimed to strengthen security and military cooperation in the Sahel region and promote new defense sector partnerships. Prominent Turkish companies including Baykar, Aselsan, Roketsan, and Otokar participated, showcasing advanced technologies such as drones and radar systems, underscoring Ankara’s growing defense influence in Africa through agreements with Mali and other Sahel Alliance (AES) members. The exhibition also attracted participation from the Democratic Republic of Congo, Niger, Burkina Faso, and Russia, which reaffirmed its support for Mali in counterterrorism efforts. Social media and activists highlighted the event as a 'slap' to Algerian and French media narratives predicting Bamako’s collapse, emphasizing that the successful organization of the exhibition proves the capital’s stability and strategic attractiveness for military investment. The 'Akıncı' drone displayed at the exhibition was noted as part of the Turkish-Malian defense agreement and had recently been shot down during operations. BAMEX 2025 is seen as a unique platform for enhancing African security sovereignty and fostering regional cooperation amid growing competition between Turkey, Russia, and China in the African arms market.\nOriginal language: en\nPublish date: November 12, 2025 08:50 PM\nSource:[fesnews.media](https://fesnews.media/313294/2025/11/12/)\n\n**Amid West Africa’s Coups, Faith Leaders Emerge As Pillars Of Stability**\nOver the past decade, more than a dozen military coups have destabilized West Africa and the Sahel, including in Mali (2020), Guinea (2021), Burkina Faso (2022), Niger (2023), and Gabon (2023), with attempted coups in Sierra Leone and Guinea-Bissau. Amid this political chaos, religious leaders—such as Cardinal Philippe Ouédraogo of Burkina Faso, Imam Mahmoud Dicko of Mali, and Islamic leaders in Niger—have emerged as key stabilizing figures. They have consistently advocated for dialogue, restraint, and national unity, using their moral authority to de-escalate tensions and prevent violence. In Burkina Faso, Ouédraogo urged a national conversation after two coups in 2022, while in Mali, Dicko played a dual role as both a protest voice and a mediator during the 2020 uprising. In Niger, Islamic leaders framed resistance to foreign military intervention as a moral defense of sovereignty. In Guinea and Gabon, clergy called for accountability and peace after military takeovers. Though not universally trusted—some are criticized for silence or proximity to power—their influence persists where formal institutions have failed. Their sermons and homilies often carry more public resonance than government statements. Despite challenges, including ongoing jihadist violence displacing millions in Burkina Faso and Mali, faith leaders remain among the last civic anchors in fragile states. Their role may diminish if military regimes consolidate power, but in transitional moments, they could still shape the region’s future governance. The article was published on November 10, 2025, by Religion Unplugged, authored by Joseph Maina, a Kenyan journalist with a BA in journalism and media studies from the University of Nairobi.\nOriginal language: en\nPublish date: November 10, 2025 11:00 AM\nSource:[Religion Unplugged](https://religionunplugged.com/news/west-africas-coups-faith-leaders-emerge-as-pillars-of-stability)\n\n**Nigeria's 2025 Coup Scare: Everything You Need to Know by Anjolaoluwa Ogunpitan**\nOn October 24, 2025, Nigerian President Bola Ahmed Tinubu reshuffled the National Service Chiefs, a move widely perceived as linked to a failed coup attempt by senior military officers. Over forty military personnel, including a brigadier general, a colonel, and several majors, were detained by the Defence Intelligence Agency (DIA) following raids in late October 2025, with the Abuja residence of former Bayelsa State Governor Timipre Sylva raided on October 29, 2025. His brother was arrested during the operation. Sylva, reportedly abroad for a medical check-up in the UK and a conference in Malaysia, is alleged to have fled Nigeria via the creeks to Senegal and then to Argentina, where he is said to have business interests. Investigators reportedly traced ₦46 billion to an account linked to him, funds suspected of financing the coup plot—though these claims remain unconfirmed by the government. While the Defence Headquarters (DHQ) described the operation as a 'routine internal disciplinary investigation,' credible reports from Premium Times and PRNigeria indicate a broader conspiracy involving mid- to senior-level officers planning to neutralize key political figures, including the vice president, Senate president, and speaker of the House of Representatives. This incident follows a regional trend of military coups in West Africa, including in Mali (2020, 2021), Guinea (2021), Burkina Faso (2022), Niger (2023), and Gabon (2023). Nigeria’s history includes multiple coups since independence in 1960, such as the 1966 counter-coup, the 1983 coup that ousted Shehu Shagari, and the 1985 coup that brought Ibrahim Babangida to power. The article argues that the alleged coup reflects deeper institutional issues: low military morale, inadequate welfare, political interference, and growing distrust. It warns that the real threat to democracy lies not in overt military force but in systemic neglect and public despair. The author urges President Tinubu to treat the incident not merely as a criminal matter but as a warning to rebuild trust, improve transparency, and restore military morale—essential acts for national preservation. The piece concludes that democracy must be actively sustained through justice, inclusion, and accountability, especially as West Africa faces democratic decline.\nOriginal language: en\nPublish date: November 01, 2025 07:15 AM\nSource:[Medium.com](https://medium.com/@johnogunpitan17/nigerias-2025-coup-scare-everything-you-need-to-know-by-anjolaoluwa-ogunpitan-3cdcba69c2ba)\n\n**The Jihadist Conundrum in the Sahel**\nThe article analyzes the escalating jihadist insurgency in the Sahel region, particularly in Mali, following the French withdrawal in July 2022 after the Malian military coup led by President Assimi Goita. Since then, Russian Wagner Group and the Africa Corps have replaced French forces, but their military support—though including hardware, training, and access to mineral resources like gold, lithium, and uranium—has failed to contain the rise of Islamist insurgents, particularly Jama'at Nasrat al-Islam wal-Muslimin (JNIM), an Al-Qaeda-linked group. Insurgent attacks surged from 1,900 in 2019 to over 5,500 in 2024, with 3,800 attacks recorded by October 10, 2025, resulting in 76,900 deaths since 2019, 56% of which occurred in Mali and Burkina Faso. The Malian junta’s propaganda of military success has been exposed as a facade, with major attacks on military outposts and increasing control loss in rural areas. The junta’s human rights violations and reliance on foreign military contractors have undermined legitimacy. A new tactic by JNIM in August 2025—targeting fuel imports from Côte d'Ivoire, Senegal, Mauritania, and Guinea—has caused a severe fuel crisis in Bamako, closing schools and universities. Foreign companies, including seven Chinese and three Indian nationals, were kidnapped in July 2025, highlighting the fragility of the economy. The U.S. Embassy has issued an 'immediate departure' advisory due to deteriorating security. The article warns that without urgent counter-insurgency reforms—including professional chain-of-command, village protection, local cooperation, internal purges of corrupt officers, and regional coordination with ECOWAS—the fall of Bamako is imminent. The risk of a state collapse similar to ISIS in Iraq or the Taliban in Afghanistan looms, threatening regional stability across Burkina Faso and Niger. The author concludes that sustainable solutions require national coordination within the Malian military, with foreign support limited to training, intelligence, and airpower, not boots on the ground.\nOriginal language: en\nPublish date: October 30, 2025 06:45 PM\nSource:[Medium.com](https://medium.com/@ahsankenway/the-jihadist-conundrum-in-the-sahel-1d5c5b2b3b17)\n\n**Overthrowing government: Full list of African countries that fell to military rule after coup plot**\nSince August 2020, seven African countries have experienced military takeovers following coup plots, disrupting civilian governments. On 26 July 2023, Niger's military removed President Mohamed Bazoum, installing General Abdourahamane Tiani as leader; ECOWAS responded with plans to deploy a regional force to restore constitutional order, while the junta proposed a maximum three-year transition. Burkina Faso saw two coups in less than a year: President Roch Marc Christian Kaboré was ousted on 24 January 2022, replaced by Lieutenant-Colonel Paul-Henri Sandaogo Damiba, who was himself overthrown on 30 September by Captain Ibrahim Traoré, who now leads a transitional government with elections scheduled for July 2024. Sudan’s democratic transition collapsed on 25 October 2021 when General Abdel Fattah al-Burhane removed civilian leaders; since 15 April 2023, a deadly conflict between Burhane and his former deputy Mohamed Hamdane Daglo has caused at least 5,000 deaths. Guinea’s President Alpha Condé was overthrown on 5 September 2021, with Colonel Mamady Doumbouya assuming power on 1 October, pledging to return to civilian rule by the end of 2024. Mali’s President Ibrahim Boubacar Keïta was ousted on 18 August 2020, leading to a transitional government; on 24 May 2021, the military arrested both the president and prime minister, and Colonel Assimi Goïta became transitional president in June, with elections planned for February 2024. Madagascar was listed among affected countries, but details of a successful military takeover remain unclear. Nigeria, though not listed as having a recent coup, has a history of military rule since independence in 1960; researchers note that the military’s economic policies in the 1980s led to 45% of foreign-exchange earnings being used for debt servicing, resulting in minimal growth, widespread poverty, and long-term instability. The article was published on 20 October 2025.\nOriginal language: en\nPublish date: October 20, 2025 09:20 AM\nSource:[Legit.ng - Nigeria news.](https://www.legit.ng/politics/1679401-full-list-african-countries-fell-military-rule-coup-plot/)\n\n**Niger, Mali and Burkina Faso Announce Exit from the International Criminal Court**\nNiger, Mali and Burkina Faso have announced that they will withdraw from the International Criminal Court (ICC), describing the court as a \"neocolonial instrument of oppression\".  According to the joint statement released by the three military‑governed states, the ICC has proven \"incapable of investigating and prosecuting proven war crimes, crimes against humanity, genocide and aggression\".  The leaders of the three countries, which have close ties to Russia, also said they intend to establish \"local mechanisms for strengthening peace and justice\".  They criticised the ICC for the fact that, out of the 33 cases opened since its founding, all but one involved African states.  The withdrawal will take effect one year after the countries submit a notice to the UN Secretary‑General.  The three West African states, which came to power through coups between 2020 and 2023, joined forces in 2023 to form the Sahel Alliance, later renamed the Confederation of Sahel Countries, and cooperate with the Russian Federation.  Their armies have been accused of committing war crimes against civilians during operations against jihadist groups linked to Al‑Qaeda and the Islamic State.  In March 2023 the ICC issued an arrest warrant for Russian President Vladimir Putin on charges of war crimes, including the illegal deportation of Ukrainian children and the forced relocation of Ukrainians to Russia.  The Ukrainian Foreign Ministry recently condemned the \"illegal visit\" of the ambassadors of Burkina Faso, Mali and Niger to the Russian‑occupied Autonomous Republic of Crimea.\nOriginal language: uk\nPublish date: September 23, 2025 09:28 AM\nSource:[УКРІНФОРМ](https://www.ukrinform.ua/rubric-world/4039447-niger-mali-ta-burkinafaso-ogolosili-pro-vihid-iz-miznarodnogo-kriminalnogo-sudu.html)\n\n**Africa: Francophone Press Review of September 1, 2025**\nThe press review for September 1, 2025 covers a range of African news items. It reports that the African Development Bank (BAD) inaugurated a new president, 'Sidi Ould Tah', who was elected on 29 May with 76.18 % of the vote and becomes the first Mauritanian to hold the post. In Gabon, lieutenant Kelly Ondo‑Obiang was released from the central prison in Libreville after seven years of detention; his release follows an amnesty ordinance issued on 12 August 2025 that pardons all participants in the January 2019 and August 2023 coup attempts. Cameroon’s military court in Yaoundé held a hearing on 1 September concerning the death of radio host Martinez Zogo, who was abducted on 17 January 2023 and found dead five days later. South Africa’s Comic‑Con Africa concluded its sixth edition in Johannesburg, drawing tens of thousands of fans for a four‑day festival of comics, anime, video games and cosplay. In Côte d’Ivoire, a political meeting in Yamoussoukro sold more than 10 000 tickets, marking a first for the country’s political gatherings. Morocco celebrated a historic third CHAN title after a 3‑2 win over Madagascar; striker Oussama Lamlaoui scored twice, including a 40‑meter goal, and finished as the tournament’s top scorer with six goals. Benin’s Romuald Wadagni has been named the presidential candidate for the 2026 election, potentially triggering a cabinet reshuffle. Togo announced a strengthened university partnership with India, aiming to expand scholarship opportunities for students. Mali’s transition, five years after the 18 August 2020 coup, is described as a period of challenge and renewal, with the country regaining sovereignty over nearly 70 % of its territory. Senegal’s sports minister Khady Diène Gaye set a dual objective for new coach Pape Thiaw: qualify the national team for the 2026 World Cup and win the 2025 Africa Cup of Nations in Morocco.\nOriginal language: fr\nPublish date: September 01, 2025 09:39 AM\nSource:[allAfrica.fr](https://fr.allafrica.com/stories/202509010140.html)\n\n**Mali and Burkina Faso Boycott African Defence Summit in Nigeria**\nMali and Burkina Faso, both part of the newly formed Alliance des États du Sahel (AES), withdrew from the African Chiefs of Defence Summit in Abuja, Nigeria, in January, following their exit from the West African Economic and Monetary Union (Cedeao). Only Niger, represented by Colonel Soumana Kalkoye, the defence attaché at the Nigerien embassy in Abuja, attended the summit. The conference, which ran until 27 August, brought senior officers from most African states to 'discuter de stratégies collectives' and to 'trouver des solutions locales aux besoins de l'Afrique en matière de défense', according to the summit programme. Nigerian Chief of Staff Christopher Musa highlighted that security challenges 'ne connaissent pas de frontières' and called for 'une nouvelle architecture de coopération en matière de sécurité, dirigée par l'Afrique', adding that 'La véritable sécurité ne s'obtient pas dans l'isolement'. Relations between Niger and Nigeria had deteriorated after the 2023 coup in Niamey, when the Cedeao imposed sanctions on Niger and threatened a military intervention to restore President Mohamed Bazoum. The tensions eased in 2024 when the two countries signed a security memorandum, but Niger’s withdrawal from the regional military force has hampered cross‑border operations against jihadists around Lake Chad. The juntas in Niger, Mali and Burkina Faso have seen their military cooperation with neighbours such as Benin, which is trying to repel Sahel armed groups, deteriorate.\nOriginal language: fr\nPublish date: August 26, 2025 08:25 AM\nSource:[JeuneAfrique.com](https://www.jeuneafrique.com/1716916/politique/le-mali-et-le-burkina-faso-boycottent-le-sommet-africain-sur-la-defense-organise-au-nigeria/)\n\n**Sahel Crisis: Why Military Regimes in Mali, Niger and Burkina Faso May Fail**\nThe article reports that the military governments in Mali, Burkina Faso and Niger are losing popular support as security deteriorates and the economy falters.  Since the coups in 2020–2021, the armed forces have failed to improve the fragile security situation; instead, Islamist insurgents and other rebels have taken control of more territory.  Within the armies, disagreements over strategy and the transition to a democratic government have surfaced, according to political analyst Beverly Ochieng of Control Risks.  In Mali, a failed coup in August 2024 led to the arrest of dozens of soldiers, including two prominent generals and a French officer accused of mobilising civilians for the French intelligence service; the French foreign ministry dismissed the allegations as \"completely unfounded\".  Ochieng notes that the coup attempt shows the regime’s attempt to pre‑empt internal dissent.  Since the 2021 coup, Mali’s junta has ended the UN mission, expelled France and brought in Russian paramilitaries, while repeatedly facing accusations of serious human‑rights violations from the UN and NGOs.  In August 2024, a protest in the village of Diafarabé over alleged mass killings by the army prompted the dismissal of the local governor, who was later arrested on charges of \"destabilising the state\".  Economic hardship, new taxes and the dissolution of political parties have sparked further protests, which were violently suppressed.  The three countries left ECOWAS in 2023 and formed the Sahel Alliance (AES), which lacks access to a port and relies on neighbouring coastal states, contributing to rising prices and frequent power outages.  In Burkina Faso, the young president Ibrahim Traoré faces criticism within the army because of his low rank and the potential expansion of Islamist influence; in Niger, mutinies have been reported after military defeats against Islamist militias.  Ochieng warns that a future coup in any of the three states is more likely to prolong the status quo than to accelerate a return to democracy, as each new junta will focus on consolidating its own power.\nOriginal language: de\nPublish date: August 23, 2025 03:30 AM\nSource:[Neue Zürcher Zeitung](https://www.nzz.ch/international/militaerregierungen-im-sahel-unter-druck-risse-in-armee-und-bevoelkerung-ld.1898767)\n\n**Africa: Review of Francophone Africa News - July 28, 2025**\nThe Democratic Republic of Congo (DRC) has been hit by an attack on a Catholic church in the north-east of the country by the rebel group ADF, affiliated with the Islamic State. The attack has resulted in at least 43 deaths, according to a new UN report. The ADF has killed thousands of civilians and committed numerous crimes in the north-east of the DRC despite the deployment of the Ugandan army (UPDF) alongside the Congolese armed forces (FARDC). In Cameroon, the rejection of Maurice Kamto's presidential candidacy has sparked controversy. Although his candidacy was not authenticated, audio recordings that have gone viral on the internet suggest that there was a plot to exclude him from the presidential election. In the Central African Republic, President Faustin-Archange Touadéra has announced his candidacy for a third term in the presidential election in December 2025. He is relying on the new constitution adopted in 2023 to extend his rule. In the US, Washington has suspended the issuance of visas to Niger. The reasons for this decision are not specified, but the suspension will remain in place until Washington resolves its 'concerns with the government of Niger'. In Madagascar, the country has failed to make it to the top 50 of the Africa's Business Heroes (ABH) 2025 competition for the first time since 2021. The competition, initiated by Alibaba Philanthropy, has seen a record number of 32,000 applications from 54 African countries. In Mali, former Prime Minister Choguel Maïga is under investigation for the misuse of public funds. In Côte d'Ivoire, a king has warned of the country's political situation ahead of the presidential election in October. In Abidjan, the capital of Côte d'Ivoire, the 27th edition of the Afrobasket women's basketball tournament is taking place, featuring 12 national teams. In Burkina Faso, a Burkinabé activist has died in prison in Abidjan. In the Sudan, the Rapid Support Forces (RSF) have announced the creation of a parallel government in the areas under their control, with Mohamed Hassan Al-Ta'ayshi as the head of the 'government of peace and unity'.\nOriginal language: fr\nPublish date: July 28, 2025 09:30 AM\nSource:[allAfrica.fr](https://fr.allafrica.com/stories/202507280137.html)\n\n**Is Africa Coming Under Mysterious Attacks As Primate Ayodele Foretold?**\nThe article discusses rising political instability across Africa, citing recent military coups in Niger Republic and an attempted coup in Sierra Leone, as well as regional tensions involving the Economic Community of West African States (ECOWAS) and military juntas in Burkina Faso, Guinea Bissau, and Mali. It claims that ECOWAS ordered the Niger junta to restore democratic rule, prompting a warning from other West African military regimes that any forceful intervention would be viewed as war and provoke retaliation. The article frames the situation as a potential continental conflict, suggesting Africa is heading toward internal warfare. It references Primate Elijah Ayodele, a self-proclaimed prophet, who in January 2023 and February 2023 foretold a 'mysterious attack' on Africa, describing it as an unexplainable crisis, widespread insecurity, and a war between African nations. Ayodele also warned that the presence of foreign powers—such as China, Russia, the U.S., the UK, and Israel—could turn Africa into a geopolitical testing ground. The article concludes by posing the question: 'Will it be right to say Africa is coming under a mysterious attack as foretold by Primate Ayodele?' The claims are presented without independent verification, relying solely on the prophet’s statements and current geopolitical developments.\nOriginal language: en\nPublish date: August 02, 2023 09:18 AM\nSource:[topcelebrities.com.ng](https://topcelebrities.com.ng/is-africa-coming-under-mysterious-attacks-as-primate-ayodele-foretold/)\n\n**Niger adds to growing list of countries in the Sahel run by the military**\nThe Associated Press reports that mutinous soldiers in Niger overthrew President Mohamed Bazoum’s democratically elected government, adding Niger to a growing list of military regimes in West Africa’s Sahel. The coup follows a pattern in which soldiers accuse civilian leaders of failing to deliver democratic dividends, promising a new government that is delayed in practice.  Karim Manuel, a West‑and‑Central Africa analyst for the Economist Intelligence Unit, warned that such military takeovers \"increase political instability going forward and make the situation on the ground much more volatile and unpredictable,\" thereby undermining regional stability.  The Sahel region—comprising Senegal, Gambia, Mauritania, Guinea, Mali, Burkina Faso, Niger, Chad, Cameroon and Nigeria—now hosts several military regimes: Mali (2020 coup, 2024 constitution referendum), Burkina Faso (2022 coup, July 2024 election goal), Sudan (2021 coup, ongoing civil conflict), and Chad (2021 coup, 18‑month transition extended).  The article also notes that over 90% of Guineans support a referendum that could allow the junta leader to run for president.  The piece was updated on July 28, 2023 at 21:24 (UTC).\nOriginal language: en\nPublish date: July 28, 2023 09:24 PM\nSource:[apnews.com](https://apnews.com/article/niger-coups-bazoum-sahel-military-democracy-d1614b14baff6571b7d3766c2cbd8ba1)\n\n",
    "date": "2025-11-17T23:13:04.391731",
    "summary": "The panel of experts broadly agrees that, while Africa—particularly in the Sahel region—remains at elevated risk for successful coups, the overall probability of a successful coup (classic or self-coup) before January 1, 2026 is lower than during the peak coup wave of 2020–2023, but still materially above long-term historical averages. Most experts situate the highest risk within specific African countries like Mali, Burkina Faso, Niger, Guinea-Bissau, and, to a lesser extent, Benin and Central African Republic, based on persistent regime fragility, elite splits, legitimacy crises, ongoing jihadist insurgencies, and a recent pattern of coup attempts and purges. Latin America is broadly assessed as substantially less likely to experience a successful coup in this time frame, given stronger institutional barriers and recent failed coup attempts. \n\nKey factors increasing the probability include high coup base rates in the Sahel, entrenched military regimes with internal fissures, legitimacy deficits, ongoing insurgencies, and election-related or elite succession crises. These risks are partially offset by recent and ongoing coup-proofing efforts, such as purges of suspected plotters, increased repression, heavy reliance on Russian (Africa Corps) and Turkish security support, and the short time window remaining (about six weeks). Several experts note that successful coups often cluster and can be contagious regionally, but also highlight that most at-risk regimes have recently survived attempted coups and remain on high alert.\n\nThe most common 'No' scenario is that existing African juntas maintain control through surveillance, purges, and foreign backing, foiling any nascent plots before they can succeed, while Latin America remains stable despite some underlying tensions. The most plausible 'Yes' scenario is an internal military split or elite fracture resulting in a rapid, successful 'palace coup' within an already unstable junta-ruled state, or, more rarely, a self-coup or rushed elite takeover in a fragile democracy during a political or security crisis.\n\nForecast probabilities cluster in the 13%–43% range, with most estimates between 23% and 34%, reflecting current warning indicators balanced by successful regime adaptation and the limited resolution window. Outliers include the highest forecast (43%) emphasizing coup contagion in regional security complexes and the lowest (13%) emphasizing coup-proofing and the short time frame. The aggregate expert consensus is that the risk of at least one successful coup in Africa or Latin America before January 1, 2026 is well above zero but remains below a coin flip, driven primarily by continued instability and elite fragmentation in Francophone Sahelian Africa.",
    "forecasters": [
        "IntelligenceAnalysis (IndicatorsAndWarningsMethod)",
        "IntelligenceAnalysis (PoliticalRiskAssessment)",
        "SecurityStudies (CivilMilitaryRelations)",
        "InternationalRelations (RegionalSecurityComplexTheory)",
        "Political Science (CoupTrapTheory)",
        "Political Science (ComparativeAuthoritarianism)",
        "Political Science (PoliticalInstitutionalism)",
        "Sociology (SocialMovementTheory)",
        "Sociology (EliteTheory)",
        "AreaStudiesAfrica (AfricanStateFragility)",
        "AreaStudiesAfrica (NeoPatrimonialism)",
        "AreaStudiesLatinAmerica (LatinAmericanMilitaryIntervention)",
        "AreaStudiesLatinAmerica (DemocraticBreakdownTheory)"
    ]
}