{
    "deliberation_results": {
        "Security Studies (CivilMilitary Relations Analysis)": {
            "time_to_resolution": "Just under 2 months until January 1, 2026 (question resolves then).",
            "perspective_relevance": "As an expert in Security Studies with a focus on civil-military relations, I bring a deep understanding of the historical triggers and mechanics of martial law, coup likelihood, state capacity for repression, and thresholds for civil unrest in the Philippines. My expertise also involves analyzing elite fractures, military and police loyalties, and the interaction between political family dynasties and the coercive apparatus, all critical to evaluating the plausibility of nationwide or Mindanao-specific martial law and mass unrest/arrests/deaths.",
            "status_quo": "The Philippines remains tense but below thresholds for major civil unrest or martial law. Despite Duterte's ICC arrest and ongoing political confrontation between the Marcos and Duterte alliances, outbreaks of violence and protest have not escalated to national martial law, nor to the casualty/arrest benchmarks stipulated by the question.",
            "perspective_derived_factors": [
                {
                    "factor": "Elite Fracture and Family Politics (Marcos vs. Duterte)",
                    "effect": "Increases probability: The open rupture, with the Duterte family threatening to mobilize Mindanao forces and public calls for secession, provides a classic elite split that historically increases risk of mass unrest, regional instability, or targeted martial law, especially if either side attempts an extra-legal gambit."
                },
                {
                    "factor": "Historical Martial Law Triggers",
                    "effect": "Decreases probability: Past martial law declarations were triggered by mass armed insurgency (1972), major terror attack (2017), or large-scale massacre (2009). Current unrest does not (yet) approach these thresholds—current protests, though large (50–150,000), have stayed mostly peaceful with limited casualties/arrests (none approaching 1,000 or 5,000)."
                },
                {
                    "factor": "Strength and Fragmentation of Security Services",
                    "effect": "Decreases probability: No credible reporting of mass defections or large-scale split in the military or police. Police and military continue to enforce order under the national government, and even with Mindanao tensions and Duterte loyalists, top-down command cohesion is holding. The history of the AFP and PNP is one of loyalty to the incumbent, not local dynasts."
                },
                {
                    "factor": "Regionalism—Mindanao as Flashpoint",
                    "effect": "Slightly increases probability: Martial law limited to Mindanao is well-precedented (2017). The open threats by Duterte Jr. (‘mobilize’ forces, secession) raise the possibility of a severe Mindanao incident triggering localized martial law, especially if violence spreads in Davao. However, the broader country shows no sign of tipping toward mass unrest or civil conflict."
                },
                {
                    "factor": "Base Rates of Civilian Protest Casualties/Arrests",
                    "effect": "Decreases probability: Protest deaths in recent years are counted in tens, not thousands, and mass arrests are in the low hundreds per event. Despite visible youth protests (e.g., September violence, 72 arrested, minor arson), cumulative numbers are far from the thresholds, even assuming sporadic escalation. No sign of an accelerating trend."
                },
                {
                    "factor": "Leadership Styles and Calculation",
                    "effect": "Decreases probability: Marcos Jr. has shown a preference for co-optation, not maximal crackdown, and is aware of domestic and international scrutiny. The legacy of his father’s protracted martial law (now remembered with trauma) works as a brake. The risk of overreaction remains but is structurally contained."
                },
                {
                    "factor": "Popular Apathy/De-politicization",
                    "effect": "Decreases probability: Civil society remains wary, even traumatized from Duterte’s previous killings, and while there is disillusionment, there’s no sign of broad urban radicalization or mass mobilization on the order needed for regime destabilization. Current protests have not achieved nationwide escalation or united disparate angry factions."
                }
            ],
            "no_scenario": "Despite intense elite rivalry, the Marcos and Duterte camps avoid open violence or negotiated de-escalation prevails in Mindanao. Protests continue but remain peaceful or are managed by regular policing, with cumulative unrest-related deaths/arrests well below the thresholds. No major event (terror attack, insurrection, massacre) triggers martial law, and the political system muddles through without a full-blown crisis.",
            "yes_scenario": "A major violent incident occurs in Mindanao (e.g., Duterte loyalists clash with central government or attempt a breakaway, or unrest spirals out of control), resulting in large-scale fatalities or mass arrests. In response, the national government—citing a breakdown of order—re-imposes martial law in Mindanao. Alternatively, if Manila protests dramatically escalate in coordination with Mindanao unrest, mass casualties/arrests could trigger a national martial law or reach the required thresholds. Both scenarios would require rapid, widespread escalation far beyond current levels.",
            "final_reasoning": "The Philippines is in a structurally high-risk period with elite fracture, a Duterte legal crisis, and Mindanao tensions. However, a confluence of restraining factors—the professionalism and incumbency loyalty of armed forces, past experience with the cost of martial law, and the regime's ability to manage or contain unrest—combine to keep the situation beneath the severe unrest or martial law thresholds so far. Despite open threats from the Duterte camp in Mindanao, no concrete evidence yet exists of secured local armed mobilization or uncontrollable mass casualty events. While the status quo is fragile and a severe flashpoint (e.g., a Mindanao shooting involving state forces and Duterte loyalists) could trigger a localized martial law akin to 2017, I judge the probability of a Yes resolution at well above historic baseline (~5–10%) but well below even odds, given the containment so far. The scenario with the highest risk is targeted martial law in parts of Mindanao, but this requires a further significant deterioration from the current situation—a real possibility, though not the most likely outcome within the timeframe.",
            "final_probability": 27
        },
        "Security Studies (Coup Risk Assessment)": {
            "time_to_resolution": "Until January 1, 2026 (approx. 2 months left from forecast date).",
            "perspective_relevance": "As an expert in Security Studies with a focus on Coup Risk Assessment, I specialize in evaluating the risk and triggers for regime instability, civil unrest, and the conditions under which martial law is invoked. This encompasses assessing elite fractures, mass mobilization dynamics, military loyalty, the strength of ruling coalitions, historical precedents, and how external or judicial shocks (e.g., Duterte’s ICC arrest) interact with these variables. The Philippines' postcolonial legacy, periodic outbreaks of martial law, regional political machinations, and clan patronage politics are all central to such an analysis.",
            "status_quo": "Despite chronic governance challenges, elite rivalries, and periodic outbreaks of violence, the Philippines has not met the high thresholds set for 'major civil unrest' or martial law (≥1,000 deaths in unrest, ≥5,000 unrest-related arrests, or a national government martial law declaration in any region) since the Mindanao martial law of 2017. Current protests and political instability have not escalated to these historic levels.",
            "perspective_derived_factors": [
                {
                    "factor": "Elite fracture and clan rivalry",
                    "effect": "Increases probability moderately; the Marcos–Duterte feud has sharply deteriorated, with explicit threats (Sara Duterte’s veiled breakup warnings, Mindanao self-governance talk, and the rupture of their political alliance) raising the risk of escalation beyond normal political maneuvering, potentially destabilizing Mindanao."
                },
                {
                    "factor": "Duterte’s ICC arrest and popular mobilization potential",
                    "effect": "Slightly increases probability; Duterte’s detention is historic, but has not (yet) triggered mass, violent mobilization. However, his and his family's enduring popularity, especially in Davao/Mindanao, and elite allegations of political persecution could serve as protest flashpoints if manipulated skillfully."
                },
                {
                    "factor": "Historical base rate of martial law/unrest of sufficient scale",
                    "effect": "Decreases probability; nationwide or even regional martial law (per resolution criteria) is rare—four declarations in modern history (1944, 1972, 2009, 2017), usually in response to larger-scale violence/insurrection than presently observed."
                },
                {
                    "factor": "Popular protest climate and government response",
                    "effect": "Marginally increases probability; recent protests (e.g., anti-corruption demonstrations with up to 150,000 participants, youth-led mobilizations) have seen hundreds of arrests, but remain far below the thresholds for mass unrest arrests or deaths. Still, the government has shown a willingness to use force and might escalate if protests grow or become more polarized."
                },
                {
                    "factor": "Military and police posture & loyalty",
                    "effect": "Neutral to decreases probability; there is little indication of military splits or independent action as of November 2025. The military remains largely under the control of the national government, lessening coup/martial law risk short-term, unless Mindanao violence sharply worsens or Manila unrest surges."
                },
                {
                    "factor": "Potential for Mindanao violence to spiral",
                    "effect": "Moderate increase; Mindanao remains the most plausible theatre for declared martial law, given Duterte networks, separatist history, and local violence (including recent evacuations). Should conflict or Duterte clan mobilization spill into broader armed resistance, risk of a regional declaration would rise quickly."
                },
                {
                    "factor": "International/ICC ‘external shock’ effects",
                    "effect": "Small increase; the ICC case is a novel stressor, symbolizing elite defection and internationalization of domestic conflict. However, backlash has not (yet) proved catalytic for unrest or mass mobilization beyond protests—and Marcos’ regime may use a mix of repression and co-optation to keep unrest under control."
                }
            ],
            "no_scenario": "Political tensions and protests simmer into 2026, with frequent but mostly peaceful demonstrations (possibly punctuated by small-scale clashes), continued elite struggle, and local violence in Mindanao. Arrests from protests remain in the hundreds (not thousands), and deaths do not approach the threshold. Marcos maintains control without regional martial law declaration, and neither mass unrest nor military/paramilitary action breaches historic thresholds.",
            "yes_scenario": "A sharp escalation occurs—possibly triggered by a violent crackdown on a surge of pro-Duterte or anti-Marcos mobilizations (for instance, after a new ICC decision or failed negotiation for Duterte's release), or a major Mindanao confrontation as clan loyalists defy Manila, prompting Marcos to declare martial law regionally. Alternatively, government overreach in policing mass protests (in Manila or Mindanao) leads to ≥1,000 deaths or ≥5,000 arrests in the context of civil unrest.",
            "final_reasoning": "The risk environment for the Philippines is elevated in late 2025 compared to most years: elite fracturing (Marcos–Duterte), Duterte’s ICC arrest and continuing popularity, high regional tensions in Mindanao, and recent large-scale protests all raise the risk of major unrest or a symbolic regional martial law declaration. However, base rates for martial law declarations are low—mindful that, even during major political crises (e.g., Duterte, Estrada, Arroyo era scandals), the thresholds for unrest deaths/arrests or martial law have rarely been breached outside severe regional instability. Current unrest, while significant (with protest crowds up to 150,000 and several clashes), has so far resulted in at most hundreds of arrests, not thousands, and deaths have been limited. The Marcos regime, while under pressure, retains military loyalty and control; the opposition is fragmented. Mindanao is the critical wildcard: sustained violent escalation there (driven by Duterte networks) could provoke a martial law declaration of regional scope, which would resolve Yes. Weighing all factors, the current forecast remains: while not negligible, the risk is lower than the headlines suggest, but meaningfully higher than baseline due to the ongoing elite fracture and regional tinderboxes. I assess a probability of 21%, above base rates but reflecting the improbability of trigger thresholds being met in the remaining two months unless a major crisis unfolds.",
            "final_probability": 21
        },
        "Risk Analysis (Political Risk Assessment)": {
            "time_to_resolution": "Approximately 8 weeks (until January 1, 2026)",
            "perspective_relevance": "As a risk analysis and political risk assessment expert, I assess threats by combining the Philippines’ political history, structural and regional risk drivers, and the dynamics of elite competition. This expertise allows me to synthesize base rates (martial law, past unrest), connect geopolitical context, and evaluate both legal and extralegal crisis triggers, including underlying grievances, state capacity, escalation signals, regional/local versus national triggers, and elite incentivization for unrest or repression.",
            "status_quo": "Despite a history of deadly unrest and periodic martial law, the Philippines is not currently under martial law, nor has it suffered mass-casualty unrest (>=1,000 deaths) or mass arrests (>=5,000) in 2025 so far. Tensions are elevated due to the Marcos-Duterte rift and the ICC detention of Rodrigo Duterte, but unrest has stayed sub-threshold, with notable but not unprecedented protests recently in Manila.",
            "perspective_derived_factors": [
                {
                    "factor": "Historical base rates for martial law or mass unrest",
                    "effect": "Decreases probability; Philippines has only had four martial law declarations since WWII, and mass-casualty unrest at national scale is rare. The modal year is peaceful despite underlying conflict."
                },
                {
                    "factor": "Elite rivalry: Marcos vs. Duterte families",
                    "effect": "Increases probability: Dynastic rifts can spark regional agitation, elite-sponsored protest, and security force confrontations, especially in Mindanao, Duterte’s base."
                },
                {
                    "factor": "Duterte’s arrest/trial at the ICC and local reactions",
                    "effect": "Increases probability: The ICC arrest and continued trial of Duterte is a potential flashpoint, especially if perceived as unjust, but so far unrest has not escalated beyond the regional base or catalyzed broader destabilization."
                },
                {
                    "factor": "Security apparatus loyalty and state capacity",
                    "effect": "Decreases probability: Philippine police/military retain unity with the central government, and there’s no evidence of major defections or panic; the state’s ability to manage protest/subregional disturbances remains high."
                },
                {
                    "factor": "Public protest mobilization capacity",
                    "effect": "Neutral to mildly increases probability: Large protests have occurred—up to 150,000 in Manila recently—but crackdowns have not yet triggered large-scale violence or mass arrests near the 5,000 threshold. Arrest response cautious so far."
                },
                {
                    "factor": "Regional grievances (Mindanao; ethnic, clan networks)",
                    "effect": "Increases probability: If Mindanao political networks loyal to Duterte escalate, this could drive localized martial law (as in 2017)."
                },
                {
                    "factor": "Recent trend of government response to unrest (restraint or escalation)",
                    "effect": "Decreases probability: Recent handling of protests has involved some violence/arrests but without escalating to lethal crackdowns or en masse detention."
                },
                {
                    "factor": "International environment (e.g., US/China rivalry, international condemnation of force)",
                    "effect": "Decreases probability: International scrutiny and the US strategic interest in the Philippines act as a mild constraint on lethal force or martial law except in extreme, localized crisis."
                }
            ],
            "no_scenario": "Tensions persist but do not escalate into either (a) martial law anywhere, (b) riots or disorder causing 1,000+ deaths, or (c) mass arrests (5,000+) before Jan 1, 2026. Protests flare intermittently, especially in Manila and Mindanao, but state response remains proportionate. Duterte’s ICC proceedings continue, perhaps inflaming rhetoric but not violence. The Duterte clan retains control in Davao but does not mount an insurgency or push for secession.",
            "yes_scenario": "A flashpoint—such as a violent incident involving Duterte family loyalists, a botched security operation, or a major judicial verdict or extradition development—in Mindanao or Manila triggers mass mobilization. This forces Marcos Jr. to declare martial law regionally (as in 2017) or even nationally. Alternatively, a protest spins out of control and government or vigilante violence produces 1,000+ deaths, or the crackdown on protests/arrests spirals beyond the 5,000 threshold.",
            "final_reasoning": "The base rate for martial law or mass-fatality unrest in the Philippines is low (four martial law declarations in modern history, last in 2017 during active Islamist insurrection). 2025 has been tense: (1) Duterte’s ICC arrest and perceived state betrayal by the Duterte/Mindanao base, (2) Large, restive but mostly nonviolent protests over corruption, inflation, and elite infighting. However, crackdowns have not moved close to mass death or mass detention thresholds and martial law remains unused despite temptations. Elite rivalry threatens instability—but the Duterte clan’s political network, while potent regionally, lacks the required force or momentum to mount an effective mass uprising at this time, especially as Duterte remains detained abroad. The Marcos administration, seeking to consolidate power, has not shown a willingness to escalate police/military repression to the scale required for Yes resolution. The state’s relatively disciplined, pragmatic response to unrest (including symbolic community service for arrested minors) plus international scrutiny further constrain escalation. Recent violence in Mindanao remains subthreshold, and elite alignment (military/police with Marcos, not Duterte) remains firm. Collectively, key risk factors are elevated but have not yet breached tipping points. While a black swan scenario (assassination; police/military split) could still produce a Yes, current trajectories make this a significantly less likely outcome. My probability: 16%.",
            "final_probability": 16
        },
        "Risk Analysis (Scenario Planning)": {
            "time_to_resolution": "Approximately 2 months (resolves by January 1, 2026; forecast date November 3, 2025)",
            "perspective_relevance": "As an expert in risk analysis and scenario planning, I take a structured approach to rare but extreme events. Using base rates, I establish the historical context of martial law and major civil unrest in the Philippines. I then stress-test the current configuration of elite rivalry, public discontent, law enforcement response, and regional vulnerabilities. My scenario planning lens weighs tail risks (low-probability, high-impact events) and watches for catalysts, contagion, and escalation paths often underestimated in conventional political analysis.",
            "status_quo": "Despite historical volatility, the Philippines is not currently under martial law, nor have there been riot-related deaths or arrests above the thresholds for a Yes outcome in 2025. Protest activity, while significant, has been met with arrests and sporadic violence, but not on a scale to trigger question resolution. The Duterte family retains regional influence but lacks national executive power. Institutional responses remain within the standard law-enforcement framework.",
            "perspective_derived_factors": [
                {
                    "factor": "Elite fratricide and Duterte-Marcos feud",
                    "effect": "Increases probability. The breakdown of the Marcos-Duterte alliance, coupled with Duterte’s arrest and Sara Duterte’s radical rhetoric, raises risks of mobilized unrest, especially in Mindanao, where the Duterte family wields considerable loyalty."
                },
                {
                    "factor": "Public disillusionment, protests, and youth mobilization",
                    "effect": "Increases probability. Large-scale protests over corruption and government impunity, with youth and progressive participation, show latent societal anger. However, previous incidents did not reach the civil unrest thresholds for the Yes outcome."
                },
                {
                    "factor": "Regional base rates and conflict history",
                    "effect": "Slightly increases probability but sets context. Four martial law declarations in the past (1944, 1972, 2009, 2017) suggest a base rate far below 10% per year. However, Mindanao’s history of conflict, and the potential for exceptional regional triggers, means past is not fully prologue."
                },
                {
                    "factor": "State discipline, institutional inertia, and police/military posture",
                    "effect": "Decreases probability. The Marcos administration, while hardline, has incentives to avoid over-escalation that would risk international standing and internal legitimacy. The handling of September protests—arrests but not mass lethal force—suggests a preference for containment over martial law unless there is extreme crisis."
                },
                {
                    "factor": "Potential for scenario 'black swans' (e.g. Duterte death in custody, high-profile assassination, or cascading Mindanao violence)",
                    "effect": "Increases probability (tail risk). Such catalysts could push events over the threshold, particularly if they delegitimize institutional authority or trigger simultaneous multi-city unrest, but each has low base probability within a 2 month window."
                }
            ],
            "no_scenario": "Tensions between Marcos and Duterte camps persist, but are managed through police action and targeted arrests. Protests continue sporadically, with some youth and regional mobilization, but lack the scale, organization, and violence to breach the 1,000 deaths or 5,000 riot-related arrests thresholds. No major escalation occurs in Mindanao beyond contained violence or clan disputes. State response remains within normal policing with no martial law declaration.",
            "yes_scenario": "An unexpected trigger—such as Duterte’s death in ICC detention, a failed or actual attempt to break him out, or assassination/attempt on a Duterte or Marcos family member—sets off mass protests in Davao and possibly Manila. Loyalist elements in Mindanao mobilize, overrun police outposts or government offices, spurring the Marcos government to declare martial law in Davao or more widely in Mindanao to maintain order. Alternatively, a violent crackdown on a large protest causes hundreds of deaths, and mass arrests rise above the 5,000 threshold as the government attempts to assert control.",
            "final_reasoning": "The baseline probability, derived from the post-1986 base rate for national martial law and major deaths/arrests, is low—likely under 5% per year. However, the arrest of Rodrigo Duterte is without precedent: this is the first time a former president and regional strongman faces prolonged external detention, heightening the risk profile in his base. The Duterte-Marcos rift is pronounced, and both families retain their own patronage networks. Recent protests reached up to ~150,000 participants but have so far been met with non-lethal crowd control; riot-related arrests have not approached 5,000, nor deaths 1,000. While Mindanao remains a flashpoint, and Sara Duterte has issued militant rhetoric, there is so far no evidence of mass mobilization or widespread elite defections. The path to a Yes outcome requires either (1) sudden elite or security force splits leading to organized violence in Mindanao, or (2) a black swan event catalyzing urban unrest beyond Manila's capacity to contain without martial law, neither of which is presently in train but remain credible tail risks. Considering the short window remaining in 2025 and the institutional resilience demonstrated thus far, my risk assessment suggests a modestly elevated but still sub-10% chance. I set my forecast at 7%.",
            "final_probability": 7
        },
        "Political Science (Contentious Politics Theory)": {
            "time_to_resolution": "Just under 2 months (question closes January 1, 2026; today is November 3, 2025)",
            "perspective_relevance": "As an expert in contentious politics theory, my perspective centers on understanding how alliance breakdowns among elites, shifts in state repression, and mass mobilization—each shaped by evolving grievances and opportunities—combine to generate or forestall large-scale social unrest or trigger martial law. This lens is vital for applying comparative base rates accurately and adequately weighing the emerging threat environment in the Philippines amid the Duterte-Marcos feud and ICC prosecution.",
            "status_quo": "Despite sporadic protests and longstanding regional insurgencies, no major civil unrest (deaths >1,000 or mass arrests >5,000 due to unrest) or martial law declaration has occurred in the Philippines in 2025 so far. The state has contained recent unrest well below thresholds, and the political arena is tense but mostly stable at national scale.",
            "perspective_derived_factors": [
                {
                    "factor": "Elite Cleavage and State Fragmentation",
                    "effect": "Increases probability. Open conflict between the Duterte and Marcos families, both of whom control substantial local networks and can mobilize loyalists, raises risks of escalation—particularly if one tries to use state power to decisively sideline the other."
                },
                {
                    "factor": "Popular Grievances and Mobilization Potential",
                    "effect": "Mildly increases probability. Economic woes (inflation, corruption scandals, broken election promises), collective trauma from Duterte-era violence, and generational divides revealed by recent large youth protests create a base for mobilization, but there remains widespread fear and atomization."
                },
                {
                    "factor": "State Repression Capacity and Selectivity",
                    "effect": "Decreases probability for mass unrest, increases probability of local martial law in Mindanao. The PNP and AFP—historically adept at targeted, lethal repression—effectively limit most protest escalations to smaller events. However, if violence increases in Mindanao or Davao, selective martial law could be reimposed."
                },
                {
                    "factor": "Base Rates of Major Unrest and Martial Law in Philippines",
                    "effect": "Decreases probability. Martial law has been declared only 4 times since WWII (1972, 2017 for Mindanao only, etc.), and 1,000+ protest-related deaths or 5,000+ unrest-related arrests in a single year are vanishingly rare. Even during major past crises, sustained mass unrest above these levels is unusual."
                },
                {
                    "factor": "Duterte's Arrest and ICC Proceedings",
                    "effect": "Mildly increases probability. While Duterte retains a devoted base, his arrest outside the country blunted immediate street mobilization. Sara Duterte's threats and strong Mindanao base could generate regional unrest, but there are few signs (so far) of large-scale national uprising or coordinated action across regions."
                },
                {
                    "factor": "Insurgency and Armed Factions in Mindanao",
                    "effect": "Mildly increases probability, but mostly for the scenario of limited martial law. If elite conflict leads to armed clashes between Duterte loyalists/cronies and state forces or local competitors in Mindanao, Marcos may reimpose martial law, but a nationwide declaration remains unlikely."
                }
            ],
            "no_scenario": "Despite the high level of elite conflict, protests, or sporadic violence (especially in Mindanao), authorities contain unrest without 1,000+ deaths or 5,000+ protest arrests. Marcos, keen to avoid international backlash and further legitimize his government post-Duterte, refrains from martial law (or limits any martial law declaration outside Davao/Mindanao, keeping it local and short-lived). The Duterte family leverages local power but does not incite or sustain large-scale, mass-mobilized unrest. The security apparatus remains professional and largely loyal.",
            "yes_scenario": "Either (1) escalating violence between Duterte loyalists (perhaps including rogue police/militia) and state forces in Davao or broader Mindanao results in Marcos declaring martial law locally (as in 2017), or (2) intensified national protests following another major political incident or economic crisis spiral out of control, leading to mass deaths/arrests and perhaps a partial martial law declaration, meeting the thresholds.",
            "final_reasoning": "We observe significant political instability, with open rupture between two powerhouse families, major protests in Manila, and ongoing conflict in Mindanao suggesting a real risk. However, actual unrest to this point remains below 'major' thresholds, and the state’s strong record of targeted repression has kept prior mobilizations from escalating. The Duterte family is channeling much energy into procedural/elite contests and regional resistance rather than national street violence. With under two months to go, the most plausible Yes scenario is a localized martial law declaration in Mindanao/Davao, which, given the history (2017 precedent), is not far-fetched if violence spikes. Yet, overall national-level systemic breakdown or truly massive civil unrest (as defined) is unlikely. Given these dynamics, my forecast is slightly elevated but well below even odds, reflecting both the heightened risk and constraints: most likely outcome is No, but the tail-risk of unrest-triggered martial law in Mindanao is not trivial.",
            "final_probability": 28
        },
        "Political Science (Regime Stability Paradigm)": {
            "time_to_resolution": "About 2 months (question closes December 31, 2025; today is November 3, 2025)",
            "perspective_relevance": "As a Political Science expert specializing in the Regime Stability Paradigm, I focus on institutional resilience, ruling coalition dynamics, elite fragmentation, state coercive capacity, and legitimacy crises in explaining and forecasting civil unrest or martial law. The Philippines’ history of episodic martial law, elite-based politics, dynastic competition, and persistent regional insurrections uniquely situates it for analysis through this paradigm. Current developments—Duterte’s ICC arrest, the Marcos-Duterte feud, and Mindanao stability—directly implicate regime stability and the risk parameters for unrest or state-imposed emergency rule.",
            "status_quo": "Although the Philippines has a history of violent unrest and martial law declarations (most recently in Mindanao, 2017), the normal status quo (especially since 1987) is electoral democracy with periodic local violence, not mass civil unrest or martial law at the national level. Annual deaths and protests remain below the thresholds for 'major unrest' or martial law definitions in this question.",
            "perspective_derived_factors": [
                {
                    "factor": "Elite Rivalry and Political Fragmentation",
                    "effect": "INCREASES probability. The collapse of the Marcos-Duterte alliance, threats by Duterte family members, and Mindanao unrest elevate risks of confrontational politics, which could spiral into state crisis, unrest, or institutional breakdown."
                },
                {
                    "factor": "Historical Martial Law Precedent",
                    "effect": "INCREASES probability modestly. The precedent for declaring martial law in response to Mindanao unrest or elite challenge lowers the political threshold for renewed declarations, especially if unrest intensifies locally."
                },
                {
                    "factor": "State Coercive Capacity and Political Incentives",
                    "effect": "INCREASES probability. The Marcos administration, seeing falling approval and allegations of corruption, may be incentivized to deploy coercion to suppress dissent or manage legitimacy crises, especially with a large adversarial base in Mindanao."
                },
                {
                    "factor": "Popular Mobilization and Protest Ruthlessness",
                    "effect": "INCREASES probability, but less so than elite factors. Recent protests (e.g., September 'pirate flag' youth demonstrations of up to 150,000, violent episodes, and large-scale arrests) show potential for escalation, although the government response has so far stopped short of martial law."
                },
                {
                    "factor": "Enduring Regionalism and Duterte Support in Mindanao",
                    "effect": "INCREASES probability, but may localize rather than nationalize unrest. The Duterte family’s threat to 'mobilize forces and break away' from Manila, plus their deep-rooted patronage in Mindanao, could trigger violent pushback or targeted regional martial law."
                },
                {
                    "factor": "Base Rate of Major Unrest or Martial Law",
                    "effect": "DECREASES probability. Since 1944, martial law has been declared only four times. Large-scale civil unrest (over 1,000 deaths or 5,000 arrests in the context of unrest) is rare despite chronic low- to mid-level separatist and leftist violence."
                },
                {
                    "factor": "International and Domestic Legitimacy Constraints",
                    "effect": "DECREASES probability. Both the ICC focus and external/international scrutiny (especially U.S./EU attention due to Duterte's arrest and China/U.S. contestation) create costs for dramatic coercive action, even as internal legitimacy is challenged."
                },
                {
                    "factor": "Regime Learning and Tactical Restraint",
                    "effect": "DECREASES probability. The current administration, despite authoritarian tendencies, has so far responded to even serious protest with community service rather than mass crackdown, suggesting desire to avoid international or historical stigma associated with martial law."
                }
            ],
            "no_scenario": "Despite elevated tensions, Mindanao witness localized violence (e.g., deaths or evacuations in flashpoints) but not at sufficient scale to cross the 1,000 deaths or 5,000 arrests threshold. The Marcos administration deploys heavy police presence but refrains from formally declaring martial law (even regionally), instead using existing emergency powers and legal harassment to tamp down unrest and manage elite rivals. Protests in Manila and elsewhere, though occasionally large, recede without tipping into nationwide violent disorder.",
            "yes_scenario": "Following further escalation—perhaps a major assassination, a coordinated uprising by Duterte loyalists in Mindanao, or a large provocation by protestors (e.g., police deaths, attacks on infrastructure)—the Marcos administration or a military proxy declares martial law in all or part of Mindanao, citing national security and the breakdown of local order. Alternatively, civil unrest nationwide spikes in the wake of a Duterte trial milestone, the government responds with mass arrests, and the event crosses the fatality/arrest thresholds or triggers an emergency decree.",
            "final_reasoning": "Recent months have featured sharp elite polarization, with both the Duterte and Marcos camps capable of mobilization—and both having roots in violent/authoritarian traditions. The Duterte family's open threats of secession or force and Mindanao's history as a locus for martial law and insurgency are significant red flags. However, most actual protest events so far have not approached the scale required for 'major' unrest per this question's definition. Martial law, while not unprecedented, remains a tool of last resort due to high international and domestic legitimacy costs—especially with Duterte detained at the ICC and with external actors closely watching for human rights abuses. The deadline (Jan 1, 2026) gives almost two more months for new shocks, but unless a violent catalyst or breakdown in elite negotiations occurs, the most likely scenario is persistent tension, localized violence, and state heaviness falling short of the formal thresholds. Thus, from a regime stability lens, the risk is meaningfully elevated but not yet extreme.",
            "final_probability": 32
        },
        "Sociology (Social Movements Theory)": {
            "time_to_resolution": "Approximately 2 months (until January 1, 2026), as the forecast date is November 3, 2025.",
            "perspective_relevance": "As an expert in Sociology with specialization in Social Movements Theory, I focus on understanding the dynamics of protest mobilization, state response, elite conflict, and regime resilience or breakdown. The Philippines has a rich history of contentious politics, elite-driven factionalism, and episodic mass protests, making this a paradigmatic case for applying social movement theories like resource mobilization, political process, and framing theory. These tools help assess grievance magnitude, mobilization structures, state capacity for repression or accommodation, and the potential for escalation to 'major civil unrest.'",
            "status_quo": "Despite deep grievances, recurring protests, and periodic violence (especially in Mindanao), the Philippine state has generally contained major unrest through a combination of limited but targeted repression, cooptation, elite bargaining, and the use of local (not national) martial law powers. Martial law declarations have remained rare at the national level, and episodes of unrest have not reached the high thresholds (1,000 deaths or 5,000 arrests in a year) outside of exceptional crises.",
            "perspective_derived_factors": [
                {
                    "factor": "Elite Factionalism (Marcos vs. Duterte Clans)",
                    "effect": "Increases probability—open conflict between powerful dynasties destabilizes pacts that have previously contained mass unrest, and threats of regional breakaway in Mindanao signal severe rifts that could produce state repression or mass protest escalation."
                },
                {
                    "factor": "Repressive State Capacity & Martial Law Precedent",
                    "effect": "Increases probability—Philippine presidents have resorted to martial law in Mindanao during spikes in violence (2017, 2009), and Marcos has the legal authority and family precedent to invoke martial law in response to elite or popular mobilization."
                },
                {
                    "factor": "Polarized and Mobilized Civil Society",
                    "effect": "Increases probability—recent mass protests (100,000+ in September 2025), youth activism adopting potent protest symbolism, and the willingness to confront state violence suggest capacity for mobilization exceeding normal anti-government protest cycles."
                },
                {
                    "factor": "Residual Fear, Trauma, and Depoliticization",
                    "effect": "Decreases probability—years of Duterte-era repression, normalized violence, and persistent political apathy/depoliticization in Manila suggest that, despite rising mobilization, most Filipinos are still reluctant to push for truly regime-disruptive protest."
                },
                {
                    "factor": "Regionalization of Conflict (Mindanao Focus)",
                    "effect": "Increases probability of local martial law—a scenario where Mindanao-specific unrest, fueled by Duterte loyalists and separatist rhetoric, sparks another limited declaration, meeting resolution criteria but not spreading nationwide."
                },
                {
                    "factor": "State Resilience via Elite Cooptation and Clientelism",
                    "effect": "Decreases probability—Philippine politics is adept at defusing mass unrest through patronage, selective repression, and elite bargaining posturing. Biden time as grievances flare and then coopt leaders or pacify movements blunts escalation."
                },
                {
                    "factor": "Threshold Effects for Resolution (Deaths & Arrests)",
                    "effect": "Decreases probability—stringent numerical criteria (1,000 deaths, 5,000 arrests) are unlikely to be hit unless violence becomes widespread or state repression ramps up dramatically, neither of which currently appears imminent based on government responses to fall 2025 protests."
                }
            ],
            "no_scenario": "Despite continued protests and elite posturing (e.g., Duterte family separatist threats, mass anti-corruption rallies), the government contains unrest to manageable levels through a mix of limited concessions, targeted arrests, and selective violence. Marcos resists declaring even localized martial law for fear of international backlash and legitimacy loss. Annual protest deaths and arrests do not cross critical thresholds, and elite conflict simmers but does not trigger open, mass rebellion. The dynamic remains within historical norms for Philippine contentious politics.",
            "yes_scenario": "Rivalries between the Duterte and Marcos clans escalate sharply, with Mindanao-based Duterte loyalists mobilizing tens of thousands in armed standoff with national forces or declaring de facto independence. State response is forceful: martial law is declared in key Mindanao provinces to reassert authority, with widespread arrests. Alternatively, a flashpoint incident during a national protest in Manila (e.g., a death during a crackdown) sparks days of riots, with police using lethal force, resulting in over 1,000 cumulative deaths or a mass roundup of protesters exceeding 5,000 arrests. Media and NGOs document the scale, meeting resolution thresholds.",
            "final_reasoning": "The probability of major civil unrest or martial law in the Philippines in 2025 is elevated compared to typical years, given the depth of the Marcos–Duterte split, Duterte's ICC detention (galvanizing loyalist outrage), and the scale of recent youth-driven protests. However, localizing factors (clan-based power, Mindanao focus), a legacy of repression/depoliticization, and the Philippine state's preference for calibrated rather than maximal repression moderate the likelihood of escalation to the question's resolution thresholds. The risk is well above historic base rates but remains less likely than not nationally—unless Mindanao 'breaks' and martial law is narrowly declared there, as in 2017. I assign a 38% probability, expressing significant but still sub-50% risk, with regional (Mindanao) martial law far more likely than a national crackdown or unrest meeting the death/arrest bar.",
            "final_probability": 38
        },
        "Sociology (Relative Deprivation Theory)": {
            "time_to_resolution": "Approximately 2 months, until January 1, 2026.",
            "perspective_relevance": "As a sociologist specializing in Relative Deprivation Theory, my focus is on perceptions of injustice among different social groups, the psychological triggers for collective action, and the conditions under which discontent escalates into mass mobilization or unrest. RD theory is highly relevant here, given the Philippines' stark inequalities, legacies of violence, and the symbolic impact of Duterte's arrest—the perceived deprivation of his supporters, and the possible empowerment of victims' advocates.",
            "status_quo": "As of November 2025, despite intense political conflict, sporadic violence (including some protester-police clashes) and the arrest of Duterte amid elite infighting, neither martial law nor major, sustained civil unrest (meeting the threshold of 1,000 deaths or 5,000 arrests) has occurred in the Philippines in 2025.",
            "perspective_derived_factors": [
                {
                    "factor": "Elite fractionalization and dynastic rivalry",
                    "effect": "Increases probability. The sharp feud between the Marcos and Duterte factions undermines elite consensus and weakens state capacity for crisis management; rival factional mobilizations can amplify polarization and lower the threshold for widespread unrest or martial law declaration, especially if high-stakes events (e.g., the ICC trial or another elite confrontation) serve as triggers."
                },
                {
                    "factor": "Relative deprivation among Duterte supporters",
                    "effect": "Increases probability. Duterte's arrest and the narrative of 'political persecution'—especially if the process is seen as foreign-imposed (ICC)—could sharpen perceived injustice among his loyal base, mainly in Mindanao, fueling protests or even paramilitary backlash. RD theory suggests that sudden perceptions of lost status/power are strong motivators for risky collective action."
                },
                {
                    "factor": "Precedents for state repression and martial law",
                    "effect": "Increases probability. The Philippines has a history of martial law declarations in response to both insurgency (1972, 2017) and local crises (2009), and the current president comes from a family with a direct legacy of authoritarianism. This makes a hardline response more plausible if unrest grows or if elite power is seriously threatened."
                },
                {
                    "factor": "Civil fatigue, trauma, and habituation to violence",
                    "effect": "Decreases probability. A key RD-theoretical insight: persistent trauma, repression, and habituation to violence can lead to demobilization or apathy rather than open revolt. News reports suggest enduring fear, depoliticization, and societal trauma following decades of conflict and Duterte-era violence, especially in urban centers. This collective 'weariness' may suppress willingness to risk mass action."
                },
                {
                    "factor": "Fragmented opposition and lack of broad cross-class/unified protest movement",
                    "effect": "Decreases probability. Despite anger towards both Marcos and Duterte, most protest actions are fragmented (by region, class, or generational cohort), with limited evidence of an effective nationwide anti-system coalition able to sustain mass unrest beyond episodic mobilizations."
                },
                {
                    "factor": "Persistent but localized/contained conflict dynamics (Mindanao)",
                    "effect": "Slightly increases probability. If violent escalation happens, Mindanao—which already shows signs of political-military mobilization and is the locus of Duterte’s support—is the likely flashpoint. However, past martial law (2017) was regionally contained, and central government seems cautious about nationalizing the crisis."
                },
                {
                    "factor": "Base rates for martial law and major unrest in the Philippines",
                    "effect": "Decreases probability. Only four instances of national or regional martial law in 80 years, often linked to much broader insurgencies or state crises. Major (1,000+ deaths, 5,000+ arrests) civil unrest is historically even rarer in a single year outside full-scale insurgency flare-ups."
                }
            ],
            "no_scenario": "Ongoing elite tensions and sporadic, possibly severe, but geographically or temporally limited unrest (e.g., protest riots, small-scale violence in Mindanao or Manila) occur. However, the Marcos government manages to prevent escalation into sustained, mass casualties/arrests, either through targeted repression, deals with local elites, or public fatigue/apathy prevails. Martial law is not declared, or only emergency measures below the legal threshold are used.",
            "yes_scenario": "The imprisonment/trial or potential ill health (or death) of Duterte, or a direct crackdown on the Duterte family, sparks large-scale protests in Mindanao or Davao, with local paramilitaries and loyalists escalating to deadly confrontations with police/military. Some elements of the Duterte clan openly call for secession or organize resistance, leading to severe government countermeasures. Sustained violence or clampdown results in over 1,000 deaths OR a regional martial law declaration (as in 2017) OR mass preventive arrests (5,000+) within 2025.",
            "final_reasoning": "The risk environment is clearly heightened versus a 'normal' year: elite cleavages, regional power bases, and unresolved justice/victimhood issues are all acute, per RD theory’s predictions for societies with rapidly shifting status and intense symbolic grievances. However, several constraining factors are at play: the fatigue and trauma of Duterte-era violence, deep societal apathy, lack of coordinated organization for mass action, the history of past martial law being regionally circumscribed, and the continued resilience of formal political institutions (e.g., competitive elections). The newly re-cemented dominance of the Marcos camp nationally, despite local Duterte strength, suggests the state retains enough coercive and distributive capacity to manage regional unrest without triggering full martial law. The most plausible path to a 'Yes' outcome is a violent confrontation or attempted secession in Mindanao—already hinted at—but this would require rapid escalation in the next two months, with casualty/arrest numbers or a legal martial law step not yet visible in open sources. Base rates suggest this is a sub-20% event for any given year, but the current spike in polarization and grievances, especially if catalyzed by a major symbolic event (e.g., Duterte death, high-visibility crackdown), push the risk higher. I judge the odds of meeting the threshold (martial law declaration/1,000 deaths/5,000 arrests) at about 30%.",
            "final_probability": 30
        },
        "Southeast Asian Studies (Philippine Political Culture)": {
            "time_to_resolution": "Approximately 2 months until January 1, 2026.",
            "perspective_relevance": "As a Southeast Asian Studies and Philippine Political Culture expert, I provide contextual understanding of elite family rivalry, localism, the state's coercive traditions, and mass attitudes towards protest and law-and-order politics. Familiarity with historical and contemporary patterns of unrest, regime response, and martial law declarations in the Philippines is crucial for accurately assessing current escalation risks.",
            "status_quo": "Despite rising tensions—elite feuding, Duterte’s ICC detention, youth protests—the Philippines manages unrest within a framework of elite bargains, geographically contained violence (mainly in Mindanao), and sporadic but controlled protest activity. Martial law has been invoked only four times in history and generally in response to mass casualties or overwhelming threat to regime stability. The state regularly deploys the police and military for crowd control without exceeding the scale implied by the question’s resolution criteria.",
            "perspective_derived_factors": [
                {
                    "factor": "Elite Political Conflict and Family Feuding",
                    "effect": "Increases the probability. The collapse of the Marcos-Duterte alliance, ICC arrest of Duterte, threats by Sara Duterte, and Mindanao unrest point to potential for escalation, especially if elite interests can no longer be negotiated through backchannels or subnational autonomy."
                },
                {
                    "factor": "Historical Martial Law Precedent",
                    "effect": "Decreases the probability. Despite chronic unrest, actual martial law remains rare, generally invoked only in extreme situations, and often regionally limited (e.g., Mindanao, 2017), not triggered by elite fallout or urban protest alone."
                },
                {
                    "factor": "Localized/Fragmented Unrest",
                    "effect": "Decreases the probability. Violence and protest in the Philippines tend to be spatially limited (Mindanao separatism, urban youth protests) with quick containment by security forces. Mass arrests and deaths rarely reach resolution thresholds nationally."
                },
                {
                    "factor": "Public Apathy and Trauma",
                    "effect": "Decreases the probability. Extended authoritarian experience and normalization of state violence (drug war; lack of mass outrage) yield a depoliticized and risk-averse majority, reducing the likelihood that unrest reaches the scale for resolution."
                },
                {
                    "factor": "Duterte’s Ongoing Influence in Mindanao and Davao",
                    "effect": "Increases the probability. A fragmented political settlement in Mindanao, combined with Duterte loyalism, raises the risk of regional violence that could prompt martial law or mass state crackdowns locally."
                },
                {
                    "factor": "Regime Survival Calculus (Marcos Government Repression)",
                    "effect": "Neutral to slightly increasing. Marcos may opt for heavy-handed measures if protests threaten regime legitimacy or crucial economic stability, but recent responses (community service for arrested youth, discipline but not wide repression) indicate some restraint."
                },
                {
                    "factor": "Base Rate of Civil Unrest/Martial Law in Recent History",
                    "effect": "Strongly decreases the probability. Base rate for nationwide or threshold-exceeding unrest or martial law is low—even significant events (2017 Marawi, 2009 Maguindanao massacre) yield brief, scoped martial law rather than ongoing mass violence or repression."
                },
                {
                    "factor": "Upcoming Timeline and Current Events",
                    "effect": "Decreases probability. The bulk of unrest, protests, and ICC-related fallout has already played out in 2025; unless Duterte dies/collapses dramatically or Mindanao experiences a major breakdown, remaining time to 2026 is likely too short for new escalation."
                }
            ],
            "no_scenario": "Continued elite rhetoric and isolated violence in Mindanao; Marcos and Duterte factions negotiate behind the scenes; urban protests arise but are quickly dispersed with limited arrests and negligible fatalities. No area of the country sees martial law declared, or unrest-related deaths/arrests remain well below thresholds (1,000 deaths/5,000 arrests). Regime uses calibrated repression but avoids major escalatory steps.",
            "yes_scenario": "Major escalation in Mindanao: Duterte loyalists, emboldened by local grievances and elite brinkmanship, mobilize heavily armed supporters in Davao/Mindanao leading to several deadly encounters with police/military. Marcos declares martial law in parts of Mindanao to restore order, or an urban protest in Manila spirals violently beyond control, resulting in mass detentions or fatalities that cross resolution thresholds. Alternatively, Sara Duterte activates informal networks to challenge the regime, provoking a cascade of state repression.",
            "final_reasoning": "The most plausible path to a Yes outcome runs through Mindanao, where Marcos-Duterte tensions, threatened secession, and collapse of longstanding elite bargains could prompt martial law or heavy crackdowns. However, existing evidence points to elite posturing, limited protestor mobilization, and a populace traumatized and desensitized from decades of violent politics. Current unrest, while notable, resulted in hundreds (not thousands) of arrests and no evidence of sustained, lethal confrontation. The base rate for martial law or threshold-level deaths/arrests within a calendar year remains low. The Duterte dynasty retains regional strongholds and could catalyze local instability, but absent either a major, unexpected breakdown (e.g., assassination, mass defection in security forces, or explosive evidence against the Marcos or Duterte camp), escalation to the required levels before January 1, 2026, is unlikely. A mid-range but still elevated risk compared to peacetime, with careful attention to Mindanao as a wild-card.",
            "final_probability": 18
        },
        "Southeast Asian Studies (Patron Clientelism Tradition)": {
            "time_to_resolution": "Just under 2 months (question closes December 31, 2025)",
            "perspective_relevance": "As an expert in Southeast Asian Studies focused on patron-clientelism, I am especially attuned to Philippine elite political dynamics, the transactional nature of alliances, and how the distribution of violence is mediated through family and regional networks. This perspective allows me to interpret the likelihood of major unrest or martial law not just from protest numbers, but from the calculus of Philippine political clans, loyalty shifts in armed actors, and the historical patterns of conflict escalation and elite accommodation.",
            "status_quo": "The status quo is cyclical elite conflict, periodic but contained protest, and localized violence with no national martial law and civil unrest never (in recent decades) rising to the threshold of 1,000 deaths/arrest of 5,000 cumulative protesters, except during the Marcos era (1972–1981) and Mindanao conflicts. Even during Duterte’s bloody drug war, state violence rarely triggered generalized unrest that led to mass casualties/arrests.",
            "perspective_derived_factors": [
                {
                    "factor": "Elite political rivalry and patron-clientelism",
                    "effect": "Increases instability, but also incentivizes negotiated settlements or transactional adjustments to avoid mutual destruction, so it actually decreases the chance of major uncontrolled, escalatory unrest unless both sides miscalculate."
                },
                {
                    "factor": "Duterte arrest and Marcos-Duterte feud",
                    "effect": "Raises unrest risk—especially in Mindanao, given the rupture of elite bargains, Duterte family calls for autonomy, and threats of mobilization. However, the Duterte network is regionally concentrated and its ability to foment nationwide unrest is limited by fragmented alliances and central government military dominance. The risk is thus more regional than national but non-trivial."
                },
                {
                    "factor": "Popular sentiment and protest dynamics",
                    "effect": "There is elevated protest activity (100,000+ recently), but both youth-driven and largely urban. Philippine protest rarely sustains mass violence without elite sponsorship; recent protests resulted in low casualty and arrest counts. Unless either camp actively arms, mobilizes, or funds escalation, protest remains at symbolic, not systemic, risk levels."
                },
                {
                    "factor": "Historical precedent and military posture",
                    "effect": "Despite four martial law declarations in 80 years, two were during full-scale wars and two were regional (including 2017–2019 in Mindanao). Marcos’s government may deploy martial law locally, but base rates (1 national declaration since 1972, one Mindanao declaration in 2017) suggest rarity. Military remains pliant to the sitting president, and at present there are no mass defections or mutinies reported."
                },
                {
                    "factor": "Regional fragmentation and ethnic politics",
                    "effect": "Mindanao, the main Duterte base, is historically restive. A localized flare-up (e.g., pro-Duterte militias or criminalized patronage networks) could lead to martial law in that region if violence spikes. Nationwide spread is less likely, as ethnic and political fragmentation hinders the creation of a single anti-government coalition."
                },
                {
                    "factor": "Media & elite fear/trauma",
                    "effect": "Generalized post-authoritarian trauma and media self-censorship reinforce elite incentives to avoid events that risk mass casualties or full national military intervention. This moderates both government and opposition behavior."
                }
            ],
            "no_scenario": "Despite ongoing Marcos-Duterte feuding, Duterte remains in ICC detention through year-end. Localized violence in Mindanao and recurring urban protests do not escalate to a threshold that would trigger martial law declarations. Arrests and deaths from protest activity remain below the question's thresholds (1,000 deaths or 5,000 arrests); the government maintains order with calibrated force and transactional compromises, mindful of domestic and international legitimacy.",
            "yes_scenario": "The Duterte family, feeling existentially threatened by continued detention and political marginalization, leverages its local networks in Mindanao (including loyal police, militias, and sympathetic politicians) to stage violent disruptions, resulting in at least hundreds of deaths/arrests and prompting the Marcos government to declare local martial law (following the 2009 or 2017 playbook). The unrest stays regional but severe enough to cross the formal resolution threshold if violence spirals.",
            "final_reasoning": "Base rates for nationwide martial law or major unrest in the Philippines are low since 1986, even during severe crises. However, the risk is elevated given (1) the unprecedented arrest of a former president, (2) a major elite feud now openly threatening regional breakaway and armed mobilization, (3) Mindanao's historic propensity for martial law in periods of intense elite conflict, and (4) some precedent for local martial law declarations as face-saving or security moves. That said, the Marcos administration has so far shown restraint, and regional protests—though large—have not crossed critical thresholds. No evidence in the reporting points to an imminent large-scale, organized violent uprising or preparations for martial law. Most recent protests remained orderly, and even disruptive elite rhetoric has not translated into large-scale action. The Duterte clan remains influential in Davao but has not shown the organizational capacity to trigger 1,000 protester deaths or 5,000 arrests in a short time frame, or to provoke a new nationwide declaration. The highest risk is for a regional martial law declaration in Mindanao, but even here the families’ transactional instincts and the calculating nature of the Philippine military and police make such a step likely only if significant violence erupts—which has not yet occurred. I estimate the odds of martial law or unrest rising to the resolution threshold at 12%. This is higher than peacetime baseline, reflecting real but contained regional risk.",
            "final_probability": 12
        }
    },
    "deliberation_probability": [
        27,
        21,
        16,
        7,
        28,
        32,
        38,
        30,
        18,
        12
    ],
    "deliberation_mean_probability": 22.9,
    "deliberation_sd": 9.723396754449777,
    "deliberation_probability_result": 23,
    "group_results": {
        "SecurityStudiesCivilmilitaryRelationsAnalysis": {
            "forecaster_to_engage": "SociologySocialMovementsTheory",
            "response_type": "critique",
            "response": "You’re over-reading the protest risk and underweighting the realities of coercive stability in the Philippine context. A 38% probability would assume not just Mindanao martial law (a plausible narrow tail risk) but either a massive, fast-spreading uprising or widespread breakdown of regime control nationwide—neither of which is suggested by actual mobilization or the sociopolitical apathy and trauma saturating Manila and the rest of the archipelago. The youth protest surge is real, but the ceiling so far has been symbolic, not revolutionary; the state’s toolkit remains vastly superior, and the Marcos administration has avoided any sign of bloodletting on a scale that would trigger a Yes. Even in Mindanao, for a martial law move, we’d need imminent armed clash or secessionist surge—at present, the rhetoric from Duterte allies is bluster, not mobilization. Your scenario-building underestimates the inertia and organizational challenges, and overstates how quickly Filipino civil society might shed its hard-earned caution. Historical base rates and specific current security dynamics—loyalty of the AFP, absence of mass violence—just don’t support 38%. Your number is panic, not probability."
        },
        "SecurityStudiesCoupRiskAssessment": {
            "forecaster_to_engage": "PoliticalScienceRegimeStabilityParadigm",
            "response_type": "defense",
            "response": "Regime Stability Paradigm gets it right: 32% is a rational expression of tail risk in an abnormal elite fracture. Unlike the more mechanistic approaches that lean on base rates to the point of myopia, this forecast recognizes the Philippine tradition of ad hoc state violence and the fragility exposed by Marcos-Duterte brinksmanship. True, formal unrest numbers and martial law moves are rare, but recent months have seen normalized brinkmanship—Sara Duterte threatening assassination, Mindanao saber-rattling, and credible local evacuations. This isn't your ordinary post-EDSA deadlock; it's the regime's internal security redline redrawing in the open. Stability is not a law of nature, and historical constraints can collapse quickly when the state's legitimacy is at risk on multiple fronts. If violence or secession seriously erupts in Mindanao, Marcos’s options are limited and the modal play is hard security, not endless patience. I stand by elevating the probability above 20%, and your 32% is a defensible hedge considering the real volatility."
        },
        "RiskAnalysisPoliticalRiskAssessment": {
            "forecaster_to_engage": "RiskAnalysisScenarioPlanning",
            "response_type": "critique",
            "response": "Your 7% estimate is too conservative given the uniquely combustible dynamics of the present. Yes, base rates suggest a low probability for martial law or unrest at threshold magnitude nationally. But scenario planning should more vigorously weight unprecedented developments: Duterte's ICC arrest (no modern parallel), open mutterings of Mindanao secession, and credible, if still somewhat contained, elite splintering. The Philippine political system is defined by abrupt discontinuities—regional martial law in 2017, coup attempts in the 2000s, and sudden surges in violence. You're underestimating the potency of symbolic triggers (a Duterte death, a mishandled protest crackdown) to catalyze regime overreaction. Moreover, elite posturing is backed by real patronage militias and latent networks, even if they're latent now. With 8 weeks to go, the tail risk—small but fat—is more than a rounding error. 7% is closer to peacetime than to the genuine stress fracture this year presents. I stand by a much more elevated forecast."
        },
        "RiskAnalysisScenarioPlanning": {
            "forecaster_to_engage": "SoutheastAsianStudiesPhilippinePoliticalCulture",
            "response_type": "defense",
            "response": "The Philippine Political Culture perspective is refreshingly grounded—finally, someone that understands that posturing from powerful families is not the same as imminent, organized revolt. Your 18% call reflects an appropriate recognition of Mindanao risk (where family, clan, and patron-client dynamics have historically routed volatility), but you smartly discount both Manila’s performative protests and the likelihood of real mass coordination amid trauma and political apathy. Waving around generational trauma, elite chest-thumping, and the ever-handy bogeyman of street mobilization (which the regime can easily contain) has become fashionable, but you keep the focus on the heavyweight forces: state repression capacity, organizational hurdles for dissent, and the real but rare use of martial law for local violence containment only. More forecasters should stress these deep roots and not be distracted by transient noise or excited headlines. 18% is a calm, appropriately elevated but not hysterical number."
        },
        "PoliticalScienceContentiousPoliticsTheory": {
            "forecaster_to_engage": "SociologyRelativeDeprivationTheory",
            "response_type": "critique",
            "response": "You're giving relative deprivation far too much explanatory power in this context and failing to grapple with the bottlenecks of collective action and Philippine-style elite containment. Yes, grievance and symbolic trauma are spiking—but underneath, organization is weak, fear is pervasive, and security elites are not splitting. You frame Mindanao as one crisis away from explosion, but you never show how deeply embedded patron-client ties, the Marcos regime's tactical statecraft, and the population's adaptive depoliticization work as a brake. 30% almost implies a coin flip on a huge outburst, but look at actual mobilization: hundreds, not thousands, arrested, next to no protest deaths, Marcos still commanding police/military, Duterte's camp strong but geographically siloed. This isn't the powder keg you say it is—it's more like a damp pile of grievances, with just enough regime capacity to keep sparks from igniting. Bump your number down unless we're suddenly in a very different Philippines."
        },
        "PoliticalScienceRegimeStabilityParadigm": {
            "forecaster_to_engage": "SecurityStudiesCoupRiskAssessment",
            "response_type": "defense",
            "response": "SecurityStudiesCoupRiskAssessment is correct to highlight the sharp increase in tail risk, especially regarding Mindanao and the 'symbolic' threat of regional martial law. Too many are lulled by national base rates, but the recent collapse of elite compacts and the erosion of Duterte influence channels the risk into highly unstable localities, not Manila per se. This forecast recognizes that if there's a rupture, it will be local, sudden, and anchored in coercive politics—not a slow-moving national street movement. The Marcos regime’s hold on the AFP is real but potentially brittle if violence escalates past a certain point, forcing a hardline hand. Most importantly, this view strengthens the recognition that base rate stability doesn’t mean stability during an abnormal year marked by elite vendetta, and it keeps the risk elevated well above peacetime. The forecast’s moderate probability (21%) is carefully justified and neither alarmist nor naive—just the kind of empirically-grounded, nuanced thinking this question deserves."
        },
        "SociologySocialMovementsTheory": {
            "forecaster_to_engage": "SecurityStudiesCivilmilitaryRelationsAnalysis",
            "response_type": "critique",
            "response": "You sound like you’ve spent too much time inside the AFP’s command briefing room and not enough on the streets or in Mindanao’s town halls—where real social movement energy incubates. Your 27% is timid, and your dismissal of escalation potential ignores the volatile, performative nature of elite politics in the Philippines, where factional splits often produce more than mere 'bluster.' The Duterte camp’s Mindanao threat matrix is not just hot air; it’s rooted in a unique patronage machine, historically capable of leveraging state-supplied arms and local militias for rapid mobilization. Civil-military professionalism is historically brittle when families feud and local commanders are forced to choose between clan and chain of command. You also underrate the potency of rapid escalation out of protests that tip past repression’s acceptable threshold—history runs dense with such moments in the Philippines, from EDSA to Maguindanao. The relative apathy and trauma in Manila can evaporate if a tipping point—say, a major crackdown or Duterte loyalist bloodshed in Davao—triggers networked outrage. Your reductionism to martial law as a function of professional military discipline and central containment won’t catch the sudden breakouts possible in the last stretch of 2025, with volatile patronage networks and grievance-fueled youth activism. 27% is too safe; it treats rolling unrest with surgical-glove detachment when history shows: the gloves come off fast."
        },
        "SociologyRelativeDeprivationTheory": {
            "forecaster_to_engage": "PoliticalScienceContentiousPoliticsTheory",
            "response_type": "critique",
            "response": "Your focus on episodes and elite script is too event-driven and ironically misses the structural burn of relative deprivation that’s been simmering for years. You talk a good game about regime targeted repression and localized clan competition suppressing escalation, but you underplay just how quickly the psychological distance between 'simmering trauma' and collective violent action can collapse if there’s a catalyst—especially in places like Mindanao where deprivation has not just symbolic but daily, lived effects. The Duterte–Marcos blowup isn’t garden variety elite infighting—it’s a symbolic struggle that maps directly onto feelings of lost status and historical wounds. Is there organizational weakness? For sure. But your comfort with the regime’s 'track record' blinds you to the potential for regional protest spillover: we’ve seen more isolated grievances merge overnight when trigger events strike, even in a society with a legacy of repression. The Philippines isn’t so path-dependent that history can’t break—EDSA wasn’t supposed to happen, yet it did. A 28% call undersells the risk that deprivation-fueled perceptions blow up into genuine unrest IF a symbolic event catches fire. Don’t ignore grievance depth just because the surface is calm."
        },
        "SoutheastAsianStudiesPhilippinePoliticalCulture": {
            "forecaster_to_engage": "RiskAnalysisPoliticalRiskAssessment",
            "response_type": "defense",
            "response": "This is a risk assessment written by someone with a clear-eyed appreciation for the inertia, containment tactics, and subtlety of Philippine political culture. The 16% estimate feels right: it's not a number born out of fatalism or naivete about elite fracture, but rather an honest nod to both the country's sporadic, geographically-limited unrest (Mindanao being the only wildcard worth losing sleep over this year) and the regime's demonstrated ability to walk the authoritarian line without crossing into the mass repression or martial law thresholds that would resolve this question Yes. You rightly point out that Filipino protest energy, even at its recent peak, has been managed with symbolic concessions or the tactical light touch—community service instead of mass jailing, for example—signaling elite confidence and continued state capacity for calibration and co-optation. You're also right to note that despite Mindanao's volatility, Duterte's clan has leverage, not true independence, and neither state nor opposition forces are currently showing signs of cascading defections or existential panic. Black swans exist (as always), but the forecast is properly weighted for the currently observable, not the theoretically possible."
        },
        "SoutheastAsianStudiesPatronClientelismTradition": {
            "forecaster_to_engage": "SociologyRelativeDeprivationTheory",
            "response_type": "critique",
            "response": "Relative Deprivation Theory, in this context, is a blunt instrument wielded on a terrain that’s all nuance and elite brokerage. You lean too hard on wounds and grievances igniting mass action, but in the Philippines, aggrieved patrons channel that energy into deals or contained violence—not system-breaking revolt. Mindanao’s deprivation is deep, but without a national elite split or tacit support from other clans, you just get isolated skirmishes—historically suppressed or bought off. The Duterte–Marcos fissure is noisy, but you ignore how patron-client dynamics incentivize negotiation and risk aversion on both sides. Yes, the population is traumatized and yes, a catalyzing event could happen, but there’s little sign either elite camp is pushing the red button—the Duterte apparatus talks big, but it hasn’t demonstrated control of enough organized, mobilized muscle this round. Your 30% is reactive, not analytical, and hangs too much on a black swan: absent a major state blunder, history says: elite adaptation, not systemic rupture."
        }
    },
    "revision_results": {
        "Security Studies (CivilMilitary Relations Analysis)": {
            "my_phase1_final_probability": 27,
            "reasoning_for_revised_probability": "Having reviewed the group’s arguments—including higher forecasts (notably the Social Movements Theory's 38%, which I critiqued) and lower ones (several under 20%, some under 10%)—I see little new concrete evidence to move the needle. The main risk remains a rapid, localized escalation in Mindanao leading to a regional martial law declaration. No new arguments convincingly demonstrate either a collapse in elite-military loyalty or a mass protest dynamic that could push cumulative deaths or arrests over the thresholds. The consensus coalesces around moderate elevation over base rates but not near-even odds. Some forecasts underweight Mindanao’s tail risk, but the highest also overstate systemic volatility. My original stance, that we are in an elevated, but contained, risk period remains valid, but considering the near resolution window and visible state resilience, I will edge the probability down slightly, from 27% to 23%, to align more closely with the most compelling cases for containment and absent signs of imminent catalyzing events.",
            "revised_probability": 23
        },
        "Security Studies (Coup Risk Assessment)": {
            "my_phase1_final_probability": 21,
            "reasoning_for_revised_probability": "Having reviewed the group deliberation, I note that the consensus among both security studies and regional politics specialists is that base rates for martial law/unrest thresholds are low, despite marked elite polarization and Mindanao volatility. Notably, even more protest-centric or contentious politics forecasts ultimately land in the 16–32% range, with most closer to the low-20s than the high-30s. Critique of the highest estimate (38%) highlights the excess weight put on theoretical protest escalation without sufficient empirical evidence of mass, organized mobilization or state overreaction. Conversely, the defense of a 32% forecast underscores that tail risk is not negligible—given the live threat of Mindanao escalation or a sudden violent incident, especially with the Marcos–Duterte standoff. However, with only two months remaining, the state still dominates the escalatory ladder, and recent protest management has shown restraint. There is an uptick in risk due to the unresolved Mindanao question, but not enough new evidence to justify a significant move away from my phase 1 probability. My logic remains that the most realistic Yes path is a regional martial law move in Mindanao, and unless a major incident happens, odds remain solidly in the 15–25% zone, slightly closer to the lower end. I therefore maintain my 21% assessment.",
            "revised_probability": 21
        },
        "Risk Analysis (Political Risk Assessment)": {
            "my_phase1_final_probability": 16,
            "reasoning_for_revised_probability": "The group deliberation highlighted a meaningful split among forecasters, with some credible arguments for higher risk (32–38%, emphasizing volatility from elite polarization and Mindanao risk) but also substantial support for caution and base rate discipline (7–18%). The strongest critique of my original position was that scenario risk—especially with elite brinkmanship and instability—justifies a somewhat higher probability, not because Yes is likely, but because genuine tail risk is elevated versus historical norms. At the same time, the most aggressive forecasts (38%) overstate the likelihood of fast-moving, large-scale escalation, underestimating regime inertia and structural state power. My own phase 1 assessment may have slightly underweighted the likelihood of rapid deterioration in Mindanao given the open threats and recent evacuations, as well as the tendency for Philippine political crises to evolve abruptly. I therefore nudge my forecast upward, but remain significantly below those forecasters prioritizing maximum volatility.",
            "revised_probability": 21
        },
        "Risk Analysis (Scenario Planning)": {
            "my_phase1_final_probability": 7,
            "reasoning_for_revised_probability": "After reviewing the group’s diverse perspectives, I see support for both a slightly higher and much higher risk estimate, especially from regime stability and social movement theorists who stress the unpredictability and path dependence of Philippine unrest. Security and risk analysts mostly cluster between 12–21%, emphasizing real tail risks but an absence of current threshold-approaching violence or arrests. My initial forecast may have slightly underweighted the combination of (1) Mindanao's demonstrated volatility and credible threats of localized martial law, (2) the effect of the Duterte-Marcos rift on discouraging compromise in a flashpoint, and (3) the Philippines’ history of abrupt regime-adopted hardline measures following elite confrontations. However, I remain skeptical of the highest estimates (30%+), as the evidentiary bar for unrest or martial law is still distant, and organizational/institutional inertia is strong. The most plausible path to a Yes remains a Mindanao martial law declaration or sudden violence triggers, neither of which is clearly imminent, but is slightly more plausible as elite patience frays. Thus, I revise upward, but remain at the low end of the elevated cluster.",
            "revised_probability": 12
        },
        "Political Science (Contentious Politics Theory)": {
            "my_phase1_final_probability": 28,
            "reasoning_for_revised_probability": "After reviewing group deliberation and the arguments of other forecasters, I find my initial assessment well-calibrated in light of the evidence and theoretical considerations. Most relevantly: (1) My critique of the SociologyRelativeDeprivationTheory forecast stands—mass grievance does not automatically translate to regime-threatening unrest given persistent bottlenecks like organizational weakness, coordination problems, and fear. (2) The strongest defense in group debate is for probabilities a notch lower than mine, grounded in the real-world inertial power of Philippine elite patronage, effective state coercion, and the lack of a sudden mass mobilizational influx. (3) That said, the elevated but sub-coin-flip range (20–32%) continues to be defensible for regional martial law tail risk. The modal scenario is either no martial law or a rapid, regionally-circumscribed move if Mindanao flashes. But with so little time left in 2025 and a continued lack of open elite/security splits, the higher >30% probabilities now seem a bit stretched (especially for national escalation), while <20% discounts the real volatility and trigger potential. I therefore maintain my original 28% probability; the weight of expert argumentation does not justify an upward or downward change.",
            "revised_probability": 28
        },
        "Political Science (Regime Stability Paradigm)": {
            "my_phase1_final_probability": 32,
            "reasoning_for_revised_probability": "After reviewing peer deliberations, I confirm my initial reasoning that regime stability risks are meaningfully elevated, especially due to elite split and Mindanao, but also recognize support from fellow forecasters highlighting (1) the continued national containment of unrest (no evidence yet of mass coordinated violence or mass arrests), (2) high barriers for both protest escalation and martial law due to international and organizational constraints, and (3) clear historical pattern of local—with not national—state overreaction. Critiques of the highest forecasts rightly note insufficient mobilization and the stability of clientelistic ties, while the lowest forecasts underweight the unique volatility of the current year; the most persuasive views land in the 18–32% band. On balance, given widespread acknowledgment of elevated but not extreme tail risk, and barring a sudden catalyzing event in the next ~2 months, I hold my forecast steady at 32%.",
            "revised_probability": 32
        },
        "Sociology (Social Movements Theory)": {
            "my_phase1_final_probability": 38,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I see a preponderance of arguments clustering between 21% and 32%, emphasizing both the low base rates of nationwide martial law or mass fatal unrest, and the extraordinary but localized volatility centered on Mindanao. But I also believe that many are underrating the unique, combustible, and unpredictable consequences of elite fragmentation and clan-based mobilization, especially given how quickly violence and martial law have erupted in the past in the Philippines when tipping points occur. The critiques against my estimate call out potential overstatement of protest risk and national escalation, citing ongoing apathy and limited evidence of imminent armed confrontation. However, I maintain that, compared to historic base rates and in light of the depth of the Marcos–Duterte rift, current tensions remain unusually high, and the last two months of the year carry significant tail risk, especially for Mindanao-specific martial law. Nonetheless, taking seriously the group consensus and the lack (so far) of a clear, imminent large-scale violent trigger, I am slightly lowering my forecast to reflect a more moderate—though still elevated—risk.",
            "revised_probability": 32
        },
        "Sociology (Relative Deprivation Theory)": {
            "my_phase1_final_probability": 30,
            "reasoning_for_revised_probability": "After reviewing strong arguments from Security Studies (CivilMilitary Relations Analysis), Risk Analysis (Political Risk Assessment), and Political Science (Contentious Politics Theory), I'm struck by the consensus around the restraining influence of trauma, civil fatigue, and the Philippine state's capacity for targeted repression and elite containment, even during peak polarization. The critiques correctly highlight that, despite sharp deprivation and symbolic grievance (my RD focus), organizational weakness and elite patronage politics dampen mass mobilization. While I maintain that Mindanao remains a genuine wildcard and that the probability for a regional martial law declaration is nontrivial, the likelihood of reaching the full-scale 'Yes' resolution threshold nationwide is a bit lower than I initially weighted. Colleagues are persuasive that the Duterte camp is powerful but not yet mobilized for mass confrontation, and that recent large protests did not spiral. Factoring in these arguments, and further aligning with base rates for regional martial law and major unrest, I'm decreasing my forecast by 5 percentage points.",
            "revised_probability": 25
        },
        "Southeast Asian Studies (Philippine Political Culture)": {
            "my_phase1_final_probability": 18,
            "reasoning_for_revised_probability": "After engaging a wide cross-section of expertise in Phase 2, my central judgment that the most plausible Yes scenario flows through Mindanao remains intact. However, the overall pattern of arguments trends slightly more hawkish on risk than my original forecast: the base rate anchor is being challenged by the peculiarities of the current crisis—unprecedented elite feuding, Duterte’s ICC detention, and plausible regional instability that could force the regime’s hand. I defend the value of the base rate and inertia but acknowledge the cogency of arguments suggesting regional martial law is more likely than normal due to the live elite split, continued Duterte regional leverage, and Mindanao saber-rattling. Nevertheless, the strongest cluster of reasoned analysis (those closest to Philippine local political realities and the mechanics of regime reaction) lands in the mid-high teens and low 20s, with only the most protest-optimistic models above 30%. Importantly, the scenario-planning and risk/elite assessments largely converge that, without a black swan, the deaths/arrest thresholds remain remote. Martial law in Mindanao remains the only real spike, yet has not occurred despite tension. To synthesize, I slightly increase my forecast to 20%, reflecting a real elevation in tail risk, greater than baseline, but still with the most likely outcome a No.",
            "revised_probability": 20
        },
        "Southeast Asian Studies (Patron Clientelism Tradition)": {
            "my_phase1_final_probability": 12,
            "reasoning_for_revised_probability": "Group deliberation surfaced consensus that the highest risk remains limited to Mindanao, where patron-clientelism and elite fracture could plausibly trigger a regional martial law declaration. Several forecasts with deep civil-military or political risk expertise (21-32%) argue that the Duterte-Marcos split, while not yet producing the violence or defections required for major escalation, produces enough volatility for a higher tail risk than my initial 12%. However, arguments in favor of a >25% probability tend to over-index both the impact of symbolic deprivation and the potential for protest to cascade into regime-shaking violence, rather than elite-managed containment or tactical martial law—a move historically deployed by presidents mostly in Mindanao or during truly nation-threatening crises. Forecasts emphasizing the resilience of patronage politics, military discipline, and inertia—such as those in the 16-21% range—are persuasive, especially given the transactional incentives of elite actors to avoid mutually destructive escalation. I am convinced the risk is slightly underweighted in my initial 12%, but only marginally. The military and police remain loyal, mass defections are not visible, unrest is energetic but confined, and public protest lethality/arrest trends are beneath critical thresholds. Factoring in tail risk and group momentum, I am revising my probability slightly upward to 15%.",
            "revised_probability": 15
        }
    },
    "revision_probability": [
        23,
        21,
        21,
        12,
        28,
        32,
        32,
        25,
        20,
        15
    ],
    "revision_mean_probability": 22.9,
    "revision_sd": 6.6072350915913045,
    "revision_probability_result": 23,
    "question_details": {
        "id": 38992,
        "title": "Will there be major civil unrest or martial law in the Philippines in 2025?",
        "created_at": "2025-08-31T06:17:58.839521Z",
        "open_time": "2025-11-03T09:19:30Z",
        "cp_reveal_time": "2025-11-03T10:49:30Z",
        "spot_scoring_time": "2025-11-03T10:49:30Z",
        "scheduled_resolve_time": "2026-01-01T06:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-11-03T10:49:30Z",
        "actual_close_time": "2025-11-03T10:49:30Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "This question is synced with an identical question on Metaculus. The original question opened on 2025-03-21 12:40:00 and can be found [here](https://www.metaculus.com/questions/36013). This question will resolve to the same value as the synced question. The original question's background info at this time is below. \n\nOn March 11, 2025, [former president of the Philippines Rodrigo Duterte was arrested in Manila](https://apnews.com/article/rodrigo-duterte-manila-philippines-icc-9b9d08b8832b43282db53418535fb245) and flown to the Netherlands for trial at the [International Criminal Court](https://www.britannica.com/topic/International-Criminal-Court). Current president Bongbong Marcos has said the arrest is not political repression against his predecessor, who is the father of current vice president Sara Duterte. Marcos is the son of [Ferdinand Marcos](https://www.britannica.com/biography/Ferdinand-E-Marcos), Philippines head of state from 1965 to 1986, who ruled as an authoritarian, including a 9-year period of martial law.\n\nThe Philippines has experienced [decades of civil conflict of varying intensity, including by separatists, communists, and state actors](https://gsdrc.org/publications/conflict-analysis-of-the-philippines/). Conflict deaths since 1989 are over 20,000, averaging 585 per year ([source](https://ourworldindata.org/grapher/deaths-in-armed-conflicts-by-country?tab=chart\\&country=~PHL)):\n\n![](https://metaculus-web-media.s3.amazonaws.com/user_uploaded/%C3%A5%C2%BE%C3%A7_2ucIR17.png)\n\nGeographically, these conflicts are concentrated in [Mindanao](https://www.britannica.com/place/Mindanao), a southern island that is the Philippines' second largest. Truces among and within these groups are [often mediated by the military or police](https://apnews.com/article/southern-philippines-land-dispute-moro-islamic-liberation-front-a9d2d4e185409279a21f19c2deaae368). Prior to his presidency, Rodrigo Duterte had served as a popular mayor of Davao City, Mindanao's largest city. Duterte's relative popularity in the Davao area stems partly from his reputation as a law-and-order figure and effective truce broker among local fighting groups.\n\n[Martial law has been declared four times in the history of the Philippines](https://www.esquiremag.ph/long-reads/features/martial-law-in-the-philippines-a00289-20200922-lfrm?s=ths48uim0s26782srnenrq1vj2): in 1944, 1972, 2009, and 2017.\n\n`{\"format\":\"metac_closes_in_period\",\"info\":{\"post_id\":36013,\"question_id\":35443}}`",
        "resolution_criteria": "This question resolves **Yes** if [credible sources](https://www.metaculus.com/faq/#definitions) report that any of the following has occurred in the Philippines after the launch of this question and before January 1, 2026:\n\n* Declaration of martial law anywhere in the Philippines\n* The deaths of at least 1,000 people due to the actions of rioters or other civilians, or police, military, national guard, or other law enforcement or government agents, cumulative throughout 2025\n* The arrest of at least 5,000 people by police, military, national guard, or other law enforcement or government agents, cumulative throughout 2025\n\nResolves **No** otherwise.",
        "fine_print": "For deaths or arrests to count toward the overall toll, they must occur within the context of an event of rioting or civil unrest. Deaths from generic shootings or homicides, or those that occur due to medical emergencies not related to rioting or unrest, do not count (for example, someone dying of a heart attack while in a crowd of rioters). Suicides do not count.\n\nMartial law must be declared by the national government, but it need not be national in scope. The [2017 declaration](https://en.wikipedia.org/wiki/Proclamation_No._216) applied only to Mindanao; a similar declaration during 2025 would result in **Yes** resolution.",
        "post_id": 39615,
        "aggregations": {
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Affirm ruling on Duterte appeals, ICC prosecutors ask**\nThe Office of the Prosecutor (OTP) of the International Criminal Court (ICC) has asked the Appeals Chamber to affirm the Pre-Trial Chamber I's (PTC I) decision denying former Philippine President Rodrigo Duterte's appeal for interim release. On September 26, the three-woman PTC I unanimously rejected Duterte's request to be released to an undisclosed country under certain conditions, citing 'reasonable grounds to believe' that his continued detention is necessary to ensure his participation in proceedings and to prevent intimidation of potential witnesses and victims. The OTP argued that the defense's claims were 'unconvincing' and emphasized that Duterte still holds significant power and influence in the Philippines, particularly in his hometown of Davao City, where he won re-election as mayor in May 2025. The prosecution stressed that the ICC applies a 'low evidentiary threshold' for detention decisions and dismissed the defense's proposed conditions as insufficiently evaluated by the chamber. Regarding Duterte's cognitive health, the OTP stated that the medical reports submitted by the defense were untested, lacked clarity on legal standards, and were therefore insufficient to determine his fitness. The Office of Public Counsel for Victims also urged the Appeals Chamber to reject the appeal, asserting that all three grounds of the defense's argument lacked merit. Duterte faces three counts of murder related to 49 incidents of drug war killings between 2013 and 2018 during his tenure as mayor of Davao and as President.\nOriginal language: en\nPublish date: November 01, 2025 09:40 PM\nSource:[Inquirer](https://globalnation.inquirer.net/297362/affirm-ruling-on-duterte-appeals-icc-prosecutors-ask)\n\n**Survivors still reckon with Duterte's drug war**\nJoel Ejorcadas and Marlon Pepito Jr., survivors of former Philippine President Rodrigo Duterte's drug war, continue to grieve and advocate for justice, commemorating 111 victims at the 'Dambana ng Paghilom' shrine in Caloocan's La Loma Catholic Cemetery. Both men, who live in the Navotas slums, made candles themselves as part of a program led by Redemptorist brother Ciriaco Santiago III, which employs relatives of drug war victims as candlemakers and baristas. Ejorcadas' brother Jomel was shot in the head in August 2016 after being accused of drug dealing, while Pepito's father and uncle were killed in January 2017 during a police raid targeting someone named 'Marlon.' Neither man wants to be photographed due to fear of police retaliation. In the years following their loved ones' deaths, they remained silent, afraid of whom to trust. Their trauma persisted: Pepito’s brother developed severe anxiety around police and guns, requiring temporary shelter under Santiago’s care. Now, eight years later, they are more outspoken, citing the International Criminal Court’s (ICC) March 2025 arrest of Duterte on charges of crimes against humanity as a turning point. Ejorcadas said, 'A thorn was removed from my heart because, somehow, our fight is starting to bear fruit.' Both men are demanding that Duterte remain in detention. The ICC’s Office of the Prosecutor and the Office of the Public Counsel for Victims have urged the Appeals Chamber to reject Duterte’s appeal for interim release, arguing that the Pre-Trial Chamber’s denial was legally sound and that the defense failed to prove humanitarian grounds for release, including claims about Duterte’s medical condition. Deputy prosecutor Mame Mandiaye Niang stated the defense's arguments were based on disagreement, mischaracterization, and misunderstanding of the law.\nOriginal language: en\nPublish date: November 01, 2025 02:32 PM\nSource:[Philstar.com](https://www.philstar.com/headlines/2025/11/02/2484266/survivors-still-reckon-dutertesdrug-war)\n\n**'At What Point Does This Cross a Line Into International Criminality?'**\nThe Trump administration has conducted at least 10 military operations in international waters near Central and South America since September 2, killing 61 people, according to reports. These actions, justified by the administration as part of a war against drug cartels under the laws of armed conflict, have drawn strong condemnation from international legal experts. Volker Türk, the U.N. High Commissioner for Human Rights, declared the killings illegal under international law. Colombian President Gustavo Petro accused the U.S. of 'murder' in connection with the death of a fisherman. Legal scholar Philippe Sands, in an interview with POLITICO Magazine, argued that the killings may cross into international criminality, citing the precedent of the Augusto Pinochet case, where a former head of state was indicted in a foreign country for crimes against humanity. Sands highlighted a growing tension between the U.S. Supreme Court’s 2024 decision granting former presidents broad immunity for official conduct and the principles of international law established after Nuremberg. He warned that such immunity could create a 'green light' for actions like torture, disappearance, or murder if framed as national security. While the U.S. is not a party to the International Criminal Court (ICC), the ICC has jurisdiction if crimes occur on a state party’s vessel or aircraft. The ICC has already issued an arrest warrant for former Philippine President Rodrigo Duterte over extrajudicial killings linked to anti-drug campaigns. Sands noted that foreign governments, including Colombia, Venezuela, and Brazil, may consider domestic investigations or inter-state cases at the International Court of Justice, though they risk political and economic retaliation. He emphasized that while prosecutions are politically complex, the existence of international legal mechanisms—such as universal jurisdiction—means that high-level officials may still face accountability. The broader context includes a U.S. double standard: supporting international law when applied to others (e.g., Sudan) but resisting it when applied to itself. Sands concluded that the situation remains a 'watch this space' scenario, with significant legal and political uncertainty ahead.\nOriginal language: en\nPublish date: November 01, 2025 01:55 PM\nSource:[Yahoo](https://www.yahoo.com/news/articles/watch-space-legal-fallout-trump-135500119.html)\n\n**'Watch This Space': The Legal Fallout From Trump's Deadly Boat Strikes**\nPhilippe Sands, an international law expert, discusses the legal and ethical implications of the Trump administration's reported use of military force in international waters near Central and South America, which resulted in at least 61 deaths between September 2 and October 27, 2024. According to Sands, these actions may violate international law, particularly the UN Charter’s prohibition on the use of force (Article 2, paragraph 4), unless an armed attack occurs—an exception under Article 51. He argues that targeting drug traffickers and couriers does not constitute an armed attack, and thus the use of military force under the laws of armed conflict is unjustified. Instead, such acts should be addressed through criminal law. Sands draws parallels to the 1998 arrest of former Chilean dictator Augusto Pinochet in the UK, where the House of Lords ruled that heads of state are not immune from prosecution for international crimes like torture. This precedent, he notes, established a landmark shift toward accountability. However, the 2024 U.S. Supreme Court ruling in Trump v. United States granted former presidents absolute immunity for official conduct related to core constitutional powers, creating a potential conflict with international legal norms. Sands warns this could create a 'green light' for actions that may cross into crimes against humanity, including murder, torture, or genocide. He highlights the International Criminal Court’s (ICC) indictment of former Philippine President Rodrigo Duterte for crimes against humanity related to anti-drug killings, suggesting a precedent for holding leaders accountable. Although the U.S. is not a party to the ICC statute, the court may still have jurisdiction if crimes occur on vessels or aircraft of state parties. Sands cautions that foreign governments—such as Colombia, Venezuela, or Brazil—might initiate domestic investigations or inter-state cases, though political and economic retaliation is a real risk. He emphasizes that the U.S. remains a powerful actor in international law, and while the ICC has historically avoided investigating powerful nations, recent actions—like the ICC’s indictment of Russian President Putin and Israeli leaders—show a shift. Sands concludes that the situation remains fluid: 'It's a sort of 'watch this space' type of scenario,' as the international legal order persists despite political resistance. He notes that even symbolic indictments can have real effects, such as deterring travel or influencing diplomatic behavior, citing anecdotal evidence including former U.S. President George W. Bush avoiding certain countries due to potential prosecution risks.\nOriginal language: en\nPublish date: November 01, 2025 01:55 PM\nSource:[POLITICO](https://www.politico.com/news/magazine/2025/11/01/trump-boat-strikes-international-law-interview-00632077)\n\n**ICC prosecutors urge Appeals Chamber to keep ex Philippine president Duterte detained**\nThe Office of the Prosecutor (OTP) at the International Criminal Court (ICC) has urged the Appeals Chamber to dismiss former Philippine President Rodrigo Duterte's appeal for temporary release, arguing that his defense failed to demonstrate any legal or factual errors in the Pre-Trial Chamber I's September 26 ruling denying his request for interim release under the Rome Statute. The OTP maintained that the chamber correctly determined that Duterte's detention remains necessary to ensure three key objectives: preventing flight, avoiding obstruction of justice, and safeguarding the integrity of the proceedings. The prosecution emphasized that Duterte's appeal was based on disagreement with the ruling rather than a valid judicial error, and criticized the defense for misstating the applicable law. Central to the OTP's argument is the risk of Duterte fleeing or interfering with justice, citing his political influence, network of loyal supporters—including his daughter, Vice-President Sara Duterte—and his recent election as mayor of Davao City. The OTP also referenced the Appeals Chamber’s prior acknowledgment that access to international contacts could enable a suspect to abscond, even without proof of intent. The prosecution defended the use of public sources such as media reports and NGO findings as legitimate evidence in ICC proceedings, noting that the risk of absconding increases with the severity of potential punishment and confirmed charges. Regarding health concerns, the OTP rejected Duterte’s medical arguments as insufficient, stating that the chamber had already ruled his alleged ailments did not outweigh the risks of release, and that there is no evidence that detention poses serious harm to his wellbeing. The OTP further noted that the issue of Duterte’s fitness to stand trial has not yet been evaluated and that the defense provided no clear legal basis for its assessment. The filing was submitted on October 31, 2025, and published on November 1, 2025, by Khaleej Times.\nOriginal language: en\nPublish date: November 01, 2025 10:41 AM\nSource:[Khaleej times](https://www.khaleejtimes.com/world/asia/icc-prosecution-detain-rodrigo-duterte)\n\n**Affirm ruling on Duterte appeals, ICC prosecutors ask**\nThe Office of the Prosecutor (OTP) at the International Criminal Court (ICC) has requested the Appeals Chamber to affirm the Pre-Trial Chamber I's (PTC I) decision denying former Philippine President Rodrigo Duterte's appeal for interim release. The PTC I, composed of three women, unanimously rejected Duterte’s bid on September 26, citing 'reasonable grounds to believe' that his continued detention is necessary to ensure his participation in proceedings and to prevent intimidation of potential witnesses and victims. The OTP argued that the defence's appeal was 'unconvincing' and based on unsubstantiated claims, emphasizing that the ICC applies a 'low evidentiary threshold' for detention. Duterte, charged with three counts of murder related to 49 drug war killings from 2013 to 2018 during his tenure as mayor of Davao City and later as president, remains a figure of significant power and influence, particularly in Davao City, where he won re-election as mayor in May 2025. The prosecution dismissed the defence's argument about proposed release conditions, stating that only the chamber can assess whether such risks are mitigated. Regarding Duterte's cognitive health, the OTP stated that the medical reports submitted by the defence are untested, lack clarity on legal standards applied, and are therefore insufficient to determine his fitness. The Office of Public Counsel for Victims also urged the Appeals Chamber to deny the appeal, asserting that all three grounds of the defence’s appeal lack merit.\nOriginal language: en\nPublish date: November 02, 2025 06:51 AM\nSource:[The Star ](https://www.thestar.com.my/aseanplus/aseanplus-news/2025/11/02/affirm-ruling-on-duterte-appeals-icc-prosecutors-ask)\n\n**Survivors still reckon with Duterte's drug war**\nJoel Ejorcadas and Marlon Pepito Jr., survivors of former Philippine President Rodrigo Duterte's drug war, continue to grieve and advocate for justice, commemorating 111 victims at the 'Dambana ng Paghilom' shrine in Caloocan's La Loma Catholic Cemetery. Both men, who live in the Navotas slums, made candles themselves as part of a program led by Redemptorist brother Ciriaco Santiago III, which employs relatives of drug war victims as candlemakers and baristas. Ejorcadas' brother Jomel was shot in the head in August 2016 after being accused of drug dealing, while Pepito's father and uncle were killed in January 2017 during a police raid targeting someone named 'Marlon.' Neither man wants to be photographed due to fear of police retaliation. In the years following their loved ones' deaths, they remained silent, afraid of whom to trust. Their trauma persisted: Pepito’s brother developed severe anxiety around police and guns, requiring temporary shelter under Santiago’s care. Now, eight years later, they are more outspoken, citing the International Criminal Court’s (ICC) March 2025 arrest of Duterte on charges of crimes against humanity as a turning point. Ejorcadas said, 'A thorn was removed from my heart because, somehow, our fight is starting to bear fruit.' Both men are demanding that Duterte remain in detention. The ICC’s Office of the Prosecutor and the Office of the Public Counsel for Victims have urged the Appeals Chamber to reject Duterte’s appeal for interim release, arguing that the Pre-Trial Chamber’s denial was legally sound and that the defense failed to prove humanitarian grounds for release, including claims about Duterte’s medical condition. Deputy prosecutor Mame Mandiaye Niang stated the defense's arguments were based on disagreement, mischaracterization, and misunderstanding of the law.\nOriginal language: en\nPublish date: November 01, 2025 02:32 PM\nSource:[Philstar.com](https://www.philstar.com/headlines/2025/11/02/2484266/survivors-still-reckon-dutertesdrug-war)\n\n**'At What Point Does This Cross a Line Into International Criminality?'**\nThe Trump administration has conducted at least 10 military operations in international waters near Central and South America since September 2, killing 61 people, according to reports. These actions, justified by the administration as part of a war against drug cartels under the laws of armed conflict, have drawn strong condemnation from international legal experts. Volker Türk, the U.N. High Commissioner for Human Rights, declared the killings illegal under international law. Colombian President Gustavo Petro accused the U.S. of 'murder' in connection with the death of a fisherman. Legal scholar Philippe Sands, in an interview with POLITICO Magazine, argued that the killings may cross into international criminality, citing the precedent of the Augusto Pinochet case, where a former head of state was indicted in a foreign country for crimes against humanity. Sands highlighted a growing tension between the U.S. Supreme Court’s 2024 decision granting former presidents broad immunity for official conduct and the principles of international law established after Nuremberg. He warned that such immunity could create a 'green light' for actions like torture, disappearance, or murder if framed as national security. While the U.S. is not a party to the International Criminal Court (ICC), the ICC has jurisdiction if crimes occur on a state party’s vessel or aircraft. The ICC has already issued an arrest warrant for former Philippine President Rodrigo Duterte over extrajudicial killings linked to anti-drug campaigns. Sands noted that foreign governments, including Colombia, Venezuela, and Brazil, may consider domestic investigations or inter-state cases at the International Court of Justice, though they risk political and economic retaliation. He emphasized that while prosecutions are politically complex, the existence of international legal mechanisms—such as universal jurisdiction—means that high-level officials may still face accountability. The broader context includes a U.S. double standard: supporting international law when applied to others (e.g., Sudan) but resisting it when applied to itself. Sands concluded that the situation remains a 'watch this space' scenario, with significant legal and political uncertainty ahead.\nOriginal language: en\nPublish date: November 01, 2025 01:55 PM\nSource:[Yahoo](https://www.yahoo.com/news/articles/watch-space-legal-fallout-trump-135500119.html)\n\n**'Watch This Space': The Legal Fallout From Trump's Deadly Boat Strikes**\nPhilippe Sands, an international law expert, discusses the legal and ethical implications of the Trump administration's reported use of military force in international waters near Central and South America, which resulted in at least 61 deaths between September 2 and October 27, 2024. According to Sands, these actions may violate international law, particularly the UN Charter’s prohibition on the use of force (Article 2, paragraph 4), unless an armed attack occurs—an exception under Article 51. He argues that targeting drug traffickers and couriers does not constitute an armed attack, and thus the use of military force under the laws of armed conflict is unjustified. Instead, such acts should be addressed through criminal law. Sands draws parallels to the 1998 arrest of former Chilean dictator Augusto Pinochet in the UK, where the House of Lords ruled that heads of state are not immune from prosecution for international crimes like torture. This precedent, he notes, established a landmark shift toward accountability. However, the 2024 U.S. Supreme Court ruling in Trump v. United States granted former presidents absolute immunity for official conduct related to core constitutional powers, creating a potential conflict with international legal norms. Sands warns this could create a 'green light' for actions that may cross into crimes against humanity, including murder, torture, or genocide. He highlights the International Criminal Court’s (ICC) indictment of former Philippine President Rodrigo Duterte for crimes against humanity related to anti-drug killings, suggesting a precedent for holding leaders accountable. Although the U.S. is not a party to the ICC statute, the court may still have jurisdiction if crimes occur on vessels or aircraft of state parties. Sands cautions that foreign governments—such as Colombia, Venezuela, or Brazil—might initiate domestic investigations or inter-state cases, though political and economic retaliation is a real risk. He emphasizes that the U.S. remains a powerful actor in international law, and while the ICC has historically avoided investigating powerful nations, recent actions—like the ICC’s indictment of Russian President Putin and Israeli leaders—show a shift. Sands concludes that the situation remains fluid: 'It's a sort of 'watch this space' type of scenario,' as the international legal order persists despite political resistance. He notes that even symbolic indictments can have real effects, such as deterring travel or influencing diplomatic behavior, citing anecdotal evidence including former U.S. President George W. Bush avoiding certain countries due to potential prosecution risks.\nOriginal language: en\nPublish date: November 01, 2025 01:55 PM\nSource:[POLITICO](https://www.politico.com/news/magazine/2025/11/01/trump-boat-strikes-international-law-interview-00632077)\n\n**ICC prosecutors urge Appeals Chamber to keep ex Philippine president Duterte detained**\nThe Office of the Prosecutor (OTP) at the International Criminal Court (ICC) has urged the Appeals Chamber to dismiss former Philippine President Rodrigo Duterte's appeal for temporary release, arguing that his defense failed to demonstrate any legal or factual errors in the Pre-Trial Chamber I's September 26 ruling denying his request for interim release under the Rome Statute. The OTP maintained that the chamber correctly determined that Duterte's detention remains necessary to ensure three key objectives: preventing flight, avoiding obstruction of justice, and safeguarding the integrity of the proceedings. The prosecution emphasized that Duterte's appeal was based on disagreement with the ruling rather than a valid judicial error, and criticized the defense for misstating the applicable law. Central to the OTP's argument is the risk of Duterte fleeing or interfering with justice, citing his political influence, network of loyal supporters—including his daughter, Vice-President Sara Duterte—and his recent election as mayor of Davao City. The OTP also referenced the Appeals Chamber’s prior acknowledgment that access to international contacts could enable a suspect to abscond, even without proof of intent. The prosecution defended the use of public sources such as media reports and NGO findings as legitimate evidence in ICC proceedings, noting that the risk of absconding increases with the severity of potential punishment and confirmed charges. Regarding health concerns, the OTP rejected Duterte’s medical arguments as insufficient, stating that the chamber had already ruled his alleged ailments did not outweigh the risks of release, and that there is no evidence that detention poses serious harm to his wellbeing. The OTP further noted that the issue of Duterte’s fitness to stand trial has not yet been evaluated and that the defense provided no clear legal basis for its assessment. The filing was submitted on October 31, 2025, and published on November 1, 2025, by Khaleej Times.\nOriginal language: en\nPublish date: November 01, 2025 10:41 AM\nSource:[Khaleej times](https://www.khaleejtimes.com/world/asia/icc-prosecution-detain-rodrigo-duterte)\n\n**ICC Prosecutor Demands Continued Detention of Rodrigo Duterte Amid Appeal Rejection**\nThe Office of the Prosecutor of the International Criminal Court (ICC) requested on Friday, October 31, 2025, that judges maintain the detention of former Philippine President Rodrigo Duterte and reject his appeal against the refusal of provisional release issued on September 26, 2025. The ICC Prosecutor argued that risks of flight, interference with the judicial process, and potential reoffending remain. The Office described the decision to uphold detention as 'reasonable and correct,' stating that Duterte's defense relied on mere disagreement, misrepresented the ruling's rationale, and misinterpreted procedural rules. The Prosecutor emphasized that judges had already found 'reasonable grounds' to believe Duterte committed crimes under the ICC’s jurisdiction during his presidency and tenure as mayor of Davao. Detention remains necessary to ensure his presence at trial, protect the investigation, and prevent further crimes. The report included partially censored excerpts from statements by Duterte’s associates, which the Prosecutor said demonstrate his ability—directly or through intermediaries—to obstruct justice. The Prosecutor also cited family members calling the arrest a 'kidnapping,' Duterte’s physical resistance during his Manila arrest, his attempts to discredit the ICC, his repeated desire to return to the Philippines, and the possibility of a lengthy sentence if convicted. Regarding health and humanitarian arguments raised by the defense, the Prosecutor clarified that medical reports were intended solely to assess Duterte’s fitness to attend trial, not to eliminate flight or obstruction risks. The ICC judges had previously determined through 'exhaustive review' that these reports did not reduce the alleged risks. The Prosecutor reiterated that the Rome Statute does not permit provisional release based on humanitarian grounds while detention justifications persist. It also noted that the defense failed to prove that detention caused serious harm. The Prosecutor strongly rejected claims by Duterte’s lawyer that judges had predetermined the outcome, calling such allegations 'concerning' and rejecting them 'in the strongest terms.' Duterte, aged 80, was arrested in March 2025 in Manila and transferred to The Hague following an international arrest warrant issued for alleged crimes against humanity committed during the Philippines' 'war on drugs,' both during his presidency and as mayor of Davao.\nOriginal language: es\nPublish date: October 31, 2025 07:56 PM\nSource:[El Nacional](https://www.elnacional.com/2025/10/cpi-exige-mantener-detenido-a-rodrigo-duterte/)\n\n**Is the Current Situation in the Philippines Unfavorable for the Duterte Family?**\nThe political alliance between the Duterte family and President Ferdinand 'Bongbong' Marcos Jr. has collapsed amid escalating tensions in Mindanao, a traditional stronghold of the Duterte family. A violent conflict in a town near former rebel-controlled areas led to the evacuation of over 2,000 households, signaling a breakdown beyond a typical gang clash. The conflict is seen as a culmination of long-standing regional tensions. Initially, the two families formed a strategic alliance, with the Marcos family relying on Duterte’s electoral support and political network to secure power. However, after consolidating authority, Marcos revoked the Duterte family’s judicial immunity and reclaimed local fiscal powers, effectively nullifying their prior agreement. In response, Rodrigo Duterte publicly asserted that Mindanao should govern itself, while his son issued a more confrontational warning: if central government pressure continues, he is prepared to mobilize forces and break away. This rupture underscores the transactional nature of Philippine family politics, where alliances are based on mutual interest rather than loyalty. The Marcos administration’s hardline approach is viewed as a strategic miscalculation, as the Duterte family’s deep-rooted influence, extensive local networks, and control over regional resources make any attempt to displace them highly destabilizing.\nOriginal language: zh\nPublish date: October 31, 2025 07:21 AM\nSource:[中华网军事频道](https://military.china.com/news/13004177/20251031/48953924.html)\n\n**Duterte Appeals ICC Decision on Crimes Against Humanity Charges**\nRodrigo Duterte, former president of the Philippines, has appealed the International Criminal Court's (ICC) decision to proceed with a case against him, accusing him of crimes against humanity and involvement in hundreds of killings linked to his anti-drug campaign. The 80-year-old is currently detained in The Hague, Netherlands, where the ICC is headquartered, after being arrested in March 2025 at Manila’s airport. The ICC judges ruled that the court has jurisdiction over the case despite Duterte’s defense arguing that the investigation was not fully initiated before the Philippines withdrew from the ICC in 2019. Duterte’s legal team has filed a motion seeking his release and another petition to dismiss the case, citing his cognitive decline. A decision on how his health affects the trial is expected in November 2025. Duterte faces three charges: (1) co-authorship of 19 murders during his tenure as mayor of Davao (1988–1998, 2001–2010, 2013–2016); (2) involvement in 14 high-value target assassinations in 2016–2017 while president; and (3) responsibility for 43 killings during 'clean-up operations' from 2016 to 2018, which prosecutors describe as systematic. The anti-drug campaign, which began in 2016, led to thousands of deaths, with police reporting 6,200 suspects killed and human rights groups citing far higher numbers. Duterte, who led the Philippines from 2016 to 2022, withdrew the country from the ICC treaty in 2019, but the court had already begun investigating alleged crimes under his leadership. He was arrested on March 11, 2025, and transferred to the ICC’s penitentiary facility in Scheveningen, marking a dramatic shift for a leader once accustomed to operating without constraints.\nOriginal language: pt\nPublish date: October 29, 2025 03:02 PM\nSource:[Folha de S.Paulo](https://www1.folha.uol.com.br/mundo/2025/10/duterte-tenta-anular-processo-no-tpi-por-crimes-contra-a-humanidade.shtml)\n\n**The Philippines at a Crossroads: Disillusionment, Protest, and the Legacy of Violence Under Marcos Jr. and Duterte**\nJasmine, a 39-year-old resident of Manila, expresses disillusionment with President Ferdinand Marcos Jr. (Bongbong), stating that insecurity has increased under his leadership. She contrasts this with the previous era of Rodrigo Duterte (2016–2022), whose 'iron fist' of intimidation, though brutal, effectively controlled crime, even if his economic policies were weak. Despite Bongbong's campaign promise to lower rice prices—now broken—protests erupted on September 21, 2025, following a flood protection scandal, leading to the arrest of 216 people, including a 12-year-old. Manila's Mayor Isko Moreno demanded cooperation from parents and sought to 'identify who stands behind the protests,' a rhetorical tactic often used in authoritarian-leaning democracies to imply foreign interference. Allegations of corruption in infrastructure projects (2023–2025) include inflated prices, kickbacks, 'ghost projects,' substandard construction, and budget manipulation, amounting to up to two billion euros in losses. Bongbong responded with promises of accountability and empathy, stating, 'If I weren’t president, I might protest too.' This led to resignations, including that of his cousin, the Speaker of the House. Protests drew 50,000 to 150,000 demonstrators, many from Generation Z, who adopted a pirate flag (a skull with a straw hat)—a symbol originating from the anime 'One Piece'—also seen in protests in Nepal and Indonesia. This cultural borrowing reflects how youth in Asia use pop culture to express dissent, including gestures from 'Hunger Games' and 'Harry Potter.' The government announced it would not prosecute the arrested youth but assign them to community service, a move met with skepticism due to the lingering trauma of the Duterte era, during which extrajudicial killings were widespread and the police were complicit. Walter S., an Austrian resident married to a Filipino, describes Manila as 'totally depoliticized,' where people rely on social media rather than newspapers or books. Duterte, now an accused war criminal in The Hague since March 2025, was the founder of the notorious 'Davao Death Squad' and a proponent of neofascism. His rhetoric, including statements like 'Hitler killed three million Jews, here we have three million drug addicts—I’d be happy to slaughter them all,' and his use of the word 'kill' 2,154 times in his first six months, fueled a wave of state-sanctioned violence that resulted in an estimated 30,000 deaths. Despite claims of self-justification, the killings were systematic. The 'Philippine Daily Inquirer' documented these killings in a 'Kill List,' while journalist Patricia Evangelista, author of 'Some People Need Killing,' portrays a society desensitized to violence, where horror became routine and was met with applause. Evangelista, a trauma reporter, describes working in areas where death was commonplace. Duterte labeled 'Rappler,' the news outlet co-founded by Nobel laureate Maria Ressa, as 'fake news.' Walter S. notes that fear remains deeply embedded, with his in-laws avoiding political discussion. Duterte’s radical violence was rooted in historical patterns of repression, including over 300 years of Spanish colonial rule and a brutal U.S. occupation that killed up to one million Filipinos. These colonial legacies entrenched elite clans and systemic violence. Evangelista reveals how Duterte exploited public apathy, framing the deaths of marginalized people as societal relief. The Philippines thus serves as a warning about how autocrats cultivate indifference to violence, particularly in an era where authoritarian regimes like those in the U.S. and Russia are increasingly dominant. In Europe, similar trends in disinformation are emerging. The article concludes with Walter S. acknowledging the Philippines’ harsh realities—long commutes, poverty, alcoholism—but still calling it his ideal country due to its vast, undeveloped landscapes, natural resilience, and cultural calm.\nOriginal language: de\nPublish date: October 12, 2025 08:06 AM\nSource:[Die Presse](https://www.diepresse.com/20183627/es-heisst-die-philippiner-wuerden-sich-erst-auflehnen-wenn-die-steigen)\n\n**International Criminal Court denies release of ex-Filipino President Rodrigo Duterte**\nThe International Criminal Court (ICC) denied an appeal for temporary release by former Philippine President Rodrigo Duterte on October 10, 2025. The pre-trial chamber issued a 23-page ruling based on a September 26 decision, citing concerns that Duterte poses a flight risk, could obstruct proceedings, or commit new crimes if released. Duterte, 80, was arrested in Manila in March 2025 on an ICC warrant related to alleged crimes against humanity during his 'war on drugs' from 2016 to 2022, which resulted in between 12,000 and 30,000 deaths. The ICC had launched a formal investigation in September 2021, prompting the Duterte administration to withdraw from the court in 2018. His legal team had proposed electronic monitoring and asylum in a third country as conditions for release. Victims' families urged the court to keep him detained. Despite this, Duterte was re-elected mayor of Davao City. His daughter, Vice President Sara Duterte, threatened to 'break him out' of jail and accused the government of using 'fake' witnesses. Sara Duterte survived impeachment attempts in the summer of 2025. The situation unfolded amid rising tensions between the Duterte and Marcos political dynasties, with both families holding multiple elected positions in the Philippines.\nOriginal language: en\nPublish date: October 10, 2025 05:26 PM\nSource:[Yahoo](https://www.yahoo.com/news/articles/international-criminal-court-denies-release-172603920.html)\n\n**Marcos-Duterte feud risks shifting Asia's balance of power**\nThe political alliance between Ferdinand Marcos Jr. (Bongbong) and Sara Duterte, once known as 'Uniteam' and instrumental in their 2022 victory—Marcos as president and Duterte as vice president—has collapsed into a bitter feud. The rift stems from corruption allegations against Sara Duterte, which she denies, failed impeachment efforts, and her public pledge to have Marcos assassinated if she dies prematurely. The breaking point came when Marcos Jr. facilitated the transfer of her father, former President Rodrigo Duterte, to the International Criminal Court in The Hague, where he is accused of crimes against humanity. While Marcos Sr. died in 1989, Rodrigo Duterte remains in custody. The escalating conflict has drawn international attention, particularly from Beijing and Washington, due to the Philippines' strategic position in the South China Sea and its shifting alignment between China and the West. Sara Duterte’s renewed popularity in polls, despite the turmoil, raises concerns for the U.S., as she appears less committed to the U.S.-Philippines alliance and more open to a rapprochement with China. This domestic power struggle now carries significant implications for regional balance of power in Asia.\nOriginal language: en\nPublish date: October 04, 2025 05:31 AM\nSource:[Yahoo News](https://sg.news.yahoo.com/the-feud-in-the-philippines-that-could-upend-asias-balance-of-power-053116452.html)\n\n**Sarah Says a Country Will Take in Duterte; Marcos Faces Double Blow**\nOn September 25, 2025, the Chinese military channel reported that Philippine President Ferdinand Marcos Jr. faced both internal and external pressure. A mass anti‑corruption protest on September 21, the anniversary of Marcos’s declaration of martial law, drew more than 100,000 participants across Manila and other cities. The demonstration turned violent when masked youths clashed with riot police at the Yela Bridge, leading to 72 arrests, including minors, and the burning of several vehicles and public property. Police described the overall gathering as '基本和平' (basically peaceful). Meanwhile, Vice‑President Sara Duterte told Filipino expatriates in Japan that a 'third‑party country' had agreed to accept her father, former President Rodrigo Duterte, through negotiations with 'foreign acquaintances', hinting that the country's stance could be seen on the International Criminal Court website. She did not name the country but ruled out Japan and noted that Australia had previously rejected the offer. The events add to the political pressure on Marcos, whose approval ratings are falling, and may prompt him to adopt more aggressive tactics on the South China Sea to divert domestic attention.\nOriginal language: zh\nPublish date: September 25, 2025 11:53 PM\nSource:[中华网军事频道](https://military.china.com/news/13004177/20250926/48858262.html)\n\n**ICC Finds Evidence Against Former Philippine President Duterte**\nThe International Criminal Court (ICC) has filed charges of crimes against humanity against former Philippine president Rodrigo Duterte, alleging his responsibility for at least 76 killings linked to the country’s war on drugs. The indictment cites three categories of killings: 19 murders committed while Duterte was mayor of Davao (2013‑2016), 14 deaths of so‑called ‘high‑value targets’ (2016‑2017), and 43 killings during drug‑eradication operations (2016‑2018). According to the ICC indictment, these deaths were the result of Duterte’s orders or encouragement, making him personally liable. The article notes that the total number of deaths attributed to the drug war is far higher: 6,229 people died in operations from July 2016 to January 2022, 8,663 were recorded in the 2020 UN Human Rights Office report, and human‑rights groups estimate that death squads ordered by Duterte killed about 30,000 people. \n\nDuterte’s own controversial statement in September 2016—\"In Germany Adolf Hitler killed 3 million Jews. In the Philippines 3 million drug addicts. I would gladly kill them\"—is quoted to illustrate the severity of his campaign. The article also reports that after the ICC issued an arrest warrant on March 11, 2024, Duterte was detained at Manila airport, flown to the Netherlands, and has since remained in the ICC’s detention centre in Scheveningen. The indictment was filed in September 2023, and the first hearing was postponed in September 2024 to assess Duterte’s fitness to stand trial.\n\nThe piece highlights that Duterte’s supporters have long accused the investigation of being politically motivated, especially after the Philippines withdrew from the ICC in 2023. It also notes that several African and American states have criticized the ICC’s focus on drug‑war crimes, labeling the court a tool of neo‑colonial repression. The article concludes by noting that the ICC’s proceedings have attracted international attention, with some countries calling for sanctions against the court.\n\nEvidence: ICC indictment (September 2023), UN Human Rights Office report (2020), Philippine Drug Enforcement Agency data (July 2016‑January 2022), Reuters reporting on Duterte’s statement, and statements from human‑rights organisations.\nOriginal language: ru\nPublish date: September 23, 2025 01:55 PM\nSource:[kommersant.ru](https://www.kommersant.ru/doc/8059690)\n\n**International Criminal Court charges former Philippine president Rodrigo Duterte with crimes against humanity**\nOn September 23 2025, Il Post reported that the International Criminal Court (ICC) has charged former Philippine president Rodrigo Duterte with crimes against humanity. The indictment accuses him of being responsible for 'decine di omicidi' committed by his subordinates between 2011 and 2019 during his 'hard‑line' anti‑drug campaign. Duterte was arrested in March 2025 in Manila and is now in pre‑trial detention in The Hague, where the ICC is headquartered. The article notes that Duterte, 80, served as mayor of Davao from 1988 to 2016 and president of the Philippines from 2016 to 2022. It describes how, as mayor, he formed civilian militias that targeted suspected drug users and traffickers, and how he expanded these policies nationwide. The ICC, established in 2002, has never before arrested a non‑African leader; Duterte is the first such case and the only one currently detained after being democratically elected. The arrest was made possible by President Ferdinand Marcos Jr., who is embroiled in a political clash with Duterte’s daughter, Vice‑President Sara Duterte.\nOriginal language: it\nPublish date: September 23, 2025 07:47 AM\nSource:[Il Post](https://www.ilpost.it/2025/09/23/accuse-rodrigo-duterte-corte-penale-internazionale/)\n\n**ICC charges ex-Philippine President Duterte with crimes against humanity**\nThe International Criminal Court (ICC) has charged former Philippine President Rodrigo Duterte with three counts of crimes against humanity, alleging his involvement in at least 76 murders during his 'war on drugs'. The charges, released in a heavily redacted ICC charge sheet dated early July and signed by deputy prosecutor Mame Mandiaye Niang, cover murders that occurred between 2013 and 2018. The first count relates to his time as mayor of Davao City, where he is alleged to have been an 'indirect co‑perpetrator' in 19 murders from 2013 to 2016. The second count concerns 14 'high‑value' targets killed in 2016 and 2017, while the third count covers 43 murders committed during 'clearance' operations against lower‑level alleged criminals between 2016 and 2018. The 76 killings were carried out by police and non‑state actors such as hitmen, according to the ICC document. Duterte, 80, has been held in a detention facility in the Netherlands since March, following his arrest in Manila on March 11. The court has delayed his appearance, pending a fitness‑to‑stand‑trial assessment after his lawyer Nicholas Kaufman argued that Duterte suffers 'cognitive impairment in multiple domains' and should be indefinitely postponed. Duterte maintains his arrest is unlawful, and his supporters claim the detention is political, stemming from a fallout with current Philippine President Ferdinand Marcos Jr.\nOriginal language: en\nPublish date: September 23, 2025 12:31 AM\nSource:[Al Jazeera Online](https://www.aljazeera.com/news/2025/9/23/icc-charges-ex-philippine-president-duterte-with-crimes-against-humanity)\n\n**Disputing Oligarchs in the Neo‑colonial Philippines and Their Catastrophic Subservience to Washington (Part I of II)**\nThe German article \"Streitende Oligarchen in den neokolonialisierten Philippinen…\" argues that Philippine politics is dominated by rival clans, with President Ferdinand \"Bongbong\" Marcos Jr. and Vice‑President Sara Duterte in conflict since early 2024. It claims the country is a neo‑colonial state under Washington, citing US troop stationing on nine Philippine bases, joint exercises, and billions in modernization (Reid 2025). The piece cites US President Donald Trump’s threat of up to 20 % tariffs on Philippine exports, prompting Marcos Jr. to seek clemency in July 2024 (Birnbaum 2024). It also reports that US Defense Secretary Pete Hegseth called for more missiles and logistics as a deterrent against China (Arkansas Democrat Gazette 2025). The article accuses the Philippine elite of enriching themselves through casinos and overseas businesses, noting that former Defense Minister Gilberto Teodoro was revealed as a Maltese citizen with large investments in Malta. It further details the arrest of former President Rodrigo Roa Duterte on March 11 2025 by Interpol under an ICC warrant for alleged crimes against humanity (Khan 2024). The author cites the death toll of 12 000–30 000 people killed during Duterte’s ‘Anti‑Drug War’ and the need for a trial in September 2025. The piece also links the COVID‑19 pandemic to a broader neoliberal crisis, citing that over 4 million people died worldwide, with 609 000 in the US, 539 000 in Brazil, and 413 000 in India as of 15 July 2021 (Lim 2020). It reports that 67 Filipino nurses died from COVID‑19 by September 2020, representing one‑third of all registered nurses in the US (Powell 2021). The article quotes John Kenneth Galbraith: 'Nehmt die Last des weißen Mannes auf euch, die wilden Kriege des Friedens.' and Kipling’s admonition about the 'wars of peace'.\nOriginal language: de\nPublish date: August 23, 2025 11:00 AM\nSource:[NachDenkSeiten](https://www.nachdenkseiten.de/?p=137823)\n\n**Philippines Midterm Elections: Marcos Gains National Ground, Duterte Dynasty Holds Firm in Davao**\nIn the May 13, 2025 midterm elections in the Philippines, nearly 70 million citizens voted for seats in the House of Representatives, Senate, and local governments. President Ferdinand Marcos Jr.'s coalition, the Philippine Federal Party (PFP), is expected to strengthen its national leadership, particularly in the Senate, where it is projected to secure at least half of the 12 available seats. The Senate race was more competitive, with strong performances from pro-Duterte candidates Christopher “Bong” Go and Ronald Dela Rosa, who received the highest votes. At the local level, political fragmentation emerged, with a notable rise in independent candidates and a significant showing by the progressive party Akbayan, which garnered 6.71% of votes (on 97.23% of ballots counted), surpassing the 2% threshold. The Duterte-aligned Duterte Youth party also exceeded expectations with 5.61% of the vote. In Davao City, the political stronghold of former President Rodrigo Duterte, his son Sebastian Duterte won second place as vice mayor, while Rodrigo Duterte Sr. himself, detained in The Hague since March 2025 on charges of crimes against humanity, received 660,000 votes despite being denied voting rights by the Commission on Elections (Comelec) due to non-registration abroad. The election results reflect a fragmented national political landscape, where alliances will be crucial, and the Duterte family retains strong influence in its regional base despite legal challenges and political scrutiny.\nOriginal language: en\nPublish date: May 13, 2025 03:53 PM\nSource:[worldmagazine.it](https://www.worldmagazine.it/1261031/)\n\n",
    "date": "2025-11-03T09:42:53.066496",
    "summary": "Across a diverse set of disciplinary perspectives, experts agree that the Philippines faces an elevated but still sub-50% risk of major civil unrest or martial law in 2025, with probabilities assigned generally between 7% and 38%. Forecasters highlight that the core risk drivers are the sharp elite conflict between the Marcos and Duterte families, Rodrigo Duterte's unprecedented arrest and trial at the ICC, and persistent Mindanao regional volatility where Duterte support is strongest. Several scenarios could theoretically trigger a Yes resolution—most plausibly, a violent incident or large-scale mobilization in Mindanao leading to a local martial law declaration, or national protests crossing the specified thresholds of 1,000 deaths or 5,000 unrest-related arrests. However, base rates for martial law declarations or mass-casualty unrest are low in Philippine history, occurring mainly in response to extreme crises. Experts note that recent protest activity, while occasionally large, has not neared these thresholds. Other moderating factors cited include the military's loyalty to the central government, depoliticization and trauma muting civil mobilization, the regime's preference for calibrated (not maximal) repression, and international scrutiny. While all agree that the Philippines is in a period of heightened instability, particularly focused on the Mindanao region, most assess that elite competition is still being managed below the level that would trigger martial law or mass fatality/unrest. The clearest tail risk is a regional spiral in Mindanao, but absent a major new catalyst in the remaining weeks of 2025, a No resolution is expected to be most likely.",
    "forecasters": [
        "Security Studies (CivilMilitary Relations Analysis)",
        "Security Studies (Coup Risk Assessment)",
        "Risk Analysis (Political Risk Assessment)",
        "Risk Analysis (Scenario Planning)",
        "Political Science (Contentious Politics Theory)",
        "Political Science (Regime Stability Paradigm)",
        "Sociology (Social Movements Theory)",
        "Sociology (Relative Deprivation Theory)",
        "Southeast Asian Studies (Philippine Political Culture)",
        "Southeast Asian Studies (Patron Clientelism Tradition)"
    ]
}