{
    "deliberation_results": {
        "Comparative Politics Analyst (Cabinet Formation Process)": {
            "time_to_resolution": "Approximately 2.5 months (until January 1, 2026)",
            "perspective_relevance": "As a Comparative Politics Analyst specializing in cabinet formation, I focus on formal constitutional rules, elite bargaining, protest-driven regime change, and the coalition-building process in parliamentary systems—especially where extra-parliamentary actors (e.g., protest movements, military) play a decisive role. My expertise is directly relevant in analyzing how Nepal’s transition from a caretaker administration to a new government will unfold, given the recent violent unrest, the role of Gen-Z protestors, and the presence of technocratic/outsider figures like Kulman Ghising.",
            "status_quo": "Sushila Karki, a former chief justice, is currently serving as caretaker prime minister. The interim government is tasked with holding elections in early March 2026. Kulman Ghising is serving as a caretaker minister (energy/infrastructure), not as PM. Historically, caretaker PMs rarely become full-term PMs, and transitional governments often revert to established politicians or major party figures unless a major political realignment occurs.",
            "perspective_derived_factors": [
                {
                    "factor": "Caretaker government mandate and precedent",
                    "effect": "Decreases probability. The current government is explicitly interim, and the constitutional norm would be to hold elections and form a new government via parliamentary procedures. Caretaker PMs are rarely elevated to full-term PMs in Nepal’s recent history."
                },
                {
                    "factor": "Kulman Ghising’s outsider/technocratic profile and appeal",
                    "effect": "Slightly increases probability. Ghising has significant popular support from Gen-Z and civil society, is credited with ending power shortages, and was a serious contender during the interim negotiations. However, his lack of a major party base limits his ability to command a majority in parliament unless the post-protest realignment is sustained."
                },
                {
                    "factor": "Gen-Z movement’s influence and possible realignment",
                    "effect": "Slightly increases probability. Gen-Z protestors are driving the current transition and could back a non-traditional figure like Ghising if established parties remain discredited. However, youth-led movements often fragment or are co-opted by established actors during the cabinet formation phase."
                },
                {
                    "factor": "Party system resilience and elite coalition dynamics",
                    "effect": "Strongly decreases probability. Nepal’s party system (Maoists, UML, Congress, etc.) is fragmented but resilient; these parties have historically sidelined technocrats in favor of their own leaders during government formation. Elite bargaining and coalition-building tend to favor politically established figures, not technocrats."
                },
                {
                    "factor": "Constitutional and procedural requirements",
                    "effect": "Decreases probability. The next PM must win a vote of confidence in the House of Representatives. Ghising is not a sitting MP, and while not strictly required by the constitution, in practice, PMs are drawn from the House. Unless there is overwhelming cross-party support or a unity government, Ghising’s path is procedurally constrained."
                },
                {
                    "factor": "Recent precedent and base rates",
                    "effect": "Decreases probability. The base rate for technocrats or caretaker ministers becoming the next full PM in South Asian parliamentary systems is extremely low. Nepal’s new PMs are usually leading politicians or party leaders."
                }
            ],
            "no_scenario": "Following the March 2026 general election, the major parties negotiate a coalition government. They select a party leader (likely from the Congress, UML, or Maoist Centre) as prime minister. Ghising either continues as a technocratic minister or returns to a non-political role. His lack of parliamentary and party support, and the return of elite politics post-crisis, blocks his elevation.",
            "yes_scenario": "The Gen-Z movement or a broad civil society coalition unites to nominate Ghising as their consensus PM candidate. Established parties are too discredited or divided to agree on a leader, and a caretaker-turned-national unity government emerges, with Ghising as a compromise. He is either given a direct path to the PM role by the President or, in a rare move, is quickly appointed to the House and wins a confidence vote with cross-factional support. This would require unprecedented consensus and sustained protester pressure.",
            "final_reasoning": "While Kulman Ghising was floated as a serious interim PM contender and has significant public goodwill, the current status quo is a caretaker government led by Sushila Karki, and Nepal’s political tradition strongly favors party leaders for the top executive post. The Gen-Z movement’s influence was decisive in toppling the previous government but is showing signs of internal division. Ghising’s lack of a party base and parliamentary seat, coupled with constitutional and elite coalition constraints, make it highly unlikely he will be named the next non-caretaker PM. Historical base rates for technocrats or caretaker ministers ascending to full PM in Nepal are extremely low. The only plausible scenario for a ‘Yes’ outcome is an extraordinary and sustained realignment, which current news does not indicate is imminent. Therefore, the probability that Kulman Ghising will be the next non-caretaker prime minister of Nepal is very low.",
            "final_probability": 3
        },
        "Comparative Politics Analyst (Elite Bargaining Analysis)": {
            "time_to_resolution": "Approximately 2.5 months (from October 13, 2025, to before January 1, 2026)",
            "perspective_relevance": "As a Comparative Politics Analyst specializing in Elite Bargaining Analysis, my perspective is crucial because Nepal's political transition is being shaped by both elite negotiations (among established political actors, the military, and Gen-Z movement leaders) and the need for broad legitimacy to stabilize governance after disruptive mass protests. Understanding the incentives, constraints, and bargaining power of these actors helps to clarify the likelihood of a technocrat like Kulman Ghising, versus a more traditional or symbolic figure, being selected as the next non-caretaker PM.",
            "status_quo": "The status quo is a caretaker government led by Sushila Karki, with elections mandated for early March 2026. The cabinet contains technocrats and respected figures, such as Kulman Ghising, but none have an explicit political mandate or party backing as prospective permanent prime minister. The expectation is that after the election, a politician with party backing will become PM.",
            "perspective_derived_factors": [
                {
                    "factor": "Technocrat Appeal amid Reformist Mood",
                    "effect": "Increases Ghising's probability. The Gen-Z movement's anti-corruption, anti-establishment anger makes technocrats like Ghising popular, as evidenced by his past record of eliminating load-shedding and his current high profile in the interim cabinet."
                },
                {
                    "factor": "Elite Bargaining, Party Politics, and Coalition Dynamics",
                    "effect": "Decreases Ghising's probability. Historically, Nepal's prime ministers are drawn from party elites after parliamentary elections. Even if a technocrat is beloved by protestors, the established parties and their parliamentary strength determine the government formation post-election."
                },
                {
                    "factor": "Caretaker Government Mandate and Constitutional Constraints",
                    "effect": "Decreases Ghising's probability. The current government is explicitly interim/caretaker, tasked with holding elections, not with producing a long-term PM. The next non-caretaker PM will almost certainly be the outcome of parliamentary bargaining after the vote."
                },
                {
                    "factor": "Gen-Z Movement's Enduring Influence",
                    "effect": "Slightly increases Ghising's probability if the movement continues to exert strong popular pressure or achieves an electoral breakthrough, possibly supporting a technocrat or outsider as PM."
                },
                {
                    "factor": "Historical Base Rates for Technocrat PMs in Nepal",
                    "effect": "Strongly decreases Ghising's probability. Nepal has little precedent for technocrat PMs winning parliamentary support post-election; the base rate is that party politicians form the government."
                },
                {
                    "factor": "Ghising's Own Political Ambitions and Network",
                    "effect": "Neutral to slightly increases probability; Ghising is respected, but there is no evidence he leads a party or has built the parliamentary coalition needed to become PM."
                }
            ],
            "no_scenario": "After the March 2026 elections, the largest party or coalition negotiates and selects a party leader or established politician—likely from the traditional parties or a Gen-Z backed political leader—who is then sworn in as PM and wins a parliamentary confidence vote. Ghising either remains a technocrat or exits the cabinet.",
            "yes_scenario": "A dramatic electoral shift occurs, with Gen-Z affiliated parties or movements winning a plurality and coalescing around Ghising as a consensus, non-partisan, reformist PM. Alternatively, elite deadlock leads to a 'national unity' government with Ghising as a compromise candidate, and he wins a confidence vote. This would require a break from Nepal's usual party-centric elite bargaining.",
            "final_reasoning": "While Kulman Ghising is respected and has symbolic appeal as an anti-corruption technocrat, the overwhelming weight of precedent, the nature of Nepal's party-based parliamentary system, and the explicit caretaker mandate of the current government all point against him being the next non-caretaker PM. The base rate for technocrats ascending to the premiership in Nepal post-election is extremely low, and there is no evidence that Ghising is building the necessary cross-party alliances or leading a political movement. The Gen-Z movement's influence increases his odds slightly, but unless it translates into parliamentary seats and coalition power, it is unlikely to overturn entrenched elite bargaining patterns. In summary, Ghising's probability is higher than random outsiders, but still very low—he is not the expected outcome.",
            "final_probability": 5
        },
        "Nepal Political Journalism (Political Party Leadership Tracking)": {
            "time_to_resolution": "Approximately 2.5 to 3 months (resolves between Sep 11, 2025 and Jan 1, 2026; today is Oct 13, 2025)",
            "perspective_relevance": "As an expert in Nepal Political Journalism specializing in political party leadership tracking, I have a nuanced understanding of Nepal's fluid coalition dynamics, the influence of youth protest movements, the role of the military and presidency in crisis transitions, and the reputations and support bases of plausible PM candidates. This expertise allows for a granular assessment of both formal and informal power shifts, base rates of technocratic outsider success, and the viability of figures like Kulman Ghising in the current, highly disrupted environment.",
            "status_quo": "Sushila Karki is currently the caretaker/interim prime minister, appointed following the collapse of the KP Sharma Oli government after massive Gen-Z protests. The interim government is mandated to hold elections on March 5, 2026. Kulman Ghising is currently a minister (Energy, etc.) in the caretaker cabinet.",
            "perspective_derived_factors": [
                {
                    "factor": "Role of caretaker government and timing of elections",
                    "effect": "Decreases probability. The current arrangement is explicitly interim, with a mandate to conduct elections in March 2026, and caretaker governments in Nepal have historically not transitioned into full PM status except in exceptional breakdowns."
                },
                {
                    "factor": "Ghising’s technocratic reputation and popularity among Gen-Z",
                    "effect": "Slightly increases probability. Ghising has a strong reputation as an effective technocrat credited with ending energy crises, and is celebrated by youth protestors, making him a plausible compromise candidate if the interim government falters."
                },
                {
                    "factor": "Factionalism and instability within Gen-Z movement",
                    "effect": "Increases probability a little. The Gen-Z movement is fractious, with multiple factions having previously backed different candidates, including Ghising. If Sushila Karki loses legitimacy or resigns, Ghising could emerge as a consensus figure."
                },
                {
                    "factor": "Base rate of technocrats/outsiders becoming PM",
                    "effect": "Decreases probability. Historically, Nepal's prime ministers are party leaders or senior politicians, not technocrats or non-party ministers. Ghising has no major-party base."
                },
                {
                    "factor": "Presence of other strong contenders",
                    "effect": "Decreases probability. Other names—especially Karki, Balen Shah, and potentially Prachanda—are more deeply embedded in political networks or have already secured interim consensus."
                },
                {
                    "factor": "Constitutional and procedural requirements",
                    "effect": "Neutral to slightly negative. Ghising could only become PM if a new coalition forms post-election or if a caretaker fails and parliament or the president appoints him as a last-resort consensus, which is possible but rare."
                }
            ],
            "no_scenario": "The caretaker government (Karki) survives until the March 2026 election, or if it collapses, another political figure (party leader or more prominent consensus candidate) is chosen as the next non-caretaker PM. Parliamentary elections are held as scheduled, and a party leader forms the next government.",
            "yes_scenario": "The caretaker government collapses due to renewed unrest, loss of legitimacy, or internal splits. Amid continued instability and Gen-Z pressure, mainstream parties and the military/president broker a consensus around a non-partisan, technocratic figure, and Ghising is appointed PM, secures the oath, and wins a confidence vote before Jan 1, 2026.",
            "final_reasoning": "While Kulman Ghising is highly visible, popular among youth, and has been a serious contender in the chaotic period post-Oli, the status quo is a caretaker government explicitly tasked with holding elections in March 2026. Historically, outsiders like Ghising rarely become PM except in total system breakdowns, which—despite the recent unrest—have not fully materialized. The Gen-Z movement's backing is meaningful, but they have already compromised on Karki, and there is no evidence of a fresh push for Ghising as PM since the interim cabinet was formed. Most scenarios see the caretaker government holding until elections, after which established party leaders or coalition figures are more likely to emerge as PM. The base rate for technocrats/outsiders is very low, and even in the current exceptional context, Ghising's ministerial appointment seems to be the extent of Gen-Z leverage. Thus, the probability is quite low but not zero: only a major, further crisis or collapse would elevate Ghising to PM in the relevant time window.",
            "final_probability": 5
        },
        "Nepal Political Journalism (Electoral Trends Nepal)": {
            "time_to_resolution": "Approximately 2.5 months (resolves between September 11, 2025 and January 1, 2026; today is October 13, 2025).",
            "perspective_relevance": "As an expert in Nepal Political Journalism specializing in electoral trends, I bring an understanding of Nepal's party dynamics, history of technocratic appointments, factors shaping public sentiment after mass protests, and how emerging youth movements (like Gen Z) can disrupt elite bargains. I also track how caretaker governments transition to elected ones and the historical precedent for technocrats or public figures like Kulman Ghising rising to executive roles.",
            "status_quo": "If nothing changes, Sushila Karki continues as caretaker PM until elections in March 2026, and a career politician from an established party or a consensus technocrat is chosen as the next non-caretaker PM. Kulman Ghising remains a cabinet minister but does not become PM.",
            "perspective_derived_factors": [
                {
                    "factor": "Caretaker government and timeline to elections",
                    "effect": "Decreases probability. The government led by Sushila Karki is explicitly an interim caretaker, set up to oversee elections. There is little precedent for a caretaker minister being elevated to the permanent PM role unless there is a major political deadlock or dramatic shift."
                },
                {
                    "factor": "Kulman Ghising's technocratic reputation and popularity",
                    "effect": "Slightly increases probability. Ghising has cross-partisan popularity, is lauded for ending Nepal’s power crisis, and enjoys significant grassroots support, especially among Gen Z protesters. If parties seek a non-partisan consensus figure to defuse the crisis, his name could emerge."
                },
                {
                    "factor": "Gen Z protester influence and anti-establishment sentiment",
                    "effect": "Slightly increases probability. The unprecedented Gen Z movement has already toppled a government and forced technocratic appointments. If their influence persists or grows, they could insist on a figure like Ghising for the PM role, especially if the traditional parties remain discredited."
                },
                {
                    "factor": "Party system resilience and coalition politics",
                    "effect": "Decreases probability. Despite public anger, Nepal's major parties (NC, UML, Maoists) remain structurally dominant in parliament and have a strong record of stitching together coalitions to keep outsiders from ultimate power. They may see Ghising as too independent and prefer to reinstall one of their own after elections."
                },
                {
                    "factor": "Ghising’s ministerial role and lack of party base",
                    "effect": "Decreases probability. Ghising is a technocrat with no significant party machinery or parliamentary bloc behind him. While he is in the interim cabinet, this does not automatically translate to the top job in the post-caretaker government."
                }
            ],
            "no_scenario": "The March 2026 elections are held on schedule. Traditional parties (or a new coalition including Gen Z-aligned independents) form a government. The new non-caretaker prime minister is a career politician—perhaps from the Nepali Congress, UML, Maoist Centre, or a prominent Gen Z-aligned political leader. Ghising remains a respected technocrat but does not become PM.",
            "yes_scenario": "Unforeseen upheaval or deadlock occurs: the caretaker period is extended, or no party can form a stable government after elections. Public pressure or a renewed Gen Z protest wave demands a non-partisan, clean figure—leading to a cross-partisan deal to install Ghising as PM. Alternatively, a new party or electoral alliance centered on technocratic governance sweeps in and nominates Ghising to signal a break with the past.",
            "final_reasoning": "While Kulman Ghising was mentioned as a contender during the post-Oli caretaker negotiations and is now a high-profile minister, there is no evidence from the news or Nepal’s political history that such technocrats are often elevated to the PM role except in severe deadlock. The caretaker government led by Sushila Karki is explicitly temporary, and all reporting suggests the next PM will be chosen after scheduled elections in March 2026. Nepal’s party system, though shaken, is still resilient; major parties are unlikely to cede the premiership to a non-party technocrat unless extraordinary instability persists. Ghising’s popularity and Gen Z support are real but may be insufficient to overcome party resistance, especially given his lack of a parliamentary base. The status quo outcome is that a party leader or prominent political figure, not Ghising, becomes Nepal’s next non-caretaker prime minister. However, I assign a non-zero probability because of the ongoing volatility and the unique post-protest context, which could still produce an unusual consensus candidate if parties are deadlocked or wish to appease public anger.",
            "final_probability": 6
        },
        "Political Science (Parliamentary Democracy Nepal)": {
            "time_to_resolution": "Approximately 2.5 months (from October 13, 2025, to before January 1, 2026)",
            "perspective_relevance": "As an expert in Political Science with a focus on Nepal's parliamentary democracy, I am able to contextualize the country's institutional norms, elite bargaining dynamics, constitutional constraints, and the evolving influence of youth-led movements. My perspective is shaped by familiarity with both the formal procedures of government formation and the informal power-broking that often determines outcomes in Nepal’s volatile multi-party system, especially in crisis transitions following mass protests.",
            "status_quo": "The current status quo is that Sushila Karki, a former Chief Justice, is serving as interim (caretaker) Prime Minister following KP Sharma Oli’s resignation after mass Gen-Z-led protests. Karki’s caretaker government is tasked with conducting elections scheduled for March 2026. Kulman Ghising is currently serving as a minister (not as Prime Minister) in the interim government, holding multiple portfolios. No non-caretaker (full mandate) Prime Minister has been appointed since Karki, and the system is expected to move to a regular government only after elections.",
            "perspective_derived_factors": [
                {
                    "factor": "Constitutional and Procedural Constraints",
                    "effect": "Decreases probability. Nepal’s constitution is explicit about the process for appointing a non-caretaker PM: After elections, the leader of the majority (or largest) party/formal coalition is invited to form a government and must win a confidence vote. The current interim government is not intended to transition into a full government except in extreme breakdown. Ghising, as an interim minister, is not positioned constitutionally to become PM unless there is extraordinary consensus or crisis."
                },
                {
                    "factor": "Political Elite Preferences and Power Structures",
                    "effect": "Decreases probability. Ghising is a technocrat and popular among youth, but he lacks a strong political party base, established parliamentary faction, or history as a party leader. Nepal’s major parties (NC, UML, Maoist Centre) are likely to revert to their own leadership or established politicians when forming the next regular government. Elite actors may exploit Ghising’s popularity but rarely cede executive power to technocrats unless under duress."
                },
                {
                    "factor": "Gen-Z Protest Movement Influence",
                    "effect": "Slightly increases probability. The unprecedented influence of the Gen-Z protest movement has already forced a caretaker government led by a compromise outsider (Karki) and elevated figures like Ghising into the cabinet. If the youth movement retains its organizational coherence and electoral strength, it could play kingmaker or even launch a new political force, possibly creating an opening for Ghising in a non-traditional coalition."
                },
                {
                    "factor": "Public Perception and Popularity of Kulman Ghising",
                    "effect": "Slightly increases probability. Ghising enjoys immense popularity for ending load-shedding and is seen as a symbol of effectiveness and anti-corruption. If major parties or an emergent Gen-Z party decide to capitalize on his image, he could be positioned as a consensus candidate—especially in a hung parliament or in a situation with continued mass mobilization."
                },
                {
                    "factor": "Party System Fragmentation and Electoral Outcomes",
                    "effect": "Neutral to slightly increases probability. If the elections produce a fragmented parliament with no clear majority, and the Gen-Z/protest movement’s parliamentary strength is significant but not dominant, there could be an elite impasse that results in a compromise outsider (like Ghising) being advanced as a unity candidate. However, this is still historically rare."
                }
            ],
            "no_scenario": "After the March 2026 elections, the established parties (NC, UML, Maoist Centre, etc.) negotiate and select one of their own as Prime Minister, as has been the norm in Nepali history. Ghising, while a respected interim minister, is not advanced as a candidate by any major coalition or lacks the parliamentary numbers to be considered. The Gen-Z movement’s influence wanes or is absorbed into existing parties, and the political elite close ranks around traditional leadership.",
            "yes_scenario": "Kulman Ghising is propelled by a strong showing of Gen-Z-aligned candidates in the parliamentary elections, and/or a continued wave of anti-establishment sentiment. With no party able to form a majority and intense public pressure for a technocratic/clean government, major parties back Ghising as a consensus/unity candidate to end deadlock and restore legitimacy. He is then invited by the President to form a government and wins the confidence vote, becoming the non-caretaker Prime Minister.",
            "final_reasoning": "While Kulman Ghising is popular and currently holds a senior position in the caretaker cabinet, there is no precedent in Nepal for a technocrat without a strong party base to become non-caretaker Prime Minister immediately after such a crisis. The constitutional process and elite interests overwhelmingly favor established party leaders. The Gen-Z movement is a disruptive force, but unless it transforms into a powerful parliamentary bloc or forges a cross-party consensus, Ghising’s path to the premiership is highly uncertain. Base rates for technocrats ascending to the premiership in Nepal are near zero; even during times of crisis, caretaker appointments have not translated into full mandates. However, the current volatility and Ghising’s unique popularity provide a non-negligible chance—higher than in ordinary times—that an outsider could be elevated if the elite are paralyzed and public pressure remains extreme. All things considered, the probability is still quite low, given structural constraints.",
            "final_probability": 7
        },
        "Political Science (Coalition Politics Theories)": {
            "time_to_resolution": "About 2.5 months (question resolves between September 11, 2025 and January 1, 2026; today is October 13, 2025)",
            "perspective_relevance": "As a political scientist specializing in coalition politics theories, I analyze how party systems, protest movements, and institutional rules influence elite bargains and coalition formation in transitional moments. Nepal's current government crisis is an archetype of rapid, extra-institutional change driven by mass mobilization, with coalition-building among fragmented protest factions, parties, and the military. My expertise is particularly relevant for evaluating the likelihood of relatively 'outsider' candidates like Kulman Ghising being elevated to executive office, given the interplay of elite interests, protest legitimacy, and constitutional rules.",
            "status_quo": "Sushila Karki is the caretaker prime minister, heading a transitional government with a mandate to hold elections by March 2026. Ghising is currently a minister (not PM). The status quo is for the next non-caretaker PM to be chosen by elite negotiation after elections, typically a party leader or major political figure—NOT a technocratic or protest-backed outsider like Ghising.",
            "perspective_derived_factors": [
                {
                    "factor": "Elite Bargaining and Party System Inertia",
                    "effect": "Decreases probability. Nepal's history shows that, despite protest-driven transitions, established party leaders (from UML, Nepali Congress, Maoists, etc.) usually regain control after caretaker periods. Outsiders like Ghising lack party machines and parliamentary blocs to form a government unless a coalition deliberately breaks precedent."
                },
                {
                    "factor": "Protest Legitimacy and Social Movement Pressure",
                    "effect": "Slightly increases probability. The Gen-Z movement has demonstrated rare strength, toppling a government and influencing caretaker selections. If electoral outcomes or continued unrest push mainstream parties to make a symbolic break from the past, outsider technocrats could be elevated as compromise figures."
                },
                {
                    "factor": "Ghising's Reputation and Political Capital",
                    "effect": "Slightly increases probability. Ghising's track record (ending load-shedding, technocratic competence) and his popularity among Gen-Z activists give him more credibility than typical technocrats. He was a serious candidate for the interim PM, and his profile is unusually high for a non-politician."
                },
                {
                    "factor": "Constitutional and Institutional Constraints",
                    "effect": "Decreases probability. Prime ministers must command a majority in the House of Representatives and withstand confidence votes. Unless Ghising runs and wins as an MP, or parties nominate him and whip MPs to support him post-election, he remains an unlikely choice."
                },
                {
                    "factor": "Caretaker Government Mandate and Election Timetable",
                    "effect": "Decreases probability. The interim government is explicitly mandated to hold elections. Historically, after such transitions, mainstream parties reassert themselves during parliamentary government formation."
                },
                {
                    "factor": "Factionalism and Protest Fragmentation",
                    "effect": "Decreases probability. News reports consistently mention Gen-Z protester infighting and lack of unity. This reduces the protest bloc's ability to coalesce behind a single non-traditional candidate like Ghising in the post-election bargaining."
                }
            ],
            "no_scenario": "Following the March 2026 elections, mainstream parties (Nepali Congress, UML, Maoists, etc.) negotiate a new coalition government. The next non-caretaker PM is a party leader or established politician (e.g., Gagan Thapa, Balen Shah, Prachanda, or another mainstream/party-backed figure). Ghising remains a respected technocrat but does not become PM.",
            "yes_scenario": "The Gen-Z protest movement maintains enough momentum to significantly shape post-election coalition talks, either by winning a substantial bloc of parliamentary seats or by extracting a commitment from major parties to nominate a non-traditional leader. Parties, seeking legitimacy and calm, coalesce around Ghising as a compromise, and he wins a confidence vote to become the next non-caretaker PM.",
            "final_reasoning": "While Kulman Ghising is unusually prominent for a technocrat, and was briefly considered for the interim PM post, Nepal's political system remains dominated by party-based coalition-building. The Gen-Z movement, despite its success in toppling the Oli government and shaping the caretaker cabinet, has not demonstrated the organizational unity or parliamentary base required to secure the premiership for a figure like Ghising post-election. Historical base rates for technocrats or outsiders becoming PM in Nepal are extremely low. Coalition politics theory suggests that, after mass mobilization subsides, power usually returns to party elites with institutional resources. The status quo, and historical precedent, both strongly favor a mainstream party leader assuming the PM role after elections. While a non-zero chance exists if protests re-escalate or if mainstream parties seek to co-opt the movement with a symbolic outsider, the odds remain very low.",
            "final_probability": 5
        },
        "Political Science (Leadership Selection Party Politics)": {
            "time_to_resolution": "Approximately 2.5 months (until January 1, 2026).",
            "perspective_relevance": "As an expert in Political Science with a focus on party politics and leadership selection, I am uniquely positioned to interpret how protest-driven regime change, elite negotiations, institutional constraints, and popular legitimacy shape succession outcomes in Nepal's volatile post-crisis context. My approach combines the analysis of party system dynamics, elite coordination problems, constitutional/legal constraints, and the importance of technocratic legitimacy after mass mobilization.",
            "status_quo": "The status quo, established as of September 2025, is that Sushila Karki, a former chief justice, is serving as caretaker (interim) prime minister, with Kulman Ghising appointed as a key minister (Energy, Infrastructure, Urban Development). Elections are scheduled for March 2026, and the next non-caretaker PM will be whoever forms a government and secures a confidence vote after the elections.",
            "perspective_derived_factors": [
                {
                    "factor": "Technocratic Legitimacy Post-Protest",
                    "effect": "Increases probability for Ghising. After a legitimacy crisis and youth-driven protests, candidates seen as effective, non-partisan technocrats (like Ghising, credited with ending electricity shortages) often gain public and elite support as compromise PMs."
                },
                {
                    "factor": "Party System Fragmentation and Elite Coordination",
                    "effect": "Decreases probability for Ghising. Nepal's party system is fragmented, with established parties attempting to reassert control. Ghising lacks an established party base, making elite coordination around his candidacy less likely unless a consensus or grand coalition emerges."
                },
                {
                    "factor": "Gen Z Movement Influence",
                    "effect": "Slightly increases probability for Ghising. The Gen Z protest movement catalyzed regime change and is pushing for new faces, giving Ghising a support base. However, their influence may wane as party politics reasserts itself post-crisis."
                },
                {
                    "factor": "Constitutional and Institutional Constraints",
                    "effect": "Neutral to slightly negative. There were early disputes about legal eligibility (e.g., for Karki as a former justice), but nothing in the reporting suggests Ghising faces such constitutional barriers."
                },
                {
                    "factor": "Base Rate of Technocrat PMs in Nepal",
                    "effect": "Decreases probability. Historically, Nepal's PMs come from established party leadership rather than technocrats or independents, especially after elections."
                },
                {
                    "factor": "Status Quo Bias & Election Outcomes",
                    "effect": "Decreases probability. Unless Ghising is adopted as a party's PM candidate and that party wins or shapes a coalition, the default is a return to established party leaders. The status quo favors continuity with established political actors."
                }
            ],
            "no_scenario": "Following the March 2026 elections, established party leaders such as those from the Nepali Congress, CPN-UML, or the Maoist Centre negotiate a coalition and nominate a veteran party leader as PM. Ghising, though popular and a competent technocrat, does not have a party apparatus and is not selected as the PM candidate. He may remain a minister or take a technocratic advisory role.",
            "yes_scenario": "A post-election deadlock leads to a demand for a compromise, particularly if the Gen Z movement maintains public pressure. Major parties fail to agree on a leader, and Ghising, as a widely respected technocrat with broad public appeal, is proposed as a consensus candidate, possibly as an outsider PM in a caretaker or unity government. He is nominated, takes the oath, and secures a vote of confidence.",
            "final_reasoning": "While Kulman Ghising is clearly respected for his technocratic accomplishments and was under consideration as an interim PM candidate, all news coverage indicates that he is currently an interim minister, not the PM. The constitutional and political process in Nepal almost always results in a party leader (with a parliamentary base) taking the PM post after elections. The Gen Z movement's influence, while significant in toppling the previous government, is likely to recede as traditional party politics and elite coalition-building come back to the fore. Ghising lacks a party base and is not publicly identified as the PM candidate for any major party or new, electorally viable movement. Unless there is an extraordinary deadlock or crisis where all parties agree to an outsider, the status quo and base rate strongly favor a party politician. Thus, despite his popularity and interim ministerial role, the probability of Ghising becoming the next non-caretaker prime minister is low, but not zero given the unpredictable post-crisis context.",
            "final_probability": 10
        },
        "South Asian Studies (Nepalese Political History)": {
            "time_to_resolution": "About 2.5 months remain until the closing window (Jan 1, 2026), with the next non-caretaker PM to be sworn in after September 11, 2025 and before Jan 1, 2026.",
            "perspective_relevance": "As a specialist in Nepalese political history, I can contextualize the relative novelty of the current Gen-Z-led mass mobilization and its impact on established elite power-sharing structures. I bring an understanding of the patterns of interim and post-crisis government formation in Nepal since 1990, the roles of technocrats versus established party leaders, the influence of the military and president during breakdowns, and the way street movements are (or are not) translated into durable political appointments.",
            "status_quo": "The status quo is that Sushila Karki is the caretaker PM, with a technocratic, Gen-Z-endorsed cabinet (including Kulman Ghising as energy and infrastructure minister), and the administration is tasked with holding elections by March 2026. Historically, after such caretaker governments, the next non-caretaker PM is almost always a leader from a major political party, usually as a result of parliamentary elections.",
            "perspective_derived_factors": [
                {
                    "factor": "Base Rate: Technocrats and Ministers Becoming PM after Caretaker Interregnums",
                    "effect": "Decreases probability. In Nepal, and in the region more broadly, career technocrats and ministers in caretaker cabinets very rarely become the next non-caretaker PM. Power almost always reverts to major party figures after elections or negotiated settlements."
                },
                {
                    "factor": "Ghising's Popularity and Gen-Z Backing",
                    "effect": "Slightly increases probability. Ghising is a rare technocrat-celebrity, credited with solving load-shedding, and has clear support among some Gen-Z activists, which could translate into political capital if new parties/coalitions form around the protest movement."
                },
                {
                    "factor": "Entrenched Party Structures and Electoral Realities",
                    "effect": "Strongly decreases probability. Despite the anti-party mood, Nepalese elections are highly structured around established parties (UML, Nepali Congress, Maoist Centre). Electoral systems, even when disrupted, tend to favor organized party machines, especially when the military and president want stability."
                },
                {
                    "factor": "Potential for Major Political Realignment or Collapse of Old Parties",
                    "effect": "Moderately increases probability. If the Gen-Z revolt leads to the formation of a new dominant party or coalition, or if established parties are delegitimized and collapse, Ghising could emerge as a compromise technocrat PM (especially if he forms or leads a new party). This would be unprecedented but not impossible."
                },
                {
                    "factor": "Role of Army and President in Backing Transition",
                    "effect": "Neutral to slightly decreases probability. Both have shown willingness to 'listen' to protest movements but have so far acted to preserve continuity. They pushed for, and got, a caretaker technocrat (Karki) but not a revolutionary break."
                },
                {
                    "factor": "Historical Patterns after Mass Protest Interregnums (e.g., 2006, 2015)",
                    "effect": "Decreases probability. Even after major protest waves, the next PMs have always been established politicians, not protest leaders or technocrats elevated from interim governments."
                }
            ],
            "no_scenario": "After the caretaker period and elections (scheduled for March 2026), the new House of Representatives meets, and a major party (likely Nepali Congress, UML, or Maoist Centre, or a coalition thereof) forms a government. The new PM is a party leader (e.g., Sher Bahadur Deuba, Pushpa Kamal Dahal, or a new face from the major parties). Ghising either returns to the NEA or remains a minor political figure.",
            "yes_scenario": "The Gen-Z movement coalesces into a new party or electoral alliance, sweeping the elections on an anti-corruption, anti-elite platform. Ghising, as a respected technocrat with cross-partisan popularity and a record of public service, is chosen as the new PM—either by leading this movement or as a compromise figure acceptable to a broad anti-elite coalition.",
            "final_reasoning": "The base rate for a technocrat or caretaker minister like Kulman Ghising becoming the next full (non-caretaker) PM of Nepal is extremely low, even after mass protests. Historically, power returns to established party leaders after crisis caretaker periods, especially after elections. Ghising's popularity and Gen-Z backing modestly raise his chances, but the entrenched party system, electoral rules, and the tendency of the army/president to seek stability make his ascent highly improbable. The only plausible path is if the Gen-Z movement fully supplants the old parties and installs him as a compromise or movement leader, but there is no evidence so far that such a complete realignment is underway—indeed, party leaders are already returning to public life and negotiations. Thus, while Ghising is a key player in the interim cabinet and a possible long-term political contender, the probability that he is the next non-caretaker PM before Jan 1, 2026 is very low.",
            "final_probability": 5
        },
        "South Asian Studies (Regional Power Dynamics South Asia)": {
            "time_to_resolution": "Approximately 2.5 months (from October 13, 2025, to January 1, 2026)",
            "perspective_relevance": "As an expert in South Asian Studies specializing in Nepalese politics and regional power dynamics, I understand the interplay between Nepal’s political factions, civil-military relations, the influence of youth-led (Gen-Z) movements, and the historical pattern of technocrats or non-partisan figures rising during moments of upheaval. My perspective allows me to interpret not just formal political developments but also the informal and societal factors—such as legitimacy among protestors and buy-in from entrenched elites and the military—that shape outcomes in times of crisis.",
            "status_quo": "The status quo is that Sushila Karki is serving as caretaker prime minister, with a technocratic interim cabinet (including Kulman Ghising as minister), and elections are scheduled for March 2026. Historically, in Nepal, caretaker governments rarely see their ministers immediately elevated to the premiership; power usually reverts to established political elites or is shared via coalition agreements post-election.",
            "perspective_derived_factors": [
                {
                    "factor": "Kulman Ghising’s Non-Political/Technocratic Profile",
                    "effect": "Decreases probability slightly. While Ghising is highly respected for resolving energy crises and has credibility with the Gen-Z movement, he lacks a political party base, which is essential to win a parliamentary confidence vote and secure the premiership beyond a caretaker role."
                },
                {
                    "factor": "Gen-Z Protest Movement Influence",
                    "effect": "Increases probability moderately. The Gen-Z movement has proven its ability to topple a government and secure appointments for favored figures, including Ghising. If this energy is sustained through elections or coalition negotiations, Ghising could emerge as a consensus or protest-backed candidate."
                },
                {
                    "factor": "Military and Elite Buy-In",
                    "effect": "Decreases probability. The military and established political elites have so far accepted Karki as caretaker PM and are likely to prefer stability and continuity post-elections. Ghising’s lack of elite/political connections makes his premiership less likely unless there is another major disruption."
                },
                {
                    "factor": "Upcoming Elections and Parliamentary Arithmetic",
                    "effect": "Decreases probability. The system requires a PM to command a majority in the House. Unless a new youth-led party sweeps the polls or Ghising is adopted as a compromise candidate by a fractured parliament, it is unlikely he will be chosen."
                },
                {
                    "factor": "Public Image and Crisis Legitimacy",
                    "effect": "Increases probability slightly. Ghising’s public image as a corruption-free, effective administrator could sway a fragmented parliament or be leveraged in coalition bargaining if protest sentiment remains high."
                },
                {
                    "factor": "Recent Appointments and Precedent",
                    "effect": "Decreases probability. Ghising has been given a powerful ministerial portfolio but not the premiership even in this extraordinary transition, suggesting elites see him more as an asset than as a leading figure."
                }
            ],
            "no_scenario": "After the March 2026 elections, established political parties (likely the Nepali Congress, CPN-UML, or a coalition) form a government. The parliament selects a leader from their own ranks or a compromise candidate with elite and military support. Ghising either returns to a technocratic role or remains an influential minister but does not become PM.",
            "yes_scenario": "Either (a) a new youth-led or reformist coalition wins a surprising number of seats and, needing a corruption-free public face, rallies around Ghising as a unity candidate; or (b) a severe post-election deadlock or crisis prompts parliament and the president to appoint Ghising as a consensus PM to appease protestors and restore order, with all major factions agreeing to his leadership.",
            "final_reasoning": "Base rates in Nepal strongly favor established party figures or those with significant backing from the core political or military elite for the premiership, especially after elections. While the Gen-Z movement is unprecedented in its scale and has succeeded in influencing the caretaker government, Ghising’s lack of a political base and the structure of Nepal’s parliamentary system are major barriers. His appointment as minister signals respect and utility, but not necessarily a path to the top post. The only plausible path to a Yes is if the protest movement fundamentally reshapes parliamentary arithmetic or if another crisis leads to his selection as a compromise, which, while not impossible, is unlikely given elite incentives and historical patterns. Therefore, the probability should be low but not zero—higher than pure base rate due to recent upheaval and his popularity, but still reflecting strong systemic headwinds.",
            "final_probability": 7
        }
    },
    "deliberation_probability": [
        3,
        5,
        5,
        6,
        7,
        5,
        10,
        5,
        7
    ],
    "deliberation_mean_probability": 5.888888888888889,
    "deliberation_sd": 1.9649710204252657,
    "deliberation_probability_result": 6,
    "group_results": {
        "comparativePoliticsAnalystCabinetFormationProcess": {
            "forecaster_to_engage": "Political Science (Leadership Selection Party Politics)",
            "response_type": "critique",
            "response": "Ten percent? That's wildly optimistic. You concede in your own reasoning that Ghising lacks a party base, is not the PM candidate for any viable movement, and that Nepalese PMs are almost always party leaders with parliamentary clout—especially post-crisis when traditional party machines reassert themselves. The Gen-Z movement's influence is real, but it's already receding into the background as elite coalition-building resumes. There is no evidence that any party or significant parliamentary bloc is preparing to back Ghising, nor that the Gen-Z movement is becoming a party in time for this cycle. In fact, Karki's appointment as caretaker PM was a classic consensus move to defuse protests, not a harbinger of technocratic government. The base rate for non-party technocrats making the leap to PM is much closer to zero than 10%. You're letting the exceptional circumstances of the protests seduce you into overestimating the probability of a true outsider leapfrogging entrenched party leadership. Put simply: Nepalese politics doesn't change that fast, and your probability should reflect that."
        },
        "comparativePoliticsAnalystEliteBargainingAnalysis": {
            "forecaster_to_engage": "Political Science (Leadership Selection Party Politics)",
            "response_type": "critique",
            "response": "A 10% probability for Ghising? That's a serious stretch. By your own admission, Nepal's system is deeply party-centric, and technocrats, no matter how popular or competent, simply don't get parachuted into the PM's office unless the party system utterly collapses—something that hasn't happened here. Sure, the Gen-Z movement shook things up, but as the dust settles, all signs point to business as usual: party leaders jockeying for power post-election. Ghising is a capable minister, but without a party machine behind him or even a parliamentary seat, his chances are a rounding error above zero. You're overweighting the protest mood and undervaluing the gravitational pull of party politics and elite bargaining. History, institutions, and the current elite consensus all stack the deck against him. If you want to be bold, fine—but 10% is bravado, not analysis."
        },
        "nepalPoliticalJournalismPoliticalPartyLeadershipTracking": {
            "forecaster_to_engage": "Nepal Political Journalism (Electoral Trends Nepal)",
            "response_type": "defense",
            "response": "This is one of the sharpest, most balanced takes in the group. You correctly anchor your reasoning in base rates and Nepal's persistent party system, while also acknowledging that the post-protest volatility and Gen Z's outsized influence modestly raise the odds above zero. Your recognition that Ghising's popularity and visibility make him a plausible emergency consensus pick—but only in the event of an extraordinary deadlock—demonstrates a nuanced grasp of both Nepalese electoral realities and the limits of technocratic outsider appeal. You avoid the common pitfall of over-extrapolating from recent unrest, and your probability assignment (6%) reflects a careful blend of historic precedent and current political turbulence. Well done for resisting wishful thinking and providing a sober, data-driven forecast."
        },
        "nepalPoliticalJournalismElectoralTrendsNepal": {
            "forecaster_to_engage": "Political Science (Parliamentary Democracy Nepal)",
            "response_type": "critique",
            "response": "You assign a 7% probability to Kulman Ghising becoming the next non-caretaker PM, which is marginally higher than most, but your justification leans on the notion that 'volatility' and 'unique popularity' could override Nepal's entrenched party machinery. That’s wishful thinking masquerading as risk balancing. The Gen-Z movement's disruptive force is undeniable, but unless it converts into a durable electoral bloc or Ghising suddenly becomes the rallying figure for a real parliamentary coalition, this is all theoretical. The Nepali system is built to absorb shocks and then return power to those with actual seats, party infrastructure, and coalition-making ability. You cite 'non-negligible' outsider odds due to volatility, but the evidence doesn’t support such a bump—Ghising’s appointment to a powerful ministry is already the system’s way of appeasing protestors without ceding real power. The base rate for technocrats becoming PM in Nepal is so close to zero that 7% is still a soft overstatement."
        },
        "politicalScienceParliamentaryDemocracyNepal": {
            "forecaster_to_engage": "South Asian Studies (Regional Power Dynamics South Asia)",
            "response_type": "defense",
            "response": "This forecast nails the structural realities of Nepali politics. You rightly stress that, while the Gen-Z movement is unprecedented, Nepal’s party system and elite incentives have always snapped back after temporary concessions to mass protest. The recognition that Ghising’s ministerial appointment is a gesture of respect—NOT an on-ramp to the premiership—is crucial, and your scenario analysis for a 'Yes' outcome is properly framed as an improbable, crisis-induced consensus. You resist the temptation to indulge in the hype around Ghising’s popularity, instead rooting your forecast in the actual mechanics of parliamentary politics, the power of established parties, and the president’s and army’s interest in stability. The 7% probability is a realistic nod to the exceptional context but not a surrender to sensationalism. This is the sort of sober, comparative, and historically-aware reasoning that should anchor this contest."
        },
        "politicalScienceCoalitionPoliticsTheories": {
            "forecaster_to_engage": "South Asian Studies (Nepalese Political History)",
            "response_type": "defense",
            "response": "This is one of the most disciplined, historically literate forecasts in the field. You correctly anchor your reasoning in Nepal's deep structural tendency to revert to party-based leadership after crisis, even when protest movements force temporary or cosmetic concessions. You also deftly recognize that Ghising's popularity and Gen-Z backing make him a relevant interim figure, but not a likely PM—unless the protest movement achieves a total and unprecedented realignment of political power, which there is no evidence for. Your scenario construction is solid, mapping the only plausible Ghising-as-PM pathway as something close to regime rupture, not mere instability. The 5% probability is not only conservative, but well-calibrated to the real odds given the base rate of technocrats becoming PM in Nepal. This is the kind of forecast that keeps the group grounded against emotional overreaction to news cycles."
        },
        "politicalScienceLeadershipSelectionPartyPolitics": {
            "forecaster_to_engage": "Comparative Politics Analyst (Elite Bargaining Analysis)",
            "response_type": "defense",
            "response": "Absolutely spot-on. Your analysis cuts through the hype about Ghising's popularity and the Gen-Z movement, getting right to the core of Nepal's enduring political logic: party elites, coalition calculus, and institutional inertia. You correctly point out that, absent a total party system collapse—which simply hasn't happened—no technocrat, however beloved, is going to leapfrog into the PM's chair. You also appropriately give a nod to the Gen-Z movement as a marginal, not transformative, factor in elite bargaining. Your probability is neither nihilistically zero nor indulgently high; it's a precise reflection of the razor-thin odds for a non-party technocrat in a system designed to keep power in the hands of those with parliamentary muscle. This is the kind of clear-eyed, history-grounded reasoning the field needs."
        },
        "southAsianStudiesNepalesePoliticalHistory": {
            "forecaster_to_engage": "Comparative Politics Analyst (Cabinet Formation Process)",
            "response_type": "defense",
            "response": "Your argument is a textbook example of disciplined comparative politics. You ground Ghising's chances in the historical record of Nepalese and regional cabinet formation, where technocrats and caretaker cabinet ministers almost never ascend to the full premiership after crisis interregnums. You also rightly identify that the Gen-Z movement's influence, while real in toppling Oli and shaping the caretaker setup, is already facing internal fissures and lacks the organization to push a non-party figure like Ghising into the top job. By emphasizing the base rate and the constitutional and coalition constraints, you steer clear of the wishful thinking that often creeps in after dramatic protest movements. Your low probability is justified—the only conceivable path for Ghising is a truly extraordinary realignment, which the news and historical patterns both argue against. This is a sharp, methodical, and sober forecast that sets the standard for the group."
        },
        "southAsianStudiesRegionalPowerDynamicsSouthAsia": {
            "forecaster_to_engage": "Comparative Politics Analyst (Elite Bargaining Analysis)",
            "response_type": "defense",
            "response": "This is the model of a rigorous, base-rate-driven forecast. You anchor your reasoning in Nepal's entrenched party-based parliamentary system and the reality that technocrats—even wildly popular ones like Ghising—almost never make the leap to PM absent a near-total elite collapse. Your recognition of the Gen-Z movement's role is properly calibrated: it modestly raises the odds above zero, but not by much, since street power rarely translates into decisive parliamentary leverage in Nepal. You also accurately highlight that elite bargaining and coalition-building are likely to revert to form post-crisis, as history has repeatedly shown. Your probability assignment is neither fatalistic nor swayed by protest euphoria; it's a disciplined reflection of structural constraints and political precedent. This is the kind of analysis that separates clear-eyed forecasting from wishful thinking."
        }
    },
    "revision_results": {
        "Comparative Politics Analyst (Cabinet Formation Process)": {
            "my_phase1_final_probability": 3,
            "reasoning_for_revised_probability": "The group discussion reinforced my initial assessment: all forecasters with relevant expertise agree that the probability of Kulman Ghising becoming the next non-caretaker PM of Nepal before Jan 1, 2026 is very low, with estimates clustering between 3% and 10%. Critiques of higher probabilities (e.g., 10%) were persuasive, emphasizing that despite exceptional Gen-Z protests and Ghising's popularity, Nepal's entrenched party system, elite bargaining patterns, and the base rate for technocrats achieving the premiership remain decisive obstacles. No new evidence emerged in group deliberation to suggest that the Gen-Z movement is coalescing around Ghising as a PM candidate or that party elites are preparing to break precedent. The convergence of expert opinion on a low probability, and the lack of any compelling scenario in which Ghising overcomes institutional constraints, justify maintaining my original estimate.",
            "revised_probability": 3
        },
        "Comparative Politics Analyst (Elite Bargaining Analysis)": {
            "my_phase1_final_probability": 5,
            "reasoning_for_revised_probability": "The group deliberation reinforced my initial analysis: all forecasters agree that the base rate for a technocrat like Ghising ascending to non-caretaker PM is extremely low. The only dissenting view (10%) was widely critiqued as overestimating the effect of protest-driven volatility and underappreciating Nepal’s entrenched party system. The most credible scenario for Ghising is as a respected minister, not as PM. No new evidence or argument emerged in the group phase to justify raising (or even sustaining) a higher probability. The consensus and my own elite bargaining perspective both point to a very low, but nonzero, chance.",
            "revised_probability": 5
        },
        "Nepal Political Journalism (Political Party Leadership Tracking)": {
            "my_phase1_final_probability": 5,
            "reasoning_for_revised_probability": "Having reviewed the group deliberation and other forecasters' arguments, my initial assessment holds strong. The consensus is overwhelming: the base rate for a technocrat or outsider like Ghising becoming the next non-caretaker PM in Nepal is extremely low, given the dominance of party politics and elite coalition bargaining. My own critique of higher probabilities (e.g., 10%) stands reinforced—there is simply no evidence of a breakdown in party control or of a realignment powerful enough to propel Ghising to the premiership before January 2026. The few percentage points above zero are justified solely by the exceptional recent volatility and the remote possibility of another major crisis. My probability remains unchanged.",
            "revised_probability": 5
        },
        "Nepal Political Journalism (Electoral Trends Nepal)": {
            "my_phase1_final_probability": 6,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I see broad consensus among domain experts and comparative politics analysts that the base rate for a technocrat like Ghising ascending to PM is extremely low, even in the wake of extraordinary protest-driven volatility. The critiques of higher forecasts are compelling: the party system's resilience, lack of evidence for an emergent pro-Ghising parliamentary coalition, and the system's tendency to absorb protest shocks without ceding top executive power to outsiders. My initial probability was already cautious, reflecting both historical precedent and modest allowance for volatility. However, seeing the strong convergence toward the 3-7% range and the lack of new evidence for a further realignment, I am persuaded to lower my estimate slightly to better reflect the structural constraints and to avoid overestimating the impact of recent unrest. I now assess that even 6% may overweight the chance of a true outsider breakthrough in this time window.",
            "revised_probability": 4
        },
        "Political Science (Parliamentary Democracy Nepal)": {
            "my_phase1_final_probability": 7,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I see strong consensus among comparative politics, journalism, and area studies experts that the probability for Kulman Ghising is extremely low—almost universally pegged at 3-7%, with only one outlier at 10% (which was robustly critiqued for overestimating outsider chances). The arguments emphasize the resilience of Nepal’s party-centric parliamentary system, the absorption of protest energy into temporary concessions, and the lack of credible evidence for Ghising's emergence as a unity or party-backed candidate in the post-election scenario. The most compelling critiques reinforce that Ghising's current cabinet role is the political system's way of channeling protester sentiment without fundamentally shifting elite power dynamics. My original probability (7%) was already at the upper end of the group’s credible range, justified by acknowledging unusual volatility but not ignoring the core institutional barriers. Given this, and seeing no new evidence to increase the odds, I will slightly lower my estimate to align with the modal consensus and the best arguments given, especially from the comparative politics and journalism specialists.",
            "revised_probability": 5
        },
        "Political Science (Coalition Politics Theories)": {
            "my_phase1_final_probability": 5,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, my initial probability of 5% remains well-justified and in line with the consensus among specialists in comparative politics, Nepalese political journalism, and South Asian studies. The critiques of higher estimates (notably the 10% forecast) reinforce the point that Nepal's party-based system and coalition logic make a technocrat like Ghising an extreme long shot for the non-caretaker premiership, even in the current post-protest context. The defense of forecasts in the 5-7% range highlights the importance of the base rate and the resilience of elite-driven coalition formation in Nepal. No forecaster provided compelling new evidence or scenarios that would warrant an upward revision. The Gen-Z movement's disruptive power is acknowledged but appears insufficient for a true outsider breakthrough. Thus, my probability remains unchanged.",
            "revised_probability": 5
        },
        "Political Science (Leadership Selection Party Politics)": {
            "my_phase1_final_probability": 10,
            "reasoning_for_revised_probability": "Group deliberation reinforced the conservative, base-rate-driven approach to this question. Multiple forecasters, including those with deep expertise in comparative politics, coalition theory, and Nepalese history, all converged on extremely low probabilities (3-7%) for Ghising, and their arguments were well-supported by both historical precedent and the structural realities of Nepal's parliamentary system. Critiques of my original 10% highlighted that I may have overestimated the lasting influence of the Gen-Z protest movement and underweighted the gravitational pull of party politics and elite bargaining. The consensus is that technocrats, even in the wake of mass protest, have almost never become non-caretaker PMs in Nepal or similar systems. While my scenario analysis for a Yes outcome remains theoretically possible, it is now clear that the real odds are closer to the 3-6% range, and my original estimate was too high. I am revising downward accordingly.",
            "revised_probability": 5
        },
        "South Asian Studies (Nepalese Political History)": {
            "my_phase1_final_probability": 5,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I find strong consensus across comparative politics, Nepal political journalism, and regional studies experts that the base rate for a technocrat like Ghising becoming Nepal's next non-caretaker PM is extremely low. Multiple forecasters articulated—in even starker terms than my own forecast—that the structural and historical constraints are overwhelming, and that even the current volatility and Gen-Z influence are unlikely to break the entrenched party system. The highest probability assigned by any serious, data-driven forecaster was 10%, and most clustered in the 3-7% range, with clear arguments that even this is generous. No new evidence or scenario was raised to increase the likelihood of a 'Yes' outcome. If anything, the group process reinforced that my initial probability was, if anything, already slightly generous given the extreme base-rate headwinds. Accordingly, I will leave my forecast unchanged at 5%.",
            "revised_probability": 5
        },
        "South Asian Studies (Regional Power Dynamics South Asia)": {
            "my_phase1_final_probability": 7,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I find that the consensus among experts in comparative politics, political science, and Nepalese journalism strongly reinforces the structural barriers against Kulman Ghising becoming Nepal's next non-caretaker PM. Multiple forecasters, including those focused on cabinet formation and elite bargaining, emphasize the importance of Nepal’s entrenched party system and the almost negligible historical base rate for technocrats without a parliamentary base to ascend to the premiership. Critiques of higher probabilities (such as 10%) are persuasive and highlight the lack of evidence for a true party-system collapse or transformative Gen-Z political organization that could carry Ghising to power. Defenses of conservative estimates (5–7%) are grounded in disciplined base-rate logic, correctly noting that Ghising’s appointment as a minister is likely the extent of elite concession to protest demands. There is no new evidence of a momentum shift in Ghising’s favor since the interim cabinet was formed. Given that the consensus is even slightly more bearish than my initial estimate, I am revising my probability downward to reflect the overwhelming historical and structural headwinds, settling at 5%.",
            "revised_probability": 5
        }
    },
    "revision_probability": [
        3,
        5,
        5,
        4,
        5,
        5,
        5,
        5,
        5
    ],
    "revision_mean_probability": 4.666666666666667,
    "revision_sd": 0.7071067811865475,
    "revision_probability_result": 5,
    "question_details": {
        "id": 39510,
        "title": "Who will be the next non-caretaker prime minister of Nepal? (Kulman Ghising)",
        "created_at": "2025-09-15T10:14:54.797753Z",
        "open_time": "2025-09-17T10:42:39Z",
        "cp_reveal_time": "2025-09-17T12:12:39Z",
        "spot_scoring_time": "2025-09-17T12:12:39Z",
        "scheduled_resolve_time": "2026-01-01T06:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-09-17T12:12:39Z",
        "actual_close_time": "2025-09-17T12:12:39Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 0.69,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "The Federal: [Who could be Nepal's next prime minister? Here are 5 top contenders](https://thefederal.com/category/international/nepals-next-prime-minister-after-olis-controversial-exit-206263)\n\n> Scuffles were reported among Gen-Z factions backing different contenders outside the Nepal Army headquarters in Kathmandu on Wednesday evening, as talks to pick an interim leader after the violent overthrow of the government extended into the third day.\n\n> KP Sharma Oli resigned as prime minister on Tuesday, leaving the post vacant while the anti-corruption revolt continues without a clear leader.\n\n`{\"format\":\"metac_reveal_and_close_in_period\",\"info\":{\"post_id\":39851,\"question_id\":39393}}`",
        "resolution_criteria": "This question is a subquestion of a group question. This subquestion specifically targets the option 'Kulman Ghising'. The resolution criteria for the parent question is below. \n\nThis question resolves as **Yes** for the individual who, after September 11, 2025 and before January 1, 2026 takes the [oath](https://www.constituteproject.org/constitution/Nepal_2016#s852) of office and secrecy as the new [Prime Minister of Nepal](https://en.wikipedia.org/wiki/Prime_Minister_of_Nepal) and wins a vote of confidence in the House of Representatives as required by [section 76](https://www.constituteproject.org/constitution/Nepal_2016#s795) of the Constitution of Nepal. The question resolves as **No** for everyone else. If none of the listed candidates fulfills the criteria during that time period, then the question resolves as **No** for every option.",
        "fine_print": "This is a Group question, so you do not have to assess probabilities for every option. More options may be added after the question opens, if there is [credible](https://www.metaculus.com/faq/#definitions) reporting that a particular individual has a material probability of coming the next PM of Nepal.",
        "post_id": 39967,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Nepal's interim PM appoints cabinet amid post-protest recovery**\nIn an effort to stabilize Nepal after deadly anti‑government protests, Prime Minister Sushila Karki, the country’s first female prime minister, appointed an interim cabinet on Monday.  The new ministers—Kalman Gurung as energy minister, Rameshore Khanal as finance minister, and Om Prakash Aryal as home minister—were sworn in outside a government building that had been attacked and set ablaze by protesters the week before.  The appointments come after violent demonstrations sparked by a brief social media ban and widespread anger over corruption that resulted in at least 72 deaths and hundreds of injuries, leading to the collapse of the previous administration.  Karki, 73, who was appointed on September 12, took office following an agreement with leaders of the largely youth‑led ‘Gen Z’ protest movement.  The military, which enforced a curfew during the unrest, ultimately consented to her leadership of a caretaker government charged with overseeing elections within six months.  At a conference on Sunday, Karki stated, 'What we need now is to work to end corruption, bring about good governance, and achieve economic equality. This is what the people truly desire at this moment.'  Businessman Shrawan Dahl expressed confidence in her ability to lead, saying, 'Her objective is to conduct the election, and we hope she will accomplish this task successfully.'\nOriginal language: en\nPublish date: September 15, 2025 03:28 PM\nSource:[Africanews](https://www.africanews.com/2025/09/15/nepals-interim-pm-appoints-cabinet-amid-post-protest-recovery/)\n\n**Nepal's PM Karki appoints ministers after deadly Gen Z protests**\nNeal's Prime Minister Sushila Karki, the country’s first female leader, appointed Om Prakash Aryal as home minister, Rameshwar Prasad Khanal as finance minister, and Kulman Ghising as energy minister on Monday, following the dissolution of parliament after deadly protests that killed at least 72 people. Aryal is a human‑rights lawyer, Khanal a former finance secretary who recommended major economic reforms, and Ghising a former state power utility chief credited with eliminating load‑shedding. President Ramchandra Paudel swore them in during a televised ceremony outside the fire‑damaged presidential office. The interim government, which will last six months until early‑March elections, is pledged to tackle corruption. The appointments came less than a week after former PM KP Sharma Oli resigned amid unrest that escalated when demonstrators were shot dead by police on Monday. The protests, led by Gen Z, began on 8 September over a brief social‑media ban and grew into widespread anger over corruption and poverty. In her first public remarks, Karki said the country should rebuild together and would work 'according to the thinking of the Gen Z generation'. Subash Dhakal, a 19‑year‑old protester shot in the knees, told AFP he had no regrets and that the pain was temporary but would bring change.\nOriginal language: en\nPublish date: September 15, 2025 12:46 PM\nSource:[Al Jazeera Online](https://www.aljazeera.com/news/2025/9/15/nepals-pm-karki-appoints-ministers-after-deadly-gen-z-protests)\n\n**Nepal PM Sushila Karki appoints three new ministers for interim cabinet**\nOn September 15 2025, the Hindustan Times reported that Nepal President Ramchandra Paudel swore in three ministers—Kulman Ghising, Rameshwor Khanal and Om Prakash Aryal—appointed by caretaker Prime Minister Sushila Karki for her newly formed cabinet. The oath ceremony took place at the President's Office, Sheetal Niwas, Maharajgunj, after which all three ministers immediately assumed their posts. Khanal, the former finance secretary, was sworn in as finance minister. Ghising, the former managing director of the Nepal Electricity Authority, was given charge of energy, water resources and irrigation; physical infrastructure and transport; and urban development. Aryal, an advocate, was appointed minister for home affairs and for law, justice and parliamentary affairs. The article notes that Karki, 73, became Nepal's first female prime minister on September 12, at the recommendation of the agitating 'Gen Z' group, to lead a caretaker government tasked with conducting fresh elections on March 5 2026. It also recounts that former Prime Minister KP Sharma Oli resigned after widespread anti‑government protests led by the 'Gen Z' group against a social media ban and corruption allegations; the protests turned violent, with at least 72 people losing their lives in the nationwide unrest.\nOriginal language: en\nPublish date: September 15, 2025 09:23 AM\nSource:[Hindustan Times](https://www.hindustantimes.com/world-news/nepal-pm-sushila-karki-appoints-three-new-ministers-for-interim-cabinet-101757927752490.html)\n\n**Three ministers inducted by Nepal's new caretaker PM Karki sworn in**\nOn September 15 2025, the Business Standard reported that Nepal President Ramchandra Paudel administered the oath of office to three ministers—Kulman Ghising, Rameshwor Khanal, and Om Prakash Aryal—inducted by the newly appointed caretaker Prime Minister Sushila Karki. The swearing‑in ceremony took place at the President's Office, Sheetal Niwas, Maharjgunj, and the ministers assumed their respective portfolios: Khanal as Finance Minister; Ghising as Minister for Energy, Water Resources and Irrigation, Physical Infrastructure and Transport, and Urban Development; and Aryal as Minister for Home Affairs and for Law, Justice and Parliamentary Affairs. The article notes that Karki, 73, is the Himalayan nation's first woman prime minister and that she assumed office on Sunday, following the resignation of former PM K P Sharma Oli after widespread protests that left at least 72 people dead. The caretaker government, appointed at the recommendation of an agitating 'Gen Z' group, is mandated to conduct fresh elections on March 5 2026. The article also cites the headline 'Those involved in violence will face justice' as a statement from PM Karki.\nOriginal language: en\nPublish date: September 15, 2025 08:59 AM\nSource:[Business Standard](https://www.business-standard.com/world-news/three-ministers-inducted-by-nepal-s-new-caretaker-pm-karki-sworn-in-125091500626_1.html)\n\n**Nepal: 3 ministers inducted by new caretaker PM Sushila Karki sworn in**\nOn Monday, Nepal President Ramchandra Paudel administered the oath of office to three ministers appointed by caretaker Prime Minister Sushila Karki, the country’s first woman prime minister. Karki, 73, assumed office on Sunday. The ministers sworn in were Kulman Ghising, Rameshwor Khanal and Om Prakash Aryal. Khanal became Finance Minister; Ghising took charge of energy, water resources and irrigation, physical infrastructure and transport, and urban development; Aryal was appointed Minister for Home Affairs and for Law, Justice and Parliamentary Affairs. The swearing‑in ceremony was held at the President’s Office, Sheetal Niwas, Maharjgunj. Karki was appointed prime minister at the recommendation of the agitating 'Gen Z' group, which demanded a caretaker government to hold fresh elections on March 5 2026. She took oath on September 12, ending a period of political uncertainty after former prime minister K P Sharma Oli resigned following widespread anti‑government protests led by the same 'Gen Z' group over a ban on social media and alleged corruption. The protests resulted in at least 72 deaths nationwide.\nOriginal language: en\nPublish date: September 15, 2025 12:00 AM\nSource:[newsdrum.in](https://www.newsdrum.in/international/nepal-3-ministers-inducted-by-new-caretaker-pm-karki-sworn-in-10466225)\n\n**Nepal: Last rites of fallen Gen-Z protesters performed with national honours**\nOn September 16, 2025, the newly‑appointed government ministers attended the cremation of protestors who were killed during the Gen‑Z protests on September 8 and 9. The first cabinet meeting of the new government had declared those who died to be 'martyrs', and the deceased were cremated with national honours beside the 'Pashupatinath temple', with the national flag draped over them. Interim ministers 'Kulman Ghising' and 'Om Prakash Aryal' were present, and armed police offered a salute. A funeral procession moved from 'Tribhuwan University Teaching Hospital' to the site. The cabinet also announced a day of mourning on September 17, with the flag flown at half‑mast, free medical treatment for the injured, and the construction of a 'Gen‑Z Memorial park'. According to police, at least 72 people died in the protests, with 19 killed on the first day, and hundreds were hospitalised. The protests, sparked by Gen‑Z youths against corruption and a social media ban, turned violent when police fired on demonstrators, leading to the death of 19 on September 8. The unrest caused vandalism and arson of government buildings and private properties, prompting then‑Prime Minister 'K P Sharma Oli' to resign. In the aftermath, top leaders of major parties, including Communist Party of Nepal (Maoist Centre) leader 'Pushpa Kamal Dahal aka Prachanda', have returned to public life; the party headquarters they visited had been burnt down during the protests.\nOriginal language: en\nPublish date: September 16, 2025 11:25 AM\nSource:[Social News XYZ](https://www.socialnews.xyz/2025/09/16/nepal-last-rites-of-fallen-gen-z-protesters-performed-with-national-honours/)\n\n**New govt takes shape**\nThe interim government of Nepal was formed on 15 September 2025 after anti‑corruption protests that toppled the previous administration. President Ram Chandra Paudel administered the oath of office to three ministers at Shital Niwas, the presidential building in Kathmandu. The new cabinet includes Finance Minister Rameshwor Khanal, Energy Minister Kulman Ghising, and Home Minister Om Prakash Aryal. The protests, sparked by a ban on social media and long‑standing economic grievances, began on 8 September and escalated into violent unrest that left at least 72 people dead and 191 injured, according to government figures. Prime Minister Sushila Karki, a 73‑year‑old former chief justice, was appointed to lead the interim administration and is tasked with addressing demands for a corruption‑free future ahead of March elections. Sushila Karki said she had \"not wished\" to take the post, but that her \"name was brought from the streets\" and that her government would work \"according to the thinking of the Gen Z generation\", seeking \"the end of corruption, good governance and economic equality\". The appointments were the result of negotiations involving army chief General Ashok Raj Sigdel and representatives of the youth protest movement, who used the Discord app to endorse Sushila Karki.\nOriginal language: en\nPublish date: September 15, 2025 11:54 PM\nSource:[The Star ](https://www.thestar.com.my/aseanplus/aseanplus-news/2025/09/16/new-govt-takes-shape)\n\n**Nepal's interim PM appoints cabinet amid post-protest recovery**\nIn an effort to stabilize Nepal after deadly anti‑government protests, Prime Minister Sushila Karki, the country’s first female prime minister, appointed an interim cabinet on Monday.  The new ministers—Kalman Gurung as energy minister, Rameshore Khanal as finance minister, and Om Prakash Aryal as home minister—were sworn in outside a government building that had been attacked and set ablaze by protesters the week before.  The appointments come after violent demonstrations sparked by a brief social media ban and widespread anger over corruption that resulted in at least 72 deaths and hundreds of injuries, leading to the collapse of the previous administration.  Karki, 73, who was appointed on September 12, took office following an agreement with leaders of the largely youth‑led ‘Gen Z’ protest movement.  The military, which enforced a curfew during the unrest, ultimately consented to her leadership of a caretaker government charged with overseeing elections within six months.  At a conference on Sunday, Karki stated, 'What we need now is to work to end corruption, bring about good governance, and achieve economic equality. This is what the people truly desire at this moment.'  Businessman Shrawan Dahl expressed confidence in her ability to lead, saying, 'Her objective is to conduct the election, and we hope she will accomplish this task successfully.'\nOriginal language: en\nPublish date: September 15, 2025 03:28 PM\nSource:[Africanews](https://www.africanews.com/2025/09/15/nepals-interim-pm-appoints-cabinet-amid-post-protest-recovery/)\n\n**Nepal's PM Karki appoints ministers after deadly Gen Z protests**\nNeal's Prime Minister Sushila Karki, the country’s first female leader, appointed Om Prakash Aryal as home minister, Rameshwar Prasad Khanal as finance minister, and Kulman Ghising as energy minister on Monday, following the dissolution of parliament after deadly protests that killed at least 72 people. Aryal is a human‑rights lawyer, Khanal a former finance secretary who recommended major economic reforms, and Ghising a former state power utility chief credited with eliminating load‑shedding. President Ramchandra Paudel swore them in during a televised ceremony outside the fire‑damaged presidential office. The interim government, which will last six months until early‑March elections, is pledged to tackle corruption. The appointments came less than a week after former PM KP Sharma Oli resigned amid unrest that escalated when demonstrators were shot dead by police on Monday. The protests, led by Gen Z, began on 8 September over a brief social‑media ban and grew into widespread anger over corruption and poverty. In her first public remarks, Karki said the country should rebuild together and would work 'according to the thinking of the Gen Z generation'. Subash Dhakal, a 19‑year‑old protester shot in the knees, told AFP he had no regrets and that the pain was temporary but would bring change.\nOriginal language: en\nPublish date: September 15, 2025 12:46 PM\nSource:[Al Jazeera Online](https://www.aljazeera.com/news/2025/9/15/nepals-pm-karki-appoints-ministers-after-deadly-gen-z-protests)\n\n**Nepal Cabinet Expansion: Meet 3 Ministers Inducted By New Caretaker PM Sushila Karki**\nOn Monday, caretaker Prime Minister Sushila Karki inducted three ministers—Kulman Ghising, Rameshwor Khanal, and Om Prakash Aryal—into her cabinet. The oath was administered by President Ramchandra Paudel at the President's Office, Sheetal Niwas, Maharjgunj in Kathmandu. Ghising was given the portfolios of energy, water resources and irrigation; physical infrastructure and transport; and urban development. He is a former managing director of the Nepal Electricity Authority, credited with resolving the country’s long‑standing power crisis. Khanal was sworn in as Finance Minister and will also handle Communications and Information Technology; he previously served as finance secretary. Aryal was appointed Minister for Home Affairs, Law, Justice and Parliamentary Affairs, and Labour, Employment and Social Security; he is an advocate known for public‑interest litigation and has served as legal advisor to Kathmandu Metropolitan City. Karki, 73, became Nepal’s first woman prime minister on Friday, September 12, after a meeting between President Paudel, the military and youth protesters. She was sworn in following the resignation of KP Oli over protests about social‑media bans and corruption.\nOriginal language: en\nPublish date: September 15, 2025 11:36 AM\nSource:[Free Press Journal](https://www.freepressjournal.in/world/nepal-cabinet-expansion-meet-3-ministers-inducted-by-new-caretaker-pm-sushila-karki)\n\n**Nepal PM Sushila Karki appoints three new ministers for interim cabinet**\nOn September 15 2025, the Hindustan Times reported that Nepal President Ramchandra Paudel swore in three ministers—Kulman Ghising, Rameshwor Khanal and Om Prakash Aryal—appointed by caretaker Prime Minister Sushila Karki for her newly formed cabinet. The oath ceremony took place at the President's Office, Sheetal Niwas, Maharajgunj, after which all three ministers immediately assumed their posts. Khanal, the former finance secretary, was sworn in as finance minister. Ghising, the former managing director of the Nepal Electricity Authority, was given charge of energy, water resources and irrigation; physical infrastructure and transport; and urban development. Aryal, an advocate, was appointed minister for home affairs and for law, justice and parliamentary affairs. The article notes that Karki, 73, became Nepal's first female prime minister on September 12, at the recommendation of the agitating 'Gen Z' group, to lead a caretaker government tasked with conducting fresh elections on March 5 2026. It also recounts that former Prime Minister KP Sharma Oli resigned after widespread anti‑government protests led by the 'Gen Z' group against a social media ban and corruption allegations; the protests turned violent, with at least 72 people losing their lives in the nationwide unrest.\nOriginal language: en\nPublish date: September 15, 2025 09:23 AM\nSource:[Hindustan Times](https://www.hindustantimes.com/world-news/nepal-pm-sushila-karki-appoints-three-new-ministers-for-interim-cabinet-101757927752490.html)\n\n**Kulman Ghising, Two Others Sworn In As Ministers In Nepal PM Sushila Karki's Cabinet**\nOn September 15 2025, Nepal President Ramchandra Paudel administered the oath of office to three new ministers in Prime Minister Sushila Karki's caretaker cabinet. The ministers are Kulman Ghising, Rameshwor Khanal and Om Prakash Aryal. Khanal, a former finance secretary, will head the Finance Ministry. Ghising, former head of the Nepal Electricity Authority, will oversee Energy, Water Resources and Irrigation; Physical Infrastructure and Transport; and Urban Development. Aryal, a lawyer, will manage the Home Ministry and the Ministry of Law, Justice and Parliamentary Affairs. Karki, 73, became the country's first woman prime minister after the resignation of KP Sharma Oli, who stepped down amid nationwide protests by the Gen Z movement over social media restrictions and corruption allegations. The protests turned violent, resulting in at least 72 deaths. The caretaker government is responsible for conducting general elections on March 5 2026.\nOriginal language: en\nPublish date: September 15, 2025 09:17 AM\nSource:[News18](https://www.news18.com/world/kulman-ghising-two-others-sworn-in-as-ministers-in-nepal-pm-sushila-karkis-cabinet-9573115.html)\n\n**Three ministers inducted by Nepal's new caretaker PM Karki sworn in**\nOn September 15 2025, the Business Standard reported that Nepal President Ramchandra Paudel administered the oath of office to three ministers—Kulman Ghising, Rameshwor Khanal, and Om Prakash Aryal—inducted by the newly appointed caretaker Prime Minister Sushila Karki. The swearing‑in ceremony took place at the President's Office, Sheetal Niwas, Maharjgunj, and the ministers assumed their respective portfolios: Khanal as Finance Minister; Ghising as Minister for Energy, Water Resources and Irrigation, Physical Infrastructure and Transport, and Urban Development; and Aryal as Minister for Home Affairs and for Law, Justice and Parliamentary Affairs. The article notes that Karki, 73, is the Himalayan nation's first woman prime minister and that she assumed office on Sunday, following the resignation of former PM K P Sharma Oli after widespread protests that left at least 72 people dead. The caretaker government, appointed at the recommendation of an agitating 'Gen Z' group, is mandated to conduct fresh elections on March 5 2026. The article also cites the headline 'Those involved in violence will face justice' as a statement from PM Karki.\nOriginal language: en\nPublish date: September 15, 2025 08:59 AM\nSource:[Business Standard](https://www.business-standard.com/world-news/three-ministers-inducted-by-nepal-s-new-caretaker-pm-karki-sworn-in-125091500626_1.html)\n\n**Kulman Ghising, 2 other ministers inducted into interim Nepal PM's cabinet**\nOn September 15, 2025, India Today reported that a day after Sushila Karki assumed office as the interim Prime Minister of Nepal following massive Gen Z protests that toppled the previous government, former Nepal Electricity Authority chief Kulman Ghising and two others were sworn in as ministers. Ghising was appointed Minister for Energy, Water Resources and Irrigation and will also head the Ministries of Physical Infrastructure and Transport and Urban Development. Rameshore Khanal was named Finance Minister, and Om Prakash Aryal became Home Affairs Minister while also taking on the law, justice and parliamentary affairs portfolio. The oath of secrecy was administered by President Ramchandra Paudel at Sheetal Niwas in Kathmandu. The interim cabinet now has four members, including Karki, who will oversee the remaining portfolios. The cabinet is tasked with holding parliamentary elections on March 6, 2026. Karki, a former Chief Justice, was sworn in as Nepal's first woman Prime Minister on September 12, following protests that began after a social media ban and led to 72 deaths. At least 79 inmates escaped during the protests but were later caught by SSB personnel; among them were two Nigerians, a Brazilian and a Bangladeshi national aged 29‑40. 'She was sworn in as Nepal's first woman Prime Minister.'\nOriginal language: en\nPublish date: September 15, 2025 08:28 AM\nSource:[India Today](https://www.indiatoday.in/world/story/nepal-cabinet-expansion-three-ministers-sworn-in-interim-prime-minister-sushila-karki-gen-z-protests-2787536-2025-09-15)\n\n**Nepal: 3 ministers inducted by new caretaker PM Sushila Karki sworn in**\nOn Monday, Nepal President Ramchandra Paudel administered the oath of office to three ministers appointed by caretaker Prime Minister Sushila Karki, the country’s first woman prime minister. Karki, 73, assumed office on Sunday. The ministers sworn in were Kulman Ghising, Rameshwor Khanal and Om Prakash Aryal. Khanal became Finance Minister; Ghising took charge of energy, water resources and irrigation, physical infrastructure and transport, and urban development; Aryal was appointed Minister for Home Affairs and for Law, Justice and Parliamentary Affairs. The swearing‑in ceremony was held at the President’s Office, Sheetal Niwas, Maharjgunj. Karki was appointed prime minister at the recommendation of the agitating 'Gen Z' group, which demanded a caretaker government to hold fresh elections on March 5 2026. She took oath on September 12, ending a period of political uncertainty after former prime minister K P Sharma Oli resigned following widespread anti‑government protests led by the same 'Gen Z' group over a ban on social media and alleged corruption. The protests resulted in at least 72 deaths nationwide.\nOriginal language: en\nPublish date: September 15, 2025 12:00 AM\nSource:[newsdrum.in](https://www.newsdrum.in/international/nepal-3-ministers-inducted-by-new-caretaker-pm-karki-sworn-in-10466225)\n\n**When will Nepal get new PM? Gen-Z 'cracks', suspense grows as names shuffle | What we know so far**\nScuffles were reported among Gen‑Z factions backing different contenders outside the Nepal Army headquarters in Kathmandu on Wednesday evening, as talks to pick an interim leader after the violent overthrow of the government extended into the third day. The post of prime minister has been vacant since KP Sharma Oli resigned on Tuesday. Four names have emerged as potential candidates: Kathmandu mayor and rapper Balendra Shah 'Balen', former chief justice Sushila Karki, former chief of the electricity board Kulman Ghising, and current mayor of Dharan Harka Raj Sampang Rai. The scuffle on Thursday evening involved supporters of Balen, Karki or Sampang, according to multiple outlets. No final decision has yet been reached; talks are ongoing among Gen‑Z representatives, President Ram Chandra Paudel and the army chief. The President issued an appeal for calm and said he was doing his best to find a solution, with a letter seen as a signal to Gen‑Z representatives to 'take the onus and decide'.\nOriginal language: en\nPublish date: September 11, 2025 11:19 AM\nSource:[Hindustan Times](https://www.hindustantimes.com/world-news/when-will-nepal-get-new-leader-wait-extends-gen-z-cracks-what-we-know-so-far-101757588087511.html)\n\n**Nepal President Issues Message Amid Talks with Gen Z to Select Interim PM**\nOn September 11, 2025, Nepal President Ram Chandra Paudel issued a letter urging calm and patience amid talks to appoint an interim prime minister after the resignation of KP Sharma Oli amid violent protests led by students and Gen‑Z groups. The letter, written in Nepali and seen by HT, states: 'I am deliberating and making every effort to find a way out of the current difficult situation in the country within the constitutional framework and to protect democracy.' Paudel, together with Army Chief Ashok Raj Sigdel, has been pressing Gen‑Z representatives to finalize a candidate. A source said: 'The onus is on them (Gen‑Z representatives), so they can't blame the President and army later.' Meetings on Thursday involved Gen‑Z leaders, the President, and the army chief, with names such as former chief justice Sushila Karki, former Nepal Electricity Authority chief Kulman Ghising, and Kathmandu mayor Balendra Shah under consideration. The army spokesperson confirmed ongoing consultations but declined to name candidates, adding: 'We are holding rounds of talks with different stakeholders. The talks are mainly focused on finding a way out from the current stalemate and at the same time maintaining law and order situation in the country.' The interim prime minister, once chosen, will govern until fresh elections are held within a specified timeframe. Meanwhile, students aligned with major parties staged demonstrations in Kathmandu, demanding the Constitution be preserved and democracy safeguarded during the transition. Dozens of young people gathered outside the army headquarters in Kathmandu awaiting the outcome.\nOriginal language: en\nPublish date: September 11, 2025 11:11 AM\nSource:[Oneindia](https://www.oneindia.com/international/nepal-president-urges-calm-as-gen-z-army-hold-talks-to-pick-interim-pm-7856763.html)\n\n**Gen Z factions clash outside Nepal Army HQ amid leadership dispute**\nThe article reports that on Thursday, a clash erupted outside the Nepal Army headquarters when factions of Gen Z protesters fought over who should lead the country’s interim government after Prime Minister KP Sharma Oli’s resignation. Witnesses described the demonstrators, who have led Nepal’s biggest protests in decades, as engaging in heated arguments that escalated into scuffles. The army had been negotiating with Gen Z representatives to agree on an interim leader, but the dispute over leadership intensified outside the headquarters. One faction supported former Chief Justice Sushila Karki, who is described in the article as a popular choice for her reputation as 'honest and fearless'; another faction rejected her nomination and instead proposed Kulman Ghising, the former chief of the Nepal Electricity Authority, arguing that appointing Karki would deepen the deadlock because the constitution bars former justices from becoming prime minister.\nOriginal language: en\nPublish date: September 11, 2025 11:02 AM\nSource:[India Today](https://www.indiatoday.in/world/story/gen-z-factions-clash-outside-nepal-army-headquarters-amid-leadership-dispute-2785755-2025-09-11)\n\n**After Sushila Karki, Kulman Ghising in the race for Nepal's interim PM post. Who is he?**\nAfter Prime Minister KP Sharma Oli resigned, Gen‑Z protesters are pushing former Nepal Electricity Authority chief Kulman Ghising (54) to become interim prime minister. Ghising, who led NEA from 2016 to 2025, is credited with ending a 2016 energy emergency that saw 18‑hour load‑shedding and 50 % of power imported from India. He cut power‑loss, upgraded the grid and reduced pilferage. The article quotes protesters calling him 'a patriot and everyone's favourite' and notes that the 35‑year‑old Kathmandu mayor Balendra Shah has also been floated, but he has endorsed Sushila Karki, the former chief justice, as a candidate. Karki’s age (over 70) and constitutional restrictions (Article 132) raise doubts. The Nepal army chief, General Ashok Raj Sigdel, reportedly met with Karki, while army spokesperson Raja Ram Basnet says 'Initial talks are on… we are trying to normalise the situation.' The article reports that protesters are staging demonstrations outside the army headquarters demanding transparent discussions.\nOriginal language: en\nPublish date: September 11, 2025 10:49 AM\nSource:[Firstpost](https://www.firstpost.com/explainers/nepal-gen-z-protests-sushila-karki-kulman-ghising-interim-pm-power-crisis-13932837.html)\n\n**Nepal President has a message amid talks with Gen Z to pick interim PM**\nOn September 11, 2025, Nepal’s President Ram Chandra Paudel issued a letter urging all parties to resolve the political stalemate within the constitutional framework and protect democracy. The letter, dated September 11, states: 'I am deliberating and making every effort to find a way out of the current difficult situation in the country within the constitutional framework and to protect democracy.' It also appeals: 'I appeal to all parties to be confident that a solution to the problem is being sought as soon as possible to address the demands of the agitating citizens.' The President, the highest ceremonial authority after the violent protests that toppled the previous government, is pressing the army and Gen‑Z representatives to finalize a name for the interim prime minister. Army chief Ashok Raj Sigdel is also involved, and an army spokesperson said: 'We are holding rounds of talks with different stakeholders. The talks are mainly focused on finding a way out from the current stalemate and at the same time maintaining law and order situation in the country.' Potential candidates mentioned include former chief justice Sushila Karki, ex‑chief of the Nepal power board Kulman Ghising, and Kathmandu mayor Balendra Shah. The interim PM will replace KP Sharma Oli, who resigned on Tuesday after a student‑led agitation. The article notes that in parts of Kathmandu, students from major parties demonstrated, demanding the Constitution be preserved and democracy protected while a new government is formed. The new executive head will have to ensure fresh elections within a specified timeframe, and the army spokesperson did not provide any names.\nOriginal language: en\nPublish date: September 11, 2025 10:25 AM\nSource:[Hindustan Times](https://www.hindustantimes.com/world-news/nepal-president-has-message-amid-talks-with-gen-z-to-pick-interim-pm-sushila-karki-balen-shah-kulman-ghising-options-101757584599327.html)\n\n**'Otherwise, grave misfortune may follow': Nepal ex-PM suggests way out to form new govt**\nFormer Nepal prime minister Baburam Bhattarai urged the country to form a new government within the existing Constitution after Gen‑Z protests toppled the coalition of former PM KP Sharma Oli.  He warned that \"Otherwise, grave misfortune may follow,\" and posted the proverb, 'It is harder to deliver the offering to the priest than to perform the funeral rite itself,' to illustrate the difficulty of the process.  Bhattarai criticised unnamed \"self‑proclaimed intellectuals\" who called Nepal \"constitutionless or stateless,\" and stressed that the Constitution, Parliament, Head of State and permanent organs remain intact even if the government resigns.  He called for a three‑pronged approach: meaningful dialogue between the movement’s official representatives and the President, convening Parliament to make constitutional arrangements, and preventing new parties from resigning from Parliament in a rash manner.  He warned that failure could plunge the nation into \"a terrifying dark tunnel, a Black Hole.\"  The article also noted that Bhattarai’s house was torched amid widespread arson linked to a social media ban, and that interim PM candidates include Kulman Ghising and former chief justice Sushila Karki.  The post was shared on X on September 11, 2025.\nOriginal language: en\nPublish date: September 11, 2025 09:52 AM\nSource:[Hindustan Times](https://www.hindustantimes.com/world-news/grave-misfortune-may-follow-if-nepal-ex-pm-suggests-way-out-to-form-new-govt-101757582493098.html)\n\n**Army out, curfew clamped as Nepal hunts for a new leader**\nOn September 10, 2025, soldiers guarded Nepal’s parliament and patrolled deserted streets under a curfew after Prime Minister KP Sharma Oli resigned amid deadly anti‑corruption protests. The death toll had risen to 25 and 633 were injured, according to the health ministry. In addition, five juvenile inmates died during a clash with security at a western Nepal jail, and more than 7,000 prisoners escaped from prisons nationwide. Negotiations between representatives and protesters began at the army headquarters, but no succession plan was agreed upon. Tribhuvan International Airport resumed services the same evening, 24 hours after closing. The army deployed armoured personnel carriers and used loudspeakers to call for calm. Former PM Jhala Nath Khanal’s wife, Ravi Laxmi Chitrakar, who sustained serious burn injuries, is critical but stable, as reported by Dr Kiran Nakarmi of Kirtipur Hospital. Nepali Army chief General Ashok Raj Sigdel held consultations with stakeholders and met with representatives of the Gen Z protest movement, according to Rajaram Basnet. Former chief justice Sushila Karki, Kathmandu mayor Balendra Shah, and former electricity board chief Kulman Ghising were named as potential interim leaders. Karki said, 'Experts need to come together to figure out the way forward' and added, 'When they requested me, I accepted.' The army announced that curfew orders would remain in force until Thursday morning, warning that demonstrations, vandalism, looting, arson, and attacks in the name of protest would be considered punishable crimes.\nOriginal language: en\nPublish date: September 10, 2025 09:36 PM\nSource:[Hindustan Times](https://www.hindustantimes.com/world-news/army-out-curfew-clamped-as-nepal-hunts-for-a-new-leader-101757540191643.html)\n\n**After Oli's exit, who will lead Nepal? Inside details of GenZ meeting on Interim Government - The Statesman**\nViolent Gen Z protests over alleged corruption and nepotism have erupted across Nepal, with demonstrators setting fire to the Parliament building and the residences of the President, Prime Minister and several ministers. Prime Minister KP Sharma Oli resigned amid the unrest, and a meeting of Gen Z protesters and allies was held on 18 September 2025 at Jangi Adda, Army Headquarters in Bhadrakali, Kathmandu, to discuss who should lead the interim government. The meeting considered several potential leaders: Kathmandu Mayor Balenndra Shah, former Chief Justice Shushila Karki (who said 'I am ready to lead the interim government if I have unanimous support'), Sumana Shrestha (who declined due to her affiliation with the Rastriya Swatantra Party), Harka Samparg (Mayor of Dharan), Sagar Dhakal (federal election candidate), Kulman Ghising (former Managing Director of Nepal Electricity Authority), and Rastra Bimochan Timalsena (YouTuber and lawyer who goes by 'Random Nepali').\nOriginal language: en\nPublish date: September 10, 2025 12:05 PM\nSource:[thestatesman.com](https://www.thestatesman.com/world/after-olis-exit-who-will-lead-nepal-inside-details-of-genz-meeting-on-interim-government-1503484209.html)\n\n",
    "date": "2025-10-13T14:00:56.184253",
    "summary": "All eight expert forecasters agree that the probability of Kulman Ghising becoming the next non-caretaker prime minister of Nepal is quite low—ranging from 3% to 10%, with most clustered between 5% and 7%. Their consensus is grounded in several recurring themes: (1) The status quo is a caretaker government led by Sushila Karki, with Ghising serving as a high-profile technocratic minister; (2) Nepal’s parliamentary system, historical precedent, and party-centric coalition politics overwhelmingly favor established party leaders or traditional politicians for the post of non-caretaker PM, especially following elections; (3) While Ghising enjoys significant popularity, particularly among Gen-Z protestors and civil society for his technocratic achievements, he lacks a political base or an electoral coalition strong enough to secure him the premiership through standard parliamentary procedures; (4) The influence of the Gen-Z protest movement and recent political volatility has slightly increased the theoretical possibilities for outsiders or technocrats, but experts still judge that without extreme deadlock, further crises, or unprecedented consensus among parties, Ghising’s ascent remains highly improbable; (5) All experts cite exceptionally low historical base rates for technocrats or non-party figures becoming prime minister after Nepalese caretaker periods and following mass protest transitions. In summary, while Ghising’s unique profile and recent mass mobilization create a nonzero chance—particularly should another major crisis provide an opening for a unity or compromise figure—the strong structural constraints of Nepal’s political system make it very unlikely he will be the next non-caretaker PM within the specified window.",
    "forecasters": [
        "Comparative Politics Analyst (Cabinet Formation Process)",
        "Comparative Politics Analyst (Elite Bargaining Analysis)",
        "Nepal Political Journalism (Political Party Leadership Tracking)",
        "Nepal Political Journalism (Electoral Trends Nepal)",
        "Political Science (Parliamentary Democracy Nepal)",
        "Political Science (Coalition Politics Theories)",
        "Political Science (Leadership Selection Party Politics)",
        "South Asian Studies (Nepalese Political History)",
        "South Asian Studies (Regional Power Dynamics South Asia)"
    ]
}