{
    "deliberation_results": {
        "Employment Relations (ILO Conventions)": {
            "time_to_resolution": "About 2.5 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Employment Relations and ILO Conventions, I bring a nuanced understanding of how international labor standards, domestic legal structures (such as Brazil's CLT), and the political economy of labor law reform influence the likelihood of significant changes to working time regulations. I can assess the interplay between government, unions, employer organizations, legislative hurdles, and broader social movements, as well as draw on international precedent for workweek reforms.",
            "status_quo": "The 6x1 work schedule (six consecutive days of work, one day of rest) remains legal and widely practiced for most CLT-registered workers in Brazil. While there is mounting public debate and some legislative initiatives, no ban has passed either as a statutory law or constitutional amendment.",
            "perspective_derived_factors": [
                {
                    "factor": "Base Rate of Major Labor Law Reforms in Brazil",
                    "effect": "Decreases probability. Historically, sweeping changes to the CLT, especially those reducing working hours or increasing rest days, are rare and slow-moving, often met with strong resistance from business lobbies and requiring broad consensus."
                },
                {
                    "factor": "Parliamentary Opposition",
                    "effect": "Decreases probability. Multiple news articles and surveys indicate that 70% of federal deputies currently oppose ending the 6x1 schedule, making both a constitutional amendment and a regular legislative change very difficult to pass in the short term."
                },
                {
                    "factor": "Government and Union Support",
                    "effect": "Increases probability, but only modestly. The Lula government, key labor unions, and the Minister of Labor are vocal proponents, and mass mobilization ('ronco das ruas') can sometimes sway legislative outcomes in Brazil, as seen with the recent shelving of unpopular amendments."
                },
                {
                    "factor": "Public Mobilization and Plebiscite",
                    "effect": "Slightly increases probability. Popular support is strong (surveys show 57-64% of the public favors ending 6x1), and a plebiscite is being organized to increase pressure, but the scale of mobilization so far is relatively modest (tens of thousands, not millions), and plebiscites in Brazil are consultative, not binding."
                },
                {
                    "factor": "Employer Resistance and Economic Concerns",
                    "effect": "Decreases probability. Employer groups warn of increased costs and competitiveness risks, which resonate with many deputies and have historically blocked similar reforms."
                },
                {
                    "factor": "Legislative Calendar and Process Hurdles",
                    "effect": "Decreases probability. There is very little time left for a complex change to pass both houses, clear committee stages, and be enacted before the end of 2025. The most advanced proposals are still in committee or awaiting reports; even the PT's push for a regular law (which requires a lower quorum than a PEC) is facing significant resistance."
                },
                {
                    "factor": "ILO and International Precedent",
                    "effect": "Neutral to slightly positive. Internationally, there is a slow trend toward shorter workweeks, but Brazil has not historically been a first mover in adopting ILO recommendations on working time, and the ILO itself does not prohibit 6x1 schedules (it only recommends limits on hours and rest)."
                }
            ],
            "no_scenario": "The most likely scenario is that the 6x1 schedule remains legal for the vast majority of CLT workers. While debate continues and public mobilization increases, parliamentary resistance and time constraints prevent either a constitutional amendment or a regular law from passing before January 1, 2026. The issue may remain on the legislative agenda for 2026 or become an election issue.",
            "yes_scenario": "A major wave of public mobilization in late 2025, perhaps triggered by the plebiscite or a major union-led strike, shifts enough deputies to pass a regular law (not a constitutional amendment) that bans the 6x1 schedule for most CLT workers. The government fast-tracks the bill, and it is signed into law and takes effect before January 1, 2026.",
            "final_reasoning": "While there is growing political and social momentum for banning the 6x1 schedule, the entrenched parliamentary opposition (with 70% of deputies currently opposed), employer resistance, and the extremely short window before the resolution date make a ban highly unlikely before January 1, 2026. The Lula government is supportive, and the labor movement is mobilizing, but the scale of action so far is insufficient to quickly overcome legislative inertia. The base rate for rapid, major labor law reforms of this type in Brazil is low, and the status quo is sticky. While I assign some possibility (a nonzero chance) to a last-minute breakthrough if mass mobilization escalates dramatically, the evidence as of mid-October 2025 points to a 'No' outcome.",
            "final_probability": 8
        },
        "Employment Relations (Industrial Relations Systems)": {
            "time_to_resolution": "Approximately 2.5 months (until January 1, 2026)",
            "perspective_relevance": "As an Employment Relations (Industrial Relations Systems) expert, I assess not just legislative and political momentum but also the embeddedness of work schedules in collective bargaining, employer strategies, union strength, and the practicalities of labor law reform. I understand how changes to core employment structures like the 6x1 system interact with Brazil's corporatist industrial relations model, business lobbying, and the inertia of labor institutions. My expertise helps evaluate both formal legislative processes and the real-world feasibility of rapid change.",
            "status_quo": "The 6x1 work schedule (6 days on, 1 off) remains the norm for CLT workers in Brazil, with multiple recent proposals to ban it but none having advanced significantly in Congress due to business and legislative resistance.",
            "perspective_derived_factors": [
                {
                    "factor": "Legislative Difficulty and Political Resistance",
                    "effect": "Decreases probability. Both news and historical precedent show strong resistance in Congress (notably, 70% of deputies oppose ending 6x1), and constitutional amendments or impactful labor reforms face high hurdles, especially without a major political or economic shock."
                },
                {
                    "factor": "Union Mobilization and Public Pressure",
                    "effect": "Increases probability, but only slightly and contingently. There is genuine mobilization, with large plebiscites, street actions, and union activity; historical cases (e.g., 'PEC da Blindagem') show public pressure can sway Congress, but only on highly salient issues with near-unanimous public outrage, which is not yet the case here."
                },
                {
                    "factor": "Executive Support and Fragmentation",
                    "effect": "Marginal increase in probability. President Lula and the Labor Minister are publicly supportive, but the government is internally divided and legislative priorities are diffuse; executive support alone is rarely decisive without strong coalition management."
                },
                {
                    "factor": "Business Lobbying and Economic Arguments",
                    "effect": "Strongly decreases probability. Employer groups and many legislators argue that banning 6x1 would increase costs, reduce competitiveness, and harm small/medium enterprises; these arguments have historically been effective in stalling or watering down labor reform."
                },
                {
                    "factor": "Proximity to Elections/Legislative Calendar",
                    "effect": "Decreases probability. With the 2026 elections approaching and little time left in the session, controversial reforms tend to be delayed or abandoned as legislators focus on electoral positioning."
                },
                {
                    "factor": "Labor Law Pathways (Ordinary Law vs. Constitutional Amendment)",
                    "effect": "Slightly increases probability. While most attention is on constitutional amendments (hard to pass), there is a realistic possibility of passing a regular law (PL) with lower voting thresholds. However, even this route faces strong headwinds."
                }
            ],
            "no_scenario": "Despite union pressure, public campaigns, and some executive branch support, Congress remains unmoved due to business lobbying, legislative inertia, lack of consensus, and electoral distractions. PECs and PLs do not advance to a plenary vote or are shelved in committees. The 6x1 schedule persists for most CLT workers into 2026.",
            "yes_scenario": "A sudden surge in public mobilization following a catalyzing event (e.g., a major strike or widely publicized labor abuse) triggers massive street protests, forcing Congress to act. A compromise bill—perhaps a version of the PT's PL rather than a constitutional amendment—passes in late 2025, banning the 6x1 schedule for most CLT workers, with only minor exceptions.",
            "final_reasoning": "While there has been an unprecedented level of mobilization around banning the 6x1 schedule, Brazil's industrial relations system is marked by slow, incremental change, especially on core issues like work hours. The status quo is strongly defended by employer interests and a conservative majority in Congress, as reflected in the 70% opposition among deputies. Although union activity and executive support are notable, they have not built the overwhelming consensus or crisis atmosphere necessary to override entrenched interests. The legislative calendar is nearly out of time for complex labor reform, and while an ordinary law could theoretically pass more easily than a constitutional amendment, even that has shown little real movement. The base rate for major labor schedule reforms passing in a single year in Brazil is extremely low. Therefore, barring an extraordinary and unforeseen mass mobilization or crisis, the likelihood of a ban being enacted before January 1, 2026, remains low.",
            "final_probability": 8
        },
        "Legislative Affairs (Brazilian Legislative Process)": {
            "time_to_resolution": "Approximately 2.5 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Brazilian Legislative Affairs, I have an in-depth understanding of the legislative process, political alignments, committee procedures, timing constraints, and the real-world obstacles facing both constitutional amendments (PECs) and regular bills in Brazil. This allows me to accurately assess the likelihood of rapid labor law reforms, especially those that would significantly alter business and labor relations, and to interpret both legislative signals and political noise.",
            "status_quo": "The 6x1 work schedule is permitted for most CLT workers. Multiple proposals to ban or restrict it have been introduced in recent years, but none have advanced significantly in Congress. The Chamber of Deputies and Senate remain resistant, with business lobbies and a majority of deputies opposing rapid changes.",
            "perspective_derived_factors": [
                {
                    "factor": "Legislative Process Complexity and Timing",
                    "effect": "Decreases probability. With less than three months left in the legislative year and a need for either a constitutional amendment (requiring 3/5 majorities in both chambers, twice) or a new law, the time for full passage, promulgation, and regulatory adaptation is extremely tight. The Chamber is notorious for slow-moving labor reforms, particularly when business interests are threatened."
                },
                {
                    "factor": "Political Will and Congressional Composition",
                    "effect": "Decreases probability. Despite vocal support from the Lula government, the Labor Minister, and left-wing parties, recent reliable surveys (Quaest, Locomotiva) indicate 70% of deputies remain opposed. The Chamber's center and right control the agenda and key committees, and no evidence shows a sudden shift capable of overcoming this resistance."
                },
                {
                    "factor": "Popular Mobilization and Plebiscite Pressure",
                    "effect": "Increases probability, but only marginally. There is evident street mobilization, and the plebiscite is gathering signatures (though in the low tens of thousands). While the 'ronco das ruas' played a role in the archiving of the PEC da Blindagem, labor reform is a more divisive, less urgent issue. The recent mass protests have not yet translated into decisive parliamentary action."
                },
                {
                    "factor": "Business and Economic Lobby Resistance",
                    "effect": "Decreases probability. Business associations, especially in commerce, agriculture, and services, strongly oppose the measure, citing competitiveness and cost concerns. This lobbying is effective in slowing or blocking labor reforms in Brazil, especially close to election years."
                },
                {
                    "factor": "Executive-Legislative Relations and Electoral Calendar",
                    "effect": "Decreases probability. With municipal elections recently concluded and federal elections on the horizon in 2026, deputies are risk-averse and unlikely to vote for a disruptive labor reform with uncertain economic effects. Lula's government, while supportive rhetorically, has not prioritized this bill with the urgency or horse-trading observed in other legislative pushes."
                },
                {
                    "factor": "Alternative Legislative Pathways (PL vs. PEC)",
                    "effect": "Slightly increases probability. There is some movement to pursue a regular bill (PL) instead of a PEC, which has a lower threshold for passage. However, even PLs on labor have faced committee bottlenecks and have not advanced. No sign suggests a breakthrough."
                }
            ],
            "no_scenario": "Despite ongoing public mobilization and government support, the PEC or PL fails to clear committee, or is not put to a floor vote before the legislative recess. The business lobby and conservative majority in the Chamber use procedural tactics to delay, and the reform is shelved or postponed, with the 6x1 schedule remaining legal for most CLT workers at the start of 2026.",
            "yes_scenario": "A massive surge in public and union mobilization, possibly triggered by the plebiscite results, forces party leaders to fast-track a bill or amendment. The government manages to broker a deal with centrist parties, perhaps with targeted exceptions or implementation delays, and the Chamber and Senate approve the reform in record time, banning 6x1 for most CLT workers before January 2026.",
            "final_reasoning": "The base rate for passage of ambitious labor reforms in Brazil on such a short timeline is extremely low, especially given that a constitutional amendment or even a regular law altering the 6x1 schedule faces strong headwinds: a hostile Chamber of Deputies, business opposition, limited time for debate and votes, and tepid prioritization by the Executive. While public mobilization has moved the needle on some issues (e.g., PEC da Blindagem), there is no evidence of a comparable groundswell or urgency for the 6x1 ban. Additionally, both recent survey data and public statements by key actors confirm a lack of consensus and majoritarian support in Congress. The existence of multiple legislative vehicles (PEC, PL) does not overcome these obstacles in the available time. A Yes outcome would require a dramatic and rapid shift in political alignment or public pressure not yet observed as of mid-October 2025. Therefore, the probability of Brazil banning the 6x1 work schedule for most CLT workers before January 1, 2026, remains very low.",
            "final_probability": 7
        },
        "Labor Law (Comparative Labor Law)": {
            "time_to_resolution": "Approximately 2.5 months (until 1 January 2026)",
            "perspective_relevance": "As an expert in Comparative Labor Law, I can assess the feasibility and typical legislative pathways for substantial changes to labor regimes like the 6x1 schedule. I can also contextualize Brazilian developments within global trends and draw on the history of labor law reforms—especially in Latin America—where employer and worker lobbies, political alignments, and economic conditions shape outcomes. This expertise allows me to evaluate how likely Brazil is to pass and implement such a ban before the deadline, considering both legal and political hurdles.",
            "status_quo": "The 6x1 schedule is currently legal and widespread for CLT workers in Brazil. There is no ban in place, and previous legislative attempts to end or modify the 6x1 regime have stalled, facing significant opposition in Congress, especially from business-aligned parties.",
            "perspective_derived_factors": [
                {
                    "factor": "Legislative Process Complexity",
                    "effect": "Decreases probability. Constitutional amendments in Brazil (PECs) require supermajorities in both chambers, multiple rounds of voting, and committee approval. The process is especially slow for labor reforms perceived as costly to employers, and the news makes clear that the current proposals are moving slowly, with 70% of deputies opposed."
                },
                {
                    "factor": "Political Will and Public Pressure",
                    "effect": "Slightly increases probability. The President, Labor Minister, and major unions are vocally in favor, and there is some precedent for popular mobilization ('ronco das ruas') shifting legislative outcomes, as with the recent defeat of the 'PEC da Blindagem.' However, the scale of mobilization needed for labor reform is greater, and current protests and plebiscites, while visible, do not yet match the historic mass movements required for such change."
                },
                {
                    "factor": "Base Rate of Labor Law Reform in Brazil",
                    "effect": "Decreases probability. Historically, major labor law reforms in Brazil occur infrequently, and usually only after long gestation periods. The 2017 labor reform, for instance, took years of debate. Rapid, radical changes (like banning 6x1 outright) are rare, especially within less than a year."
                },
                {
                    "factor": "Business Opposition and Economic Concerns",
                    "effect": "Decreases probability. The business lobby and many deputies argue that banning 6x1 would harm competitiveness, raise costs, and trigger layoffs. Such opposition has historically blocked or diluted labor reforms in Brazil and other emerging economies."
                },
                {
                    "factor": "Alternative Legislative Vehicles (PL vs. PEC)",
                    "effect": "Slightly increases probability. There is a technical possibility to pass a bill (PL) instead of a constitutional amendment, which requires a lower quorum. However, bills have also faced significant resistance and have not advanced in the Chamber, per the news."
                },
                {
                    "factor": "Comparative International Trends",
                    "effect": "Slightly increases probability. There is a global trend toward shorter workweeks and more flexible labor arrangements, with some successful pilots in other countries. This provides rhetorical and political support but does not override domestic legislative inertia."
                }
            ],
            "no_scenario": "Despite public pressure and government support, the PEC or any PL to ban the 6x1 schedule stalls in committee or fails to gather enough votes before the end of 2025. The strong business lobby, lack of supermajority, and a divided Congress prevent passage. Mobilization does not reach the necessary critical mass to force legislative action. The status quo persists into 2026.",
            "yes_scenario": "A surge in street mobilization and union pressure—possibly catalyzed by the plebiscite—forces Congress to fast-track and approve a bill (PL) or even a constitutional amendment banning the 6x1 schedule for most CLT workers. Political calculation, perhaps spurred by approaching 2026 elections, pushes wavering deputies to support the measure. The executive acts swiftly to promulgate and implement the new law before January 2026.",
            "final_reasoning": "The base rate for major labor law changes—especially those reducing employer flexibility and increasing costs—is low in Brazil, with most reforms taking years. The current legislative context is unfavorable: 70% of deputies oppose the PEC, and the Labor Minister explicitly says only massive public pressure can change this. While there is growing public debate, union mobilization, and some executive support, none of the news indicates a decisive shift or breakthrough imminent in the next 2.5 months. The plebiscite and protests are significant but do not yet match the scale of movements that have previously forced legislative change in Brazil. While there are alternative legislative vehicles (PLs), none have advanced meaningfully despite being easier to pass. Thus, while there is some probability of a last-minute surge (especially given Brazil's history of sudden political shifts under mass mobilization), the status quo, inertia, and legislative hurdles strongly dominate. I estimate a moderately low probability, allowing for a small chance of a late breakthrough.",
            "final_probability": 12
        },
        "Labor Law (Brazilian Labor Code CLT)": {
            "time_to_resolution": "Approximately 2.5 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Brazilian Labor Law (CLT), I understand both the legal and practical hurdles involved in changing the 6x1 schedule for registered workers. The CLT sets the framework for labor relations, and my perspective allows for nuanced analysis of legislative procedure, historical precedent, union/business influence, and how such reforms typically unfold.",
            "status_quo": "The 6x1 schedule is legal for CLT workers, with the majority of Brazilian workers in several sectors (retail, services, etc.) still subject to it under the CLT. There are ongoing proposals and public debate, but no law or amendment has passed to ban 6x1 as of October 2025.",
            "perspective_derived_factors": [
                {
                    "factor": "High legislative barrier",
                    "effect": "Decreases probability. Changing the 6x1 regime for most occupations requires either a constitutional amendment (PEC), which demands a supermajority in both houses, or an ordinary law, which, while easier, still faces strong political resistance."
                },
                {
                    "factor": "Political climate and opposition in Congress",
                    "effect": "Decreases probability. Recent surveys and news reporting indicate about 70% of deputies oppose banning 6x1, and business lobbies are resistant."
                },
                {
                    "factor": "Government and union support",
                    "effect": "Increases probability. President Lula, the Minister of Labor, several union federations, and segments of the judiciary support banning 6x1, and have mobilized public opinion and legislative proposals."
                },
                {
                    "factor": "Popular mobilization and plebiscite",
                    "effect": "Slightly increases probability. There is a rare level of public engagement (plebiscite, street protests, millions of signatures), which could pressure Congress as seen with the recent defeat of the \"PEC da Blindagem\"."
                },
                {
                    "factor": "Timing and legislative process",
                    "effect": "Decreases probability. With less than three months to the deadline, and key proposals still in committee stages or awaiting reports, the legislative calendar is tight, especially for a change of this magnitude."
                },
                {
                    "factor": "Base rate for rapid labor reforms in Brazil",
                    "effect": "Decreases probability. Historically, major labor reforms in Brazil take years of negotiation, and rapid passage of measures like this is rare, especially when strong business and parliamentary resistance is present."
                }
            ],
            "no_scenario": "Despite public pressure, the PEC or proposed bills do not advance to a floor vote or fail to achieve the required majority in Congress. Business lobbying, parliamentary resistance, and concerns over economic impact stall or water down the proposals. The 6x1 schedule remains legal for most CLT workers as of January 1, 2026.",
            "yes_scenario": "A surge in public protest or a last-minute political deal—possibly spurred by the plebiscite results and a push from the executive—leads Congress to pass either a constitutional amendment or a bill banning the 6x1 schedule for most CLT occupations before the deadline. The law is published and there are no more than 5 exceptions affecting less than 1% of the workforce.",
            "final_reasoning": "The legal and procedural barriers to banning the 6x1 schedule for most CLT occupations before January 2026 remain very high. While there is unprecedented union, government, and public support, the base rate for major labor reforms passing rapidly is very low in Brazil. News reports confirm that approximately 70% of deputies currently oppose the measure, and the Minister of Labor himself acknowledges that only extraordinary popular pressure could push the change through. The plebiscite and recent street actions are notable, but no evidence suggests a rapid shift in congressional opinion or legislative momentum sufficient to overcome entrenched resistance in the remaining weeks. Historically, labor reforms—even with strong mobilization—rarely clear all hurdles this quickly. Therefore, while not impossible, the probability remains quite low.",
            "final_probability": 10
        },
        "Political Science (Public Policy Process)": {
            "time_to_resolution": "Approximately 2.5 months (until 1 January 2026)",
            "perspective_relevance": "As an expert in the Public Policy Process, I bring a focus on how labor reforms emerge, the role of interest groups, political coalitions, legislative procedures, and path dependency in labor law. My expertise allows for detailed assessment of how public opinion, institutional inertia, party politics, and social mobilization interact to shape legislative outcomes in Brazil, especially for ambitious labor reforms like banning the 6x1 schedule.",
            "status_quo": "The 6x1 work schedule (six days work, one day rest) remains legal and widely used for CLT workers in Brazil. Despite ongoing debate and several legislative proposals, no bill or constitutional amendment banning 6x1 has been passed by Congress.",
            "perspective_derived_factors": [
                {
                    "factor": "Institutional Barriers in Congress",
                    "effect": "Decreases probability. Changing labor law, especially via Constitutional Amendment (PEC), requires supermajorities and faces strong resistance from business interests and a conservative bloc. Recent news indicates about 70% of deputies oppose ending 6x1, and prior proposals have stalled."
                },
                {
                    "factor": "Popular Mobilization and Public Pressure",
                    "effect": "Increases probability. There is evidence of growing street mobilization, union activism, and plebiscite campaigns, which have been decisive in some recent legislative outcomes (e.g. archiving the PEC da Blindagem). The government and labor ministry are explicitly urging mass pressure."
                },
                {
                    "factor": "Political Alignment of Executive and Legislative",
                    "effect": "Neutral to slightly positive. President Lula and the Labor Minister support ending 6x1, but the government does not have a reliable majority in Congress on labor issues, and faces opposition from business-aligned and centrist deputies."
                },
                {
                    "factor": "Legislative Alternatives (Bill vs. Constitutional Amendment)",
                    "effect": "Slightly increases probability. Some actors are pursuing passage via regular bill (PL) rather than PEC, which requires fewer votes. However, even regular bills face strong resistance; none have advanced significantly so far."
                },
                {
                    "factor": "Economic and Employer Opposition",
                    "effect": "Decreases probability. Employer associations and many deputies argue that banning 6x1 would raise costs, harm competitiveness, and risk layoffs, making legislators reluctant to approve broad bans, especially before an election year."
                },
                {
                    "factor": "Time Constraints and Legislative Calendar",
                    "effect": "Decreases probability. With only about two months left in the year, major labor reforms are unlikely to pass unless already advanced. The legislative process for both PECs and PLs is slow, with subcommittees only recently installed and reports pending."
                },
                {
                    "factor": "Historical Base Rate for Large-Scale Labor Reforms",
                    "effect": "Decreases probability. Major labor law reforms in Brazil (e.g., 2017's reform) are rare and require broad coalitions, often taking years of debate."
                }
            ],
            "no_scenario": "Despite increasing mobilization and government support, Congress remains resistant. Proposals to ban 6x1 (both PEC and PL) remain stalled in committee or are voted down due to employer lobbying and lack of legislative consensus. The 6x1 schedule continues to be legal for most CLT workers into 2026.",
            "yes_scenario": "A surge of popular mobilization—potentially triggered by the plebiscite results or major union action—leads to a rapid legislative push, with either a regular bill or a constitutional amendment passed in late 2025. The law is enacted banning 6x1 for most CLT workers before 1 January 2026.",
            "final_reasoning": "The status quo heavily favors a 'No' outcome: most deputies oppose a ban, and there is little sign that employer opposition has been overcome. While there is significant public mobilization and government support, the legislative calendar is tight, and the history of labor reform in Brazil suggests such changes are slow and require broad, sustained coalitions. The possibility of passing a regular bill (PL) instead of a PEC is a positive factor, but no such bill has yet advanced meaningfully. The fact that the Labor Minister and President are calling for public pressure indicates that support is insufficient in Congress without external impetus. Given these considerations, and accounting for the slight chance of a last-minute surge in political momentum, I assign a low but nonzero probability.",
            "final_probability": 8
        },
        "Political Science (Institutionalism)": {
            "time_to_resolution": "2 months and 18 days (until 1 January 2026)",
            "perspective_relevance": "As an expert in Political Science (Institutionalism), my perspective emphasizes the critical role of established institutional structures—especially legislative rules, party system incentives, and the inertia of existing labor laws—in shaping the likelihood of major labor reforms in Brazil. Institutionalism highlights how path dependence, veto points, and the distribution of power in Congress affect the prospects for significant policy change, such as banning the 6x1 work schedule.",
            "status_quo": "The 6x1 work schedule remains legal and prevalent for most CLT workers in Brazil, despite recurrent social mobilization and recent legislative proposals. No recent efforts to ban the 6x1 regime have passed either as ordinary law or as a constitutional amendment.",
            "perspective_derived_factors": [
                {
                    "factor": "Legislative Institutional Barriers",
                    "effect": "Decreases probability. Both constitutional amendments (PECs) and regular bills face significant obstacles: 70% of deputies reportedly oppose the ban, and the multi-party, fragmented Congress is institutionally conservative regarding labor reform. The process for amending the CLT or Constitution is lengthy and requires high quorums."
                },
                {
                    "factor": "Executive and Labor Ministry Support",
                    "effect": "Increases probability slightly. President Lula and Labor Minister Marinho publicly support ending the 6x1 schedule, but have acknowledged that executive support alone is insufficient without popular pressure and legislative buy-in."
                },
                {
                    "factor": "Popular Mobilization and Pressure",
                    "effect": "Increases probability, but not decisively. Recent history (e.g., defeat of the \"PEC da Blindagem\") shows that mass mobilization can sway Congress, but only on issues with less business resistance. The 6x1 issue faces strong economic counter-lobbies."
                },
                {
                    "factor": "Business and Economic Resistance",
                    "effect": "Decreases probability. Business groups and many deputies argue that banning 6x1 would increase costs and hurt competitiveness, especially for SMEs. This resistance is institutionally embedded in key congressional committees."
                },
                {
                    "factor": "Legislative Alternatives and Pathways",
                    "effect": "Increases probability slightly. The recent shift from constitutional amendments (requiring 3/5 supermajorities) toward regular bills (which require a simple majority) makes passage marginally more feasible, but still faces strong committee gatekeeping."
                },
                {
                    "factor": "Time Constraints and Legislative Calendar",
                    "effect": "Decreases probability. With less than three months remaining in the year—amid a crowded legislative calendar and upcoming 2026 elections—there is very limited time for deliberation, negotiation, and passage of such a significant reform."
                },
                {
                    "factor": "Historical Base Rate of Labor Law Overhaul",
                    "effect": "Decreases probability. Major labor reforms in Brazil (e.g., 2017 reform) are infrequent, typically take years to negotiate, and often occur only under strong exogenous shocks or broad consensus—which is not evident here."
                }
            ],
            "no_scenario": "Despite ongoing mobilization and executive support, the proposal to ban the 6x1 schedule fails to pass in Congress due to entrenched opposition from the majority of deputies, committee bottlenecks, and strong business lobbying. The proposal is either archived, stalled in committee, or simply does not reach the floor for a vote before the end of 2025.",
            "yes_scenario": "A surge of popular mobilization—potentially sparked by a major labor-related incident or economic shock—forces Congress to prioritize labor reform. Either a regular bill or a constitutional amendment banning the 6x1 schedule is rapidly negotiated and passed, with only minor exceptions, and signed into law before January 1, 2026.",
            "final_reasoning": "The status quo is strongly entrenched due to both institutional inertia and substantial legislative opposition, as explicitly evidenced by the 70% of deputies polled who oppose the change. While executive and union support, as well as public mobilization, do modestly increase the chance of reform, the short time remaining, the complexity of institutional change (either via PEC or regular law), and strong business resistance make rapid passage extremely unlikely. The base rate for such sweeping labor reforms passing in less than a year—especially without pre-existing consensus—is very low in Brazilian politics. The most recent momentum is not matched by actual legislative progress: proposals are stuck in committees, and even mobilizing events have not shifted the status quo. Therefore, the probability should be low, albeit not zero due to the possibility of an exogenous shock or sudden legislative bargain.",
            "final_probability": 7
        },
        "Latin American Studies (Brazilian Political Economy)": {
            "time_to_resolution": "Approximately 2.5 months (until 1 January 2026)",
            "perspective_relevance": "As an expert in Brazilian Political Economy, my perspective is crucial due to an in-depth understanding of Brazil's legislative processes, labor market history, the political economy of labor reforms, and the interplay between social mobilization, party politics, and business interests. This expertise enables a nuanced analysis of both the formal obstacles and the social forces at play in efforts to alter the 6x1 work schedule.",
            "status_quo": "The 6x1 work schedule is currently legal and standard for many CLT (registered) workers in Brazil. While there is significant mobilization to change it, legislative inertia and political resistance have so far prevented a ban.",
            "perspective_derived_factors": [
                {
                    "factor": "Legislative Hurdles in Passing Labor Reform",
                    "effect": "Decreases probability. Constitutional amendments or major labor reforms are extremely difficult to pass in Brazil, requiring a supermajority and facing stiff resistance from center and center-right blocs, especially when business interests are threatened."
                },
                {
                    "factor": "Public Mobilization and 'Ronco das Ruas' (Roar of the Streets)",
                    "effect": "Slightly increases probability. Recent history (e.g., PEC da Blindagem) shows that extraordinary popular mobilization can sway Congress, but such moments are rare and require sustained, massive pressure."
                },
                {
                    "factor": "Political Will within the Executive and Key Parties",
                    "effect": "Increases probability. President Lula and Labor Minister Marinho both publicly support ending 6x1, and the PT is actively pushing bills and constitutional amendments. However, executive support is necessary but not sufficient."
                },
                {
                    "factor": "Parliamentary Opposition and Business Lobbies",
                    "effect": "Strongly decreases probability. Surveys indicate 70% of deputies oppose ending 6x1, and business groups warn of economic fallout, raising the likelihood of legislative stalemate or dilution of proposals."
                },
                {
                    "factor": "Election Cycle and Timing",
                    "effect": "Neutral to slightly decreasing probability. The proximity of 2026 elections might make deputies less willing to approve controversial labor reforms or more sensitive to business lobbying, although labor reforms sometimes surface before elections as symbolic gestures."
                },
                {
                    "factor": "Alternative Legislative Paths (PL vs. PEC)",
                    "effect": "Slightly increases probability. The PT is now pursuing a bill (PL) route, which is easier to pass than a constitutional amendment; however, even ordinary bills face resistance and can be blocked or watered down."
                },
                {
                    "factor": "Base Rates of Similar Labor Reforms in Brazil",
                    "effect": "Decreases probability. Major labor reforms (e.g., 2017 labor reform) typically take years of negotiation and often result in pro-market, not pro-labor, outcomes. Bans of standard work schedules are unprecedented in recent decades."
                }
            ],
            "no_scenario": "Despite ongoing mobilization and executive support, Congress remains deadlocked, with business lobbies and a majority of deputies blocking any binding vote. The plebiscite is presented to Lula and the public, but fails to translate into legislative action or results in watered-down measures, leaving the 6x1 schedule intact for most CLT workers by January 2026.",
            "yes_scenario": "Massive, sustained protests in late 2025—possibly catalyzed by the plebiscite—force Congress to act. The government brokers a deal, and a bill or urgent measure is passed in December 2025, banning 6x1 for most CLT workers, perhaps with minor exceptions.",
            "final_reasoning": "The status quo is deeply entrenched, and multiple sources confirm that 70% of deputies currently oppose ending the 6x1 schedule. While public mobilization has proven effective in rare cases, such as the recent defeat of the PEC da Blindagem, there is little evidence that the momentum around labor reform is approaching a similar scale. The executive is supportive, and union and social movement pressure is rising, but the legislative hurdles are formidable: the base rate for major pro-labor reforms passing in under a year is extremely low. Additionally, even with the PL route, significant parliamentary opposition and business lobbying remain. The timing (late in the legislative year, with elections looming) further constrains the window for passage. Given all these factors—especially the strong status quo bias, legislative inertia, and base rates—while some probability must be assigned for a last-minute breakthrough fueled by extraordinary mobilization, the most likely scenario is that no ban is passed before the deadline.",
            "final_probability": 8
        }
    },
    "deliberation_probability": [
        8,
        8,
        7,
        12,
        10,
        8,
        7,
        8
    ],
    "deliberation_mean_probability": 8.5,
    "deliberation_sd": 1.6903085094570331,
    "deliberation_probability_result": 8,
    "group_results": {
        "employmentRelationsIloConventions": {
            "forecaster_to_engage": "Labor Law (Comparative Labor Law)",
            "response_type": "critique",
            "response": "You bump your probability up to 12, but you’re not offering any substantive reason to diverge from the much stronger consensus around 7-10%. You acknowledge the same hard constraints—parliamentary inertia, employer resistance, and the glacial pace of labor reforms in Brazil—yet you seem to give disproportionate weight to the possibility of a \"last-minute surge\" simply because of Brazil’s history of sudden political shifts. But history also shows that such rapid changes almost always follow a genuinely massive and sustained mobilization, which is precisely what we are NOT seeing here. The plebiscite is small scale, and even union actions haven’t moved the needle in Congress, where 70% of deputies are still opposed. If anything, 12% is too optimistic: the evidence only supports a slim, tail-risk scenario for a breakthrough, not a plausible likelihood. If you want to justify a higher probability, you need to point to real, concrete shifts in legislative behavior or mass mobilization—otherwise, you’re just being wishful."
        },
        "employmentRelationsIndustrialRelationsSystems": {
            "forecaster_to_engage": "Legislative Affairs (Brazilian Legislative Process)",
            "response_type": "defense",
            "response": "This is the sharpest, clearest-eyed take in the whole round. You cut through the noise and correctly identify the structural features that doom the 6x1 ban in the near term: Chamber hostility, business opposition, lack of executive prioritization, and—crucially—a legislative calendar that makes passage near-impossible. While everyone else is hand-waving about public mobilization, you ground your call in the real mechanics of the process: it’s not just that 70% of deputies are opposed, but that nothing in the news cycle shows a groundswell anywhere near big enough to move the needle. You also don’t get distracted by the theoretical possibility of a PL passing, recognizing that, even there, the obstacles are prohibitive on this timeline. This is a model of probabilistic, process-oriented forecasting—no wishful thinking, just cold hard base rates and institutional analysis. The 7% is well-justified; anything higher is unjustifiable optimism."
        },
        "legislativeAffairsBrazilianLegislativeProcess": {
            "forecaster_to_engage": "Labor Law (Brazilian Labor Code CLT)",
            "response_type": "critique",
            "response": "You’re right to emphasize the procedural and legal obstacles, but you’re underplaying just how calcified the status quo is right now. If anything, your probability of 10% is still too generous given the total lack of movement on the legislative calendar and the explicit statements from both the Labor Minister and the parliamentary leadership that nothing advances without a truly unprecedented mobilization—which, by all available evidence, simply isn’t happening. You cite \"unprecedented union, government, and public support,\" but the numbers don’t back that up: the plebiscite is barely a blip, and unions have failed to make 6x1 a national crisis. The only way to justify 10% would be if we saw a dramatic, unexpected surge—protests dwarfing those against the PEC da Blindagem, for example—which is nowhere in sight. Unless you see evidence of a genuine, game-changing event in the next six weeks, your estimate is an overstatement. Status quo bias is stronger than you allow."
        },
        "laborLawComparativeLaborLaw": {
            "forecaster_to_engage": "Political Science (Public Policy Process)",
            "response_type": "critique",
            "response": "You're echoing the standard talking points—status quo bias, legislative inertia, employer opposition—but then you hedge with 'slight chance of a last-minute surge' and let that nudge your probability up to 8%. That's overcompensating for tail risk. The purported possibility of a breakthrough is not grounded in any concrete evidence of actual, large-scale mobilization or a sudden change in congressional mood. The labor movement's efforts, while visible, are nowhere near what Brazil has seen during its rare moments of rapid reform, and the timeline is brutally short. If you're going to bump up your probability above the rock-bottom base rate, you need to point to more than the hypothetical: where is the evidence of a brewing political avalanche? There isn't any. Your scenario planning is solid, but your number is a little too generous for the facts on the ground."
        },
        "laborLawBrazilianLaborCodeClt": {
            "forecaster_to_engage": "Political Science (Institutionalism)",
            "response_type": "defense",
            "response": "Finally, someone who understands that inertia isn't just about numbers—it's about deep-rooted institutional and cultural resistance. You don't get lost in the weeds of every new plebiscite or protest, because you know Brazil's system only bends under extreme, coordinated, and sustained pressure. You correctly call out that 70% opposition in Congress is a mountain, not a hill, and that executive and union cheerleading means little without legislative machinery moving behind it. The clock is ticking, and your 7% nails it: there's always a sliver of room for a black swan, but the machinery of Brazilian lawmaking grinds slow, especially on something this disruptive to employers. Your analysis is cold-blooded and realistic—the right approach for a forecast like this."
        },
        "politicalSciencePublicPolicyProcess": {
            "forecaster_to_engage": "Employment Relations (ILO Conventions)",
            "response_type": "defense",
            "response": "You are absolutely right to anchor your probability in the single-digit range and to lean hard on the base rates and the status quo. The allure of a \"sudden Brazilian political shift\" is a mirage unless there is sustained, overwhelming mobilization—something the evidence here simply does not support. You correctly identify that, despite government support and some union activism, nothing has crested into the kind of national crisis that forces legislative action on a compressed timeline. Your acknowledgment of a nonzero chance (tail risk) is reasonable, but you don’t let it distort your estimate the way some others do. In sum: your forecast is measured, realistic, and grounded, and you should be commended for sticking to the facts rather than wish-casting."
        },
        "politicalScienceInstitutionalism": {
            "forecaster_to_engage": "Labor Law (Comparative Labor Law)",
            "response_type": "critique",
            "response": "You bump your probability up to 12, but you’re not offering any substantive reason to diverge from the much stronger consensus around 7-10%. You acknowledge the same hard constraints—parliamentary inertia, employer resistance, and the glacial pace of labor reforms in Brazil—yet you seem to give disproportionate weight to the possibility of a \"last-minute surge\" simply because of Brazil’s history of sudden political shifts. But history also shows that such rapid changes almost always follow a genuinely massive and sustained mobilization, which is precisely what we are NOT seeing here. The plebiscite is small scale, and even union actions haven’t moved the needle in Congress, where 70% of deputies are still opposed. If anything, 12% is too optimistic: the evidence only supports a slim, tail-risk scenario for a breakthrough, not a plausible likelihood. If you want to justify a higher probability, you need to point to real, concrete shifts in legislative behavior or mass mobilization—otherwise, you’re just being wishful."
        },
        "latinAmericanStudiesBrazilianPoliticalEconomy": {
            "forecaster_to_engage": "Labor Law (Comparative Labor Law)",
            "response_type": "critique",
            "response": "You set your probability at 12%—noticeably higher than the solid consensus in the 7-10% range—without offering any truly convincing reason for the bump. You talk about the chance of a 'last-minute surge,' but you fail to show any evidence that such a surge is brewing: the plebiscite numbers are anemic, union mobilization is below historical thresholds for seismic change, and Congress remains deadlocked with 70% opposed. Brazil's history of rapid policy shifts is only relevant when there is massive, undeniable, and sustained popular pressure, which is absent here. Your scenario planning is disciplined, but the actual on-the-ground indicators simply don't warrant more than a single-digit probability. Unless you can point to real, concrete momentum in legislative behavior or street mobilization, your optimism is misplaced."
        }
    },
    "revision_results": {
        "Employment Relations (ILO Conventions)": {
            "my_phase1_final_probability": 8,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I find strong consensus across all relevant domains—labor law, legislative process, political science, and regional expertise—that the probability of a ban before January 1, 2026 remains very low. The one slightly higher estimate (12%) was critiqued for overvaluing the possibility of a sudden shift without concrete supporting evidence. No new information or compelling argument has emerged to warrant a change from my initial assessment. The entrenched parliamentary opposition, legislative inertia, and insufficient scale of public mobilization remain decisive factors. Thus, my reasoning—and probability—remain unchanged.",
            "revised_probability": 8
        },
        "Employment Relations (Industrial Relations Systems)": {
            "my_phase1_final_probability": 8,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, my conviction in the original low probability is reinforced. The consensus among specialists—including those in legislative affairs, political science, and Brazilian labor law—is that all relevant base rates, institutional inertia, and current political dynamics overwhelmingly favor the status quo. The critiques of higher probabilities (such as 12%) are persuasive: there is no evidence of the level of mass mobilization or legislative movement required for a breakthrough. The legislative process is not just slow but actively resistant, and the timeline is extremely tight. While I considered a slight downward adjustment given some forecasters' even lower probabilities (7%), the margin is negligible given the inherent uncertainty in politics, so I hold at 8%.",
            "revised_probability": 8
        },
        "Legislative Affairs (Brazilian Legislative Process)": {
            "my_phase1_final_probability": 7,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I see no compelling reason to substantially revise my initial probability. The arguments from other forecasters are in strong consensus: the legislative and institutional barriers are overwhelming, the current level of public and union mobilization is insufficient to move Congress, and there is no concrete evidence of a late-breaking groundswell or political deal in the works. The slight differences among forecasters (e.g., 7% vs. 10% vs. 12%) hinge mostly on subjective weighting of Brazil's historical volatility and slim-tail scenarios, but the news cycle and legislative calendar both strongly support a very low probability. If anything, the critiques reinforce my original analysis that the base rate for such a major labor law change on a short timeline is extremely low, and the status quo bias is even stronger than some forecasters admit. Therefore, I will keep my estimate at 7%.",
            "revised_probability": 7
        },
        "Labor Law (Comparative Labor Law)": {
            "my_phase1_final_probability": 12,
            "reasoning_for_revised_probability": "The group deliberation made clear that my initial probability was relatively optimistic compared to the strong consensus among other experts, most of whom are clustered in the 7-8% range. The critiques emphasized that the evidence for a last-minute surge is even weaker than I allowed for: the plebiscite is small, union actions haven't moved Congress, and there has been no mass mobilization of the scale required for a historic legislative reversal. Furthermore, the legislative calendar and explicit public statements by both the Labor Minister and parliamentary leadership indicate that nothing is advancing without unprecedented pressure, which is not materializing. The base rate for such a rapid, disruptive labor law change is extremely low, and absent clear, concrete signs of an impending shock, my tail-risk adjustment should be more modest. Therefore, I am revising my probability downward to align better with the base rates and the current evidence.",
            "revised_probability": 8
        },
        "Labor Law (Brazilian Labor Code CLT)": {
            "my_phase1_final_probability": 10,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I see consensus among domain experts—including those with knowledge of legislative process, industrial relations, and public policy—that the base rate for such a rapid, sweeping labor reform is extremely low. Most forecasters are clustered tightly between 7% and 10%, with the most process-attuned voices arguing for the lower end due to the legislative calendar, entrenched congressional opposition (70% against), and lack of evidence for a mass mobilization capable of shifting parliamentary behavior in the remaining weeks. Critiques of slightly higher probabilities (10-12%) highlighted the absence of any game-changing political or social event on the horizon. My own original probability—10%—already reflected a low likelihood but in light of these arguments, especially the strong case for status quo persistence, I now see that even 10% may be slightly generous unless a dramatic shift occurs. Therefore, I am revising downward to 8%, in line with the best-supported base rate and the overwhelming evidence of institutional inertia.",
            "revised_probability": 8
        },
        "Political Science (Public Policy Process)": {
            "my_phase1_final_probability": 8,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, my initial assessment is reinforced. The consensus among experts in legislative affairs, labor law, and political science is that the base rate for rapid, large-scale labor reform in Brazil—especially with explicit 70% parliamentary opposition and no evidence of a mass mobilization breakthrough—is extremely low. While some forecasters gave very slightly higher probabilities, the critiques correctly point out that any increase above the low single digits would require concrete, imminent evidence of a political or social earthquake, which is not present. The institutional and procedural inertia, the timeline, and the lack of legislative momentum all point to the status quo holding. My initial probability was already at the high end of the justified range, and upon reflection, I see no reason to raise it. If anything, the risk is slightly to the downside, but not enough to warrant a change.",
            "revised_probability": 8
        },
        "Political Science (Institutionalism)": {
            "my_phase1_final_probability": 7,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, especially the critiques and defenses across different expert perspectives, my conviction in the original low probability is reinforced. The consensus among informed forecasters is that the base rate for rapid, sweeping labor reform in Brazil is extremely low, especially given the explicit 70% opposition in Congress, the lack of mass mobilization, and the limited time left. The higher probabilities (e.g., 12%) are not justified by any evidence of a real shift in legislative dynamics or public pressure, and the modest tail-risk for a sudden breakthrough is already captured by a 7% estimate. No new information from deliberation suggests an upward or downward revision is warranted.",
            "revised_probability": 7
        },
        "Latin American Studies (Brazilian Political Economy)": {
            "my_phase1_final_probability": 8,
            "reasoning_for_revised_probability": "After reviewing both my original analysis and the group deliberation, I see a clear consensus emerging around the 7-10% range, with strong arguments underscoring the formidable structural, institutional, and political obstacles to passing a 6x1 ban before January 2026. Critiques of higher probabilities (like 12%) are persuasive—there is no concrete evidence of a brewing last-minute mass mobilization or seismic legislative shift. The status quo bias remains exceptionally strong, and while tail risks exist, they are not enough to justify a higher estimate. My initial reasoning holds: the legislative calendar is tight, opposition in Congress is entrenched, and union/public mobilization, while real, is not yet at the threshold required for rapid change. I see no new information or arguments that would justify moving my probability upward or downward. Thus, I will maintain my original probability.",
            "revised_probability": 8
        }
    },
    "revision_probability": [
        8,
        8,
        7,
        8,
        8,
        8,
        7,
        8
    ],
    "revision_mean_probability": 7.75,
    "revision_sd": 0.4629100498862757,
    "revision_probability_result": 8,
    "question_details": {
        "id": 38951,
        "title": "Will Brazil ban the 6x1 work schedule before 1 January 2026?",
        "created_at": "2025-08-31T06:17:36.868665Z",
        "open_time": "2025-09-27T13:45:12Z",
        "cp_reveal_time": "2025-09-27T15:15:12Z",
        "spot_scoring_time": "2025-09-27T15:15:12Z",
        "scheduled_resolve_time": "2026-01-01T03:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-09-27T15:15:12Z",
        "actual_close_time": "2025-09-27T15:15:12Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "This question is synced with an identical question on Metaculus. The original question opened on 2024-11-22 02:45:00 and can be found [here](https://www.metaculus.com/questions/29956). This question will resolve to the same value as the synced question. The original question's background info at this time is below. \n\nThere is currently [a lot of talk](https://www.brasildefato.com.br/2024/11/11/why-is-everyone-talking-about-the-6x1-work-schedule-in-brazil ) about banning the 6x1 work schedule (6 working days, 1 off) for registered workers in Brazil. Proponents claim that working 6 days a week is too exhausting and doesn't leave enough time for workers to rest, socialize and run errands. An ambitious constitutional ammendment has recently [been proposed](https://www1.folha.uol.com.br/internacional/en/business/2024/11/proposal-to-reduce-weekly-work-hours-in-brazil-gains-momentum-in-congress.shtml) by two Brazilian congress members that would mandate a 4x3 schedule for all workers and has garnered some support.\n\nPortuguese language sources:\n- https://noticias.uol.com.br/politica/ultimas-noticias/2024/11/12/fim-da-escala-6x1-o-que-muda-se-pec-for-aprovada-no-congresso.htm\n- https://economia.uol.com.br/noticias/redacao/2024/11/12/o-que-e-a-escala-6x1-entenda-o-que-propoe-a-pec-para-reducao-da-jornada.htm\n\n`{\"format\":\"metac_closes_in_period\",\"info\":{\"post_id\":29956,\"question_id\":29790}}`",
        "resolution_criteria": "This question will resolve as **Yes** if the 6x1 work schedule is officialy banned for most CLT occupations in Brazil before 1 January 2026, and will resolve as **No** otherwise.",
        "fine_print": "This question concerns only CLT occupations in Brazil (registered workers), and will resolve to **Yes** even if employers find legal workarounds to keep hiring people in 6x1 work schedules after a ban.\n\nIn Brazil, a CLT worker is someone employed under the rules of the Consolidação das Leis do Trabalho (CLT), or the Consolidation of Labor Laws. This legislation governs employment relations and protects workers' rights in Brazil. Being a CLT worker means you’re formally employed and entitled to a range of rights and protections set out in Brazilian labor laws.\n\n\"Most CLT occupations\" here means that the law lists no more than 5 exceptions to the general rule, affecting in total no more than 1% of the workforce",
        "post_id": 39574,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Plebiscite on Ending the 6‑Day Work Week to Close by Month’s End**\nThe plebiscite on ending the 6‑day work week (6x1) and granting income‑tax exemption for earners up to R$5 000 is set to close on 30 October 2025, according to the article.  The campaign, led by groups such as the MST, MTST, CUT, CTB, Sinteal, and left‑wing parties PT, PCdoB and PSOL, has been collecting votes and signatures since July, extending the period by a month to pressure the National Congress.  In Alagoas, physical ballot boxes were moved through schools, markets and other public spaces, while online voting codes were also distributed.  Organizers estimate that the plebiscite will exceed 10 000 votes, though the exact total is not yet known.  The campaign’s president, Izael Ribeiro of Sinteal, said the widespread participation “was very large” and that the proposal “has a very positive reaction” (Izael Ribeiro, quoted).  He added that the results will be presented to President Lula next week to push for the reform of the income‑tax table, which is already in Congress under the sponsorship of Senator Renan Calheiros and Deputy Arthur Lira.  The article notes that the plebiscite is a constitutional instrument (Art. 14 of the Constitution, Lei 9.709/98) that allows citizens to be consulted before a law is enacted.  The campaign’s goal is to secure a tax‑justice measure that exempts those earning below R$5 000 while increasing taxes on those earning above R$50 000.  The article reports that the voting will remain open until 30 October, with instructions to use a mobile phone to scan a QR code for online participation.\nOriginal language: pt\nPublish date: September 27, 2025 11:35 AM\nSource:[Tribuna Hoje](https://tribunahoje.com/index.php/noticias/politica/2025/09/27/167474-plebiscito-popular-da-escala-6x1-sera-encerrado-no-final-do-mes)\n\n**Marinho Calls for Public Pressure to End 6×1 Work Schedule**\nBrazilian Labor Minister Luiz Marinho publicly urged citizens to protest and go to the National Congress to push for the Constitutional Amendment (PEC) that would end the 6×1 work schedule, where workers work six days and rest one. He said that without popular pressure the PEC would not advance, noting that the topic \"has great difficulty tramitar no Congresso Nacional\" and that a \"livre, leve, solto\" parliament would only harm workers. Marinho made the remarks on the \"Bom Dia Ministro\" program on the federal government channel. The PEC, introduced by federal deputy Erika Hilton (PSOL‑SP) in February, proposes moving to a 4×3 or 5×2 schedule, arguing that 6×1 \"escravizes workers\" by limiting family time. Despite being filed, the proposal has moved slowly; a survey shows about 70% of deputies disagree with the text.\nOriginal language: pt\nPublish date: September 26, 2025 02:35 PM\nSource:[Jovem Pan – Esportes, entretenimento, notícias e vídeos com credibilidade](https://jovempan.com.br/programas/jornal-da-manha/marinho-defende-pressao-popular-no-congresso-para-fim-da-escala-6x1.html)\n\n**No DR com Demori: TST Minister Delaíde Miranda Discusses the 6x1 Schedule and Labor Reform Impacts**\nOn September 23, 2025, Minister Delaíde Miranda appeared on the TV Brasil program \"DR com Demori\" to discuss new work arrangements, digital platforms, slavery, and the 2025 labor reform. She highlighted her background as a former domestic worker and noted her support for the CLT. Miranda said, 'Eu acompanho muito as deflagrações do Ministério Público do Trabalho nas questões de resgate de trabalho escravo. E entendo que, no fundo, é uma questão de lucro. Por quê? Onde se detecta mais? Nas empresas terceirizadas por grandes multinacionais'. She also argued that ending the 6x1 schedule would create more jobs and allow workers to better qualify, spend time with family and leisure, saying, 'A redução da jornada traria o benefício de criar mais empregos, além de permitir que o trabalhador possa se qualificar melhor, dedicar mais tempo à família e ao lazer. A gente não pode pensar em um trabalhador que viva apenas para o trabalho'. The program aired on TV Brasil and Rádio MEC at 23:00 on September 23, 2025.\nOriginal language: pt\nPublish date: September 26, 2025 04:43 AM\nSource:[ebc.com.br](https://www.ebc.com.br/imprensa/2025/no-dr-com-demori-a-ministra-do-tst-delaide-miranda-analisa-a-escala-6x1-e-impactos-da-reforma-trabalhista)\n\n**Guilherme Derrite to Remain in São Paulo Security Post Until March 2026 at Governor's Request**\nGuilherme Derrite, the current Secretary of Public Security of São Paulo, said on Thursday, 25 September 2025 that he will stay in the post until the end of the disqualification period in March 2026, at the request of Governor Tarcísio de Freitas.  Derrite explained that the Progressistas party had considered an early exit so he could return to the federal Chamber of Deputies and work on the Constitutional Amendment (PEC) 18 on public security.  He added, 'A possibilidade de antecipar minha volta ao Congresso existe por conta dos temas ligados à segurança pública. Mas, a pedido do governador, eu devo permanecer até o final do prazo, em março.'  The PEC 18 seeks to modernise Brazil’s security system by integrating federal, state and municipal forces; Derrite said it has already begun in a special commission and that he has met with the commission’s president, Deputy Aluísio Mendes, and the rapporteur, Mendonça Filho, to discuss its progress.  He also noted that he will continue to focus on structural actions such as vehicle deliveries and expanding the Muralha Paulista program, which is now present in 61 % of the state’s cities.  Derrite plans to run for the Senate in 2026, which requires him to leave the state post by April 2026 and return to the Chamber by March 2026.\nOriginal language: pt\nPublish date: September 26, 2025 01:05 AM\nSource:[Jovem Pan – Esportes, entretenimento, notícias e vídeos com credibilidade](https://jovempan.com.br/noticias/brasil/governador-pediu-para-eu-permanecer-o-maximo-de-tempo-no-governo-afirma-derrite.html)\n\n**Minister of Labor says government supports ending 6x1 schedule and defends 'pressure' on Congress**\nThe Brazilian Minister of Labor, Luiz Marinho, said on September 25, 2025 that ending the 6‑day work schedule (6x1) will only succeed if the National Congress is subjected to 'muita pressão' (heavy pressure). He supports ending 6x1 and cutting the weekly work hour from 44 to 40. Marinho cited the successful street mobilization that led to the archiving of the PEC of blindagem as an example of pressure. In February, Deputy Erika Hilton (PSOL‑SP) introduced a constitutional amendment to reduce the maximum weekly work time to 36 hours over four days. A Quaest survey found that 70 % of federal deputies oppose ending 6x1. Marinho warned that without pressure, the measure will not pass and urged voters to consider candidates’ positions on 6x1 when voting next year.\nOriginal language: pt\nPublish date: September 25, 2025 01:53 PM\nSource:[globo.com](https://g1.globo.com/politica/noticia/2025/09/25/ministro-do-trabalho-diz-que-governo-apoia-fim-da-escala-6x1-e-defende-pressao-sobre-o-congresso.ghtml)\n\n**Plebiscite on Ending the 6‑Day Work Week to Close by Month’s End**\nThe plebiscite on ending the 6‑day work week (6x1) and granting income‑tax exemption for earners up to R$5 000 is set to close on 30 October 2025, according to the article.  The campaign, led by groups such as the MST, MTST, CUT, CTB, Sinteal, and left‑wing parties PT, PCdoB and PSOL, has been collecting votes and signatures since July, extending the period by a month to pressure the National Congress.  In Alagoas, physical ballot boxes were moved through schools, markets and other public spaces, while online voting codes were also distributed.  Organizers estimate that the plebiscite will exceed 10 000 votes, though the exact total is not yet known.  The campaign’s president, Izael Ribeiro of Sinteal, said the widespread participation “was very large” and that the proposal “has a very positive reaction” (Izael Ribeiro, quoted).  He added that the results will be presented to President Lula next week to push for the reform of the income‑tax table, which is already in Congress under the sponsorship of Senator Renan Calheiros and Deputy Arthur Lira.  The article notes that the plebiscite is a constitutional instrument (Art. 14 of the Constitution, Lei 9.709/98) that allows citizens to be consulted before a law is enacted.  The campaign’s goal is to secure a tax‑justice measure that exempts those earning below R$5 000 while increasing taxes on those earning above R$50 000.  The article reports that the voting will remain open until 30 October, with instructions to use a mobile phone to scan a QR code for online participation.\nOriginal language: pt\nPublish date: September 27, 2025 11:35 AM\nSource:[Tribuna Hoje](https://tribunahoje.com/index.php/noticias/politica/2025/09/27/167474-plebiscito-popular-da-escala-6x1-sera-encerrado-no-final-do-mes)\n\n**Proposal to Legally Prevent Delays in ISSEMyM Pension Payments**\nIn the local congress, the MC caucus proposed a bill to prohibit the delay or suspension of pension payments from the Instituto de Seguridad Social del Estado de México y Municipios (ISSEMyM). The proposal would require the pension to be paid within 30 days, the period allowed by current law, and if the payment is not resolved in that time, a provisional payment would be made. If the institution fails to comply, a 5 % compensation on the unpaid amount would be granted. The bill preserves the existing exceptions in the Social Security Law for state and municipal public servants, such as incompatibility of pensions, suspension upon re‑entry to public service, verification or doubt of documents, revocation for acts affecting granted rights, and restitution of improper payments.\n\nThe proponent, Deputy Maricela Beltrán Sánchez (MC), emphasized that the goal is to protect retirees from administrative inefficiency and financial disorder. She noted that while the law allows a maximum of 30 working days to resolve requests, in practice the processes are taking more than a year.\n\nAccording to the proposal, official data show that 59 % of ISSEMyM’s total spending in 2024 was allocated to pensions and retirements. The document also states that \"no obstante, se han documentado inmensos rezagos administrativos y retrasos de meses o incluso años para que los beneficiarios reciban lo que en justicia les corresponde\". The institute faces a severe budget contingency; in 2023 its expenditures totaled 38 846 million pesos, exceeding its revenues of 37 832.98 million pesos, confirming an operating deficit.\n\nThe bill would therefore ensure timely pension payments, provide provisional coverage if delays occur, and impose a penalty for non‑compliance, aiming to safeguard retirees from prolonged administrative delays.\nOriginal language: es\nPublish date: September 26, 2025 05:43 PM\nSource:[Portal Diario](https://diarioportal.com/legislatura/proponen-impedir-por-ley-retraso-en-pago-de-pensiones-del-issemym)\n\n**STF Validates Loss of Mandate if Politician Leaves Party to Create New Party**\nOn September 26 2025, the Supreme Federal Court (STF) confirmed that a politician who leaves a party to create a new one will lose their mandate, a decision that relies on a 30‑day window for new parties to receive parliamentarians without risk of revocation. The ruling was supported by six ministers following rapporteur Luís Roberto Barroso, who argued that the change, enacted by law 13.165/15, aims to reduce party fragmentation and frequent defections. The case was brought by Rede Sustentabilidade, whose party was registered with the Superior Electoral Court (TSE) in September 2015 and would have had a 30‑day period to accept new members under the old rules. Barroso said, 'A migração constante de parlamentares entre partidos esvazia a escolha feita nas urnas e enfraquece o papel dos partidos como expressão de projetos políticos duradouros.' He added, 'Não se pode admitir que lei limite ou exclua os efeitos do direito, quando todos os fatos necessários à sua aquisição já haviam sido completados e sua própria fruição já havia começado.' The ruling preserves the right of parties registered before the law’s entry into force to receive new affiliates within the original 30‑day period, while treating the creation of a new party as a constitutional ground for defiliation.\nOriginal language: pt\nPublish date: September 26, 2025 05:38 PM\nSource:[Migalhas](https://www.migalhas.com.br/quentes/440968/stf-valida-perda-de-mandato-se-politico-deixa-sigla-para-criar-partido)\n\n**Marinho Calls for Public Pressure to End 6×1 Work Schedule**\nBrazilian Labor Minister Luiz Marinho publicly urged citizens to protest and go to the National Congress to push for the Constitutional Amendment (PEC) that would end the 6×1 work schedule, where workers work six days and rest one. He said that without popular pressure the PEC would not advance, noting that the topic \"has great difficulty tramitar no Congresso Nacional\" and that a \"livre, leve, solto\" parliament would only harm workers. Marinho made the remarks on the \"Bom Dia Ministro\" program on the federal government channel. The PEC, introduced by federal deputy Erika Hilton (PSOL‑SP) in February, proposes moving to a 4×3 or 5×2 schedule, arguing that 6×1 \"escravizes workers\" by limiting family time. Despite being filed, the proposal has moved slowly; a survey shows about 70% of deputies disagree with the text.\nOriginal language: pt\nPublish date: September 26, 2025 02:35 PM\nSource:[Jovem Pan – Esportes, entretenimento, notícias e vídeos com credibilidade](https://jovempan.com.br/programas/jornal-da-manha/marinho-defende-pressao-popular-no-congresso-para-fim-da-escala-6x1.html)\n\n**Automatic Pix Debit Required for Unauthorized Banks**\nThe Monetary Council (CMN) and the Central Bank (BC) approved on 25 September 2025 resolutions that make the use of Pix automatic mandatory for interbank debit authorizations when the recipient is a legal entity or an entity not authorized to operate by the BC. Under the new rule, a customer must authorize the debit in the app of their financial institution before the money leaves their account. The BC says the mandatory use of Pix automatic brings greater convenience and control to customers and prevents unauthorized charges. The measures take effect on 13 October 2025, with a deadline of 1 January 2026 for institutions to adjust contracts and authorizations. The BC claims that Pix automatic can increase competition, reduce delinquency, improve operational efficiency and lower collection costs. The rule does not apply when the institution that holds the payer’s account is also the recipient of the funds. The article explains how Pix automatic works for recurring payments and outlines additional security measures the BC is implementing after a series of cyber attacks, such as limiting Pix access for institutions using PSTIs, tightening transaction value limits, and extending the block period for large transfers. The BC says, 'O BC diz que a adoção do Pix automático tem o potencial de aumentar a competição, reduzir a inadimplência, elevar a eficiência de processos operacionais e diminuir os custos dos procedimentos de cobrança.' The new rule does not apply when the institution responsible for the payer’s account is also the recipient of the funds, 'A nova regra não vale quando a instituição responsável pela conta do pagador também for a destinatária dos recursos.' The BC also notes, 'O BC passou a preparar um pacote de medidas visando reforçar a segurança do sistema financeiro nacional após uma sequência de ataques cibernéticos e fechar brechas que permitiram a infiltração do crime organizado na economia.'\nOriginal language: pt\nPublish date: September 26, 2025 01:54 PM\nSource:[Folha de S.Paulo](https://www1.folha.uol.com.br/mercado/2025/09/pix-automatico-sera-obrigatorio-em-debitos-para-instituicoes-nao-autorizadas.shtml)\n\n**No DR com Demori: TST Minister Delaíde Miranda Discusses the 6x1 Schedule and Labor Reform Impacts**\nOn September 23, 2025, Minister Delaíde Miranda appeared on the TV Brasil program \"DR com Demori\" to discuss new work arrangements, digital platforms, slavery, and the 2025 labor reform. She highlighted her background as a former domestic worker and noted her support for the CLT. Miranda said, 'Eu acompanho muito as deflagrações do Ministério Público do Trabalho nas questões de resgate de trabalho escravo. E entendo que, no fundo, é uma questão de lucro. Por quê? Onde se detecta mais? Nas empresas terceirizadas por grandes multinacionais'. She also argued that ending the 6x1 schedule would create more jobs and allow workers to better qualify, spend time with family and leisure, saying, 'A redução da jornada traria o benefício de criar mais empregos, além de permitir que o trabalhador possa se qualificar melhor, dedicar mais tempo à família e ao lazer. A gente não pode pensar em um trabalhador que viva apenas para o trabalho'. The program aired on TV Brasil and Rádio MEC at 23:00 on September 23, 2025.\nOriginal language: pt\nPublish date: September 26, 2025 04:43 AM\nSource:[ebc.com.br](https://www.ebc.com.br/imprensa/2025/no-dr-com-demori-a-ministra-do-tst-delaide-miranda-analisa-a-escala-6x1-e-impactos-da-reforma-trabalhista)\n\n**Guilherme Derrite to Remain in São Paulo Security Post Until March 2026 at Governor's Request**\nGuilherme Derrite, the current Secretary of Public Security of São Paulo, said on Thursday, 25 September 2025 that he will stay in the post until the end of the disqualification period in March 2026, at the request of Governor Tarcísio de Freitas.  Derrite explained that the Progressistas party had considered an early exit so he could return to the federal Chamber of Deputies and work on the Constitutional Amendment (PEC) 18 on public security.  He added, 'A possibilidade de antecipar minha volta ao Congresso existe por conta dos temas ligados à segurança pública. Mas, a pedido do governador, eu devo permanecer até o final do prazo, em março.'  The PEC 18 seeks to modernise Brazil’s security system by integrating federal, state and municipal forces; Derrite said it has already begun in a special commission and that he has met with the commission’s president, Deputy Aluísio Mendes, and the rapporteur, Mendonça Filho, to discuss its progress.  He also noted that he will continue to focus on structural actions such as vehicle deliveries and expanding the Muralha Paulista program, which is now present in 61 % of the state’s cities.  Derrite plans to run for the Senate in 2026, which requires him to leave the state post by April 2026 and return to the Chamber by March 2026.\nOriginal language: pt\nPublish date: September 26, 2025 01:05 AM\nSource:[Jovem Pan – Esportes, entretenimento, notícias e vídeos com credibilidade](https://jovempan.com.br/noticias/brasil/governador-pediu-para-eu-permanecer-o-maximo-de-tempo-no-governo-afirma-derrite.html)\n\n**The Roar of the Streets, the Burial of the Shielding PEC, and January 8**\nThe article reports that the Brazilian Senate has definitively rejected the \"PEC da Blindagem\" (the \"PEC of Shielding\"), a bill that had been approved in the Chamber of Deputies a week earlier. The rejection was unanimous, with the Senate’s Constitution and Justice Committee and President Davi Alcolumbre voting against it. The author frames this decision as evidence that the \"ronco das ruas\" (the roar of the streets) still holds power over the Congress.\n\nThe piece traces the history of the \"ronco das ruas\" from the early 1960s, when President João Goulart relied on popular mobilisations to defend his reforms, through the 1968 \"Passeata dos 100 Mil\" in Rio de Janeiro, where more than 100,000 students, artists, intellectuals and workers protested the military regime. The protest was followed on 13 December 1968 by the decree of AI‑5, which closed Congress, suspended civil liberties and granted absolute power to the executive, ushering in the most brutal phase of the dictatorship.\n\nAfter two decades of silence, the \"ronco das ruas\" re‑emerged during the Diretas Já movement (1983‑1984). Leaders such as Ulysses Guimarães, Leonel Brizola and Tancredo Neves used the popular pressure—\"mais de um milhão\" attended the Praça da Sé rally—to push Congress toward redemocratization, culminating in the 1988 Constitution.\n\nThe article then highlights the 1 January 2023 inauguration of President Lula, where \"centenas de milhares\" of Brazilians gathered in Brasília, a democratic celebration that forced the Bolsonaro‑led coup plotters to postpone their attempt. The failed coup on 8 January 2024 is described as a \"golpe dentro do golpe\" that was thwarted by institutional resistance and international pressure.\n\nFinally, the author notes that on 21 September 2025 the \"ronco das ruas\" again echoed strongly, threatening to halt attempts at amnesty, shielding and façade pacification that would absolve former coup plotters. The narrative concludes that Congress moves not by virtue but by calculation, and the roar of the streets is decisive.\n\nKey metrics cited: 100 000 protesters in 1968; more than 1 million at the Praça da Sé rally; 21 years of dictatorship (1964‑1985); 1 January 2023 inauguration; 8 January 2024 coup attempt; 21 September 2025 protests.\n\nNotable quotes from the article (single‑quoted as requested): 'o ronco das ruas', 'PEC da Bandidagem', 'PEC da Blindagem', 'AI‑5', 'golpe dentro do golpe', 'Diretas Já', 'Constituição Cidadã', 'ronco das ruas', 'Constituição Cidadã', 'ronco das ruas', 'ronco das ruas', 'ronco das ruas'.\nOriginal language: pt\nPublish date: September 25, 2025 11:27 PM\nSource:[Brasil 247](https://www.brasil247.com/blog/o-ronco-das-ruas-o-enterro-da-pec-da-blindagem-e-o-8-de-janeiro)\n\n**Minister of Labor says government supports ending 6x1 schedule and defends 'pressure' on Congress**\nThe Brazilian Minister of Labor, Luiz Marinho, said on September 25, 2025 that ending the 6‑day work schedule (6x1) will only succeed if the National Congress is subjected to 'muita pressão' (heavy pressure). He supports ending 6x1 and cutting the weekly work hour from 44 to 40. Marinho cited the successful street mobilization that led to the archiving of the PEC of blindagem as an example of pressure. In February, Deputy Erika Hilton (PSOL‑SP) introduced a constitutional amendment to reduce the maximum weekly work time to 36 hours over four days. A Quaest survey found that 70 % of federal deputies oppose ending 6x1. Marinho warned that without pressure, the measure will not pass and urged voters to consider candidates’ positions on 6x1 when voting next year.\nOriginal language: pt\nPublish date: September 25, 2025 01:53 PM\nSource:[globo.com](https://g1.globo.com/politica/noticia/2025/09/25/ministro-do-trabalho-diz-que-governo-apoia-fim-da-escala-6x1-e-defende-pressao-sobre-o-congresso.ghtml)\n\n**Minister of Labor Calls for End of 6x1 Schedule and Urges Congress**\nThe Brazilian Minister of Labor and Employment, Luiz Marinho, appeared on the EBC program 'Bom Dia, Ministro' on September 25, 2025, to argue for ending the 6x1 work schedule and reducing the weekly work hours from 44 to 40. He said, 'Eu defendo que reduza para 40 horas semanais, saindo das 44 horas semanais. E defendo que se encontre um jeito de acabar com a escala 6x1', and emphasized that the decision ultimately depends on the National Congress. Marinho urged the public to mobilize and pressure legislators, stating, 'Se tiver uma mobilização dirigida, com massa, com vigor, de rua, é possível que o Congresso Nacional venha atender esse clamor da classe trabalhadora'. He added that a collective agreement would be needed to maintain economic activity, but it would require congressional authorization to ban the 6x1 schedule. The interview was conducted by Fabio Rodrigues-Pozzebom for Agência Brasil.\nOriginal language: pt\nPublish date: September 25, 2025 12:33 PM\nSource:[Home](https://odia.ig.com.br/economia/2025/09/7135035-ministro-do-trabalho-defende-fim-da-escala-6x1-e-pede-pressao-ao-congresso.html)\n\n**Working less and better? 'Few companies experiment with a four‑day week, but when they do, most don't want to go back'**\nThe article discusses the growing interest in reducing working hours worldwide, focusing on Brazil and Portugal. In Brazil, the campaign against the \"escala 6x1\"—a schedule where workers work six days a week and have only one day off—has sparked street protests and prompted congressional debate, as the article states that \"milhares [people] went to the streets in protest and mobilized deputies in Congress.\" In Portugal, the debate centers on creating a healthier work‑life balance by cutting weekly hours and implementing a four‑day work week. The article notes that this issue was part of the Livre party’s electoral platform and had already been on the agenda of the XXIII Constitutional Government led by António Costa in 2023. It also highlights that Portuguese workers often exceed the 40‑hour limit set by Law No. 7/2009 of the Labor Code, with the article explicitly mentioning \"acima das 40 horas permitidas pela Lei nº 7/2009 do Código do Trabalho.\" These points illustrate the broader context of labor reforms and the push for more flexible working arrangements.\nOriginal language: pt\nPublish date: September 09, 2025 04:14 PM\nSource:[Jornal Expresso](https://expresso.pt/revista/fisga/2025-09-09-trabalhar-menos-e-melhor--poucas-empresas-experimentam-a-semana-de-quatro-dias-mas-quando-o-fazem-a-maior-parte-nao-quer-voltar-atras-398d5ec2)\n\n**Life Beyond Work: Ending the 6×1 Schedule Revives Brazil's Historical Struggle**\nThe article discusses the Brazilian proposal to abolish the 6×1 work schedule, a system that has been criticized for overworking employees. According to the International Labour Organization, the average weekly working hours in Brazil in 2023 were 39, lower than India (47), China (46) and Mexico (44), but higher than Germany (34), Australia (32) and Canada (32). The piece cites several stakeholders: deputy Bella Gonçalves (Psol) said, 'A luta pelo fim da escala 6×1 é uma pauta muito importante do mundo do trabalho… talvez seja a primeira vez em muitos anos que uma pauta positiva ganha uma expressão e um debate público que chega praticamente em todas as pessoas'; economist Frederico Melo of Dieese explained that sectors such as agriculture, construction and commerce have the highest 40‑hour‑plus workloads and that the change would not lead to layoffs, calling the business argument a 'falácia'; CUT‑MG president Jairo Nogueira highlighted the intensification of the 6×1 schedule after the 2017 labor reform and noted that countries like Iceland, Belgium and the UK already test four‑day weeks. The article also reports that Dieese’s April bulletin found the 2017 reform spread the 12×36 schedule and promoted intermittent work, which disrupts social life and professional development. Workers such as Lucas Sidrach of the Vida Além do Trabalho movement argue that the current schedule hampers family life and mental health, while deputy Beatriz Cerqueira (PT) posted on social media: 'Sim, existe vida além do trabalho… a luta de classes é a matriz de todas as demais lutas'. The piece lists several legislative proposals in Congress, including a bill led by deputy Erika Hilton (Psol) to reduce the weekly workweek from 44 to 36 hours without pay cuts, and other proposals by senators Weverton Rocha (PDT/MA), Paulo Paim (PT/RS) and Reginaldo Lopes (PT/MG).\nOriginal language: pt\nPublish date: September 04, 2025 04:37 PM\nSource:[Brasil de Fato](https://www.brasildefato.com.br/2025/09/04/vida-alem-do-trabalho-fim-da-escala-6x1-reacende-luta-historica-do-povo-brasileiro/)\n\n**PEC Proposal to End 6×1 Scale Must be Presented within 90 Days**\nThe report on the Proposed Constitutional Amendment (PEC) that proposes the end of the 6×1 scale must be presented within 90 days, according to Deputy Luiz Gastão (PSD-CE), rapporteur of the subcommittee that will analyze the working hours in Brazil. The committee was installed on Tuesday (19) and will be linked to the Labor Committee of the Chamber. The plan includes public hearings to hear from entrepreneurs, workers, university professors, and government representatives before the elaboration of the opinion. The intention is for the text to be later discussed in the Constitutional and Justice Commission (CCJ). 'We will evaluate which sectors still adopt the 6×1 scale and what effects this change would have,' Gastão said. The proposal also provides for the adoption of a 4×3 schedule (four days of work and three days of rest) and the limitation of weekly working hours to 36 hours, without exceeding eight hours a day. Currently, the Constitution allows up to 44 hours a week. According to the work plan disclosed by the parliamentarian, the subcommittee seeks to consolidate a consensual text that guarantees balance between worker protection, business viability, and public account sustainability. The initiative of the PEC came from the Vida Além do Trabalho movement and has popular support from over 3 million signatures. The proposal had been postponed in 2024, when it depended on analysis by the CCJ, then led by the PL. Now, with the protocol effective, it will be up to the collegiate to evaluate the constitutionality of the measure. If it advances, the PEC may profoundly change the organization of working hours in Brazil, reducing formal working hours and expanding rest time for workers.\nOriginal language: pt\nPublish date: August 20, 2025 02:00 PM\nSource:[Jovem Pan – Esportes, entretenimento, notícias e vídeos com credibilidade](https://jovempan.com.br/noticias/economia/relatorio-da-pec-que-propoe-fim-da-escala-6x1-deve-ser-apresentado-em-ate-90-dias.html)\n\n**Reduzir jornada por lei não garante emprego nem qualidade de vida**\nThe debate about the 6x1 shift schedule has gone beyond social media and reached the National Congress. The mobilization, which started spontaneously and gained strength among workers and experts, resulted in the Proposed Amendment to the Constitution (PEC) 8/2025, which proposes to prohibit this model of shift and establish a four-day workweek. However, the discussion about the shift schedule should not be seen as a simple dilemma between maintaining or abolishing the 6x1 schedule. It is necessary to evaluate the possibility of flexibility and negotiation between employers and employees, seeking solutions that respect workers' rights and the need for the labor market to adapt. According to historian data, reducing the work hours does not generate jobs, and in fact, the Brazilian productivity is one of the worst in the world, which would make it difficult for the country to compete externally. The justification that reducing work hours without reducing salaries would boost the Brazilian economy and reduce inequalities is an utopia. The data shows that no reduction in work hours has generated jobs, and the reduction of work hours does not guarantee an increase in quality of life. The approval of the PEC 8/2025 could lead to a wave of judicializations, with relevant impacts on labor law, economy and society.\nOriginal language: pt\nPublish date: August 05, 2025 11:35 AM\nSource:[Gazeta do Povo](https://www.gazetadopovo.com.br/opiniao/artigos/reduzir-jornada-por-lei-nao-garante-emprego-nem-qualidade-de-vida/)\n\n**Redução da jornada e fim da escala 6×1 serão debatidos em evento das centrais sindicais em Porto Alegre**\nThe central unions are promoting an event in Porto Alegre on Monday (4) to discuss the proposal to reduce the working day without cutting salaries and the end of the 6×1 schedule. The activity is part of the national mobilization in support of the Proposal of Constitutional Amendment (PEC) 148/2015, authored by Senator Paulo Paim (PT/RS), which proposes a gradual reduction of the weekly workload from 44 to 36 hours. According to Paim, the measure can generate millions of jobs and improve the quality of life of the working class. A study by the Dieese points out that the change can create around 3 million new jobs immediately. Paim also states that in 19 companies that tested the new model, one of them recorded a growth of almost 15% in revenue and productivity in 2024. 'This measure is fundamental, not only to increase free time and the quality of life of workers, but also to create jobs and promote better living conditions,' Paim explains. The deputy federal Daiana Santos (PCdoB) will also bring her Project of Law nº 67/2025 to the debate, which proposes a reduction of the weekly working day to 40 hours and the end of the 6×1 schedule, with the guarantee of two consecutive days of remunerated rest per week. Santos defends that the reduction of the working day is a social justice and valuation of the working people agenda. She cites the example of developed countries like Belgium, Germany and Norway, which have adopted shorter working hours for years, understanding that rested and healthy workers are also more productive and contribute to economic growth. 'This is exactly the differential of our PL 67/2025, a possible project to be applied in the short term, with responsibility,' she highlights, recalling that the proposal has already received support from the Minister of Labor, Luiz Marinho, who recognized its viability.\nOriginal language: pt\nPublish date: August 01, 2025 07:54 PM\nSource:[Brasil de Fato](https://www.brasildefato.com.br/2025/08/01/reducao-da-jornada-e-fim-da-escala-6x1-serao-debatidos-em-evento-das-centrais-sindicais-em-porto-alegre/)\n\n**Lula Defends Proposal to End 6x1 Work Schedule in Brazil**\nBrazilian President Luiz Inácio Lula da Silva has defended the proposal to end the 6x1 work schedule in Brazil, which has been criticized by some for being too rigid. Lula stated, 'The humanity does not want 6x1 anymore, we need to find a way to have a more flexible work schedule. This was an extraordinary thing in my time, but today's youth does not want this anymore. We will try to present a new way of working in this country, so that we can guarantee more mobility for people.' A survey by the Instituto de Economia da Unicamp found that 37% of workers with a formal contract would benefit directly from the reduction of the work schedule, while 38% of the occupied population, mostly informal workers with a work schedule above 36 hours a week, would be indirectly affected. The proposal to end the 6x1 schedule is supported by 64% of Brazilians, according to a Datafolha survey from December 2024. However, some business entities and trade unions have expressed concerns that the reduction of the work schedule could lead to increased costs for companies, higher prices for products and services, and negative effects on the competitiveness of small and medium-sized enterprises.\nOriginal language: pt\nPublish date: July 11, 2025 08:48 PM\nSource:[Folha de S.Paulo](https://www1.folha.uol.com.br/mercado/2025/07/lula-critica-jornada-6x1-e-diz-que-quer-discutir-assunto-com-empresarios-e-sindicalistas.shtml)\n\n**PT Proposes New Bill to End 6×1 Work Schedule and Reduce Working Hours**\nThe Workers' Party (PT) has submitted a new bill (PL) to the Brazilian Congress, aiming to abolish the 6×1 work schedule and reduce the weekly working hours from 44 to 36 hours without any salary reduction. According to PT members, a quorum of votes for a bill is easier to achieve than the 308 votes required to pass a Constitutional Amendment (PEC). A similar proposal was previously presented by Érika Hilton (PSol-SP) and Reginaldo Lopes (PT-MG), but none of them have advanced in the Chamber of Deputies due to strong resistance from parliamentarians who believe that reducing working hours would harm employers and the economy. The PT's proposal includes the following points: the inclusion of travel time as part of the working hours for jobs with difficult access or no public transportation; flexibility in negotiating time off for small and micro businesses; a maximum of two hours of overtime per day with special protection for pregnant and breastfeeding women; and the possibility of 12-hour shifts followed by 36 hours of rest for security and health professionals, as long as it is negotiated through a collective labor agreement. The PT justifies the measure by citing a survey that found 72% of Brazilians are stressed at work, and that in 2022, over 209,000 people were absent from work due to mental health issues. As stated by the PT, 'the time has come to rethink the way we work and prioritize the well-being of workers.'\nOriginal language: pt\nPublish date: July 03, 2025 04:00 AM\nSource:[A Rede](https://arede.info/cotidiano/581419/bancada-do-pt-propoe-novo-projeto-pelo-fim-da-escala-de-trabalho-61)\n\n**PT Proposes Bill to End 6x1 Work Schedule and Reduce Work Hours**\nThe Workers' Party (PT) has submitted a bill (PL) to the Brazilian Congress, proposing to end the 6x1 work schedule and reduce the weekly work hours from 44 to 36 hours without reducing salaries. According to PT, it is easier to pass a bill with a quorum of votes than a Constitutional Amendment (PEC), which requires 308 votes. A PEC on the same topic was presented by Érika Hilton (PSol-SP) earlier this year, and another proposal by Reginaldo Lopes (PT-MG) also exists. However, no proposal to reduce work hours has advanced in the Chamber of Deputies due to strong resistance from parliamentarians, who believe that reducing work hours would harm employers and the economy. The PT justifies the measure, citing a survey that found 72% of Brazilians are stressed at work, and in 2022, over 209,000 people were absent from work due to mental health issues, according to the text submitted by the PT.\nOriginal language: pt\nPublish date: July 02, 2025 07:28 PM\nSource:[Metrópoles](https://www.metropoles.com/brasil/bancada-do-pt-propoe-novo-projeto-pelo-fim-da-escala-de-trabalho-6x1)\n\n**PT Proposes Bill to Reduce Workweek to 36 Hours and End 6×1 Shift Schedule**\nThe PT (Workers' Party) faction in the Brazilian Chamber of Deputies has presented a bill to reduce the weekly workweek from 44 to 36 hours, without reducing salaries, and to end the 6×1 shift schedule, which requires six consecutive days of work followed by one day of rest. The proposal also includes changes to the calculation of overtime, the definition of intraday breaks, and the treatment of travel time for workers with difficult access to their workplaces or no public transportation. According to the faction's press office, the initiative will be accompanied by a dialogue with the federal government to discuss the possibility of sending a similar bill to Congress in an urgent constitutional manner. The PT faction argues that, from a legal standpoint, it is not necessary to amend the Constitution to modify the 6×1 shift schedule, as the article 7 of the Constitution only establishes a minimum of labor rights, and the 6×1 schedule is established in the Consolidation of Labor Laws (CLT), not in the Constitution. As such, a regular law can modify this regime, as long as it benefits the worker. There are two other initiatives in the works that address the same topic: PEC 221/2019, proposed by Reginaldo Lopes (PT-MG), and PEC 08/2025, proposed by Erika Hilton (PSOL-SP).\nOriginal language: pt\nPublish date: July 02, 2025 06:33 PM\nSource:[Brasil 247](https://www.brasil247.com/brasil/pt-protocola-projeto-para-reduzir-jornada-de-trabalho-para-36-horas-e-acabar-com-escala-6-1-tqu4avnm)\n\n**Goiás Divided: Politicians, Workers, and Businessmen Weigh In on the 6x1 Work Schedule**\nA proposed amendment to the Brazilian Constitution, PEC 8/2025, aims to end the traditional 6x1 work schedule, which requires workers to work six consecutive days and rest only one. The proposal, presented by federal deputy Erika Hilton, seeks to guarantee at least two days of weekly rest to improve the physical and mental health of millions of Brazilians. According to a survey by the Instituto Locomotiva, 57% of the population supports the end of the 6x1 schedule. In Goiás, the debate has also moved to local politics. State deputy Bia de Lima is in favor of the change, emphasizing that more rest time is essential, especially for women who work double shifts with domestic work and family care. On the other hand, state deputy Amauri Ribeiro is against the change, arguing that it may harm the economy. This concern is shared by the Associação Comercial, Industrial e de Serviços do Estado de Goiás (Acieg), which sees the proposal as a risk of increased costs and loss of competitiveness for companies. The Central Única dos Trabalhadores (CUT) defends that a rested worker produces more, gets sick less, and that the change would be positive for health and productivity in general, as said, 'um trabalhador descansado rende mais, adoece menos e que a mudança seria positiva para a saúde e a produtividade no geral'.\nOriginal language: pt\nPublish date: June 30, 2025 09:19 PM\nSource:[Jornal Opção](https://www.jornalopcao.com.br/ultimas-noticias/politicos-trabalhadores-e-empresarios-escala-6x1-divide-opinioes-em-goias-721345/)\n\n",
    "date": "2025-10-13T16:30:08.180837",
    "summary": "All eight experts forecast a low probability that Brazil will ban the 6x1 work schedule for most CLT (registered) workers before January 1, 2026, with final probabilities ranging from 7% to 12%. Across diverse specialties—including labor law, legislative affairs, industrial relations, and political science—they highlight consistent themes: (1) strong legislative and institutional barriers, with approximately 70% of deputies currently opposed to the ban; (2) intense business and employer lobbying, warning of increased costs and economic harm; (3) procedural complexity and severe time constraints, with less than three months remaining and key proposals stalled in committee; (4) only modestly positive impact from growing government, union, and public support—including a plebiscite and notable street protests—which, while historically sometimes influential, have not yet reached decisive or crisis levels needed for rapid reform; (5) all agree that while there is a nonzero chance a major surge in public mobilization or a triggering event could force legislative action, the base rate for sweeping labor reforms passing in such a short timeframe in Brazil is very low. Most likely, the 6x1 schedule remains legal into 2026, barring an extraordinary, unforeseen breakthrough in public pressure and legislative consensus.",
    "forecasters": [
        "Employment Relations (ILO Conventions)",
        "Employment Relations (Industrial Relations Systems)",
        "Legislative Affairs (Brazilian Legislative Process)",
        "Labor Law (Comparative Labor Law)",
        "Labor Law (Brazilian Labor Code CLT)",
        "Political Science (Public Policy Process)",
        "Political Science (Institutionalism)",
        "Latin American Studies (Brazilian Political Economy)"
    ]
}