{
    "deliberation_results": {
        "Election Polling (Survey Methodology Standards)": {
            "time_to_resolution": "Approximately 2.5 months until end of 2025 (forecast date: 2025-10-13)",
            "perspective_relevance": "As an expert in election polling and survey methodology, I can critically evaluate the reliability, sample composition, and interpretation of voting intention data—especially among subpopulations like the 18-24 demographic. This is crucial because youth samples are often more volatile, harder to reach, and more susceptible to both polling error and short-term trends. My expertise also allows me to recognize when poll results may overstate or understate real support due to methodological artifacts, social desirability bias, or sampling variance.",
            "status_quo": "According to the latest available 40dB poll (September 2025), Vox is at or very close to 27% direct voting intention among 18-24 year-olds, marking a high point. Most other recent polls have shown Vox leading among young people, with numbers in the low-to-mid 20s, and many data points clustered just below the 27% threshold.",
            "perspective_derived_factors": [
                {
                    "factor": "Base Rate of Youth Vote Volatility",
                    "effect": "Increases uncertainty and thus makes both sharp rises and sharp drops plausible. Historically, youth voting intention can swing several points in short periods, especially for insurgent or populist parties."
                },
                {
                    "factor": "Recent Upward Trend and European Context",
                    "effect": "Slightly increases probability. Similar surges for far-right parties among youth have been observed in France (RN) and Germany (AfD). The ideological rightward shift among Spanish youth is corroborated by multiple sources."
                },
                {
                    "factor": "Survey Methodology Issues (Sample Size, Non-response, Weighting)",
                    "effect": "Slightly decreases probability. Youth samples are often small and more subject to statistical error. Direct intention may be inflated by online panel composition, and sampling errors could exaggerate spikes."
                },
                {
                    "factor": "Salience of Key Issues (Immigration, Housing, Economic Discontent)",
                    "effect": "Increases probability. The persistent salience of issues that favor Vox, combined with the party's effective social media strategy, keeps the party top-of-mind for young voters."
                },
                {
                    "factor": "Abstention and Youth Disengagement",
                    "effect": "Decreases probability. High youth abstention means the pool of 'intending to vote' youth is smaller; if abstention rises further, the share for Vox could contract even if their core support remains energized."
                },
                {
                    "factor": "Gender Gap and Demographic Composition of Youth",
                    "effect": "Slightly decreases probability. Young men skew much more heavily toward Vox than young women; shifts in sample composition or turnout among women could pull the number down."
                },
                {
                    "factor": "Potential for Short-term Reversal",
                    "effect": "Decreases probability. The current 27% may be a high-water mark, and support could regress to the mean if media attention turns, or if a backlash or scandal emerges."
                },
                {
                    "factor": "Survey Timing (End-of-Year Effects)",
                    "effect": "Mixed effect. Political salience can both spike (due to year-end news) or dissipate (due to holidays), adding noise to late-year polling."
                }
            ],
            "no_scenario": "A No outcome occurs if the next 40dB poll before year-end shows Vox at 27% or lower among 18-24s. This could happen if: a) support plateaus or slightly declines due to increased scrutiny or backlash; b) other right-wing or new parties siphon off youth support; c) methodological correction or sampling variance pulls the number down; or d) greater youth abstention is captured in the final sample.",
            "yes_scenario": "A Yes outcome occurs if the next (and last) 40dB poll of 2025 shows Vox at 27.1% or higher among 18-24s. This could happen if: a) the current momentum continues or slightly intensifies; b) salience of key issues (e.g., migration, housing) remains high; c) a viral campaign or event further boosts Vox's appeal; or d) random sampling error or a favorable youth sample pushes the number just above 27%.",
            "final_reasoning": "The status quo is precariously close to the threshold, with the latest poll at or near 27%. The base rate for such sharp increases in youth voting intention is low, and regression to the mean in subsequent polls is common. However, the European context, continued rightward ideological shift, and issue salience provide a tailwind for Vox. Methodological caveats—small youth samples, volatility, and sampling error—mean that even if underlying support is close to 27%, the observed number could swing either way. Abstention and gender gaps are countervailing forces. On balance, the probability that Vox will surpass (i.e., strictly exceed) 27% in the last 40dB youth poll is modestly below even odds: the status quo is likely to persist or revert slightly, and sampling error could just as easily nudge the figure down as up. But with the threshold so close and the momentum real, this is a genuinely tough call. My expert view is that there is a roughly 40% chance that Vox will surpass 27% among youth in the final 2025 survey.",
            "final_probability": 40
        },
        "Election Polling (Sampling Error Analysis)": {
            "time_to_resolution": "Approximately 2.5 months (question resolves on or after Dec 31, 2025, forecast date is Oct 13, 2025)",
            "perspective_relevance": "As an expert in election polling, especially sampling error analysis, my perspective is critical for interpreting youth vote intention data. Polling among young people (18-24) often faces higher sampling error, nonresponse bias, and volatility, especially with fast-moving political trends and low youth turnout. Understanding the technical nuances of poll methodology, margin of error, and subgroup volatility helps calibrate how likely a direct voting intention figure above 27% for Vox is, given present and historical data.",
            "status_quo": "Vox has just reached 27% direct voting intention among 18-24 year olds in the September/October 2025 40dB poll—the highest recorded so far. Historically, youth support for Vox has trended upward over several years, but each incremental gain is hard-won and volatile. The status quo, assuming no sudden shocks or reversals, is that Vox maintains or slightly improves this level, but further gains are not guaranteed.",
            "perspective_derived_factors": [
                {
                    "factor": "Sampling Error and Subgroup Volatility",
                    "effect": "Increases uncertainty; youth samples in polls are small, so a reported shift above 27% could be noise. Actual support may oscillate around this threshold without a clear trend crossing it."
                },
                {
                    "factor": "Recent Upward Trend in Youth Support",
                    "effect": "Increases probability; consistent movement towards the right among Spanish youth, with Vox leading, suggests further gains are possible if the trend continues."
                },
                {
                    "factor": "Political Saturation/Asymptote Effect",
                    "effect": "Decreases probability; once a party reaches a threshold close to a third of young voters, further increases are difficult due to ceiling effects and competition from abstention or other parties."
                },
                {
                    "factor": "Turnout and Engagement Issues",
                    "effect": "Neutral to slightly decreases probability; high abstention among youth means that reported intention figures may not translate into real support, and volatility is high."
                },
                {
                    "factor": "Comparative European Trends",
                    "effect": "Slightly increases probability; similar rightward youth shifts in France and Germany suggest a continent-wide pattern that could buoy Vox's numbers further."
                },
                {
                    "factor": "Potential for Backlash or Counter-Mobilization",
                    "effect": "Decreases probability; strong negative reactions, especially among young women or due to anti-far-right activism, could limit Vox's ability to grow further among youth."
                },
                {
                    "factor": "Poll Timing and Methodological Variance",
                    "effect": "Neutral to slightly decreases probability; if the last 2025 40dB poll lands before a surge, the window to cross 27% closes. Also, methodological tweaks could impact the measured figure."
                }
            ],
            "no_scenario": "Vox's youth support plateaus at 27%, or dips slightly in the final 2025 40dB poll due to either a backlash, a rise in abstention, a polling artifact, or a re-engagement by left-wing or centrist youth. Sampling error or a change in poll methodology could also mean the direct intention figure is 27% or lower, even if the underlying trend is stable.",
            "yes_scenario": "Vox's momentum among young men continues, abstention stays flat, and their digital/social media strategy yields incremental gains, pushing direct voting intention to 28%+ in the final 2025 40dB poll. Broader European trends and continued disillusionment with left/center parties reinforce this, and there is no major backlash before year's end.",
            "final_reasoning": "The polling data shows Vox at a historic high of 27% among 18-24s, with a clear upward trend over several years and a broader European context of youth right-wing surges. However, as a sampling error specialist, I am keenly aware of the volatility and error margins in youth subsamples—just a few respondents can swing the reported number above or below 27%. Furthermore, there are ceiling effects as abstention remains high, and left-leaning youth could mobilize in response to far-right gains. The remaining time window is short; if the last 2025 poll comes soon, there may not be enough time for further growth. Still, the prevailing signals point to a slightly greater-than-even chance of Vox exceeding 27% at least once before year-end, but with high uncertainty due to statistical noise and potential for late reversals.",
            "final_probability": 62
        },
        "Political Consulting (Voter Segmentation Strategies)": {
            "time_to_resolution": "Approximately 2.5 months (until end of 2025, current date is 2025-10-13).",
            "perspective_relevance": "As an expert in Political Consulting with a focus on Voter Segmentation Strategies, I bring a granular understanding of how youth cohorts behave, how issue salience, digital strategy, gender divides, and turnout propensity interact to translate polling into actual support, and how microtargeting and sociopolitical context can shift direct voting intention among the 18-24 demographic. This expertise allows me to assess not just headline numbers but underlying demographic, attitudinal, and behavioral trends driving Vox’s youth support.",
            "status_quo": "Recent 40dB polls show Vox at 27% direct voting intention among 18-24 year-olds, its highest ever and higher than in older groups. Historically, far-right parties in Spain have not led in youth intention, but 2025 sees a sharp rightward shift among young men and a contraction of left-leaning youth. The status quo—if nothing changes—is a plateau or slight increase around this 27% mark.",
            "perspective_derived_factors": [
                {
                    "factor": "Gender Divide",
                    "effect": "Increases probability—young men are now substantially more likely to support Vox, and men are overrepresented among politically active online youth. However, young women remain less likely to support Vox, moderating the overall average."
                },
                {
                    "factor": "Issue Salience (Immigration, Housing, Rebellion)",
                    "effect": "Increases probability—Vox’s anti-immigration, anti-progressive, and ‘rebellious’ messaging is highly resonant with young voters frustrated by economic precarity and lack of opportunity, and this is reinforced by social media virality."
                },
                {
                    "factor": "Digital Strategy and Microtargeting",
                    "effect": "Increases probability—Vox’s sophisticated use of TikTok, Instagram, and viral digital content is specifically designed for youth, reinforcing its appeal and driving up intention numbers among the 18-24 group."
                },
                {
                    "factor": "Turnout and Abstention",
                    "effect": "Decreases probability—despite high intention, abstention remains the largest single 'party' among youth. If highly-mobilized far-right-leaning youth are already captured in the 27% figure, further increases may be challenging without broader turnout gains."
                },
                {
                    "factor": "Base Rate and Ceiling Effects",
                    "effect": "Decreases probability—27% is an unprecedented high for a far-right party in this cohort in Spain. Base rates suggest that sharp increases are rare and often result in consolidation or regression to the mean unless catalyzing events occur."
                },
                {
                    "factor": "Competitor Party Stagnation/Decline",
                    "effect": "Increases probability—PP stagnates and PSOE is losing ground among youth, which could lead to further gains for Vox if these trends continue."
                },
                {
                    "factor": "Potential Vote Dilution from Other Far-Right/Ultra Parties",
                    "effect": "Decreases probability—rise of parties like Alianza Catalana and figures like Alvise could split the far-right youth vote, preventing Vox from breaking through the 27% ceiling."
                }
            ],
            "no_scenario": "Vox maintains or slightly increases its youth support, but due to natural ceiling effects, vote splitting with other ultra-right parties, or a late mobilization of progressive youth (perhaps spurred by an event or counter-messaging campaign), its direct intention remains at or below 27%. Alternatively, turnout among disaffected youth increases, but the new participants are less likely to support Vox, diluting its percentage.",
            "yes_scenario": "The trend of rightward movement among young men accelerates, the PP continues to stagnate or lose youth support, and Vox’s digital strategy keeps converting disengaged or apolitical youth. The party’s messaging on immigration and economic frustration resonates even more as economic or migration crises intensify. No major vote-splitting occurs, or possible splits are offset by Vox’s brand dominance and digital virality, pushing intention above 27%.",
            "final_reasoning": "Vox’s current 27% among 18-24 year-olds is already a historic peak, driven by a combination of economic malaise, gender polarization, and highly effective digital outreach. The international context (France, Germany) supports the plausibility of far-right increases among youth, but base rates suggest that once such a dramatic shift occurs, further increases are difficult without a major catalyzing event. The gender gap and abstention rates among youth are headwinds, as are potential splits from other far-right parties. However, the momentum is clearly on Vox’s side, and the PP’s stagnation along with the left’s inability to mobilize youth further tilt the odds toward a potential further rise. While there are ceiling effects, the current polling trend and segmentation analysis point to a slightly greater than even chance that Vox will exceed 27% in the next direct intention measurement before year-end, unless a turnout or progressive mobilization shock occurs. My estimate incorporates the risk of regression to the mean and the plausible, but not highly likely, scenario of further rightward acceleration.",
            "final_probability": 62
        },
        "Public Opinion Analysis (Trend Projection Techniques)": {
            "time_to_resolution": "Approximately 2.5 months (question resolves at the end of 2025; today is 2025-10-13)",
            "perspective_relevance": "As an expert in Public Opinion Analysis (Trend Projection Techniques), I specialize in identifying and projecting the trajectory of voting intention trends among demographic subgroups. My expertise allows me to critically evaluate polling methodologies, the durability of attitudinal shifts, and the impact of underlying social and economic drivers on youth political behavior. This enables a nuanced projection beyond superficial poll readings, integrating base rates, cohort effects, and the role of digital mobilization or demobilization.",
            "status_quo": "Vox is at or near 27% direct voting intention among young people (18-24), with the latest cited 40dB poll showing precisely this figure. The most recent trend lines indicate Vox is leading among youth, with strong growth in the last year, but the 27% mark is a high-water point, not an average.",
            "perspective_derived_factors": [
                {
                    "factor": "Historical Base Rate of Surpassing High Polling Peaks in Youth Vote",
                    "effect": "Decreases probability. Historically, once an anti-system or radical party reaches a peak in youth voting intention, further rapid growth is rare without a major social or political catalyst. Regression to the mean is common, especially with high volatility in youth opinion."
                },
                {
                    "factor": "Recent Acceleration in Rightward Youth Shift Across Europe",
                    "effect": "Increases probability. Spain is experiencing a European-wide trend of young voters moving toward radical-right parties, with similar patterns visible in Germany (AfD) and France (RN). This creates upward momentum and a wider base for Vox."
                },
                {
                    "factor": "Youth Political Volatility and High Abstention Rates",
                    "effect": "Decreases probability. Youth are less reliable voters and more prone to apathy, as highlighted by multiple articles. While intention may spike, actual turnout and sustained engagement often lag, and viral enthusiasm may fade or channel into abstention."
                },
                {
                    "factor": "Polarization and Social Media Virality",
                    "effect": "Increases probability. Vox's digital strategy, leveraging virality and anti-establishment rhetoric, resonates strongly with youth on platforms like TikTok and Instagram, amplifying their reach and potential to break through the 27% ceiling."
                },
                {
                    "factor": "Gender Divide and Feminist Backlash",
                    "effect": "Neutral to slightly decreasing. Vox's surge is driven primarily by young men, while young women remain more left-leaning. This caps the ceiling of Vox's support unless they successfully broaden their appeal."
                },
                {
                    "factor": "Potential for Counter-Mobilization or Scandal",
                    "effect": "Decreases probability. Sudden shifts in public mood, negative events, or effective counter-campaigns by rivals could blunt or reverse Vox's momentum before the end of the year."
                },
                {
                    "factor": "Polling Methodology and Margin of Error",
                    "effect": "Decreases probability. Youth samples in polls are often small, with high volatility; a one-point shift in either direction could determine outcome. There’s also the possibility that the 27% figure is a statistical outlier."
                }
            ],
            "no_scenario": "Vox's youth support proves to have peaked at 27% in late summer/early fall 2025, possibly as a reaction to specific events. In the final 40dB poll of the year, their intention falls back to 25-27%, either due to a loss of novelty, the emergence of competing anti-establishment options, or a demobilization among the most radical segments. Alternatively, margin of error means they record 27% or less, even if real support is stable.",
            "yes_scenario": "Vox maintains and slightly expands its digital and anti-system appeal through the end of 2025. No major backlash or successful counter-message emerges. Economic or migration-related shocks, or further rightward shifts in Europe, energize their base. In the final 40dB survey, their youth voting intention reads 28-30%, breaking the prior ceiling and confirming a structural shift.",
            "final_reasoning": "The data shows Vox at the upper end of youth support, hitting 27% in the latest 40dB poll. The trend has been clearly upward in 2024-2025, fueled by European-wide rightward youth shifts, successful viral digital strategies, and a sense of rebellion against the mainstream left among young men. However, the base rate for radical parties to continue breaking new ceilings after hitting a local maximum is low, especially in youth cohorts marked by fickleness and high abstention. Polling volatility, potential regression to the mean, and the risk of backlash or counter-mobilization suggest caution. Nevertheless, the current socio-political climate and Vox's evident momentum make a modest further increase plausible. Given all factors, the probability is above even odds, but not extremely high, given the ceiling effect and inherent volatility.",
            "final_probability": 62
        },
        "Political Science (Party System Theory)": {
            "time_to_resolution": "Approximately 2.5 months (until the end of December 2025)",
            "perspective_relevance": "As an expert in Political Science with a focus on Party System Theory, I bring an understanding of how party realignment, generational change, and issue salience drive shifts in youth voting behavior. I can contextualize Vox’s youth surge within broader patterns of party system evolution, the rise of right-wing populism across Europe, and the specific mechanisms by which youth cohorts reshape party competition.",
            "status_quo": "As of the latest 40dB polls (September 2025), Vox is at 27% voting intention among 18-24 year olds. This is its peak so far, with most recent figures ranging between 21% and 27%. The status quo is that Vox holds or slightly fluctuates around this level, without surpassing it.",
            "perspective_derived_factors": [
                {
                    "factor": "Momentum of Right-Wing Populism Among European Youth",
                    "effect": "Increases probability. The trend across EU countries (RN in France, AfD in Germany, Vox in Spain) is for far-right parties to gain among the young, suggesting a structural shift in youth preferences."
                },
                {
                    "factor": "Issue Salience: Immigration, Housing, and Economic Insecurity",
                    "effect": "Increases probability. Youth are especially affected by unemployment, housing precarity, and perceive mainstream parties as unresponsive; Vox’s messaging on these issues is resonating."
                },
                {
                    "factor": "Digital Mobilization and Media Virality",
                    "effect": "Increases probability. Vox’s targeted social media campaigns, meme culture, and virality are effective at reaching and energizing young voters in a way traditional parties are not."
                },
                {
                    "factor": "Gender Polarization Within Youth Vote",
                    "effect": "Decreases probability. While young men are shifting strongly to Vox, young women are less likely to do so, limiting how high the aggregate youth vote can go without a breakthrough among women."
                },
                {
                    "factor": "High Youth Abstention and Volatility",
                    "effect": "Decreases probability. Abstention remains very high among youth (over 40% in 18-24s), and intention can be volatile and not translate into actual votes, potentially capping the ceiling for any party."
                },
                {
                    "factor": "Party System Fragmentation and Competition from Other Far-Right or Protest Parties",
                    "effect": "Decreases probability. In some regions, new parties (e.g., Alianza Catalana) or protest/ultra-right alternatives compete for the same electorate, fragmenting the far-right youth vote."
                },
                {
                    "factor": "Base Rate for Surpassing Thresholds in Youth Cohorts",
                    "effect": "Decreases probability. Historically, it is rare for any party to consolidate more than a quarter of the youth vote in multiparty systems without an accompanying political crisis or charismatic breakthrough."
                }
            ],
            "no_scenario": "Vox peaks at 27% among young people in autumn 2025 and either plateaus or declines in the final 40dB poll of the year. This could occur due to saturation of the far-right message, a resurgence in activism among left-leaning youth (especially women), increased infighting or negative media attention on Vox, or the emergence of competing right-wing or protest options siphoning votes away.",
            "yes_scenario": "Vox’s digital strategy accelerates, leveraging viral content on new platforms and capitalizing on another high-salience event (e.g., migration crisis, urban violence, or a scandal involving the left or PP). This triggers a further realignment, pushing its youth intention above 27% (e.g., 28-32%) in the year-end 40dB poll, especially if right-leaning youth turnout intentions rise and abstention falls.",
            "final_reasoning": "The status quo is that Vox is at 27%—the threshold for this question. The European context and party system theory suggest youth are realigning right, and Vox’s digital prowess, issue salience, and the weakness of the mainstream right (PP) give it a base for further gains. However, several structural and countervailing factors limit the likelihood of breaking through: gender polarization within the youth vote, continued high abstention, and fragmentation on the right. In multiparty systems, it is rare for a party to consolidate much more than a quarter of the youth vote unless there is sudden crisis or charismatic breakthrough—neither of which is strongly evident right now. The most recent polls suggest Vox has reached a local maximum, and while a further surge is possible (especially if there’s a right-populist shock event), the median expectation is that it will hover at or just under 27%. Therefore, while the probability is significant (given the momentum), it remains less likely than not.",
            "final_probability": 38
        },
        "Political Science (Vote Choice Models)": {
            "time_to_resolution": "Approximately 2.5 months (Question resolves at the end of 2025; today is October 13, 2025)",
            "perspective_relevance": "As a political scientist specializing in vote choice models, I offer expertise in interpreting polling data, understanding demographic shifts, and identifying drivers of party preference. My perspective emphasizes the importance of base rates, cohort effects, political messaging, and the translation of intention into actual behavior, especially in volatile or rapidly changing electoral environments.",
            "status_quo": "Recent 40dB polling places Vox at 27% direct voting intention among 18-24-year-olds, with Vox currently the most popular party in this cohort. Historically, youth support for Vox has been rising, but the absolute number has only recently approached the 27% threshold.",
            "perspective_derived_factors": [
                {
                    "factor": "Base rate of rapid party growth in youth voting intention",
                    "effect": "Slightly increases probability. Far-right parties in Europe have seen sharp but not unlimited youth surges. Vox’s rise is consistent with this trend, but base rates suggest that exceeding a high-water mark (like 27%) is less common than sustaining or falling back after a spike."
                },
                {
                    "factor": "Recent polling trajectory and underlying drivers",
                    "effect": "Increases probability. The latest poll has Vox at 27%, and the momentum appears upward, fueled by youth disillusionment with mainstream parties, effective social media outreach, and resonance of anti-establishment/anti-immigration messaging."
                },
                {
                    "factor": "Youth abstention and volatility",
                    "effect": "Decreases probability. Although intention is high, actual turnout among youth remains low (~45% abstention), and youth are more volatile in their expressed preferences, making sharp further increases less likely, especially if rival parties mobilize or events shift sentiment."
                },
                {
                    "factor": "Gender and regional divides",
                    "effect": "Decreases probability. Vox’s appeal is heavily concentrated among young men, while young women lean left; regional polls (e.g., Catalonia) show fragmented youth vote. If the gender/region composition of the next survey is less favorable, the 27% could prove a ceiling."
                },
                {
                    "factor": "Potential for campaign shocks or counter-mobilization",
                    "effect": "Neutral to slightly decreases probability. While shocks (scandals, international events) can move intention, the window is short and there is evidence of increased anti-Vox mobilization (especially among women and in left-leaning regions)."
                },
                {
                    "factor": "Comparative European context",
                    "effect": "Increases probability. Youth surges for far-right parties in France and Germany (e.g., AfD, RN) suggest a pan-European pattern that could reinforce further gains for Vox."
                }
            ],
            "no_scenario": "Vox’s youth support plateaus or declines due to counter-messaging from rivals, media scrutiny, or a shift in the salience of issues (e.g., a drop in the immigration debate, a new left-leaning youth movement, or a scandal involving Vox). The next 40dB poll finds youth support at or below 27% as turnout and interest stagnate or other parties recover among the youth.",
            "yes_scenario": "Vox sustains or accelerates its current momentum, with viral social media campaigns and further youth alienation from mainstream parties. A major news event or controversy energizes Vox’s anti-system appeal, or turnout among right-leaning youth increases relative to others. The next 40dB poll shows Vox at 28% or higher among 18-24s.",
            "final_reasoning": "The base rate for parties breaking through high thresholds in youth intention is modest but not negligible, especially in an environment of rapid ideological realignment. Vox’s recent polling at 27% could be a statistical outlier or a genuine inflection point. Given European trends and the strength of rightward shifts among Spanish youth, a further slight increase is plausible, but several headwinds exist: high abstention rates, gender and regional polarization, and potential for rival mobilization. Historically, such spikes are often followed by stabilization or regression to the mean, but the current data give no indication of a reversal. Given the momentum and European context, and factoring in the risk of volatility or survey composition effects, I estimate the probability that Vox will surpass 27% youth voting intention in the last 2025 40dB poll at 58%.",
            "final_probability": 58
        },
        "Sociology (Youth Political Socialization)": {
            "time_to_resolution": "Approximately 2.5 months (until end of December 2025)",
            "perspective_relevance": "As an expert in Sociology (Youth Political Socialization), I bring a deep understanding of how youth identities, grievances, and social media-driven political engagement interact with party messaging and broader sociopolitical trends. This expertise is crucial for evaluating not just polling data but also the underlying structural and cultural dynamics influencing Spanish youth's alignment with Vox.",
            "status_quo": "Recent 40dB polls (as of September 2025) show Vox at 27% voting intention among the 18-24 demographic, their historical high. This is a sharp increase from previous years (e.g., 21.4% earlier in 2025), and marks a significant realignment of youth voting preferences towards the right.",
            "perspective_derived_factors": [
                {
                    "factor": "Youth Political Realignment and Disillusionment with Mainstream Parties",
                    "effect": "Increases probability. There is a clear trend among Spanish youth toward right-wing identification, with Vox specifically capitalizing on issues like employment precarity, housing, and public safety—areas where youth feel failed by traditional parties."
                },
                {
                    "factor": "Social Media and Digital Mobilization",
                    "effect": "Increases probability. Vox's adept use of viral content and meme culture on platforms like TikTok and Instagram has proven highly effective at reaching and energizing young voters, bypassing traditional media gatekeepers."
                },
                {
                    "factor": "Youth Abstention and Volatility",
                    "effect": "Decreases probability. Despite rising intention, actual youth turnout remains the lowest of any demographic (45% abstention in 2023, historically under 60%). High volatility and apathy mean that even strong polling may not translate into higher real voting intention or survey responses, especially if disillusionment rises."
                },
                {
                    "factor": "Competing Far-Right and Populist Options",
                    "effect": "Decreases probability slightly. The rise of other right-populist or ultra-nationalist parties (e.g., Alianza Catalana) could siphon a portion of the youth vote, fragmenting the far-right bloc."
                },
                {
                    "factor": "Gender Divide Among Youth",
                    "effect": "Net neutral to slight decrease. While young men are driving the Vox surge (sometimes by double-digit margins), young women lean left and are less likely to support Vox. If female youth turnout increases or male enthusiasm wanes, this may cap Vox's growth."
                },
                {
                    "factor": "International and National Political Context",
                    "effect": "Slightly increases probability. The pan-European trend of youth moving to the right, the normalization of far-right rhetoric, and ongoing sociopolitical crises (immigration, economic stress) all create fertile ground for Vox to maintain or slightly grow its youth support."
                },
                {
                    "factor": "Recent Momentum and Bandwagon Effects",
                    "effect": "Increases probability. With the narrative of Vox surpassing PP among youth and overall, and their continued polling momentum, there is potential for a bandwagon effect that could push them over the 27% threshold in the final 2025 polls."
                }
            ],
            "no_scenario": "Vox consolidates at or just below 27%—perhaps due to youth political apathy, a late swing to abstention, or a partial reversion to mainstream parties as economic conditions stabilize or left-wing parties sharpen their youth appeal. Alternatively, emerging far-right alternatives or fragmentation split the vote, or survey volatility means the final 2025 40dB poll captures a slight dip (e.g., 25-27%).",
            "yes_scenario": "Vox's youth appeal continues to strengthen, buoyed by viral campaigns, persistent economic anxieties, and the perception of institutional failure. Youth right-ward drift, male-driven enthusiasm, and the demobilization of the left ensure that the final 2025 40dB poll shows Vox at 28% or higher among 18-24s, marking a new peak.",
            "final_reasoning": "The base rate for rapid youth political realignment is low, but recent Spanish polling and broader European trends indicate a real and ongoing surge for the far right among young people. The current status quo is already at the 27% threshold, and all major structural and attitudinal trends—except for youth turnout/volatility and potential vote splitting—point toward further (if modest) increases. Given that the question is about polling intention (not actual votes), and considering the inertia of political momentum and the lack of clear countervailing trends in the news, the odds slightly favor Vox surpassing 27%. However, the natural ceiling imposed by youth abstention, gender divides, and the possibility of volatility or fragmentation temper the likelihood of a dramatic jump. Thus, the probability is pushed above 50%, but not to an extreme.",
            "final_probability": 63
        },
        "Sociology (Generational Theory)": {
            "time_to_resolution": "Approximately 2.5 months (question resolves at the end of 2025, today is October 13, 2025)",
            "perspective_relevance": "As a sociologist specializing in Generational Theory, my expertise is central to understanding shifts in youth political attitudes, the generational drivers of right-populist support, gender splits, the role of social media, and the influence of economic insecurity on the political realignment of young voters. These factors are pivotal in explaining why the youth cohort in Spain may diverge from older voting patterns, especially regarding support for far-right parties like Vox.",
            "status_quo": "Current 40dB polling shows Vox at 27% among 18-24 year-olds—already at the threshold. Historically, youth support for right-populist parties has been rising, but often stalls or fluctuates near such peaks. The status quo, if unchanged, would see Vox at or below 27% by year-end.",
            "perspective_derived_factors": [
                {
                    "factor": "Generational Value Shift",
                    "effect": "Increases probability. Data show a clear and rapid movement of Spanish youth away from traditional left-wing identity toward right-wing or populist stances, with Vox the main beneficiary. This generational realignment is replicating patterns seen in France and Germany, suggesting the trend could continue or intensify."
                },
                {
                    "factor": "Youth Economic Insecurity",
                    "effect": "Increases probability. Precarious employment, unaffordable housing, and lack of future prospects are major drivers for anti-establishment voting among European youth. Vox’s messaging on these themes is resonating, especially compared to mainstream parties."
                },
                {
                    "factor": "Digital/Social Media Strategy",
                    "effect": "Increases probability. Vox’s mastery of viral content, memes, and short-form video on platforms popular among youth (TikTok, Instagram) is a potent mobilization tool. Their ability to swap 'veracity for virality' (per sociologist Rafael López) can catalyze further support."
                },
                {
                    "factor": "Gender Divide",
                    "effect": "Decreases probability. The youth vote is not monolithic: young men are driving the Vox surge, while young women lean left and are more likely to resist far-right appeals. If women’s turnout increases, it could cap Vox’s youth ceiling."
                },
                {
                    "factor": "Youth Abstention",
                    "effect": "Decreases probability. Abstention remains the largest 'party' among young Spaniards. High non-participation rates (45% abstention in 18-24s, per recent elections) dampen the impact of polling swings, and could limit further Vox gains."
                },
                {
                    "factor": "Base Rate of Sustained Surges",
                    "effect": "Decreases probability. Historically, when a party hits a generational ceiling in polls, further growth is difficult absent a major exogenous shock. Populist youth surges sometimes plateau or even revert if opposition mobilizes or media scrutiny intensifies."
                },
                {
                    "factor": "Recent Momentum and Bandwagon Effect",
                    "effect": "Increases probability. Vox is currently gaining among youth as the only 'authentic' right-wing alternative, and the relative stagnation of PP plus recent media narratives may encourage further bandwagoning for Vox among first-time voters."
                }
            ],
            "no_scenario": "Vox’s youth support plateaus at the current high-water mark (27%) or slips due to increased abstention, counter-mobilization from the left (especially young women), or negative media coverage. Alternatively, other right-populists (e.g., Aliança Catalana, Alvise) siphon off some of the youth vote, or economic conditions stabilize and reduce anti-establishment fervor.",
            "yes_scenario": "Vox successfully leverages digital outreach, capitalizes on youth disillusionment and economic frustration, and benefits from a bandwagon dynamic among right-leaning young men. A triggering event (e.g., migration crisis, public order issue, viral social media campaign) pushes the poll above 27% in the final 40dB survey. Abstention remains high, but among those expressing intent, Vox inches above the threshold.",
            "final_reasoning": "The unique generational context in Spain—marked by rapid rightward shifts among youth, deep economic insecurity, and a strong social media mobilization by Vox—places the party at an unusually high baseline among 18-24s. The most recent 40dB poll has Vox at 27%, already the highest in any age group, and all signs in the news cycle point to continued momentum (e.g., stagnation of PP, international far-right surges). However, generational theory and the base rate of rapid surges caution that further increases above such a high threshold are difficult, especially with abstention so high and gender splits capping the ceiling. The probability of a further increase is real but limited—absent a shock, most surges plateau. Taking all factors together, with a slight lean toward the status quo holding, I estimate the probability at 38%.",
            "final_probability": 38
        },
        "Iberian Studies (Contemporary Spanish Politics)": {
            "time_to_resolution": "Approximately 2.5 months (until 31 December 2025, assuming the last 40dB poll of 2025 comes out at the end of the year).",
            "perspective_relevance": "As an expert in Iberian Studies with a focus on contemporary Spanish politics, I bring a deep contextual understanding of both the long-term ideological evolution of Spanish youth and the mechanisms by which far-right parties such as Vox have tailored their strategies to exploit shifting social, economic, and cultural trends. This expertise allows for nuanced interpretation of polling data, demographic nuances, and the broader European context of youth radicalization.",
            "status_quo": "Vox currently registers 27% voting intention among the 18-24 demographic in the latest 40dB poll (February 2025). Historically, youth support for far-right parties in Spain was negligible, but there has been a rapid increase since 2019. If nothing changes, the most likely scenario is that Vox maintains or slightly increases its youth support, but surpassing 27% is not a given and would require a continued positive trend.",
            "perspective_derived_factors": [
                {
                    "factor": "Polarization and ideological shift among young people",
                    "effect": "Increases probability. There's a clear trend from the last decade of Spanish youth moving from center/left to right-wing positions, with Vox capitalizing most among young men, as evidenced by multiple CIS and 40dB barometers and secondary sources."
                },
                {
                    "factor": "Vox's digital strategy and social media reach",
                    "effect": "Increases probability. Vox is uniquely effective at digital campaigning, meme culture, and 'virality over veracity,' especially on TikTok and Instagram, which are key youth platforms."
                },
                {
                    "factor": "Abstentionism among youth",
                    "effect": "Decreases probability. While Vox leads in voting intention among engaged youth, high abstention rates (roughly 45% in 2023) mean that the pool of actual voters is smaller and more volatile, potentially limiting the ceiling for Vox's support."
                },
                {
                    "factor": "Gender gap in youth support",
                    "effect": "Decreases probability. Vox's support among young men is much higher than among young women, with the latter tending to vote for left-wing or center-right parties. Unless Vox bridges this gap, its overall youth share may be capped."
                },
                {
                    "factor": "International and domestic issue salience",
                    "effect": "Slightly increases probability. Issues like immigration, housing, and public security resonate with youth, and Vox is perceived as addressing these more directly than mainstream parties. European trends show similar youth surges for far-right parties."
                },
                {
                    "factor": "Recent polling plateau and volatility",
                    "effect": "Decreases probability. Although Vox reached 27% in February, recent polls show some volatility and a plateau in their national vote estimates (hovering around 17-20% overall). Youth spikes may not convert into sustained growth without a catalyzing event."
                },
                {
                    "factor": "Potential for a catalyzing external event",
                    "effect": "Increases probability, albeit with uncertainty. A major crisis (immigration, security, government scandal) could push more youth to Vox, but this is speculative."
                }
            ],
            "no_scenario": "Vox remains at or below 27% in the 40dB youth voting intention, either because abstention increases among their likely voters, the gender gap isn't bridged, the party fails to further expand its appeal, or polling volatility reflects a ceiling in their youth support. Mainstream parties regain some youth credibility or new issues emerge that blunt Vox's momentum.",
            "yes_scenario": "Vox's momentum among young men accelerates and is joined by more young women due to economic or cultural backlash, or a major polarizing event (e.g. migration crisis, public disorder, corruption scandal) drives a further rightward shift. Vox's digital strategy pays off, and their youth support surpasses 27% in a 40dB poll by the end of 2025.",
            "final_reasoning": "The base rate for youth support for far-right parties in Spain was very low until recently, but the current trend is sharply upward, with Vox at 27% among 18-24s as of February 2025. European comparators (e.g., AfD, RN) show it is plausible for far-right youth support to continue rising in times of economic or cultural anxiety. However, limitations include persistent high abstention among youth, a significant gender gap, and the possibility that 27% represents a near-term ceiling for Vox unless something further changes. The status quo slightly favors a 'No' outcome, but the trend and volatility of the last six months suggest a non-negligible risk of a further uptick. Given the factors above, the most likely scenario is that Vox hovers around the 25-28% mark, with a modestly higher chance of staying at or below 27% than exceeding it, barring a major external shock. I assess a roughly 35% chance that Vox will surpass 27% youth voting intention in a 40dB poll by end-2025.",
            "final_probability": 35
        }
    },
    "deliberation_probability": [
        40,
        62,
        62,
        62,
        38,
        58,
        63,
        38,
        35
    ],
    "deliberation_mean_probability": 50.888888888888886,
    "deliberation_sd": 12.604011707036419,
    "deliberation_probability_result": 51,
    "group_results": {
        "electionPollingSurveyMethodologyStandards": {
            "forecaster_to_engage": "Election Polling (Sampling Error Analysis)",
            "response_type": "critique",
            "response": "You’re leaning way too hard on the volatility card and letting statistical noise dominate your reasoning while overestimating the odds of a breakthrough. Yes, small subsample sizes make the youth numbers bouncy, but that cuts both ways: just as likely the next 40dB poll has a handful fewer Vox supporters and the number dips to 25-26%. Your 62% probability acts as though the trend alone nearly guarantees a further rise, but ignores base rate inertia—most surges stall or pull back at high-water marks. The 'ceiling effect' from abstention isn’t just a side note, it’s a structural cap on further growth, especially with the gender gap and the lack of a fresh right-populist shock. In short: statistical volatility means we can’t trust the current peak will be exceeded, not that it likely will. Your estimate puts way too much faith in the upward trajectory and not enough in the tendency for these things to revert or plateau."
        },
        "electionPollingSamplingErrorAnalysis": {
            "forecaster_to_engage": "Political Consulting (Voter Segmentation Strategies)",
            "response_type": "critique",
            "response": "You’re letting segmentation theory seduce you into overconfidence. Sure, Vox’s digital strategy and male youth polarization are pushing numbers up, but you downplay just how much sampling error can whipsaw these results. Segmentation is great for explaining why Vox got to 27%—not why it will break past it. Without a big, new catalyst, further gains are much harder; the ceiling effect plus high abstention and gender divides aren’t just 'headwinds,' they’re mathematical limits in a small subsample. Your focus on messaging ignores the harsh reality: a handful of different responses in a 400-person youth sample can mean the difference between 27% and 25.5%. You give the impression that momentum alone will nudge Vox over the line, but in polling, especially at high-water marks, regression to the mean is king. Your scenario for further rise is plausible, but your probability is too high given the structural and methodological brakes."
        },
        "politicalConsultingVoterSegmentationStrategies": {
            "forecaster_to_engage": "Public Opinion Analysis (Trend Projection Techniques)",
            "response_type": "defense",
            "response": "This is one of the few forecasts that balances optimism about Vox’s momentum with hard-nosed skepticism about the ceiling effect and volatility among youth. The emphasis on polling volatility and regression to the mean is crucial—too many forecasters are extrapolating straight lines from trend data, ignoring how often such surges stall or reverse, especially in youth cohorts with high abstention and fickle attitudes. At the same time, you recognize that momentum is real and the digital/issue environment is tilting in Vox’s favor, just not to the point of certainty. The nuanced probability (62%) reflects this knife-edge and acknowledges both the risk of further rightward drift and the natural tendency for these numbers to cap out. In short: you avoid both the recency bias of trend extrapolation and the myopia of assuming nothing can change, landing on a defensible, well-calibrated estimate."
        },
        "publicOpinionAnalysisTrendProjectionTechniques": {
            "forecaster_to_engage": "Political Science (Party System Theory)",
            "response_type": "critique",
            "response": "Your argument is stuck in the mud of structural theory and misses the pulse of the current youth electorate. Yes, multiparty systems rarely let one party exceed a quarter of the youth vote, but you’re underestimating the disruptive impact of digital virality and rapid ideological realignment—just look at the polling chaos in Germany and France. The idea that Vox needs a 'charismatic breakthrough' or a 'crisis' ignores that, for this cohort, the crisis is permanent: economic stagnation, housing precarity, and social media echo chambers are already creating the conditions for continued right-populist advance. The 'local maximum' framing is too static; it treats youth politics as a slow-moving glacier when it’s more like a flash flood. By anchoring so heavily on party system inertia, you’re overlooking both the speed and magnitude of recent shifts and the possibility that the ceiling is being raised in real time. Your sub-40% probability is overly anchored to the past and fails to account for how dramatically the playing field has changed."
        },
        "politicalSciencePartySystemTheory": {
            "forecaster_to_engage": "Sociology (Youth Political Socialization)",
            "response_type": "critique",
            "response": "You're letting the narrative of political momentum blind you to the structural and statistical brakes. Yes, all the attitudinal arrows point toward a generational rightward shift, but you’re hand-waving away the sheer volatility and fickleness of youth intention polling—especially with abstention still sky-high. You treat polling intention as if it’s just inertia plus trend, but the actual data are bouncier and more prone to late reversals than your reasoning allows. By pushing your probability above 60%, you’re overestimating the inertia of the current moment and underestimating both regression to the mean and the stubborn ceiling created by gender splits and fragmentation. Youth in Spain aren’t ideologically locked-in; their swings are fast but also soft, and the status quo at 27% is just as likely to revert as to surge. Your estimate is riding the excitement of the trend, not the reality of how hard it is to keep breaking new ground at these levels."
        },
        "politicalScienceVoteChoiceModels": {
            "forecaster_to_engage": "Sociology (Generational Theory)",
            "response_type": "defense",
            "response": "Finally, someone willing to put the brakes on the hype. Your forecast is one of the few that actually grapples with the mathematical and historical ceiling effects at play here. Everyone else is getting swept up in the narrative of a 'youthquake' for the far right, but you rightly point out that after such a sudden surge, further upward momentum is the exception, not the rule. The generational context—economic insecurity, digital mobilization—explains how Vox got to 27%, not why it should be expected to break 28% or 30%. Your probability (38%) is a needed corrective to the trend-chasers: it recognizes that high abstention and gender polarization are not just epiphenomena, but real structural caps on further growth in the absence of a new catalytic event. Too many are underestimating how often the first big surge is the last for a while—and your analysis nails that risk."
        },
        "sociologyYouthPoliticalSocialization": {
            "forecaster_to_engage": "Iberian Studies (Contemporary Spanish Politics)",
            "response_type": "defense",
            "response": "At last, a forecaster who resists the herd mentality. Your estimate (35%) is refreshingly anchored in base rates and the real historical inertia of Spanish party politics, rather than being swept up by the latest polling high. You take the European context seriously—seeing that surges in far-right youth support are possible, but still rare and usually plateau fast unless there’s a fresh shock. Too many others are extrapolating from a couple of polls and pretending volatility and youth abstention don’t matter. Your forecast rightly notes that 27% is more likely a near-term ceiling than a new floor, given persistent abstention, gender splits, and the likelihood of fragmentation. It’s a needed antidote to the recency bias and overconfidence swirling around this topic. Well-calibrated skepticism, for once."
        },
        "sociologyGenerationalTheory": {
            "forecaster_to_engage": "Political Science (Vote Choice Models)",
            "response_type": "defense",
            "response": "Finally, someone willing to put the brakes on the hype. Your forecast is one of the few that actually grapples with the mathematical and historical ceiling effects at play here. Everyone else is getting swept up in the narrative of a 'youthquake' for the far right, but you rightly point out that after such a sudden surge, further upward momentum is the exception, not the rule. The generational context—economic insecurity, digital mobilization—explains how Vox got to 27%, not why it should be expected to break 28% or 30%. Your probability (38%) is a needed corrective to the trend-chasers: it recognizes that high abstention and gender polarization are not just epiphenomena, but real structural caps on further growth in the absence of a new catalytic event. Too many are underestimating how often the first big surge is the last for a while—and your analysis nails that risk."
        },
        "iberianStudiesContemporarySpanishPolitics": {
            "forecaster_to_engage": "Election Polling (Survey Methodology Standards)",
            "response_type": "defense",
            "response": "This is one of the few voices showing real methodological discipline. You correctly foreground the reality that, with the current 40dB poll basically at the threshold, base rates and regression to the mean are the best anchors, not trend extrapolation. Your focus on the volatility inherent in small youth subsamples—and the point that this volatility is as likely to pull Vox down as up—is crucial and is being ignored by the pro-momentum brigade. You also appreciate that most polling surges at local maxima revert, especially when the ceiling is defined by abstention and gender splits. The 40% probability is well-calibrated and reflects genuine uncertainty, rather than the overconfident optimism that a single upward blip in a noisy series should dictate our expectation. In a sea of overexcited trend-followers, your approach is a much-needed dose of statistical sobriety."
        }
    },
    "revision_results": {
        "Election Polling (Survey Methodology Standards)": {
            "my_phase1_final_probability": 40,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, particularly the critique of the 'Sampling Error Analysis' forecast, I am reinforced in my view that volatility and sampling error make point predictions above 27% unreliable—just as likely to swing down as up. The consensus among most forecasters aligns with my original reasoning: the status quo is a local maximum and there are real structural headwinds (abstention, gender gap, ceiling effects) that make further upward movement challenging. While I acknowledge the momentum and the broader European context, I continue to see regression to the mean and sampling variance as equally likely to drag the number down as to push it up. No new arguments in the group phase persuade me to raise my probability; if anything, the higher estimates seem insufficiently sensitive to the stability of high polling thresholds in youth cohorts. I therefore maintain my original estimate.",
            "revised_probability": 40
        },
        "Election Polling (Sampling Error Analysis)": {
            "my_phase1_final_probability": 62,
            "reasoning_for_revised_probability": "After engaging with other forecasters—especially the critique from 'Election Polling (Survey Methodology Standards)'—I recognize I may have overweighted the trend and comparative European context, and underweighted regression to the mean and the statistical volatility of youth subsamples. The group consensus is clearly more cautious, with most experts clustering below 50%, emphasizing that hitting a local maximum (27%) is often followed by plateau or slight retreat, not further breakthrough, especially given ceiling effects, abstention, and persistent gender gaps. While the trend is real, the odds of a small poll sample producing a >27% result again are lower than I initially judged. The lack of a clear, new mobilizing event or shock also tempers the case for further short-term gains. Overall, the balance of evidence and expert argumentation suggests a probability modestly below even odds.",
            "revised_probability": 48
        },
        "Political Consulting (Voter Segmentation Strategies)": {
            "my_phase1_final_probability": 62,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, particularly the critiques from the survey methodology and sampling error specialists, I recognize I may have underweighted the significance of statistical noise and ceiling effects at play. The point that volatility in small youth samples can just as easily push the number down as up is well-taken, and the historical base rate for parties breaking through such high-water marks is low. While my segmentation analysis justifies a probability above 50%, the structural and methodological brakes—especially the risk of regression to the mean and lack of a new catalyzing event—tilt the odds back toward a much closer call. The case for further growth is real, but the chance Vox simply hovers at or just below 27% is at least as likely. I am therefore lowering my estimate to better reflect the true uncertainty and the possibility of a plateau.",
            "revised_probability": 52
        },
        "Public Opinion Analysis (Trend Projection Techniques)": {
            "my_phase1_final_probability": 62,
            "reasoning_for_revised_probability": "Group deliberation reinforced the knife-edge nature of this forecast. The critiques of higher probabilities (especially those grounded in sampling error analysis and voter segmentation) highlighted the real risk of over-extrapolating from trend momentum and underestimating regression to the mean at polling peaks. The best arguments from the lower-probability forecasts centered on base rates, structural ceilings, and how often bouncy youth polling reverts or dips under pressure from abstention, gender gaps, and the lack of a fresh shock event. However, the defense of my initial forecast also validated the balance I struck, acknowledging both momentum and volatility. All considered, the consensus leans slightly more skeptical about a breakthrough above 27%, leading me to moderate my optimism. I am lowering my probability to better reflect the structural and methodological brakes, but not all the way to the sub-50% camp, as the international context and digital momentum still give Vox a plausible shot at a further uptick.",
            "revised_probability": 55
        },
        "Political Science (Party System Theory)": {
            "my_phase1_final_probability": 38,
            "reasoning_for_revised_probability": "After reviewing group deliberation, I see that most forecasters are modestly more bullish than I was, with several putting the odds above 60% and only a minority (mainly structural theorists and Iberian Studies) sticking in the 35-40% range. The best arguments for an increase are the still-unfolding rightward shift in youth, the possibility that social media virality can break past traditional ceilings, and the fact that the 'local maximum' may not be a true cap if feedback loops accelerate. However, I remain convinced that abstention, gender splits, and regression to the mean are strong counterweights, and I found the arguments emphasizing statistical volatility and ceiling effects persuasive. The trend is real, but so are the statistical and structural headwinds. I also note that the last poll hit 27%—not over—and the hurdle is strictly 'above', which matters with such small margins. Still, given the breadth of consensus that the status quo is very finely balanced and the possibility of a late-campaign nudge, I will slightly revise upward to account for the genuine momentum and the risk of a further upward blip due to viral events or sampling noise.",
            "revised_probability": 44
        },
        "Political Science (Vote Choice Models)": {
            "my_phase1_final_probability": 58,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I see a clear pattern: although recent momentum and European comparators suggest a real risk of Vox exceeding 27% among youth, several forecasters persuasively argue that regression to the mean, sampling volatility, ceiling effects from abstention and gender gaps, and the lack of a new catalytic event all combine to make further gains above 27% harder than my initial estimate implied. The critiques emphasize that polling at such thresholds is highly sensitive to subsample variation, and that even continued ideological realignment does not guarantee a further increase in this specific poll metric. The defense of lower probabilities based on historical ceiling effects and volatility was compelling, reminding me to put even more weight on the tendency for surges to plateau, especially in youth cohorts. Therefore, I am revising my probability downward to more closely align with the sub-50% consensus of the most methodologically rigorous arguments.",
            "revised_probability": 45
        },
        "Sociology (Youth Political Socialization)": {
            "my_phase1_final_probability": 63,
            "reasoning_for_revised_probability": "After reading the group deliberation, especially the repeated emphasis by methodologists, party system theorists, and generational analysts on structural and statistical ceilings, I acknowledge I was a touch too bullish on the upward effects of momentum and digital mobilization. The critiques highlight that at such a high-water mark, volatility and regression to the mean are not just minor headwinds, but central to the outcome—particularly given the small youth sample sizes and persistent abstention. The consensus among the most statistically grounded forecasters (Survey Methodology Standards, Party System Theory, Generational Theory, Iberian Studies) is that the odds of overshooting 27% are modest, not probable, and that a plateau or minor dip is historically more likely barring a new shock. While I still think the trend, digital strategy, and European context give Vox a fighting chance to break 27%, the probability should be closer to even odds, not well above. Therefore, I am revising my estimate downward.",
            "revised_probability": 52
        },
        "Sociology (Generational Theory)": {
            "my_phase1_final_probability": 38,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I see that my initial probability (38%) was on the low end compared to most other forecasters, many of whom gave probabilities in the upper 50s and low 60s. However, the critiques and defenses raised in the discussion reinforce my view that the structural and statistical ceilings—high abstention, gender splits, and regression to the mean—are being underweighted by those with higher probabilities. Notably, several critiques (including my own) pointed out the risk of over-extrapolating from recent surges and underestimating how often such peaks stall or reverse. On the other hand, no new compelling evidence was raised to suggest a significant new catalyst is imminent, nor that the ceiling is likely to be raised quickly. Therefore, I see no strong reason to shift my estimate upward. If anything, the group discussion validated my caution, but since my estimate already incorporated these concerns, I will hold it steady.",
            "revised_probability": 38
        },
        "Iberian Studies (Contemporary Spanish Politics)": {
            "my_phase1_final_probability": 35,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I see that most forecasters either cluster just under or just over 50%, with a few going as high as 62% and several in the high 30s to low 40s. The most persuasive critiques reinforce my initial emphasis on structural ceilings (abstention, gender gap, volatility) and the likelihood of regression to the mean. Defenses of higher probabilities do not convincingly account for the ceiling effects or the possibility that the current 27% is a local high, not a new baseline. While arguments about digital strategy and European trends are valid, they do not outweigh the statistical and demographic brakes. The deliberation confirms my view that the probability should be below even odds, with a slight lean to the downside due to the structural impediments. Therefore, I maintain my original estimate.",
            "revised_probability": 35
        }
    },
    "revision_probability": [
        40,
        48,
        52,
        55,
        44,
        45,
        52,
        38,
        35
    ],
    "revision_mean_probability": 45.44444444444444,
    "revision_sd": 6.894039293315478,
    "revision_probability_result": 45,
    "question_details": {
        "id": 38765,
        "title": "Will Vox surpass the 27% voting intention among young people in Spain by the end of 2025?",
        "created_at": "2025-08-31T05:07:40.748062Z",
        "open_time": "2025-09-21T16:23:23Z",
        "cp_reveal_time": "2025-09-21T17:53:23Z",
        "spot_scoring_time": "2025-09-21T17:53:23Z",
        "scheduled_resolve_time": "2025-12-31T22:59:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-09-21T17:53:23Z",
        "actual_close_time": "2025-09-21T17:53:23Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "This question is synced with an identical question on Metaculus. The original question opened on 2025-02-27 13:30:00 and can be found [here](https://www.metaculus.com/questions/35263). This question will resolve to the same value as the synced question. The original question's background info at this time is below. \n\nVox is a political party founded in 2013 in Spain, classified by political scientists and media outlets as a far-right or right-wing populist party. In recent years, its support among young voters has attracted significant attention. According to [ <u>recent 40dB polls</u> ](https://ep00.epimg.net/infografias/encuestas40db/2025/02-barometro/2025_02_barometro_voto.pdf) published by El País, Vox receives 27% support among voters aged 18-24, its highest percentage across all age groups. This is notably higher than its support among older demographics, which ranges from 10-19%.\n\n This pattern of increased youth support for far-right parties [ <u>is not unique to Spain</u> ](https://elpais.com/internacional/2024-06-15/el-voto-de-los-jovenes-a-la-extrema-derecha-crece-en-los-cinco-mayores-paises-de-la-ue.html), as Marine Le Pen's RN in France and AfD in Germany have also seen an increase in youth support in recent years.\n\n`{\"format\":\"metac_closes_in_period\",\"info\":{\"post_id\":35263,\"question_id\":34747}}`",
        "resolution_criteria": "The question will be answered as **Yes** if, according to the latest 2025 survey conducted by the company 40dB., the direct voting intention for Vox among young people aged 18 to 24 is greater than 27%. It will be answered as **No** if it is 27% or less.",
        "fine_print": "• The relevant survey will probably be published by [ <u>El País</u> ](https://elpais.com/noticias/barometro-el-pais/).\n\n • Voting intention refers specifically to the 18-24 age group and to direct voting intention data, as presented in the 40dB survey. You can consult [ <u>this example</u> ](https://ep00.epimg.net/infografias/encuestas40db/2025/02-barometro/2025_02_barometro_voto.pdf). If that range is not available, another nearby range will be used to represent the youth vote.\n\n • If the last 2025 40dB survey is published before October 1, 2025, this question will be **void**.",
        "post_id": 39388,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Rafael López, sociologist: 'The far‑right excels at swapping truth for virality'**\nThe program \"laSexta Xplica\" examined the rise of the far‑right in Spain. It highlighted that Vox voters cite immigration (47 %) and government/parties (47 %) as main concerns, while left‑wing voters point to housing, employment quality and political conduct. Sociologist Rafael López, who appeared on the show, explained that the situation is complex, noting that \"the first party for young people is abstention, not Vox\" and that the far‑right simplifies the problem. He warned that the far‑right \"works very well by swapping veracity for virality\" and that its goal is not only to radicalise some voters but also to demobilise large working‑class segments. López added that the movement seeks to disconnect people from the past and undermine critical thinking in schools. The program’s discussion was framed by these quotes: 'Para empezar tenemos que decir que la situación es compleja', 'La extrema derecha trabaja muy bien el cambiar la veracidad por la viralidad', and 'Cuando ves que los jóvenes son el único sector de la población que no ha recuperado cierto poder adquisitivo'.\nOriginal language: es\nPublish date: September 21, 2025 11:58 AM\nSource:[Mundo Deportivo](https://www.mundodeportivo.com/actualidad/20250921/1002536161/rafael-lopez-sociologo-extrema-derecha-trabaja-cambiar-veracidad-vitalidad-importante-conocer-verdad-inundar-zona-cree-sensacion-verdad-expt-dct.html)\n\n**Youth Drive a 'Revolution' on Social Media but Vote the Least**\nThe article reports that in the 2023 general elections in the country, the electoral roll counted 4,782,940 voters, of whom 31% (1,489,501) were aged 18‑29, 57% were aged 30‑64, and 12% were 65 or older.  The 18‑29 age group had the lowest turnout, with only 56.4% voting; 839,926 of the 1,489,501 eligible young voters cast ballots.  In comparison, turnout was 68% among 30‑64 year olds and 58.2% among those 65 and older.  The age group with the highest participation was 60‑64 year olds (73%).  The article notes that 45% of voters aged 18‑24 did not vote and 41% of those aged 25‑29 abstained.  It also highlights a gradual increase in youth turnout over the past decade: 54.98% in 2023, 52.22% in 2021 municipal elections, 47.64% in 2018 general elections, and 45.97% in 2015 municipal elections.  Despite the law of automatic registration and the removal of ‘blank lists’, the youth remain the most apathetic segment at the polls, even though they are very active on social media.  The article quotes that \"Los jóvenes encabezan las cifras de abstencionismo al no acudir a sufragar y dar pie a que se impulsen leyes de 'muerte civil' a no votantes.\"\nOriginal language: es\nPublish date: September 21, 2025 04:54 AM\nSource:[ABC Digital](https://www.abc.com.py/politica/2025/09/21/jovenes-arman-una-revolucion-en-redes-pero-son-los-que-menos-votan/)\n\n**Vox Surpasses PP**\nAccording to all polls, the Partido Popular (PP) is stagnating in vote intention while Vox continues to grow, the article states. The author expresses a preference for the \"nazi, racist, negationist, machista, inhumana, codiciosa y parasitaria\" right over the \"derechita cobarde\" that Santiago Abascal claims, arguing that Vox is the original and PP the copy. The piece claims Vox is not a splinter of PP but its \"célula madre\", and that the citizen prefers the original over the copy. It also notes that Vox could surpass PP in upcoming elections, stating \"Quedan un par de años para las elecciones y no es descartable una mayoría de PP y Vox, pero no como la habíamos imaginado, sino con otra correlación de fuerzas.\"\nOriginal language: es\nPublish date: September 21, 2025 04:12 AM\nSource:[Público.es](https://www.publico.es/opinion/columnas/vox-sorpassa-pp.html)\n\n**Hungary’s Youth Voice Anger Against Viktor Orban’s Party**\nThe article reports that in Hungary, youth are expressing anger through festivals and concerts, criticizing Viktor Orban’s 16‑year rule. 24‑year‑old student Armin says 'Tout est de plus en plus cher, il y a une énorme inflation…', and that the government is pro‑Russian and hostile to LGBT+ people.  The pop singer Majka satirises the regime in her hit ‘Bindjistan’, with the refrain ‘Je survis à tout, car les lois sont écrites pour moi’.  At a concert in Szeged, the chant ‘Salaud de Fidesz !’ was repeated by hundreds of young attendees.  Political scientist Matyas Bodi notes that while far‑right parties like Le Pen, the AfD and Vox are popular among young people in other European countries, Orban’s Fidesz is in power and presents itself as anti‑establishment.  A September 2025 survey by the Institut Median found 37 % of voters would choose the opposition Tisza party, 30 % would choose Fidesz, and among voters under 30 only 15 % would vote for Fidesz while 56 % would vote for Tisza.  Youth such as stylist Kata are actively supporting Tisza, saying ‘C’est notre dernière chance…’ and describing the current regime as ‘toxique’.  The article warns that without a radical change by 2026, Hungary could become ‘une sorte de Biélorussie’.\nOriginal language: fr\nPublish date: September 20, 2025 01:57 PM\nSource:[rts.ch](https://www.rts.ch/info/monde/2025/article/hongrie-la-jeunesse-crie-sa-colere-contre-le-parti-d-orban-dans-les-festivals-28999760.html)\n\n**Young People Are No Longer More Left‑Wing Than Their Parents**\nSpain’s government is moving forward with a proposal to lower the minimum voting age from 18 to 16, following a similar change in the United Kingdom aimed at boosting democratic participation.  The article draws on a series of CIS barometers from 1986 to 2025 to chart how 18‑to‑24‑year‑olds’ self‑perceived ideology has shifted.  In 2015, 8 % of this age group identified as right‑wing, rising sharply to 34 % in 2025, while left‑wing identification fell from 40 % to 31 %.  The centre, defined as those rating their ideology between 4 and 6, has contracted across all ages, with the youngest cohort moving toward right‑leaning options.  Catalonia mirrors the national trend; the 18‑24 bracket moved from the lowest to the second‑highest average ideological score.  Electoral intentions reflect these shifts: Vox is the most supported party among 18‑24‑year‑olds, with 21.4 % direct voting intention, and in Catalonia a three‑way tie between PSC, ERC and Vox at roughly 13 % each.  Gender differences are evident—young men are more right‑leaning and show less interest in feminism, whereas young women lean left and express greater feminist engagement.  A European study cited in the piece notes that men aged 16‑29 vote more for the far‑right, a trend that has widened in recent years and could significantly impact European societies.  The article presents these findings in a data‑driven, neutral tone, highlighting the evolving political landscape among Spain’s youth.\nOriginal language: es\nPublish date: September 20, 2025 06:01 AM\nSource:[El Periódico](https://www.elperiodico.com/es/sociedad/20250920/jovenes-son-izquierdas-padres-121712229)\n\n**Rafael López, sociologist: 'The far‑right excels at swapping truth for virality'**\nThe program \"laSexta Xplica\" examined the rise of the far‑right in Spain. It highlighted that Vox voters cite immigration (47 %) and government/parties (47 %) as main concerns, while left‑wing voters point to housing, employment quality and political conduct. Sociologist Rafael López, who appeared on the show, explained that the situation is complex, noting that \"the first party for young people is abstention, not Vox\" and that the far‑right simplifies the problem. He warned that the far‑right \"works very well by swapping veracity for virality\" and that its goal is not only to radicalise some voters but also to demobilise large working‑class segments. López added that the movement seeks to disconnect people from the past and undermine critical thinking in schools. The program’s discussion was framed by these quotes: 'Para empezar tenemos que decir que la situación es compleja', 'La extrema derecha trabaja muy bien el cambiar la veracidad por la viralidad', and 'Cuando ves que los jóvenes son el único sector de la población que no ha recuperado cierto poder adquisitivo'.\nOriginal language: es\nPublish date: September 21, 2025 11:58 AM\nSource:[Mundo Deportivo](https://www.mundodeportivo.com/actualidad/20250921/1002536161/rafael-lopez-sociologo-extrema-derecha-trabaja-cambiar-veracidad-vitalidad-importante-conocer-verdad-inundar-zona-cree-sensacion-verdad-expt-dct.html)\n\n**PSC Falls and Junts, ERC, Alianza Compete for Second Place According to La Vanguardia**\nA poll conducted by Ipsos from 11‑17 September and published by La Vanguardia shows a highly fragmented Catalan political landscape. The PSC remains the most voted party but would lose six seats, dropping from 42 to 36. Junts would suffer a larger fall, losing 14 seats and falling from 35 to 21. Alianza Catalana would surge, gaining 17 seats (from 2 to 19) with 11.9% of the vote, while Vox would increase its representation from 11 to 16 seats with 12.1% of the vote, surpassing the PP. ERC would obtain 14.7% of the vote and 21 seats; Comuns would get 4.9% and 5 seats. The poll indicates that the PSC could win the election with 25.1% of the vote but would be unable to form a majority with ERC and Comuns. The article warns that the rise of far‑right forces threatens an ungovernable Catalonia if current trends continue. Key issues for voters are politics (18%), housing (18%) and immigration (16%). Immigration support for Alianza and Vox has quadrupled, rising from 4% to 16% in one year. Fifty percent of respondents believe Catalonia is on the wrong path, while only 26% think it is going well. Interviews quoted in the article include Barcelona mayor Jaume Collboni, who said 'Los presupuestos del 2026 y 2027 congelarán impuestos a familias y pymes', and Junts secretary Jordi Turull, who declared 'el seguidismo de Illa con respecto a Madrid empobrece a Catalunya'. A separate housing survey cited in the paper found that 79% of Spanish respondents demand a housing pact, with 79% calling for the unlocking of the land‑use law to build more apartments.\nOriginal language: es\nPublish date: September 21, 2025 07:06 AM\nSource:[ElNacional.cat](https://www.elnacional.cat/es/politica/portadas-psc-retrocede-junts-erc-alianca-se-disputan-segunda-posicion-segun-va_1488023_102.html)\n\n**AfD Leads New Opinion Polls, Surpassing the CDU**\nThe right‑wing populist party 'البديل من أجل ألمانيا' (AfD) topped a new opinion poll conducted by the Insa Institute on behalf of the German newspaper 'بيلد', with 26% support—an increase of one percentage point from the previous week and the highest share ever recorded by Insa. The Christian Democratic Union (CDU) coalition remained steady at 25%. A separate poll by the YouGov Institute also showed AfD surpassing the CDU for the first time. Other parties performed as follows: the Social Democratic Party (SPD) received 15% support, up one point; the Greens (الخضر) fell to 11%, matching the Left (اليسار); the Saarland Alliance (تحالف سارا فاجنكنشت) garnered 4%; and the Free Democratic Party (الديمقراطي الحر) obtained 3%, both below the 5% threshold for parliamentary entry. The survey covered 1,200 eligible voters in Germany between 15 and 19 September 2025.\nOriginal language: ar\nPublish date: September 21, 2025 05:32 AM\nSource:[جريدة الشروق](https://www.shorouknews.com/news/view.aspx?cdate=21092025&id=9f05cd56-d718-4bca-bb65-b6214d2bcb63)\n\n**Youth Drive a 'Revolution' on Social Media but Vote the Least**\nThe article reports that in the 2023 general elections in the country, the electoral roll counted 4,782,940 voters, of whom 31% (1,489,501) were aged 18‑29, 57% were aged 30‑64, and 12% were 65 or older.  The 18‑29 age group had the lowest turnout, with only 56.4% voting; 839,926 of the 1,489,501 eligible young voters cast ballots.  In comparison, turnout was 68% among 30‑64 year olds and 58.2% among those 65 and older.  The age group with the highest participation was 60‑64 year olds (73%).  The article notes that 45% of voters aged 18‑24 did not vote and 41% of those aged 25‑29 abstained.  It also highlights a gradual increase in youth turnout over the past decade: 54.98% in 2023, 52.22% in 2021 municipal elections, 47.64% in 2018 general elections, and 45.97% in 2015 municipal elections.  Despite the law of automatic registration and the removal of ‘blank lists’, the youth remain the most apathetic segment at the polls, even though they are very active on social media.  The article quotes that \"Los jóvenes encabezan las cifras de abstencionismo al no acudir a sufragar y dar pie a que se impulsen leyes de 'muerte civil' a no votantes.\"\nOriginal language: es\nPublish date: September 21, 2025 04:54 AM\nSource:[ABC Digital](https://www.abc.com.py/politica/2025/09/21/jovenes-arman-una-revolucion-en-redes-pero-son-los-que-menos-votan/)\n\n**Vox Surpasses PP**\nAccording to all polls, the Partido Popular (PP) is stagnating in vote intention while Vox continues to grow, the article states. The author expresses a preference for the \"nazi, racist, negationist, machista, inhumana, codiciosa y parasitaria\" right over the \"derechita cobarde\" that Santiago Abascal claims, arguing that Vox is the original and PP the copy. The piece claims Vox is not a splinter of PP but its \"célula madre\", and that the citizen prefers the original over the copy. It also notes that Vox could surpass PP in upcoming elections, stating \"Quedan un par de años para las elecciones y no es descartable una mayoría de PP y Vox, pero no como la habíamos imaginado, sino con otra correlación de fuerzas.\"\nOriginal language: es\nPublish date: September 21, 2025 04:12 AM\nSource:[Público.es](https://www.publico.es/opinion/columnas/vox-sorpassa-pp.html)\n\n**Alert in Spanish Right Over Populism Expanding from the US After Kirk's Murder**\nEl Periódico reports that the FAES campus in Madrid highlighted the rise of right‑wing populism in Spain, focusing on Vox leader Santiago Abascal. The article notes that Vox is approaching 20 % of the vote and could double its seats to more than 60 in the next election. It describes how Abascal, a former PP youth leader, has become a key figure in the Spanish right and is now aligned with international populist leaders such as Donald Trump, Marine Le Pen, Giorgia Meloni, Viktor Orbán, and Javier Milei. The piece also recounts how former Spanish prime minister José María Aznar and Galician PP leader Alberto Núñez Feijóo criticized Pedro Sánchez, while Feijóo’s migration policy remains a priority. The article cites the murder of American conservative activist Charlie Kirk as a shock that has intensified the alarm in the European right. It quotes Aznar saying that 'the United States is expanding populism' and that Europe faces a 'catastrophe' that fuels right‑wing parties. The article concludes that Vox is now the most powerful right‑wing force in Spain, with 20 % of the vote and more than 60 seats, while the PP lags behind.\nOriginal language: es\nPublish date: September 21, 2025 04:00 AM\nSource:[El Periódico](https://www.elperiodico.com/es/politica/20250921/alerta-derecha-espanola-populismo-expande-121773934)\n\n**Hungary’s Youth Voice Anger Against Viktor Orban’s Party**\nThe article reports that in Hungary, youth are expressing anger through festivals and concerts, criticizing Viktor Orban’s 16‑year rule. 24‑year‑old student Armin says 'Tout est de plus en plus cher, il y a une énorme inflation…', and that the government is pro‑Russian and hostile to LGBT+ people.  The pop singer Majka satirises the regime in her hit ‘Bindjistan’, with the refrain ‘Je survis à tout, car les lois sont écrites pour moi’.  At a concert in Szeged, the chant ‘Salaud de Fidesz !’ was repeated by hundreds of young attendees.  Political scientist Matyas Bodi notes that while far‑right parties like Le Pen, the AfD and Vox are popular among young people in other European countries, Orban’s Fidesz is in power and presents itself as anti‑establishment.  A September 2025 survey by the Institut Median found 37 % of voters would choose the opposition Tisza party, 30 % would choose Fidesz, and among voters under 30 only 15 % would vote for Fidesz while 56 % would vote for Tisza.  Youth such as stylist Kata are actively supporting Tisza, saying ‘C’est notre dernière chance…’ and describing the current regime as ‘toxique’.  The article warns that without a radical change by 2026, Hungary could become ‘une sorte de Biélorussie’.\nOriginal language: fr\nPublish date: September 20, 2025 01:57 PM\nSource:[rts.ch](https://www.rts.ch/info/monde/2025/article/hongrie-la-jeunesse-crie-sa-colere-contre-le-parti-d-orban-dans-les-festivals-28999760.html)\n\n**Young People Are No Longer More Left‑Wing Than Their Parents**\nSpain’s government is moving forward with a proposal to lower the minimum voting age from 18 to 16, following a similar change in the United Kingdom aimed at boosting democratic participation.  The article draws on a series of CIS barometers from 1986 to 2025 to chart how 18‑to‑24‑year‑olds’ self‑perceived ideology has shifted.  In 2015, 8 % of this age group identified as right‑wing, rising sharply to 34 % in 2025, while left‑wing identification fell from 40 % to 31 %.  The centre, defined as those rating their ideology between 4 and 6, has contracted across all ages, with the youngest cohort moving toward right‑leaning options.  Catalonia mirrors the national trend; the 18‑24 bracket moved from the lowest to the second‑highest average ideological score.  Electoral intentions reflect these shifts: Vox is the most supported party among 18‑24‑year‑olds, with 21.4 % direct voting intention, and in Catalonia a three‑way tie between PSC, ERC and Vox at roughly 13 % each.  Gender differences are evident—young men are more right‑leaning and show less interest in feminism, whereas young women lean left and express greater feminist engagement.  A European study cited in the piece notes that men aged 16‑29 vote more for the far‑right, a trend that has widened in recent years and could significantly impact European societies.  The article presents these findings in a data‑driven, neutral tone, highlighting the evolving political landscape among Spain’s youth.\nOriginal language: es\nPublish date: September 20, 2025 06:01 AM\nSource:[El Periódico](https://www.elperiodico.com/es/sociedad/20250920/jovenes-son-izquierdas-padres-121712229)\n\n**Poll: 91% of French Support Banning Rioters from Demonstrations**\nA CSA poll conducted for Europe 1, CNews and the Journal du Dimanche found that 91 % of French respondents support banning \"casseurs\" (rioters) from demonstrations, 8 % oppose the idea and 1 % remain undecided. The support is high across demographic groups: 89 % of men and 92 % of women are in favour; CSP+ 90 %, CSP‑ 91 % and inactive 90 % also show strong backing. Age‑group data reveal that, except for the 25‑34 bracket (80 %), all other age ranges are above 90 % in favour, with 18‑24, 50‑64 and 65 + at 93 % each and 35‑49 at 90 %. Politically, the majority of left‑wing voters (81 %) favour the ban, while the far‑right parties show even higher support: Renaissance 97 %, LR 93 % and RN 96 %. Within left factions, the Socialist Party is at 89 %, LFI 72 % and the Greens 71 %. The article cites a recent incident on 18 September, when 309 people were detained and 134 were placed in custody during protests. The piece presents the poll data factually without editorial commentary, making the reporting voice objective and the provocative level low.\nOriginal language: fr\nPublish date: September 20, 2025 04:07 AM\nSource:[Europe 1](https://www.europe1.fr/societe/sondage-91-des-francais-pensent-quil-faut-interdire-aux-casseurs-de-participer-aux-manifestations-773316)\n\n**Why Women Over 60 Don’t Vote for Vox: 'When I See Men Talking About Traditional Values, My Hair Rises'**\nThe article reports that women aged 60 and older are the strongest demographic opposition to the rise of the far‑right party Vox in Spain. According to recent surveys by CIS and 40db for Cadena SER and El País, the voting intention for Vox among women 60+ is only 8.3%. The article notes that Vox’s support drops sharply after age 44 and continues to decline with increasing age. It features quotes from prominent women: director Isabel Coixet says, 'Tengo 65 años, y he visto muchas cosas… Cuando veo a estos señores de ultraderecha hablando de valores tradicionales se me ponen los pelos de punta… Me da la risa', and former university rector Josefina Gómez Mendoza says, 'Yo nací en los años 40, los más duros de la dictadura… Si en los años y las elecciones que me quedan se me ocurre votar a la extrema derecha es que habría perdido la cabeza'. The piece concludes that this demographic is largely lost for the far‑right, contrasting with countries like France where the party’s message is more feminist.\nOriginal language: es\nPublish date: September 18, 2025 07:09 PM\nSource:[Cadena SER](https://cadenaser.com/nacional/2025/09/18/por-que-las-mujeres-mayores-de-60-anos-no-votan-a-vox-cuando-veo-a-senores-hablando-de-valores-tradicionales-se-me-ponen-los-pelos-de-punta-cadena-ser/)\n\n**Spanish Voters Condemn Uncontrolled Immigration, Debt Forgiveness, and Slightly Support Sanctions on Israel**\nA DYM poll released for 20 Minutos shows the Partido Popular (PP) at 35.2 % of the vote, translating to 150–154 seats, comfortably ahead of the Spanish Socialist Workers’ Party (PSOE) at 26.9 % (109–113 seats). The poll indicates that the PP’s majority‑right coalition remains stable and that the party’s prospects of governing without Vox are not currently threatened. The survey also highlights Spanish public opinion on several policy issues, including a strong condemnation of uncontrolled immigration, support for debt forgiveness, and only modest backing for sanctions against Israel. These findings suggest that while the PP dominates the current political landscape, its stance on key international and economic matters continues to shape voter preferences.\nOriginal language: es\nPublish date: September 18, 2025 04:54 PM\nSource:[elliberal.cat](https://www.elliberal.cat/2025/09/18/los-espanoles-condenan-la-inmigracion-descontrolada-la-condonacion-de-deuda-y-apoyan-muy-levemente-las-sanciones-a-israel/)\n\n**Vox Captures Youth: Tradition, Rebellion, and Social Media Make the Difference**\nThe article reports that Vox has become the preferred political option among Spanish youth, surpassing PSOE and PP in direct voting intention for voters under 35. According to the latest 40dB barometer, Vox has a 17.4% national vote estimate, but its real strength lies in the 18‑34 age group where it is the second‑largest force and, in some segments, close to the top. The piece attributes Vox’s appeal to a blend of traditional values, anti‑progressive rhetoric, and a highly targeted digital strategy that uses short videos, memes, and viral content on TikTok, Instagram and YouTube. It notes that Vox’s messaging focuses on employment, affordable housing and public safety—issues that resonate with young people facing precarious jobs and high rents. The article quotes the party’s slogan: 'Con VOX, España tendrá un futuro próspero y asegurado', and highlights the party’s use of international far‑right figures to reinforce a sense of global solidarity. The data cited include the 17.4% national estimate, the rise of Vox in the 18‑34 segment, and the loss of five points by PSOE among 18‑24 year‑olds in a year. The tone is largely factual, presenting statistics and party statements, though it frames Vox’s rise as a challenge to the ‘old politics’ and portrays the party in a positive light for its youth‑oriented strategy.\nOriginal language: es\nPublish date: September 15, 2025 10:09 PM\nSource:[Periodista digital](https://www.periodistadigital.com/politica/20250916/vox-conquista-juventud-tradicion-rebeldia-redes-sociales-marcan-diferencia-noticia-689405132457/)\n\n**Who Are the Catalan Ultras?**\nThe article examines the electoral base of the two right‑wing parties that have recently risen in Catalonia—Vox and Aliança Catalana—by analysing demographic and polling data. It notes that Vox’s support is strongest among young men aged 18‑34, where the party’s intention to vote reaches 15%, and even higher, 17%, among those aged 18‑24, outpacing the CUP, PSC and ERC by five percentage points. In the same age group, the ultra‑nationalist party led by Silvia Orriols records more than 11% intention, compared with an average of about 5% for all parties. The article cites that in 2024, roughly one in ten former Junts voters and one in fifteen former PP voters would now back Aliança, a shift that could push Orriols’ party over 250,000 ballots. It also highlights that Vox’s share of the vote among men under 35 is the highest among all parties, and that immigration is a key driver of ultra‑right voting, with many voters prioritising anti‑immigration concerns over their Catalan or Spanish identity. The piece uses phrases such as 'extrema derecha xenófoba' and discusses how the generational shift in Catalonia may favour authoritarian‑leaning offers. The analysis is data‑driven but carries a political slant, focusing on the rise of right‑wing forces.\nOriginal language: es\nPublish date: September 14, 2025 04:12 AM\nSource:[LaVanguardia](https://www.lavanguardia.com/politica/20250914/11010584/quienes-son-ultras-catalanes.html)\n\n**Vox Celebrates Festival Without Milei, Riding Rising Poll Numbers**\nVox is celebrating its annual political festival in Madrid this weekend, even though Argentine libertarian leader Javier Milei will not attend because he has cancelled his trip amid a political crisis at home. The party’s popularity has surged: recent polls show Vox exceeding 17 % of the vote and potentially reaching 20 % in future surveys, a level that could make it a decisive force in the next Spanish legislature. The article notes that more than one million former Partido Popular (PP) voters have switched to Vox in the last year, and that Vox is the most preferred party among 18‑ to 24‑year‑olds, surpassing Podemos in that age group. It also highlights that Vox’s support is strongest among younger voters, while older voters (65 +) still favor the PP. In presidential preference polls, Vox’s leader Santiago Abascal leads Pedro Sánchez among 18‑ to 30‑year‑olds and outpaces Alberto Núñez Feijóo among 18‑ to 40‑year‑olds, but Feijóo remains ahead of Abascal among those over 65. The article cites the latest CIS barometer, which reports that the majority of 18‑ to 45‑year‑olds answer ‘none’ when asked who they prefer as president. It also discusses how the PP is attempting to copy Vox’s messaging, while the PSOE is portrayed as a ‘refuge party’ for left‑wing voters. The piece points out that Vox’s social‑media presence on Tik‑Tok and Instagram is the strongest among young people, and that the party’s alliances with Viktor Orbán and Marine Le Pen are seen as strategic. Finally, the article explains that Milei’s absence is due to his loss in the Buenos Aires provincial elections, where he was defeated by a margin of more than thirteen points, and that his sister Karina is embroiled in a corruption scandal. The overall tone is analytical but carries a clear political bias in favor of Vox’s rise.\nOriginal language: es\nPublish date: September 13, 2025 04:28 AM\nSource:[LaVanguardia](https://www.lavanguardia.com/politica/20250913/11055890/vox-milei.html)\n\n**European Youth Shift Toward Left and Right Populism Amid Traditional Party Disillusionment**\nEuropean youth in France, Germany and Spain are increasingly turning to left‑ and right‑wing populist parties because traditional parties have failed to address their economic and social concerns.  In France, Marine Le Pen and Jean‑Luc Mélenchon have gained traction among young voters who face precarious jobs and unaffordable housing, as illustrated by Lucie, a secondary‑school teacher in Tours, who says, 'A mi edad, mis padres ya tenían casa. Yo apenas puedo ahorrar'.  In Germany, 27 % of voters aged 18‑24 supported Die Linke and 22 % backed the far‑right AfD, reflecting a sentiment that 'La política es hecha por viejos y para viejos, no para jóvenes', according to Alexandria, a university student in Munich.  Spain’s youth unemployment exceeds 26 %, and only 15 % of people under 30 live independently, a situation highlighted by sociologist Jorge Galindo who warned that the country’s ‘burbuja inmobiliaria’ leaves young people traumatized.  These statistics and quotes show a growing disillusionment with mainstream politics and a shift toward populist alternatives that promise immediate solutions and a return to a perceived ‘old world’ order.\nOriginal language: es\nPublish date: September 11, 2025 11:37 AM\nSource:[El Financiero](https://www.elfinanciero.com.mx/mundo/2025/09/11/jovenes-europeos-voltean-hacia-el-populismo-de-izquierda-y-derecha-ante-la-falta-de-respuestas-de-politicos-tradicionales/)\n\n**Vox Achieves Best Result Since General Elections, Leaving the People's Party in Worst Position**\nA recent online poll of 2,000 respondents conducted between 29 August and 1 September shows that the far‑right party Vox has achieved its best performance since the last general election, reaching 17.4 % of the vote – a gain of about two percentage points from the 23‑J poll.  The People's Party (PP) has fallen to 32.2 %, a decline of 2.6 percentage points from the July survey and 2.4 points below its 2023 election result.  Vox’s rise has come at the expense of the PP, which now loses 4.5 % of its electorate to Vox, up from 13.2 % in the previous poll.  The Socialists (PSOE) have slipped to 28.6 %, a drop of 7 percentage points, while the new party Sumar has gained 6.6 % and Podemos 3.4 %.  The survey also reports that Vox retains 86.7 % of its voters, the PP 71.2 %, and the PSOE 64.2 %.  The article notes that the PP’s decline is linked to the political backlash over the handling of forest fires in Castilla‑La Mancha, Galicia and Extremadura, all governed by the PP, and that the PSOE’s recent scandal involving former secretary of organization Santos Cerdán has helped it recover some support.  In terms of age and gender, Vox is strongest among men (22.3 %) and the 18‑24 age group (20.9 %), while the PSOE leads among women (21.5 %) and the 25‑34 age bracket (15.2 %).  The poll’s findings suggest that the right‑wing bloc (PP + Vox) now holds 48.1 % of the estimated vote, 10.4 percentage points ahead of the left‑wing bloc (PSOE + Sumar + Podemos).  The article quotes the poll’s methodology and highlights that Vox’s performance is the highest since the 2023 general election, where it had 13.2 % of the vote.\nOriginal language: es\nPublish date: September 09, 2025 06:05 AM\nSource:[Diario EL PAIS Uruguay](https://www.elpais.com.uy/mundo/espana/vox-alcanza-su-mejor-resultado-desde-las-elecciones-generales-y-deja-al-partido-popular-en-su-peor-registro)\n\n**Vox's Rise Pushes PP to Its Worst Result Since General Elections**\nAccording to the 40dB poll for Cadena SER and El País, if elections were held today, the far‑right Vox would receive 17.4% of the vote, its best result in the survey’s history. The PP remains the largest party but has slipped to 30.7% from 33.3% in July, a 2.6‑point drop. The PSOE sits at 27.7%, down from 29.8% after the Cerdán corruption scandal, while Sumar rises to 6.6% from 6.2% and Podemos falls to 3.4% from 3.8%. Vox’s gain of 2.2 points is the largest swing, and the poll shows that 17.7% of voters who chose PP in 2023 would now back Vox, compared with only 13% in the previous survey. Regionally, Vox leads in Andalucía (20.5%) and Valencia (20.7%), while the PSOE is strongest in Castilla y León (21.5%) and Galicia (22.4%). \"El barómetro de 40dB. para la Cadena SER y 'El País' revela que si hoy se celebrasen elecciones, la ultraderecha obtendría un 17,4% de los votos\".\nOriginal language: es\nPublish date: September 08, 2025 05:28 AM\nSource:[Cadena SER](https://cadenaser.com/nacional/2025/09/08/el-ascenso-de-vox-coloca-al-pp-en-su-peor-resultado-desde-las-elecciones-generales-cadena-ser/)\n\n**The 16‑Year‑Old Vote Favors EH Bildu and Vox | El Diario Vasco**\nEl Diario Vasco reports that lowering the voting age to 16 in the Basque Country would add roughly 40,000 new voters, a figure that experts say would largely benefit EH Bildu and Vox.  According to the CIS, in the last Basque elections EH Bildu would capture nearly 30 % of voters under 24, compared with 26 % for the PNV.  Nationally, recent 40db polls place Vox as the leading force among young voters, with the PP attracting older voters and the PSOE leading the progressive young vote.  María Silvestre notes that the Basque electorate would see EH Bildu as the most benefited party, the PSE‑EE a slight boost, and the PNV hurt.  Ainara Villaño adds that the demographic imbalance (37 % of voters aged 45‑64, <13 % under 29) would be partially corrected.  The experts conclude that the right age of 16 is cognitively sufficient for political decisions, citing UNICEF evidence and examples from Germany, Brazil, Austria, Argentina, Belgium, Scotland, Wales and Malta.  They stress that the debate should focus on civic participation rather than maturity.  \"el derecho a voto no tiene que ver con nuestras capacidades sino con el ejercicio pleno de la ciudadanía,\" says Martínez.  \"El derecho a voto no debería moverse por tanto en términos de madurez intelectual sino de invitación a la participación cívica,\" adds Silvestre.\nOriginal language: es\nPublish date: August 23, 2025 10:01 PM\nSource:[El Diario Vasco](https://www.diariovasco.com/politica/voto-jovenes-decanta-bildu-vox-20250824131023-nt.html)\n\n**The Lost Generation of Democracy: Spain's Rise of the Far-Right**\nSpain is joining the list of countries where young people are fueling the rise of the far-right and authoritarian ultraderecha. A decade ago, one in three young people expressed their intention to vote for the left, while only one in four thought they would vote for the right. However, in recent surveys, the correlation has been reversed: four in ten young people between 18 and 24 years old support the right (and two-thirds of them support the ultraderecha), while only two in ten choose left-wing options. This age group now accounts for over three million voters out of a total of 37 million. The most significant aspect of this ideological shift is the rapid and unprecedented growth of the ultraderecha among young people. In the CIS survey of May, the conservative space was divided equally between the Partido Popular (20%) and the ultraderecha of Vox and Alvise (22%) among those under 24. A similar correlation occurred in the 25-34 age group (a contingent that accounts for another five million voters). However, this pattern is maintained, intensified, in the CIS survey of July: the ultraderecha has a 13-point lead over the PP in the 18-24 age group, and more than six points in the next age group (25-34 years). The mutation of the ideological youth in Spain has no precedents. With the country just out of the dictatorship, young people leaned clearly to the left (and their location on the ideological scale reflected this, as they now sit one point to the right). Even in the early 90s, the percentage of young people under 35 who supported the PSOE or more left-wing forces doubled or even tripled the rate of adhesions to the right. The data from last May provides clues about the causes of this change. If the declared voting intention is segregated by sex, the result is very eloquent: among men aged 18-24, Vox outperforms the PP by almost eleven points (and seven in the 25-34 age group). However, among young women, it is the Partido Popular that outperforms the ultras: by 12 points in the 18-24 age group, and seven in the 25-34 age group. In short, the ultraderechization of young men has something of an egoistic rebellion against the advance of gender parity. Nevertheless, Spain is not an exceptional case. Other Western countries are experiencing a sustained rise in extreme right-wing parties with the decisive support of new generations. The recent Polish presidential elections are a good example: the ultra-candidate clearly won among those under 40 (and with a greater advantage among men). And something similar occurred in the German legislative elections, although here the young people radicalized towards the two extremes (AfD, to the right, and Die Linke, to the left). Of course, there are exceptions. In the Canadian legislative elections, the Liberal Party (center-left) won over the Conservative Party (close to Trump) thanks to the vote of those under 35 (and especially women). In contrast, the age group between 35 and 54 leaned towards the conservatives. However, unlike what happens not only on the other side of the Atlantic, in the Spanish case, the low level of education still does not play decisively in favor of the ultraderecha, which is residual among those who barely went to school (46% of them vote for the PSOE). And although Vox is also marginal among the working class, it is starting to have presence among the poorest.\nOriginal language: es\nPublish date: July 13, 2025 04:04 AM\nSource:[LaVanguardia](https://www.lavanguardia.com/politica/20250713/10808553/generacion-perdida-democracia.html)\n\n**VOX's Quest for a Broad Appeal: Can the Party Win Over Older Voters?**\nVOX, a far-right party in Spain, is gaining popularity among young people, but it still needs to win over older voters to be a determining force in the next election. According to the author, VOX needs to pass the 40-deputy threshold to be significant. To achieve this, the party needs to refine its message, avoid being too confrontational, and present a more optimistic and attractive image. The author notes that a third of Spaniards between 18 and 24 years old are disenchanted with politics and plan to abstain from voting, while another third intend to support VOX. The party's leader, Santiago Abascal, has expressed pride in VOX's growth among young people, but the author argues that the party should also focus on winning over older voters, who make up a significant portion of the population. As Spain faces a demographic winter, with over a third of the population over 65, VOX needs to appeal to a broader range of voters to be a major player in the next election. 'It is ilusionante that te respalden en masa los chavales, pero viendo los datos y pensando en lo que se avecina, si yo fuera Abascal estaría a estas horas estrujando el cerebro para afinar el mensaje y lograr que los viejos también apoyen a VOX', the author writes, quoting themselves. 'It is essential that the party's message is not just appealing to young people, but also to older voters, who are a crucial part of the population', they add.\nOriginal language: es\nPublish date: July 09, 2025 01:00 PM\nSource:[Periodista digital](https://www.periodistadigital.com/politica/opinion/columnistas/20250709/alfonso-rojo-chavales-espanoles-pasan-regimen-sanchista-sintonizan-dia-vox-video-689405109902/)\n\n",
    "date": "2025-10-13T16:11:59.812935",
    "summary": "Experts are divided but tend slightly toward a greater-than-even probability that Vox will surpass the 27% threshold in youth (18-24) voting intention in Spain by the end of 2025, though significant uncertainties remain. The latest available 40dB poll puts Vox at 27%, marking a historic peak, and the European context shows similar rightward youth trends. Factors increasing the likelihood include Vox's effective digital strategy, social media virality, issue salience among youth (especially men), disillusionment with mainstream parties, and alignment with broader European far-right youth surges. Countervailing factors are high youth abstention, the volatility and small size of youth samples in polling, a significant gender divide (with young women less supportive), possible polling plateau or regression to the mean, and potential vote splitting from other far-right groups. Scenarios for a 'No' outcome emphasize plateauing or reverse momentum, statistical noise, or turnout dynamics, while 'Yes' outcomes focus on momentum continuity and potential external shocks favoring Vox. Probabilities given by forecasters cluster in two camps: a minority (35-40%) expect Vox will not surpass 27%, giving weight to structural ceilings and sampling error; a majority (58-63%) argue Vox has a modest but real chance to eke out a further increase. The median or consensus forecast is just above 50%, reflecting both uncertainty and the exceptional momentum Vox has built among Spanish youth.",
    "forecasters": [
        "Election Polling (Survey Methodology Standards)",
        "Election Polling (Sampling Error Analysis)",
        "Political Consulting (Voter Segmentation Strategies)",
        "Public Opinion Analysis (Trend Projection Techniques)",
        "Political Science (Party System Theory)",
        "Political Science (Vote Choice Models)",
        "Sociology (Youth Political Socialization)",
        "Sociology (Generational Theory)",
        "Iberian Studies (Contemporary Spanish Politics)"
    ]
}