{
    "deliberation_results": {
        "RealEstateAnalysis (ComparativeMarketAnalysis)": {
            "time_to_resolution": "About 2.5 months (until December 2025 data is published in early 2026, or potentially sooner if Idealista data is available earlier).",
            "perspective_relevance": "As a RealEstateAnalysis (ComparativeMarketAnalysis) expert, my approach involves integrating granular market supply-demand data, historical price cycles, the impact of regulatory and macroeconomic shifts, and buyer composition (domestic vs. foreign). I focus on the mechanisms underpinning price formation and the sustainability of rapid price increases, drawing analogies to past cycles and leveraging leading indicators such as transaction volumes and new construction pipeline.",
            "status_quo": "Madrid housing prices rose by about 20% in 2024. Leading forecasts and historical patterns suggest a continuation of upward momentum, but at a slower pace. The most cited bank and analyst forecasts for 2025 are in the 6%-10% range for Spain overall, with Madrid at the high end. Without additional shocks, a 10-14% increase for Madrid in 2025 is the central expectation.",
            "perspective_derived_factors": [
                {
                    "factor": "Supply Shortage",
                    "effect": "Strongly increases probability. The persistent and widening housing deficit in Madrid (and Spain generally) is driving a structural upward pressure on prices. The deficit is now over 700,000 units, and approvals are not keeping pace, especially in Madrid, where the shortage is most acute."
                },
                {
                    "factor": "Demand Drivers (Demographics, Foreign Buyers, Household Formation)",
                    "effect": "Increases probability. High net migration to Madrid, new household formation, and foreign investment (especially non-resident, high-paying buyers), all add sustained demand, supporting strong price growth."
                },
                {
                    "factor": "Affordability and Overvaluation",
                    "effect": "Decreases probability. Prices are now well above long-term equilibrium, with affordability ratios deteriorating. Signs of overvaluation (10%+ above 'fair value') historically tend to slow price increases as buyers are priced out, and policy pressure grows."
                },
                {
                    "factor": "Macro and Financial Conditions (Interest Rates, Lending, Economy)",
                    "effect": "Neutral to Slightly Positive. Mortgage activity is robust and financing conditions are favorable, but ECB is not expected to cut rates soon, and stagnating real wages limit how much further prices can rise before demand cracks."
                },
                {
                    "factor": "Government and Regulatory Actions",
                    "effect": "Decreases probability. The end of the Golden Visa and increased rent controls are targeted at cooling demand, especially at the luxury and investment end. While these have not yet cooled prices, they may dampen the most speculative segment."
                },
                {
                    "factor": "Base Rate / Historical Precedent",
                    "effect": "Decreases probability. Double-digit (18%+) annual price gains in a major city are rare for two consecutive years in developed markets. After a 20% jump in 2024, mean reversion and market fatigue usually set in, making another such jump unlikely without an extraordinary shock."
                }
            ],
            "no_scenario": "Price growth moderates as affordability becomes too stretched: domestic buyers are priced out, mortgage approvals plateau, and foreign/investor demand is partially cooled by regulatory changes (end of Golden Visa, rent controls). While supply remains tight, the market cannot sustain another year of near-20% nominal gains; price growth slows to 7-14% for 2025, in line with consensus forecasts and the historical tendency for price surges to self-limit.",
            "yes_scenario": "Supply constraints worsen unexpectedly (e.g., construction halts, planning bottlenecks), while foreign capital surges (perhaps due to instability in other markets or a collapse in the euro). Domestic demand remains resilient due to wage growth, and regulatory interventions prove ineffective or are reversed. Investor panic buying (FOMO) and speculation take hold, driving prices up another 18%+ in 2025, before a potential correction in future years.",
            "final_reasoning": "Madrid's housing market remains extremely tight, with acute shortages and strong demand, especially from foreign buyers. However, after a 20% price increase in 2024, and with new signs of overvaluation and affordability stress, a further >18% price surge in 2025 would be historically exceptional. Base rates for such consecutive jumps are very low. Consensus forecasts from banks and analysts (including Caixabank, Tinsa, and UBS) point to price increases in the 6%-10% range nationally, with Madrid at the upper end (potentially 12%-14%). While the supply-demand imbalance is severe, policy interventions, macro headwinds, and market fatigue act as brakes. Therefore, while a further double-digit increase is plausible, the specific threshold of >18% is a high bar and would likely require an additional positive shock or speculative mania. Given the balance of factors, the probability of Madrid prices rising more than 18% in 2025 is modest but non-negligible.",
            "final_probability": 18
        },
        "RealEstateAnalysis (HedonicPricingModel)": {
            "time_to_resolution": "Approximately 3 months (until early January 2026, given Idealista's December 2025 data publication schedule and fallback to November if delayed).",
            "perspective_relevance": "As an expert in Real Estate Analysis and the Hedonic Pricing Model, my analysis focuses on decomposing housing price movements into their structural drivers: supply constraints, demand shocks, demographic trends, financial conditions, and regulatory interventions. The hedonic model compels a granular, attribute-level focus—critical for understanding whether a historically high rate of price appreciation (>18%) is plausible given Madrid's evolving fundamentals, not just headline figures or sentiment.",
            "status_quo": "If nothing changed from the current trajectory, Madrid would see a strong price increase in 2025, but most mainstream forecasts (CaixaBank, Tinsa) expect a rise in the 7–10% range, well below the 18% threshold. In 2024, prices rose by 20%, an outlier driven by acute supply shortages and surging demand; however, the consensus is that such a pace is unsustainable. Therefore, the status quo outcome is a price increase below 18%.",
            "perspective_derived_factors": [
                {
                    "factor": "Supply Shortage and Housing Deficit",
                    "effect": "Increases probability. The structural deficit in Madrid is among the worst nationally (60,000+ homes), with new household formation vastly outpacing completions. Multiple sources attribute up to 39% of price pressure to this deficit. Unless a supply surge materializes (which is unlikely given construction lead times and regulatory bottlenecks), this offers unusually strong upward price pressure."
                },
                {
                    "factor": "Foreign and Investor Demand",
                    "effect": "Increases probability modestly. Madrid is attracting a growing share of both resident and non-resident foreign buyers—now 14–18% of sales—who pay a premium and are less sensitive to affordability constraints. This is further enhanced by Madrid's positioning as a 'safe haven' market as other European cities cool."
                },
                {
                    "factor": "Affordability and Demand Elasticity",
                    "effect": "Decreases probability. Price/income ratios are hitting historic highs. The collapse in youth home-buying, wage growth lagging prices, and rising mortgage burdens suggest mounting resistance from domestic buyers. The market may be 'overheating,' but demand elasticity imposes a ceiling unless external shocks drive further excess demand."
                },
                {
                    "factor": "Financial Conditions and Credit",
                    "effect": "Net neutral to slightly positive. ECB policy remains tight (no near-term rate cuts), but local mortgage lending is growing (14% YoY in April). However, the lack of a credit boom (as in 2005–08) reduces the risk of a 'blow-off' top in prices—yet there is a window for continued price inflation as long as rates stay stable."
                },
                {
                    "factor": "Regulatory Environment and Policy Response",
                    "effect": "Decreases probability. The end of the Golden Visa, tighter rental controls, and growing political pressure to address affordability may cool speculative and luxury segments. While these measures have so far not dented price momentum, the risk of further intervention grows as the social impact of unaffordability becomes acute."
                },
                {
                    "factor": "Base Rate and Momentum",
                    "effect": "Decreases probability. Historically, double-digit annual price growth above 15% in large, mature European markets is rare and rarely sustained for more than 1–2 years. Even in Madrid’s recent history, back-to-back >18% increases are exceptional. The base rate for such an outsized rise is low."
                },
                {
                    "factor": "Market Sentiment and Bubble Risk",
                    "effect": "Mixed: Increases tail risk, but not the central scenario. Bubble risk (as flagged by UBS) means the market could overshoot, but also raises the possibility of a sharp correction or at least a pause in Q4 2025 if sentiment turns or macro headwinds emerge."
                }
            ],
            "no_scenario": "Madrid housing prices rise strongly in 2025 (e.g., 7–14%), driven by persistent supply shortfalls and robust demand, but affordability constraints, regulatory headwinds, and a natural cooling from the extraordinary 2024 pace limit the increase to below 18%. This is consistent with most forecasts and the historical tendency for markets to mean-revert after unsustainable surges.",
            "yes_scenario": "Acute supply constraints persist or worsen, foreign/investor demand intensifies (perhaps due to further instability abroad or a rush to front-run expected regulation), and mortgage conditions remain benign. Despite affordability pressures, pent-up demand from high-income buyers and investors overwhelms local headwinds, driving nominal price growth above 18% for a second consecutive year. There is no significant policy shock or sentiment reversal before year-end.",
            "final_reasoning": "While Madrid faces an extraordinary supply deficit and is attracting outsized demand, especially from international buyers, the hedonic analysis and historical base rate strongly favor a moderation after 2024’s outlier surge. Most bank and portal forecasts cluster around 7–10% for 2025, with only the most bullish scenarios approaching (but not exceeding) 18%. Affordability is increasingly stretched, and macro/credit conditions, while supportive, are not as stimulative as in past bubbles. Regulatory risks are rising, and a growing social/political backlash is likely to cap further excesses. While a >18% rise is possible if all pro-cyclical factors align and no corrective event occurs, this is a high bar—especially given the natural tendency for housing markets to self-correct after outsized gains. The probability is materially higher than a typical year (perhaps 10–15%), but still well below 50%. I judge the probability at 22%, reflecting a moderate tail risk but emphasizing the weight of base rates, status quo inertia, and hedonic limits to price growth.",
            "final_probability": 22
        },
        "BankingAndFinance (RiskAssessmentStandards)": {
            "time_to_resolution": "Approximately 3 months (until December 2025 data is published and compared to December 2024 baseline).",
            "perspective_relevance": "As an expert in BankingAndFinance (RiskAssessmentStandards), I focus on macroprudential risk, financial stability, credit dynamics, and structural imbalances. This perspective emphasizes base rates (historical price growth), financial system resilience, credit expansion, and exogenous risks (policy, macro shocks) that may abruptly alter otherwise stable market dynamics. I also consider how regulatory and credit standards affect both the demand and supply sides of the housing market, and how these interact with demographic and investor trends.",
            "status_quo": "Madrid housing prices have exhibited strong momentum: 20% growth in 2024, and 14% YoY increase as of mid-to-late 2025. Most major forecasters (e.g., CaixaBank, Tinsa) expect 6-10% national price growth for 2025, with Madrid outperforming. If these trends persist, Madrid would likely see a high single-digit or low double-digit price increase, but >18% is an extremely high bar.",
            "perspective_derived_factors": [
                {
                    "factor": "Supply-Demand Imbalance",
                    "effect": "Increases probability. Severe housing deficit in Madrid (and Spain broadly) is well-documented, with demand strongly outpacing new supply and projections of 700,000 more homes needed. This structural imbalance is a key driver of outsized price increases."
                },
                {
                    "factor": "Foreign and Investor Demand",
                    "effect": "Increases probability. Foreign buyers—both residents and non-residents—now account for 14-18% of transactions, often paying higher prices, especially for luxury/central locations. Madrid is a prime target, intensifying upward pressure."
                },
                {
                    "factor": "Credit/Mortgage Conditions",
                    "effect": "Neutral to slightly increasing probability. Mortgage origination is up, with banks showing willingness to lend and interest rates relatively stable. However, high prices are beginning to erode broader affordability, which may cap further acceleration."
                },
                {
                    "factor": "Affordability Constraints and Macroprudential Risk",
                    "effect": "Decreases probability. Housing price growth is significantly outpacing wage growth, and affordability is stretched. This historically limits further price surges absent speculative excess or major credit expansion, and may prompt demand-side fatigue or regulatory tightening."
                },
                {
                    "factor": "Policy Interventions",
                    "effect": "Decreases probability. Madrid and the national government have implemented or are considering measures like ending the Golden Visa, tightening rental controls, and discussing more social housing. These could cool the market at the margin, especially for the luxury/investment segment."
                },
                {
                    "factor": "Base Rate of >18% Citywide Annual Price Growth",
                    "effect": "Decreases probability. Even in hot years, >18% is rare for large, mature urban housing markets; the 2024 figure (20%) is an outlier, and mean reversion is historically likely. Most current forecasts for 2025 are in the 6-10% range, with only the most bullish scenarios approaching 14%."
                },
                {
                    "factor": "Bubble Risk/Market Psychology",
                    "effect": "Slightly increases probability. Madrid is now in the 'moderate bubble risk' group (UBS index), and rapid price gains can sometimes be self-reinforcing in the short run, but bubble warnings also tend to attract caution among buyers, lenders, and policymakers."
                },
                {
                    "factor": "Macro/Exogenous Shocks (Interest Rates, Economic Growth, Geopolitics)",
                    "effect": "Decreases probability. ECB is not planning imminent rate cuts; consumer confidence and fiscal imbalances could worsen, and any negative shock could abruptly stall price momentum."
                }
            ],
            "no_scenario": "Madrid’s housing prices rise at a strong but more typical rate (e.g., 8-14%)—in line with the structural deficit and high demand but capped by affordability constraints, a degree of regulatory intervention, and a natural cooling after the extraordinary 2024 run-up. This outcome also reflects base rates for large global cities and the consensus forecast range.",
            "yes_scenario": "Momentum from the 2024 surge carries through, with continued rampant foreign/investor demand, no effective policy brakes, and supply remaining extremely tight—even as affordability erodes. Madrid’s market psychology tips into a mini-bubble, and prices rise over 18% citywide, perhaps concentrated in central districts but strong enough elsewhere to lift the average. No macro or credit shock intervenes in time to cool the surge.",
            "final_reasoning": "While the structural and demand-side factors (supply deficit, foreign investor appetite, demographic growth) are undeniably powerful, and Madrid has already posted a 14% YoY rise (per UBS and INE) as of Q2/Q3 2025, the hurdle of >18% citywide growth from an already high base is exceptionally steep. The historical base rate for such outsized annual increases in a large, mature European city is low, and most major forecasters (including CaixaBank, Tinsa, Idealista) expect 6-10% for Spain, with Madrid moderately outperforming but not doubling the national trend. Affordability and regulatory pressures are mounting, and policy interventions—though perhaps slow—could begin to bite. Macroprudential risk is rising, but not enough for the consensus to expect a further acceleration above the 2024 level. The status quo (double-digit growth, but not >18%) is favored by both base rates and current consensus. The risks are asymmetric: a sharp slowdown is more likely than a further acceleration. Therefore, the probability Madrid exceeds 18% nominal price growth in 2025 is low but non-trivial, given the extraordinary supply-demand imbalance and recent momentum. I estimate the probability at 12%.",
            "final_probability": 12
        },
        "UrbanPlanning (MunicipalHousingPolicyReview)": {
            "time_to_resolution": "Approximately 3 months (until data for December 2025 is published, likely in early January 2026)",
            "perspective_relevance": "As an expert in urban planning and municipal housing policy review, I bring a nuanced understanding of both supply-side and demand-side levers in housing markets. My expertise enables me to critically assess the impact of zoning, construction pipelines, migration, policy interventions, and international investment—factors central to price dynamics in a city like Madrid. I also understand the lag and inertia in municipal responses to housing crises, and the limitations of regulatory tools in the face of structural deficits.",
            "status_quo": "Madrid’s housing prices have experienced rapid growth, with a 20% increase in 2024 and 14% year-over-year as of Q2/Q3 2025. Market consensus and bank forecasts point to continued, but moderating, increases in the 6-10% range for 2025. The status quo outcome, if nothing changed, would be a price increase below the 18% threshold.",
            "perspective_derived_factors": [
                {
                    "factor": "Structural Supply Shortage",
                    "effect": "Increases probability. The chronic and worsening deficit in new housing construction, especially acute in Madrid, is the key driver of price increases. The supply shortfall is not being addressed at scale or pace, supporting rapid price growth."
                },
                {
                    "factor": "Strong Demographic and Foreign Demand",
                    "effect": "Increases probability. Madrid’s demographic growth—via both new household formation (especially one-person households) and net migration—along with robust international investor demand (even after the golden visa program ended), continues to push prices up."
                },
                {
                    "factor": "Affordability Constraints and Demand Elasticity",
                    "effect": "Decreases probability. Despite strong demand, affordability is eroding rapidly. Wage growth lags price growth, and there are signs that younger buyers are increasingly priced out. This can cap the rate of price appreciation, as seen in the slowdown of youth purchases and rising average buyer age."
                },
                {
                    "factor": "Policy and Regulatory Responses",
                    "effect": "Neutral to slightly decreases probability. Recent interventions (e.g., end of golden visa, rent controls) have not materially eased supply constraints or cooled demand, but further regulatory tightening could, in theory, slow speculative or foreign-driven price surges. However, no major new municipal supply initiatives have come online."
                },
                {
                    "factor": "Macroeconomic and Financial Conditions",
                    "effect": "Neutral to slightly increases probability. Mortgage conditions remain favorable relative to historic norms, and the ECB is not expected to cut rates soon. However, with inflation at 2.7–3% and no clear macroeconomic headwinds, financing is not a major constraint."
                },
                {
                    "factor": "Recent Price Momentum and Base Rate",
                    "effect": "Decreases probability. After an extraordinary 20% rise in 2024 and 14% YoY in 2025, base rates for double-digit increases in major European cities are rare and hard to sustain for two consecutive years, especially from a high base. Most expert/analyst projections for 2025 are in the 5–10% range."
                }
            ],
            "no_scenario": "Despite tight supply and strong demand, affordability reaches a tipping point: wages do not keep pace, mortgage costs bite, and buyer/investor demand softens. Price growth slows as more buyers are priced out or turn to rentals, policy tweaks (e.g., rent controls or taxes) marginally cool investor appetite, and the 2025 increase ends up in the 7–15% range, consistent with major bank forecasts and historical base rates.",
            "yes_scenario": "Supply bottlenecks worsen due to administrative delays, construction costs, or land shortages, while demographic and investor demand (including a new wave of international capital seeking inflation hedges) intensifies. Regulatory interventions fail to have any cooling effect. A late-year surge—perhaps driven by a macro or policy shock (e.g., sudden ECB rate cut or capital flight from other markets)—pushes prices up more than 18% as measured by Idealista in December 2025.",
            "final_reasoning": "While Madrid’s housing market is extremely tight and price pressures remain strong, the base rate for >18% annual nominal price increases in a developed European capital is very low—especially following an already exceptional 20% rise in 2024. All major bank and research projections (including CaixaBank, Tinsa, and consensus economic forecasts) expect the pace to moderate, with 2025 price growth in the 6–10% range for Spain and slightly higher for Madrid, but not close to another 18%. Urban planning constraints and policy inertia favor continued price appreciation, but affordability ceilings and recent momentum suggest that the market is unlikely to sustain such extreme growth two years in a row. The risk of a bubble and moderate overvaluation is real, and a >18% outcome cannot be ruled out if supply collapses further or if there is a speculative surge. However, given the base rate, expert forecasts, and early data for 2025, the status quo outcome remains a high single- or low double-digit increase (not >18%).",
            "final_probability": 12
        },
        "Economics (SupplyAndDemandTheory)": {
            "time_to_resolution": "Approximately 3 months until December 2025 data becomes available and the question resolves.",
            "perspective_relevance": "As an economist specializing in Supply and Demand Theory, my analysis gives primacy to the fundamental drivers of price: shifts in demand, supply constraints, and the elasticity of both. This lens is uniquely suited to interpret the current situation in Madrid's housing market, where acute supply shortages and strong demand are repeatedly cited as the core factors driving recent price surges.",
            "status_quo": "If current trends persist, Madrid's housing prices will likely continue rising, but at a more moderate rate than the extraordinary 20% increase seen in 2024. The consensus forecast from major banks and analysts for 2025 is a 6-10% increase, with some outlier projections up to 14%.",
            "perspective_derived_factors": [
                {
                    "factor": "Acute Supply Shortage",
                    "effect": "Increases probability. The recurring theme across all major reports is that Madrid suffers a structural housing deficit, with new construction lagging far behind household formation. CaixaBank estimates a deficit of over 60,000 homes in Madrid alone, and supply has fallen 39% since 2019. This persistent shortage is a powerful upward force on prices."
                },
                {
                    "factor": "Sustained and International Demand",
                    "effect": "Increases probability. Demand is buoyed by both national household formation (due to demographic and migratory trends) and strong foreign investor interest—foreigners now account for 18% of sales in Spain, often paying higher prices. Madrid is positioned as a global real estate hotspot."
                },
                {
                    "factor": "Affordability and Overvaluation Constraints",
                    "effect": "Decreases probability. Despite upward pressure, affordability is reaching limits: prices are now at or above 2008 bubble peaks in nominal terms, and overvaluation is estimated at 8-10%. Wage growth lags far behind price increases, and first-time buyers (especially youth) are increasingly priced out, which may cap further explosive growth."
                },
                {
                    "factor": "Macroeconomic and Monetary Policy",
                    "effect": "Neutral to mildly decreasing probability. ECB policy rates remain high, with no imminent cuts, keeping mortgage costs elevated. However, the Spanish labor market is stable and financing conditions are still considered relatively benign by analysts, so a sharp negative effect is not currently expected."
                },
                {
                    "factor": "Government/Regulatory Response",
                    "effect": "Mildly decreases probability. The Spanish government has tried to cool the market (ending the golden visa, tightening rent controls), but these are minor relative to the structural supply constraints. There is some risk that more aggressive policy interventions could slow price growth, but none announced so far appear sufficient to sharply reverse the trend."
                },
                {
                    "factor": "Base Rate/Mean Reversion",
                    "effect": "Decreases probability. Historically, double-digit annual price surges above 15% are rare and typically not sustained in consecutive years in developed urban markets. After a 20% rise in 2024, a second year of >18% is statistically exceptional."
                }
            ],
            "no_scenario": "Despite continued tightness, the market cools: the 2024 surge triggers affordability ceilings, mortgage approvals plateau as the ECB maintains rates, and price growth decelerates to the 6-10% range projected by major banks and analysts. Government measures (rent controls, golden visa removal) marginally reduce demand at the high end, and speculative/investment buyers pause amid bubble risk warnings. Prices rise, but by less than 18%.",
            "yes_scenario": "Supply remains extremely constrained, and demand (especially from foreign investors and affluent buyers) accelerates further, possibly in response to macroeconomic uncertainty or global 'safe haven' seeking. Construction lags even further, and price momentum from 2024 persists as buyers anticipate further appreciation. Market psychology tips into FOMO (fear of missing out), and price growth remains at or above 18% for a second consecutive year, perhaps peaking at 20%+ as in 2024.",
            "final_reasoning": "While the fundamentals of supply and demand point to continued upward pressure on Madrid's housing prices, the probability of a >18% nominal price increase in 2025 is relatively low. This is because: (1) base rates for such extreme consecutive yearly increases are very rare in developed city housing markets; (2) consensus forecasts from banks and research institutes (CaixaBank, Tinsa, UBS, etc.) for 2025 are mostly in the 6-10% range, with the most bullish at 14%; (3) affordability constraints are biting, with local incomes far outpaced and the median buyer age rising; (4) macroeconomic policy is not easing further, and ECB rates remain a drag; and (5) while supply shortage and foreign demand offer strong support, they are unlikely to create a second consecutive price explosion unless a new exogenous shock (e.g., global capital flight, policy error) occurs. The balance of evidence suggests strong growth, but not a repeat of 2024’s exceptional surge. I therefore assign a low, but non-negligible, probability to a >18% rise:",
            "final_probability": 10
        },
        "Economics (RealEstateMarketCycleTheory)": {
            "time_to_resolution": "Approximately 3 months (until December 2025 data is available, likely published in January 2026).",
            "perspective_relevance": "As an expert in Real Estate Market Cycle Theory, I am uniquely positioned to assess the sustainability of rapid price growth, the transition phases of property cycles, and the impact of structural imbalances (such as supply-demand mismatches, affordability, and speculative pressures) on short-term price trajectories. This perspective is essential here, as Madrid is showing strong expansion but also signs of overvaluation and possible bubble risk.",
            "status_quo": "If current trends continue and nothing disrupts the trajectory, Madrid housing prices would rise by approximately 10–12% in 2025, consistent with expert and bank projections, but below the 18% threshold required for a 'Yes' resolution.",
            "perspective_derived_factors": [
                {
                    "factor": "Supply-Demand Imbalance",
                    "effect": "Increases probability. Multiple sources confirm a severe, worsening housing deficit in Madrid and Spain overall, with supply unable to keep up with robust demographic and household formation trends. This is a classic late-expansion driver of price acceleration."
                },
                {
                    "factor": "Momentum and International Capital Flows",
                    "effect": "Increases probability. Foreign investor demand, especially non-resident buyers, is at record highs and pushing up prices, particularly in luxury and prime segments. However, the end of the Golden Visa may slightly moderate the luxury segment."
                },
                {
                    "factor": "Financing Conditions and Interest Rates",
                    "effect": "Moderately increases probability. While the ECB is holding rates steady for now, financing conditions have improved, and mortgage activity is robust. However, there is little expectation of major rate cuts before year-end, so explosive credit-driven price gains are less likely."
                },
                {
                    "factor": "Affordability Constraints and Demand Exhaustion",
                    "effect": "Decreases probability. Housing affordability is deteriorating rapidly, with wage growth lagging far behind price increases. Youth home purchases have collapsed, and the median buyer age has risen sharply. This suggests the pool of buyers able to absorb further double-digit price increases is shrinking."
                },
                {
                    "factor": "Overvaluation and Bubble Risk",
                    "effect": "Neutral to slightly decreases probability. While Madrid shows signs of moderate overvaluation and 'bubble risk,' most analysts and banks stress the absence of credit excess or speculative leverage characteristic of pre-crash phases. Still, overvaluation can trigger a cooling of appreciation rates."
                },
                {
                    "factor": "Mean Reversion and Base Rate",
                    "effect": "Significantly decreases probability. Historically, years with >18% price increases in mature European capitals are exceedingly rare outside of extraordinary events or the very early expansion phase. With 2024 already recording 20%, the base rate for a consecutive >18% year is extremely low, especially as most forecasts peg 2025 at 6–12%."
                },
                {
                    "factor": "Recent Price Trajectory",
                    "effect": "Slightly increases probability. The Q2 2025 y/y figure for Spain overall was 12.7%, with Madrid trending above the national average. However, most forecasts and recent monthly data suggest some deceleration compared to the 2024 run-up."
                }
            ],
            "no_scenario": "Despite continued tight supply and healthy demand, housing price growth in Madrid decelerates through Q4 2025 as affordability constraints bite, mortgage rates remain stable, and the pool of buyers able to pay higher prices dwindles. Price appreciation remains robust (e.g., 10–15%), but falls short of the 18% threshold, in line with bank and analyst forecasts.",
            "yes_scenario": "Supply shortages and foreign demand intensify even further in late 2025, perhaps due to a new wave of international capital flight or a policy change (e.g., sudden rate cuts or regulatory rollbacks). Local speculation and panic buying emerge amid public fear of being priced out, driving a late-year surge. Prices accelerate sharply in Q4, pushing the annual increase over 18%.",
            "final_reasoning": "While Madrid’s housing market remains in a strong expansion phase, and several factors (supply shortage, international capital, robust demand) are pushing prices upward, the preponderance of high-quality forecasts (CaixaBank, Tinsa, UBS, market analysts) converge on 2025 price growth rates in the 6–12% range, possibly up to 14% in the most bullish scenarios. Affordability constraints, a rising median buyer age, and the exhaustion of domestic demand suggest that further acceleration to 18%+ is unlikely absent a major exogenous shock. Historically, back-to-back years of near-20% price appreciation in mature European cities are extremely rare and usually precede a sharp correction, which is not currently forecast. The structural factors that drove the 2024 surge remain, but the market is showing some signs of cooling and overvaluation. Therefore, while a 'Yes' outcome is possible in a tail-risk scenario, the most likely outcome is a robust but sub-18% increase.",
            "final_probability": 12
        },
        "Economics (MonetaryPolicyTransmission)": {
            "time_to_resolution": "Approximately 3 months (question resolves with December 2025 price data, and it is now mid-October 2025)",
            "perspective_relevance": "As an expert in Economics, specifically in Monetary Policy Transmission, I bring a deep understanding of how monetary conditions, credit availability, and policy rates transmit through financial markets to real estate prices. My expertise allows me to assess the impact of mortgage rates, household credit conditions, and macroeconomic policy on housing demand and affordability, especially in a market like Madrid where supply constraints, credit dynamics, and international demand are crucial.",
            "status_quo": "If nothing changes, Madrid housing prices will rise at a robust but decelerating pace, likely below the 2024 rate (20%), with consensus forecasts for Spain and Madrid around 6–10% for 2025. The base rate for >18% annual nominal price increases in major developed cities is low, though Madrid’s recent performance is exceptional.",
            "perspective_derived_factors": [
                {
                    "factor": "Supply Shortage and Construction Deficit",
                    "effect": "Increases probability, as structural undersupply (765,000-unit deficit nationally, acute in Madrid) strongly supports further price rises."
                },
                {
                    "factor": "Foreign and Investment Demand",
                    "effect": "Increases probability, as non-resident buyers and international capital are driving prices in Madrid more than the national average."
                },
                {
                    "factor": "Monetary Policy and Credit Conditions",
                    "effect": "Neutral to slightly negative. While ECB rates remain high, there is no imminent cut; financing conditions have stabilized but are not easing much further in the short term, capping additional demand from domestic buyers."
                },
                {
                    "factor": "Affordability Constraints and Demand Exhaustion",
                    "effect": "Decreases probability, as extreme price increases are unsustainable given wage stagnation and collapsing home purchases among the young, indicating demand destruction at the margin."
                },
                {
                    "factor": "Policy Intervention and Regulatory Risk",
                    "effect": "Decreases probability, as the removal of the Golden Visa, tighter rental controls, and public debate raise downside tail risks, though so far policy has not curbed price growth."
                },
                {
                    "factor": "Recent Price Momentum and Bubble Dynamics",
                    "effect": "Increases probability, as recent 14%+ y/y increases and momentum trading can fuel overshoots, but bubble risk is rising and may soon curb further acceleration."
                },
                {
                    "factor": "Macro Backdrop and Confidence",
                    "effect": "Neutral to slightly negative. Spain’s growth is solid but slowing; inflation is above the eurozone average, but the labor market is stable. However, public deficit and a fragile European backdrop could dent confidence."
                },
                {
                    "factor": "Consensus/Expert Forecasts and Base Rates",
                    "effect": "Strongly decreases probability, as most forecasts (CaixaBank, Tinsa, consensus) expect 6–10% for 2025, and >18% increases in consecutive years are historically rare even in hot markets."
                }
            ],
            "no_scenario": "Price growth slows from the 2024 peak (20%) as affordability caps are reached, demand is partially exhausted (especially among domestic buyers), and regulatory changes begin to bite. Despite ongoing undersupply, prices rise 8–12% in 2025, in line with consensus, but do not surpass the 18% threshold.",
            "yes_scenario": "Momentum from 2024’s 20% increase carries through into 2025, driven by continued supply constraints, a further surge in foreign/investment demand, and a late-year drop in ECB rates or mortgage costs. Prices overshoot consensus, climbing above 18% despite affordability concerns, with luxury and central Madrid leading the gains.",
            "final_reasoning": "Despite record price momentum in Madrid (14% y/y recently) and severe supply shortages, the base rate for two consecutive years above 18% is low. Most structural factors (supply deficit, foreign demand) still support strong price growth. However, affordability is at a breaking point—youth purchases have collapsed, and rents and sale prices are outpacing incomes. Major banks and research houses project a deceleration to 6–10% for 2025, and while price momentum has surprised to the upside, there is little evidence of a further acceleration beyond the 2024 high. Macro policy is steady, not stimulative, and while downside risks from regulation exist, they have not yet bitten. The risk of a bubble or sharp correction is rising, but not imminent. The status quo and expert consensus heavily weigh against a >18% outcome, though a non-trivial probability remains given recent outperformance and extreme supply constraints. I estimate a 15% chance of prices exceeding 18% in 2025—a bold but not extreme position, reflecting the strong upward pressures but also the rarity of such outsized gains in back-to-back years.",
            "final_probability": 15
        },
        "Urban Studies (UrbanGrowthTheory)": {
            "time_to_resolution": "2 months and ~3 weeks (until December 2025 data is published, likely by early January 2026)",
            "perspective_relevance": "As an expert in Urban Studies (UrbanGrowthTheory), my perspective centers on the interplay of supply-demand dynamics, demographic trends, financial factors, and regulatory regimes in rapidly growing urban centers. UrbanGrowthTheory highlights how persistent supply constraints amid strong demand, especially in global cities, lead to sustained or even accelerating housing price increases, but also how market cycles, affordability ceilings, and policy interventions can moderate or reverse these trends.",
            "status_quo": "If nothing changes, housing prices in Madrid are likely to continue rising, but at a rate below the 20% seen in 2024. Most sector forecasts for Spain and Madrid specifically predict 6-10% annual growth for 2025, with some outlier estimates up to 12-14%. The base rate for >18% annual increases, even in hot markets, is very low historically.",
            "perspective_derived_factors": [
                {
                    "factor": "Severe and Worsening Supply Shortage",
                    "effect": "Increases probability. The persistent and growing housing deficit (up to 765,000 units nationally, with Madrid among the most affected) is a structural driver of above-trend price growth, especially in the absence of a construction surge."
                },
                {
                    "factor": "Strong Demand (Demographic Growth, Foreign Buyers, Household Formation)",
                    "effect": "Increases probability. High rates of new household formation, migration, and robust foreign investor interest (14-18% of purchases in Madrid) create sustained upward pressure on prices."
                },
                {
                    "factor": "Affordability and Demand Elasticity",
                    "effect": "Decreases probability. Rapid price increases have outstripped wage growth, with affordability ratios worsening and youth homebuying collapsing. Rising prices eventually price out buyers, slowing transaction volumes and dampening further increases."
                },
                {
                    "factor": "Macro-Financial Conditions (Mortgages, Interest Rates, ECB Policy)",
                    "effect": "Neutral to slightly increases probability. Financing conditions have improved, but the ECB is not expected to cut rates sharply in the short term. Mortgage activity is robust, but not frothy. This supports ongoing but not explosive price growth."
                },
                {
                    "factor": "Recent Price Momentum and Base Rate",
                    "effect": "Decreases probability. While Madrid saw a 14% YoY rise (and 20% in 2024), the historical base rate for >18% annual increases is rare, especially after a 'hot' year. Regression to the mean is likely, with forecasts clustering around 6-10% for 2025."
                },
                {
                    "factor": "Policy and Regulatory Environment",
                    "effect": "Neutral to slightly decreases probability. Efforts to cool the market (ending golden visas, rent controls) have had little immediate effect, but further interventions or macroprudential tightening could temper price growth."
                },
                {
                    "factor": "Bubble/Overvaluation Risk",
                    "effect": "Neutral. Madrid is now considered at moderate bubble risk, but analysts agree this is due to supply shortages, not speculative excess. No imminent crash is forecast, but the risk of a sharp correction tempers runaway price expectations."
                }
            ],
            "no_scenario": "Despite strong supply constraints and demand, affordability ceilings bite: buyers are priced out, transaction volumes slow, and price growth cools to 10-14%. Macro conditions (income growth, consumer sentiment, interest rates) do not support another year of >18% nominal increases. Policy interventions or investor caution (due to 'bubble' risk) further moderate the market. December 2025 data shows a 10-14% year-on-year rise.",
            "yes_scenario": "Supply crisis intensifies with new construction lagging even further behind, while demand (especially from foreign buyers and new households) remains red-hot. Mortgage conditions remain favorable, no major policy cooling effects materialize, and Madrid's 'superstar city' status draws global capital. Market psychology turns euphoric, with investors speculating on further gains. Prices rise another 18-22% year-on-year in a self-reinforcing surge.",
            "final_reasoning": "UrbanGrowthTheory and recent data highlight that while Madrid is experiencing severe supply shortages and strong demand, especially from foreign investors, the market is also showing increasing affordability stress, with household incomes lagging price growth and youth homebuying collapsing. While 2024 saw an exceptional 20% price rise, the historical base rate for consecutive years of >18% increases in established European capitals is extremely low. Consensus sector forecasts for Madrid in 2025 cluster in the 6-12% range, with even bullish institutional projections capping at 10-14%. The structural deficit, migration, and investment flows could keep prices at double-digit growth, but the likelihood of back-to-back years above 18% is sharply limited by affordability ceilings and some evidence of demand-side strain. The risk of a bubble is rising, but the context is still supply-driven, not speculative excess. I therefore judge the probability of >18% annual growth in 2025 as meaningfully above zero but still low, best estimated at 10%.",
            "final_probability": 10
        },
        "Urban Studies (LandUseEconomics)": {
            "time_to_resolution": "about 2.5 months (until December 2025 data is published and compared to December 2024)",
            "perspective_relevance": "As an expert in Urban Studies (LandUseEconomics), I focus on the interplay between housing supply, regulatory constraints, demographic trends, economic dynamics, and investment flows. Madrid's market displays acute supply-demand imbalances, regulatory inertia, and international capital flows—all of which are central to land use economics. My expertise allows me to distinguish between cyclical and structural drivers, assess bubble risk, and integrate base rates from comparable global cities.",
            "status_quo": "If nothing changed, Madrid’s housing prices would continue to rise robustly but not at the extraordinary 20% rate recorded in 2024. Most major forecasts (CaixaBank, Tinsa, sectoral analyses) anticipate 6-10% annual growth for 2025, with few projecting >18% increases.",
            "perspective_derived_factors": [
                {
                    "factor": "Persistent Structural Housing Deficit",
                    "effect": "Increases probability. The accumulated deficit of 700,000+ homes, especially pronounced in Madrid, creates sustained upward pressure on prices, as documented in multiple reports attributing up to 39% of price growth to this shortage."
                },
                {
                    "factor": "Strong Demand (Domestic and International)",
                    "effect": "Increases probability. High rates of household formation, migration, and especially foreign (non-resident) demand have all intensified, with international buyers accounting for a growing share and pushing up average transaction values."
                },
                {
                    "factor": "Limited New Construction and Regulatory Constraints",
                    "effect": "Increases probability. Urban planning delays, lack of buildable land, and slow permitting continue to restrict supply, particularly in Madrid’s high-demand districts."
                },
                {
                    "factor": "Macroeconomic and Credit Conditions",
                    "effect": "Slightly increases probability. Lower interest rates and robust mortgage lending support demand, but the ECB is not expected to ease aggressively, and affordability issues are growing."
                },
                {
                    "factor": "Affordability Ceilings and Demand Elasticity",
                    "effect": "Decreases probability. Wage growth lags behind price growth, pushing more buyers out of the market, especially younger and lower-income groups, which could cap further price escalation."
                },
                {
                    "factor": "Policy Interventions and Bubble Risk",
                    "effect": "Decreases probability. Recent elimination of the Golden Visa and tightening rental regulations could modestly cool the luxury and rental segments. Rising bubble concerns may also dampen speculative activity."
                },
                {
                    "factor": "Recent Price Momentum and Base Rates",
                    "effect": "Decreases probability. While 2024 saw a 20% rise, such surges are historically rare and typically revert; base rate for >18% annual increases in developed cities is low. Major forecasters now expect a deceleration."
                }
            ],
            "no_scenario": "Despite ongoing supply shortages, the market’s momentum cools as affordability barriers increasingly exclude potential buyers, especially locals. New construction—though insufficient—edges up slightly, foreign demand plateaus post-Golden Visa, and recent price surges prompt caution among investors. As a result, price growth decelerates to 8-12% (in line with most forecasts), well below the 18% threshold.",
            "yes_scenario": "Supply collapses further due to regulatory or construction bottlenecks, while foreign capital flows (especially from risk-averse or inflation-hedging investors) intensify. Domestic demand remains resilient despite affordability challenges, perhaps buoyed by improved credit or wage growth. Regulatory interventions fail to curb demand or speculation, and year-end data shows another double-digit surge—topping 18%.",
            "final_reasoning": "Madrid’s housing market is extremely tight, with chronic supply shortages, robust domestic and foreign demand, and price momentum that has outpaced most other European cities. However, almost all sectoral and institutional forecasts (CaixaBank, Tinsa, UBS) now anticipate a deceleration from the extraordinary 20% 2024 rise, expecting 6-10% in 2025. While supply remains far below demand, affordability ceilings are increasingly binding, and there are early but notable policy efforts to cool the market. The base rate for consecutive >18% annual increases in developed cities is extremely low, and the 2024 spike appears unsustainable. My land use economics perspective highlights that while the fundamentals remain bullish, the combination of high prices, lagging wage growth, and some regulatory cooling measures make another >18% jump unlikely—but not impossible. The risk of bubble dynamics or a late-year surge keeps the possibility alive, but the weight of evidence suggests a strong deceleration. I therefore assign a probability of 15%.",
            "final_probability": 15
        },
        "RegionalStudiesIberia (SouthernEuropeanHousingModel)": {
            "time_to_resolution": "About 3 months (until December 2025 data is published, likely in January 2026)",
            "perspective_relevance": "As an expert in RegionalStudiesIberia with a focus on the Southern European Housing Model, I bring a deep understanding of the persistent structural features of the Spanish housing market, including chronic supply shortages, high home-ownership rates, the role of foreign demand, slow policy response, and the unique interplay of economic, demographic, and regulatory factors in Madrid compared to broader Spain. I am equipped to contextualize current data within decades-long housing and policy trends in Madrid and Spain.",
            "status_quo": "If current trends persist, Madrid’s housing prices will continue to rise but are unlikely to repeat the explosive 20%+ growth of 2024. Most institutional forecasts (CaixaBank, Tinsa, etc.) for 2025 point to a 6-10% increase in Spain, with Madrid expected to be at the upper end, but not above 18%. The status quo outcome is a rise, but not >18%.",
            "perspective_derived_factors": [
                {
                    "factor": "Chronic Supply Shortage",
                    "effect": "Increases probability. Madrid faces an acute housing deficit, with new supply running far behind demand (39% drop in supply since 2019, 60,000+ homes shortfall). This creates structural upward pressure on prices."
                },
                {
                    "factor": "Strong Demand and Demographic Pressures",
                    "effect": "Increases probability. Robust household formation, migration (both international and domestic), and high levels of foreign investment (record 18% of sales) add to the pressure, especially in Madrid."
                },
                {
                    "factor": "Foreign Investment and 'Luxury' Market Pull",
                    "effect": "Increases probability. Madrid is now a global investment target due to relative affordability vs other European capitals, further stimulating price growth, especially in prime areas."
                },
                {
                    "factor": "Economic Context and Financing Conditions",
                    "effect": "Neutral to slightly increasing probability. The labor market is strong, interest rates are expected to remain stable (ECB not cutting soon), and mortgage activity is robust, but not at 2007 bubble levels. This supports demand but is less explosive than in 2024."
                },
                {
                    "factor": "Affordability Crisis and Policy Response",
                    "effect": "Decreases probability. Affordability is at crisis levels; demand from residents (especially young buyers) is collapsing, and government has ended the Golden Visa and attempted rent controls. These measures, though not fully effective, may start to cool the extreme price growth."
                },
                {
                    "factor": "Base Rate/Mean Reversion",
                    "effect": "Strongly decreases probability. In the last decade, double-digit annual increases above 18% are rare even in Madrid; the 20% rise in 2024 is exceptional. Regression to the mean is expected; most credible forecasts for 2025 cluster at 6–12% for Madrid."
                },
                {
                    "factor": "Bubble Risk and Investor Caution",
                    "effect": "Decreases probability. UBS and others now flag Madrid as a moderate bubble risk, which could dampen speculative demand and trigger more cautious lending and buying behaviors."
                },
                {
                    "factor": "Tourism and Rental Market Shifts",
                    "effect": "Neutral/slightly increasing. While tourism demand is flattening, pressure on rental markets persists, but this is less directly tied to sale prices in the short term."
                }
            ],
            "no_scenario": "Madrid’s housing prices continue to rise, but at a moderated pace due to strained affordability, sluggish income growth, slight cooling from regulatory efforts, and the fading impact of the 2024 surge. Prices increase by 10–14%, in line with major forecasts, but do not surpass the 18% threshold. Foreign demand remains strong but is insufficient to offset declining local buying power and higher base prices. No major macroeconomic shock occurs, but the market exhibits more caution due to bubble risk warnings.",
            "yes_scenario": "Despite affordability constraints, supply remains so tight—and foreign and investment demand so insatiable—that price competition drives another year of explosive growth, exceeding 18%. Regulatory efforts fail to dent demand, and pent-up capital from global investors floods into Madrid, especially as other European cities stagnate. Mortgage lending remains very strong, and speculation by both domestic and foreign actors accelerates. No meaningful economic or policy headwinds materialize, allowing for a repeat of the 2024 surge.",
            "final_reasoning": "Madrid’s housing market is experiencing record demand, severe supply constraints, and robust foreign investment, all of which push prices higher. However, the 20%+ price increase in 2024 is an outlier, driven by exceptional post-pandemic dynamics, and nearly all credible sector forecasts (CaixaBank, Tinsa, Idealista) expect significant slowing in 2025, with estimates for Madrid’s increase ranging from 8% to 14%. Chronic affordability problems, government interventions (even if partially effective), and heightened bubble risk are likely to temper further acceleration. The structural factors pushing prices higher are powerful, but extreme, consecutive annual surges are historically rare in Spain’s major cities. The most probable scenario is that prices rise strongly, but not above 18%. Therefore, while the probability is not negligible given Madrid’s unique pressures, it remains well below even odds.",
            "final_probability": 18
        }
    },
    "deliberation_probability": [
        18,
        22,
        12,
        12,
        10,
        12,
        15,
        10,
        15,
        18
    ],
    "deliberation_mean_probability": 14.4,
    "deliberation_sd": 3.9496835316263,
    "deliberation_probability_result": 14,
    "group_results": {
        "realestateanalysisComparativemarketanalysis": {
            "forecaster_to_engage": "RealEstateAnalysis (HedonicPricingModel)",
            "response_type": "critique",
            "response": "You lean too heavily on the hedonic base rate and status quo inertia, while underplaying the compounding effect of Madrid’s extraordinary supply deficit and global capital flows. Sure, the historical pattern is for price growth to moderate after an outlier year, but the current structural imbalance is not your typical European cycle. Foreign buying power, persistent demographic influx, and the utter lack of new construction in Madrid are not just maintaining, but actively exacerbating, the disequilibrium. Your 22% probability is reasonable, but your reasoning underestimates the risk of a feedback loop: as rents soar and supply evaporates, even marginal demand shocks can push prices much further than models anticipate. This is not a normal market, and your hedonic comfort zone may be blinding you to the tail risk of another explosive year. The odds for >18% are still low, but not just because of mean reversion—Madrid’s unique structural context deserves more weight."
        },
        "realestateanalysisHedonicpricingmodel": {
            "forecaster_to_engage": "RealEstateAnalysis (ComparativeMarketAnalysis)",
            "response_type": "critique",
            "response": "Your analysis gives due credit to the severity of Madrid's supply-demand imbalance, but it falls into the classic trap of overestimating how much past outlier performance predicts future outlier performance. You acknowledge the historical rarity of consecutive >18% jumps, yet you hedge with vague allusions to 'positive shocks' or 'speculative mania' as if those are mere tail risks. In reality, hedonic constraints—affordability, income elasticity, and substitution effects—are already biting, and the price per square meter is at a level where even wealthy foreign demand cannot carry the entire market. You also underplay how much base rate and market fatigue matter: after a 20% rise, the next cohort of buyers is even less able to pay, and investors are increasingly skittish about regulatory and bubble risk. Your probability is a touch too conservative, but your reasoning still lets bullish bias creep in under the guise of 'modest but non-negligible'—when in fact, the bar for another >18% surge is even higher than you admit."
        },
        "bankingandfinanceRiskassessmentstandards": {
            "forecaster_to_engage": "Urban Studies (UrbanGrowthTheory)",
            "response_type": "defense",
            "response": "Urban Studies (UrbanGrowthTheory) nails what too many market bulls ignore: the iron law of affordability ceilings and demand exhaustion, even in the most dynamic cities. The argument that Madrid's unique supply crunch and foreign influx can indefinitely override these constraints is wishful thinking. The data on collapsed youth homebuying, surging median buyer age, and household incomes lagging far behind price gains demonstrate that the pool of solvent buyers isn't endless—especially after a 20% jump. Their focus on base rates and structural headwinds is spot-on: back-to-back years of >18% growth are not just rare, they're almost unprecedented in mature markets, and ignoring this is reckless. The bullish case always finds a 'new paradigm,' but UrbanGrowthTheory's skepticism is exactly what's needed to counter the hype and keep forecasts grounded in reality. Their low probability reflects both caution and a clear-eyed reading of the market's limits."
        },
        "urbanplanningMunicipalhousingpolicyreview": {
            "forecaster_to_engage": "Economics (MonetaryPolicyTransmission)",
            "response_type": "critique",
            "response": "You’re leaning too heavily on the idea that monetary policy is neutral and thus not a major driver, but you underplay the lagged effects of both rate stability and recent credit expansion, which have turbocharged demand even as affordability craters. Your argument acknowledges the severe supply crunch and hints at bubble risk, but then you retreat to consensus forecasts as if they’re gospel—when in fact, consensus has repeatedly underestimated Madrid’s momentum in the last two years. The ECB’s hands-off stance, combined with political reluctance to seriously intervene in the market, leaves the door wide open for continued outsized gains if investor sentiment stays bullish and construction bottlenecks persist. You say the risk of >18% is 'a tail event,' but your probability (15%) is timid given how much the old analytical frameworks have failed to capture the extraordinary nature of Madrid’s structural shortages. Tail risk is precisely what bites in these abnormal supply/demand regimes, and you’re not bold enough in weighting that possibility."
        },
        "economicsSupplyanddemandtheory": {
            "forecaster_to_engage": "RegionalStudiesIberia (SouthernEuropeanHousingModel)",
            "response_type": "defense",
            "response": "RegionalStudiesIberia (SouthernEuropeanHousingModel) gets it exactly right: Madrid's market is uniquely pressured by chronic underbuilding, intense foreign demand, and a persistent lack of policy action—yet the 20%+ price gain in 2024 is a genuine outlier, not a new baseline. The forecaster wisely centers their argument on the rarity of consecutive explosive jumps in Southern European capitals, emphasizing how even severe supply imbalances eventually run into the brick wall of affordability, buyer fatigue, and political risk. Their probability (18%) is bold enough to reflect the region's volatility, but not so high as to ignore the statistical and historical brakes on runaway appreciation. They resist the temptation to get caught up in market 'momentum' narratives and instead anchor their outlook in the cyclical, mean-reverting nature of even the hottest housing markets. In this contest, that's the right mix of realism and recognition of local peculiarities."
        },
        "economicsRealestatemarketcycletheory": {
            "forecaster_to_engage": "BankingAndFinance (RiskAssessmentStandards)",
            "response_type": "defense",
            "response": "BankingAndFinance (RiskAssessmentStandards) is refreshingly grounded compared to the often overheated rhetoric in this debate. The focus on base rates for major European cities is exactly what most market participants and even some analysts ignore in the face of short-run headlines and anecdotal supply horror stories. Their point about the exceptional difficulty of consecutive >18% annual price growth from an already elevated base is critical: it's not just rare, it's practically a warning sign for imminent correction, not continued acceleration. They also recognize that while the supply-demand imbalance is severe, affordability and regulatory signals are flashing red, not green. Their skepticism toward consensus-busting forecasts is justified—Madrid's market is tight, but not immune to gravity. The 12% probability reflects both the outlier risk and the overwhelming weight of historical precedent and economic fundamentals. This is the kind of sober, status-quo-anchored reasoning that wins forecasting competitions."
        },
        "economicsMonetarypolicytransmission": {
            "forecaster_to_engage": "Urban Studies (LandUseEconomics)",
            "response_type": "critique",
            "response": "You're giving far too much comfort to the argument that regulatory cooling and affordability ceilings are finally putting a lid on Madrid's price surge. Look at the on-the-ground evidence: supply is not just tight, it's actively shrinking, and the political will to truly dampen demand or unleash new housing is nowhere to be found. You mention policy efforts, but they're half-measures at best—removing the golden visa barely touches the broader capital inflows, and rent controls are scattershot, with little effect on for-sale prices. Meanwhile, foreign buyers and institutional investors are still flooding in, outbidding locals and pushing prices up even as domestic demand falters. The fact that you assign a 15% probability shows you sense the tail risk, but your reasoning underestimates how easily a few more quarters of tight supply and bullish sentiment could push Madrid right back to another >18% jump. You’re clinging too tightly to the textbook—markets in this kind of structural crisis don't decelerate on schedule."
        },
        "urbanStudiesUrbangrowththeory": {
            "forecaster_to_engage": "UrbanPlanning (MunicipalHousingPolicyReview)",
            "response_type": "defense",
            "response": "UrbanPlanning (MunicipalHousingPolicyReview) offers a refreshingly realistic assessment compared to the overconfident tail risks some others are peddling. Their emphasis on the extremely low base rate for consecutive >18% price jumps in developed capitals is exactly right—this isn’t some emerging-market boomtown, it’s a mature city with real-world constraints. They’re also correct that even severe supply shortages run into the wall of affordability and policy inertia. The argument that only a speculative frenzy or total supply collapse could push Madrid above 18% again is well-founded, and the recognition of persistent urban planning barriers aligns with both theory and the lived experience of Madrid’s housing market. Their probability is conservative, but appropriately so; they don’t get swept away by headline-grabbing news, and instead ground their forecast in long-run patterns and structural headwinds. This is the kind of disciplined, status-quo-centered reasoning that keeps forecasts honest."
        },
        "urbanStudiesLanduseeconomics": {
            "forecaster_to_engage": "Economics (RealEstateMarketCycleTheory)",
            "response_type": "critique",
            "response": "You're letting cyclical theory do too much heavy lifting and missing how Madrid's current land use bottlenecks and demographic churn break the usual market rhythm. It's not just a 'phase'—it's a structural choke point. Urban economics tells us that when supply is as inelastic as Madrid's, and demand is buoyed by global capital, price cycles can get stretched and distorted far beyond what standard models predict. You cite 'exhaustion of domestic demand' and 'affordability constraints' as if they're hard stops, but recent data shows international and investor demand is picking up the slack, and local buyers are getting muscled out without any real price relief. If you only look at cycles, you miss the unique urban structure and regulatory sclerosis driving Madrid's housing pain. Your 12% probability is too anchored in the past and not responsive enough to the unprecedented supply-demand disequilibrium. If you want to win this contest, get out of the cycle rut and look at the land use fundamentals."
        },
        "regionalstudiesiberiaSoutherneuropeanhousingmodel": {
            "forecaster_to_engage": "RealEstateAnalysis (HedonicPricingModel)",
            "response_type": "critique",
            "response": "You lean too heavily on the hedonic base rate and status quo inertia, while underplaying the compounding effect of Madrid’s extraordinary supply deficit and global capital flows. Sure, the historical pattern is for price growth to moderate after an outlier year, but the current structural imbalance is not your typical European cycle. Foreign buying power, persistent demographic influx, and the utter lack of new construction in Madrid are not just maintaining, but actively exacerbating, the disequilibrium. Your 22% probability is reasonable, but your reasoning underestimates the risk of a feedback loop: as rents soar and supply evaporates, even marginal demand shocks can push prices much further than models anticipate. This is not a normal market, and your hedonic comfort zone may be blinding you to the tail risk of another explosive year. The odds for >18% are still low, but not just because of mean reversion—Madrid’s unique structural context deserves more weight."
        }
    },
    "revision_results": {
        "RealEstateAnalysis (ComparativeMarketAnalysis)": {
            "my_phase1_final_probability": 18,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, especially the exchange with the HedonicPricingModel forecaster, my assessment of downside base rate constraints and mean reversion remains valid, but I am reminded that the current supply-demand imbalance in Madrid is truly exceptional and may carry more weight than typical European housing cycles. The broad consensus among other forecasters clusters between 10-22%, with several arguments highlighting the unprecedented nature of the supply crunch and the risk of positive feedback loops if demand shocks occur. However, no fundamentally new evidence or scenario has emerged to justify a major upward revision, and the rarity of consecutive >18% annual surges in mature markets still anchors my view. To reflect the possibility that I may have slightly underweighted the structural tail risk, I will make a modest upward revision.",
            "revised_probability": 20
        },
        "RealEstateAnalysis (HedonicPricingModel)": {
            "my_phase1_final_probability": 22,
            "reasoning_for_revised_probability": "Upon reviewing the group deliberation, especially the critique from ComparativeMarketAnalysis, I recognize that my initial reasoning may have slightly underweighted the possibility of runaway price dynamics in the presence of Madrid's extraordinary supply constraints and persistent foreign capital inflows. However, most peer forecasts cluster at or below my own probability, and the arguments for mean reversion, affordability ceilings, and base-rate inertia remain dominant. While the feedback loop risk is real, the burden of evidence still points to a sub-18% outcome being much more probable. Therefore, I will nudge my estimate upward to better reflect the potential for outlier dynamics, but only slightly, as the tail risk is still just that—a tail risk.",
            "revised_probability": 24
        },
        "BankingAndFinance (RiskAssessmentStandards)": {
            "my_phase1_final_probability": 12,
            "reasoning_for_revised_probability": "The group deliberation reinforced the logic behind a low probability for >18% price growth: multiple forecasters independently emphasized the rarity of consecutive outlier years, the binding constraints of affordability, and the weight of base rates, all of which I also highlighted. Critiques and defenses across specialties (hedonic modeling, urban theory, comparative market analysis) consistently found no compelling evidence or overlooked structural factor that would justify raising the probability. If anything, the uniformity of expert consensus—grounded in both historical market cycles and present affordability stress—argues for maintaining or even slightly lowering my estimate. However, my initial 12% already reflects both tail risk and the extreme imbalance unique to Madrid, so I see no justification for adjustment.",
            "revised_probability": 12
        },
        "UrbanPlanning (MunicipalHousingPolicyReview)": {
            "my_phase1_final_probability": 12,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, my initial assessment remains broadly supported: nearly all forecasters converge on the central scenario of continued strong, but not >18%, price growth, with base rates and affordability constraints strongly limiting the likelihood of a second consecutive year of explosive appreciation. However, several critiques (notably those calling out the inadequacy of standard models in the face of Madrid's extraordinary structural supply deficit and the risk of tail events in abnormal markets) have merit. The strong consensus among both urban economics and finance perspectives that double-digit growth is likely, but >18% is still a high bar, is compelling. Yet, the points raised about the possibility of tail risk—especially in a market where consensus has repeatedly been surprised by the magnitude of recent price increases—justify a slight upward revision. I now assign a slightly higher weight to the possibility that feedback loops in rents, investor behavior, and persistent supply paralysis could lead to a late-year surge beyond what standard projections expect. Therefore, I revise my probability modestly upward.",
            "revised_probability": 15
        },
        "Economics (SupplyAndDemandTheory)": {
            "my_phase1_final_probability": 10,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, my original position is further confirmed. The consensus among diverse domain experts is that the structural supply shortage and strong demand are powerful, but the base rate for back-to-back >18% price surges in a mature European city is extremely low. Other forecasters—particularly those using comparative, urban growth, and macro-financial perspectives—emphasize affordability ceilings, market fatigue, and the historical rarity of such extreme outcomes. Critiques of higher probabilities rightly point out that even in the face of Madrid's unique pressures, the statistical likelihood remains modest, and the extraordinary 2024 result is unlikely to repeat absent a major exogenous shock. No new evidence emerged in the discussion to suggest an upward revision is justified. If anything, the polemics reinforced the wisdom of weighting base rates and status quo inertia more heavily. I therefore maintain my original probability.",
            "revised_probability": 10
        },
        "Economics (RealEstateMarketCycleTheory)": {
            "my_phase1_final_probability": 12,
            "reasoning_for_revised_probability": "After reviewing group deliberation and other expert forecasts, my initial assessment is reinforced. The consensus among diverse experts—using comparative, hedonic, banking, and regional approaches—is that while Madrid’s supply-demand imbalance is extraordinary, the probability of back-to-back >18% annual price surges remains historically very low. All serious projections cluster strongly in the 10–14% range, and multiple participants highlighted the power of affordability limits, buyer fatigue, and mean reversion after a 20% year. Group discussion further exposed that even bullish cases fail to provide a plausible mechanism for such extreme acceleration in 2025. The most compelling arguments (and winning forecasting strategies) emphasize base rates, status quo inertia, and the extreme rarity of consecutive outlier years in developed city markets. No new, compelling argument emerged to justify raising my probability, and the slight possibility that I might have been too conservative is offset by the strong consensus around low double-digit probability. Therefore, I maintain my initial forecast.",
            "revised_probability": 12
        },
        "Economics (MonetaryPolicyTransmission)": {
            "my_phase1_final_probability": 15,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, my initial probability of 15% for Madrid housing prices rising more than 18% in 2025 remains appropriate, but I am nudged slightly upward by the critiques emphasizing how abnormal Madrid’s supply-demand imbalance has become. Several forecasters (notably ComparativeMarketAnalysis and LandUseEconomics) underscore the possibility that structural factors—especially the severe and worsening supply deficit, persistent global capital inflows, and persistent political inaction—could override historical base rates in the short term. Critiques of my own and others’ reasoning highlight that consensus forecasts have repeatedly underestimated real price momentum in Madrid, and that tail risks in disequilibrated markets deserve real weight. On the other hand, defenders of the status quo (especially BankingAndFinance and UrbanGrowthTheory) persuasively argue that affordability ceilings and mean reversion remain powerful brakes, and that back-to-back >18% jumps are historically anomalous. Balancing these, I believe the risk is still meaningfully above typical years, and deserving of a modest bump. I am revising my probability up to 18% to reflect a stronger tail risk than my initial estimate, yet still well below even odds.",
            "revised_probability": 18
        },
        "Urban Studies (UrbanGrowthTheory)": {
            "my_phase1_final_probability": 10,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, the overwhelming consensus from diverse expert perspectives—spanning real estate analysis, banking, economics, urban planning, and regional studies—is that the base rate for consecutive >18% annual price increases in a developed European capital like Madrid is exceedingly low. While a few acknowledge the tail risk posed by Madrid's extraordinary supply shortage and global capital flows, nearly all emphasize the hard affordability ceiling, rising buyer fatigue, and clear signals from institutional forecasts (Caixabank, Tinsa, UBS, etc.) that expect significant deceleration (6-12%). Critiques of more bullish or tail-risk-leaning arguments stress that even in abnormal markets, gravity reasserts itself after an outlier year. No compelling new evidence or argument has emerged to make >18% anything but a low-probability event. Therefore, I see no reason to revise my probability upward; if anything, the consensus supports my original low estimate.",
            "revised_probability": 10
        },
        "Urban Studies (LandUseEconomics)": {
            "my_phase1_final_probability": 15,
            "reasoning_for_revised_probability": "The group deliberation reinforced the consensus that, despite Madrid's extraordinary supply-demand imbalance and recent outlier price growth, the base rate for consecutive >18% annual increases in a developed city is extremely low. Multiple forecasters anchored their judgments on the rarity of such back-to-back surges, robustly defending the primacy of affordability ceilings, market fatigue, and the limits of international demand to fully offset domestic exclusion. Critiques highlighted that while tail risks from supply collapse and capital inflows remain, policy interventions—even if imperfect—and the psychological impact of last year's surge make another explosive year less likely. My own critique of RealEstateAnalysis (HedonicPricingModel) stands: Madrid's context is unique, but not immune to gravity. No decisive new evidence emerged to justify a major upward or downward revision. Therefore, my assessment remains that the probability of >18% price growth in Madrid in 2025 is low but not negligible.",
            "revised_probability": 15
        },
        "RegionalStudiesIberia (SouthernEuropeanHousingModel)": {
            "my_phase1_final_probability": 18,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, my original assessment is reinforced by the overwhelming consensus among forecasters with diverse methodologies: the structural supply deficit and intense foreign demand in Madrid create strong upward price pressure, but the base rate for consecutive years above 18% is still extremely low. The arguments in favor of a more aggressive tail risk are well-articulated (including my own critique of hedonic inertia), yet even the boldest counterpoints do not provide evidence of a new exogenous catalyst strong enough to overcome the affordability and policy headwinds. Most forecasts cluster between 10-15%, with only slight upward adjustments for the 'Madrid exceptionalism' tail scenario. Therefore, the most defensible stance is to maintain the original probability, as both base rates and current sector data do not support moving higher.",
            "revised_probability": 18
        }
    },
    "revision_probability": [
        20,
        24,
        12,
        15,
        10,
        12,
        18,
        10,
        15,
        18
    ],
    "revision_mean_probability": 15.4,
    "revision_sd": 4.5995168828427575,
    "revision_probability_result": 15,
    "question_details": {
        "id": 38828,
        "title": "Will housing prices in Madrid rise by more than 18% in 2025?",
        "created_at": "2025-08-31T05:08:24.133769Z",
        "open_time": "2025-09-24T17:57:06Z",
        "cp_reveal_time": "2025-09-24T19:27:06Z",
        "spot_scoring_time": "2025-09-24T19:27:06Z",
        "scheduled_resolve_time": "2025-12-31T22:59:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-09-24T19:27:06Z",
        "actual_close_time": "2025-09-24T19:27:06Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "This question is synced with an identical question on Metaculus. The original question opened on 2025-02-27 12:57:00 and can be found [here](https://www.metaculus.com/questions/35570). This question will resolve to the same value as the synced question. The original question's background info at this time is below. \n\nIn 2024, house prices in the city of Madrid rose by 20%, and the Madrid real estate market is expected to continue its upward trajectory in 2025. According to [ <u>Caixabank Research</u> ](https://www.caixabankresearch.com/en/sectoral-analysis/real-estate/spanish-real-estate-market-2024-2025-expansive-mode), the current state of the Spanish real estate market is generally characterized by strong demand and tight supply. [ <u>They forecast</u> ](https://www.caixabankresearch.com/en/sectoral-analysis/real-estate/new-forecasts-spanish-real-estate-sector-expansionary-cycle-takes) a 6%-7% increase for house prices in Spain.\n\n`{\"format\":\"metac_closes_in_period\",\"info\":{\"post_id\":35570,\"question_id\":35020}}`",
        "resolution_criteria": "The question will be answered as **Yes** if, according to the sales price data published on the [ <u>Idealista portal</u> ](https://www.idealista.com/sala-de-prensa/informes-precio-vivienda/venta/madrid-comunidad/madrid-provincia/madrid/), the average price of housing in the **city of Madrid** per square meter rises by more than 18% from December 2024 to December 2025. It will be answered as **No** if the increase is 18% or less, or if there is a decrease in prices.",
        "fine_print": "* At the time of writing this question, December 2024 prices are €4,952/m² according to the graph and table \"Historical variation in sales prices in Madrid\" in the resolution source. However, the increase will be calculated based on the December 2024 prices shown when the December 2025 data is published.\n * Nominal figures will be compared, without discounting the effect of inflation.\n\n • If Idealista has not published data for December 2025 by January 7, this question will be resolved based on the increase from November 2024 to November 2025. If this is not available, this question will be **cancelled**.",
        "post_id": 39451,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Spain’s Housing Crisis Worsens: 700,000 Homes Needed While Supply Falls**\nSpain’s housing crisis is worsening, with a projected need for 700,000 finished homes in 2025 to meet new household creation, while supply is falling. The Bank of Spain previously estimated a deficit of 400,000–450,000 homes between 2022 and 2024, but José Luis Escrivá now says 700,000 will be required: 'José Luis Escrivá señaló que en 2025 se necesitarían unas 700.000 viviendas terminadas para los nuevos hogares creados.' Caixabank’s study found a 515,000‑home deficit over 2021‑2024 based on net household creation of 970,000 versus 454,000 new‑construction permits; when finished houses and alternative uses are considered, the deficit rises to 765,000. Idealista reports that the supply of available homes has dropped 39 % since the second quarter of 2019, further tightening the market: 'Idealista alertan de que el número de viviendas que salen al mercado nacional no solo no aumenta al mismo ritmo de la demanda, sino que está disminuyendo.' INE data project that Spain will add almost 3.7 million households in the next 15 years, with one‑person households growing from 5.4 million to 7.7 million—a 41.86 % increase—meaning more dwellings will be needed. The article concludes that the only solution is to build more homes.\nOriginal language: es\nPublish date: September 24, 2025 04:35 AM\nSource:[Libertad Digital](https://www.libertaddigital.com/libremercado/2025-09-24/mier-se-agrava-la-crisis-de-vivienda-en-espana-se-necesitan-700-000-pero-la-oferta-se-hunde-7299101/)\n\n**El precio de la vivienda en España bajo Sánchez alcanza niveles no vistos desde 2008**\nIn the second quarter of 2025, Spain’s average free‑housing price climbed to 2,093.5 €/m², a 10.4 % year‑over‑year increase that leaves the market only 0.3 % below the peak of the 2008 bubble. Prices are rising across all autonomous communities, with San Sebastián at 6,071 €/m²—over 250 % above the national average—and Madrid and the Balearic Islands above 3,900 €/m². The surge outpaces wage growth, tightening access for young and low‑income households and pushing rents higher. Analysts argue the growth is driven by solid demand, cautious financing and a stable labour market, and not a repeat of the 2008 bubble. Structural tension from limited new housing and international interest could still pose over‑valuation risks in the most active areas. Projections forecast a 5–7 % price increase by the end of 2025, with continued pressure in major capitals and tourist zones, while other regions may see milder gains. The widening affordability gap underscores the need for new housing policies. 'El aumento del precio de la vivienda tiene un impacto social significativo, especialmente para jóvenes y familias con ingresos medios o bajos,' the article notes.\nOriginal language: es\nPublish date: September 24, 2025 01:24 AM\nSource:[Periodista digital](https://www.periodistadigital.com/economia/20250924/precio-vivienda-espana-sanchez-alcanza-niveles-vistos-2008-noticia-689405135698/)\n\n**Madrid Housing Price Surge Raises Risk of Real‑Estate Bubble**\nAccording to the UBS Global Real Estate Bubble Index 2025, Madrid has become \"'Madrid se ha consolidado como una de las capitales más dinámicas del panorama inmobiliario internacional.'\" The city recorded the highest real‑price growth among the 21 cities analysed, with a 14 % increase over the last year, compared with stagnation in much of Europe and North America. This surge pushed Madrid into the moderate‑risk bubble group, receiving a risk score of 0.80, up from a lower level a year earlier. UBS analysts note that the risk is even higher in cities such as Miami, Tokyo, Zurich, Los Angeles or Dubai, where Dubai has also seen the largest rise in risk since the previous edition. The price climb is attributed to strong foreign demand—positioning Madrid as an alternative to more mature markets like London, Paris or Vancouver—and to limited supply in central areas, which pressures prices even in less exclusive neighbourhoods. \"'El Gobierno ha intentado enfriar el mercado con medidas como la eliminación del programa de golden visa para compradores de vivienda y un mayor control sobre los alquileres.'\" yet these initiatives have not succeeded in curbing the escalation. In terms of affordability, a qualified worker would need about six to seven years to buy a 60‑m² apartment in Madrid, compared with 10–15 years in cities like Hong Kong, Paris or London. For renters, UBS points out that Madrid is close to markets where buying remains relatively profitable, meaning rent is expensive relative to purchase. The city’s trajectory contrasts with European centres that have corrected past excesses, such as Paris, London or Munich, and aligns with Dubai and Tokyo, which still experience strong real‑price growth. UBS concludes that the return of international investment to markets with looser regulation and higher potential returns is driving Madrid’s continued rise.\nOriginal language: es\nPublish date: September 23, 2025 04:34 PM\nSource:[EL PAÍS](https://elpais.com/economia/2025-09-23/la-escalada-de-los-precios-de-la-vivienda-en-madrid-eleva-el-riesgo-de-burbuja-inmobiliaria.html)\n\n**Miguel Sebastián warns that even with a stable economy, people notice housing problems**\nOn the Spanish TV program Al rojo vivo, former minister and economist Miguel Sebastián warned that, despite a stable economy, the public still feels the housing crisis. He said, 'Aunque la economía vaya bien, la gente nota el problema de la vivienda', linking the issue to a loss of purchasing power amid high prices. The latest inflation data from the Instituto Nacional de Estadística (INE) showed the consumer price index (CPI) at 2.7 % year‑on‑year in August, unchanged from July; food inflation moderated to 2.3 %, while fuel and air transport kept household costs high. Sebastián noted that inflation is falling but the most recent figure was not good and he predicts a rise to 3 % in September, which he described as 'malo'. Eurostat reported euro‑area inflation at 2 % in August, underscoring Spain’s steeper inflation. ECB President Christine Lagarde said the bank was in a 'good position' and would not cut rates in the short term, a stance that could affect mortgage costs. Housing market data from Idealista indicated the highest price level on record, and CaixaBank Research forecasts price increases of over 10 % in about 60 % of Spanish municipalities with more than 25 000 residents. Sebastián rejected policies that would encourage more home ownership, arguing instead that 'Hace falta vivienda en alquiler. Es el objetivo' and that Spain’s high home‑ownership rates make further debt‑based ownership unsustainable. He also expressed concern about Spain’s public deficit, citing France’s situation as a warning that Spain could face a similar 'callejón sin salida' if fiscal imbalances are not corrected. The broader European context remains fragile, with inflation near the ECB target and growth projected at only about 1 % in 2026, which explains why, according to Sebastián, 'la gente nota' the everyday pressure despite apparent recovery.\nOriginal language: es\nPublish date: September 23, 2025 02:49 PM\nSource:[El Confidencial](https://www.elconfidencial.com/economia/2025-09-23/miguel-sebastian-economista-economia-vaya-bien-problema-vivienda-1qrt_4214673/)\n\n**Madrid’s Housing Prices Surge, Bubble Risk Rising**\nThe UBS Global Real Estate Bubble Index reports that Madrid’s housing market has seen the largest price increase among major world cities, rising 14% over the past year, and is now positioned at a moderate but rising bubble‑risk level.  The index, which covers 21 cities, places Madrid in the middle of the table, behind Miami – the highest‑risk market – but ahead of cities such as London, Paris and Milan, which have low risk.  In the global context, prices in large cities have been stable in real terms, following three years of cooling after the 2020‑2022 boom, yet Madrid “breaks the trend” as the most dynamic market in Western Europe.\n\nRent prices in Madrid have also surged, with a 10% real‑term increase in the last year, driven by \"the strong creation of new households\" and \"the limited pace of new housing construction\".  Analysts warn that demand far outstrips supply, pressuring both the sale and rental markets, and that the structural shortage of new construction – exacerbated by long urban planning timelines and a lack of final‑stage land – remains a key issue.\n\nForeign investment has been a key driver of price growth in the capital, and the end of Spain’s Golden Visa programme – which allowed residence permits through property purchase – has particularly impacted the luxury segment.  Regulatory measures to tighten rent controls have sparked debate among owners, funds and sector associations.\n\nUBS author Maciej Skoczek notes that \"more stringent rules, such as new taxes or purchase prohibitions and rent‑control measures, have reduced the attractiveness of previously highly demanded markets such as Vancouver, Sydney, Amsterdam, Paris, New York, Singapore and London, but have not fully contained the pressure when supply is insufficient.\"\nOriginal language: es\nPublish date: September 23, 2025 12:04 PM\nSource:[elEconomista.es](https://www.eleconomista.es/vivienda-inmobiliario/noticias/13559036/09/25/ni-nueva-york-ni-londres-ni-paris-el-riesgo-de-burbuja-inmobiliaria-crece-en-madrid-con-los-precios-de-la-vivienda-disparados.html)\n\n**Real Estate Market: More Supply, Rising Prices, Increasing Vacancy and Cautious Demand**\nAccording to a new report from Economic Trends compiled by the Colegio de Profesionales Inmobiliarios de Córdoba (CPI), the rental stock in Córdoba is 83.4 % above the 2023 average, surpassing pre‑Ley de Alquileres levels. Vacancy in residential properties rose to 3.7 %, up 0.2 percentage points from the previous month, while commercial vacancy reached 3.1 %, up 0.9 points. In July, real‑estate sales were 0.2 % lower than the same month in 2024, indicating a stagnant market. Apartments accounted for 40.4 % of transactions, followed by houses (25.5 %) and housing (13.8 %). New rental contracts saw price increases of +50.2 % for houses, +51.8 % for apartments, and +102.5 % for commercial spaces, reflecting continued rent pressure. July rental activity fell 34.7 % YoY, showing a decline in demand for new leases. In Córdoba Capital, a two‑bedroom apartment rents for $600,000 (as of 15 August), while in Nueva Córdoba the same unit rents for $720,000. One‑bedroom rents range from $410,000 to $540,000 depending on the area. Median sale prices for two‑bedroom apartments are US$144,500 in Nueva Córdoba and US$75,000 in the city centre; one‑bedroom medians range from US$58,000 to US$88,350. The report concludes that the market’s recovery remains dependent on macro‑economic factors such as inflation, mortgage credit and income expectations. The article notes, 'El stock de inmuebles habitacionales destinados al alquiler superó el nivel que tenía al momento de entrada en vigencia de la normativa.'\nOriginal language: es\nPublish date: September 24, 2025 03:16 PM\nSource:[La Voz](https://www.lavoz.com.ar/clasificados-inmuebles/mercado-inmobiliario-mas-oferta-precios-en-alza-vacancia-creciente-y-demanda-cautelosa/)\n\n**Spain’s Housing Crisis Worsens: 700,000 Homes Needed While Supply Falls**\nSpain’s housing crisis is worsening, with a projected need for 700,000 finished homes in 2025 to meet new household creation, while supply is falling. The Bank of Spain previously estimated a deficit of 400,000–450,000 homes between 2022 and 2024, but José Luis Escrivá now says 700,000 will be required: 'José Luis Escrivá señaló que en 2025 se necesitarían unas 700.000 viviendas terminadas para los nuevos hogares creados.' Caixabank’s study found a 515,000‑home deficit over 2021‑2024 based on net household creation of 970,000 versus 454,000 new‑construction permits; when finished houses and alternative uses are considered, the deficit rises to 765,000. Idealista reports that the supply of available homes has dropped 39 % since the second quarter of 2019, further tightening the market: 'Idealista alertan de que el número de viviendas que salen al mercado nacional no solo no aumenta al mismo ritmo de la demanda, sino que está disminuyendo.' INE data project that Spain will add almost 3.7 million households in the next 15 years, with one‑person households growing from 5.4 million to 7.7 million—a 41.86 % increase—meaning more dwellings will be needed. The article concludes that the only solution is to build more homes.\nOriginal language: es\nPublish date: September 24, 2025 04:35 AM\nSource:[Libertad Digital](https://www.libertaddigital.com/libremercado/2025-09-24/mier-se-agrava-la-crisis-de-vivienda-en-espana-se-necesitan-700-000-pero-la-oferta-se-hunde-7299101/)\n\n**El precio de la vivienda en España bajo Sánchez alcanza niveles no vistos desde 2008**\nIn the second quarter of 2025, Spain’s average free‑housing price climbed to 2,093.5 €/m², a 10.4 % year‑over‑year increase that leaves the market only 0.3 % below the peak of the 2008 bubble. Prices are rising across all autonomous communities, with San Sebastián at 6,071 €/m²—over 250 % above the national average—and Madrid and the Balearic Islands above 3,900 €/m². The surge outpaces wage growth, tightening access for young and low‑income households and pushing rents higher. Analysts argue the growth is driven by solid demand, cautious financing and a stable labour market, and not a repeat of the 2008 bubble. Structural tension from limited new housing and international interest could still pose over‑valuation risks in the most active areas. Projections forecast a 5–7 % price increase by the end of 2025, with continued pressure in major capitals and tourist zones, while other regions may see milder gains. The widening affordability gap underscores the need for new housing policies. 'El aumento del precio de la vivienda tiene un impacto social significativo, especialmente para jóvenes y familias con ingresos medios o bajos,' the article notes.\nOriginal language: es\nPublish date: September 24, 2025 01:24 AM\nSource:[Periodista digital](https://www.periodistadigital.com/economia/20250924/precio-vivienda-espana-sanchez-alcanza-niveles-vistos-2008-noticia-689405135698/)\n\n**Madrid Housing Price Surge Raises Risk of Real‑Estate Bubble**\nAccording to the UBS Global Real Estate Bubble Index 2025, Madrid has become \"'Madrid se ha consolidado como una de las capitales más dinámicas del panorama inmobiliario internacional.'\" The city recorded the highest real‑price growth among the 21 cities analysed, with a 14 % increase over the last year, compared with stagnation in much of Europe and North America. This surge pushed Madrid into the moderate‑risk bubble group, receiving a risk score of 0.80, up from a lower level a year earlier. UBS analysts note that the risk is even higher in cities such as Miami, Tokyo, Zurich, Los Angeles or Dubai, where Dubai has also seen the largest rise in risk since the previous edition. The price climb is attributed to strong foreign demand—positioning Madrid as an alternative to more mature markets like London, Paris or Vancouver—and to limited supply in central areas, which pressures prices even in less exclusive neighbourhoods. \"'El Gobierno ha intentado enfriar el mercado con medidas como la eliminación del programa de golden visa para compradores de vivienda y un mayor control sobre los alquileres.'\" yet these initiatives have not succeeded in curbing the escalation. In terms of affordability, a qualified worker would need about six to seven years to buy a 60‑m² apartment in Madrid, compared with 10–15 years in cities like Hong Kong, Paris or London. For renters, UBS points out that Madrid is close to markets where buying remains relatively profitable, meaning rent is expensive relative to purchase. The city’s trajectory contrasts with European centres that have corrected past excesses, such as Paris, London or Munich, and aligns with Dubai and Tokyo, which still experience strong real‑price growth. UBS concludes that the return of international investment to markets with looser regulation and higher potential returns is driving Madrid’s continued rise.\nOriginal language: es\nPublish date: September 23, 2025 04:34 PM\nSource:[EL PAÍS](https://elpais.com/economia/2025-09-23/la-escalada-de-los-precios-de-la-vivienda-en-madrid-eleva-el-riesgo-de-burbuja-inmobiliaria.html)\n\n**Miguel Sebastián warns that even with a stable economy, people notice housing problems**\nOn the Spanish TV program Al rojo vivo, former minister and economist Miguel Sebastián warned that, despite a stable economy, the public still feels the housing crisis. He said, 'Aunque la economía vaya bien, la gente nota el problema de la vivienda', linking the issue to a loss of purchasing power amid high prices. The latest inflation data from the Instituto Nacional de Estadística (INE) showed the consumer price index (CPI) at 2.7 % year‑on‑year in August, unchanged from July; food inflation moderated to 2.3 %, while fuel and air transport kept household costs high. Sebastián noted that inflation is falling but the most recent figure was not good and he predicts a rise to 3 % in September, which he described as 'malo'. Eurostat reported euro‑area inflation at 2 % in August, underscoring Spain’s steeper inflation. ECB President Christine Lagarde said the bank was in a 'good position' and would not cut rates in the short term, a stance that could affect mortgage costs. Housing market data from Idealista indicated the highest price level on record, and CaixaBank Research forecasts price increases of over 10 % in about 60 % of Spanish municipalities with more than 25 000 residents. Sebastián rejected policies that would encourage more home ownership, arguing instead that 'Hace falta vivienda en alquiler. Es el objetivo' and that Spain’s high home‑ownership rates make further debt‑based ownership unsustainable. He also expressed concern about Spain’s public deficit, citing France’s situation as a warning that Spain could face a similar 'callejón sin salida' if fiscal imbalances are not corrected. The broader European context remains fragile, with inflation near the ECB target and growth projected at only about 1 % in 2026, which explains why, according to Sebastián, 'la gente nota' the everyday pressure despite apparent recovery.\nOriginal language: es\nPublish date: September 23, 2025 02:49 PM\nSource:[El Confidencial](https://www.elconfidencial.com/economia/2025-09-23/miguel-sebastian-economista-economia-vaya-bien-problema-vivienda-1qrt_4214673/)\n\n**Youth Home Purchases in Spain Collapse to Less Than Half in 20 Years**\nThe article reports a steep decline in home purchases by Spanish youth (18‑30 years old), falling from 22.5 % in 2007 to 9.5 % in 2025, a drop of more than half. The median age of buyers has risen from 40 to 47‑48 years, an increase of eight years. Housing prices per square metre have returned to the 2007 level of €2,077, but are 27 % below that historical peak when adjusted for inflation. Mortgage usage has fallen from 87 % of sales in 2007 to 54 % in 2024, with the share of the purchase price financed by a mortgage dropping from 84 % to 72 %. The number of mortgages signed fell from 722,000 in 2007 to roughly half that in 2024. In high‑price areas such as Madrid (80 % of mortgages), larger loans are requested, whereas in less‑demanded provinces the debt burden is higher relative to income. The average financial effort needed to buy a house has decreased from six annual income‑based instalments in 2008 to 5.1 in 2024, though in expensive regions like the Balearic Islands up to eight instalments are required. Foreign buyers have tripled their share of purchases, rising from 4.4 % in 2007 to 12.6 % in 2024, and now account for one in five homes in 2025, especially in the Balearic Islands, Alicante, Málaga, Murcia and the Canary Islands. The share of foreign residents in sales is 13 % overall, with 7 % non‑resident buyers; in provinces such as Alicante (32 %) and Málaga (20 %) the non‑resident share is particularly high. The article cites Alberto Martínez, director general of the Centro Tecnológico del Notariado, who warned in the Spanish Congress that the housing crisis is most acute in places like San Sebastián (€6,000/m²), Barcelona (€4,500/m²), Madrid (€4,900/m²) and the Balearic Islands (€3,800/m²). He noted that protected housing supply has collapsed, with only 10 % of the 1995 peak of 122,000 units currently being built. The article presents these figures without editorial commentary, focusing on factual data.\nOriginal language: es\nPublish date: September 23, 2025 12:38 PM\nSource:[La Razón](https://www.larazon.es/economia/viviendas-compradas-jovenes-desploman-menos-mitad-apenas-20-anos_2025092368d294bc31b8a3479b7840a2.html)\n\n**UBS: Madrid and Dubai Record Highest Increase in Real Estate Bubble Risk**\nUBS’s latest Global Real Estate Bubble Index shows that Miami has the highest bubble risk among the cities examined, followed by Tokyo and Zurich. Los Angeles, Geneva, Amsterdam and Dubai also show visibly high risk, with Dubai registering the largest increase in risk since the previous edition, alongside Spain’s capital. UBS notes that Madrid has the largest real‑price growth of any city in the study, rising 14% compared with last year. According to the firm, Madrid, Frankfurt and Munich fall into the moderate‑risk group, while London, Paris and Milan are considered low‑risk. Most experts dismiss a housing bubble in Spain, arguing the current issue is a supply shortage rather than a financial one. Cities that were flagged as high risk in 2021—such as Frankfurt, Paris, Toronto, Hong Kong and Vancouver—have seen an average real‑price decline of almost 20% from their peaks due to rising interest rates, whereas cities with lower imbalances have fallen about 5% on average. Hong Kong is the least affordable city in the study, requiring roughly 14 years of income to buy a 60‑m² apartment. UBS warns that the ongoing, likely unsustainable rise in public debt could give the real‑estate market a new boost in the coming years, especially in a period of financial repression where demand for assets with positive real returns, like housing, increases. In the short term, UBS expects central banks to cut policy rates by 2026, gradually reducing real financing costs, while limited supply in most urban centers supports further price rises.\nOriginal language: es\nPublish date: September 23, 2025 12:36 PM\nSource:[Expansión](https://www.expansion.com/inmobiliario/mercado/2025/09/23/68d2943c468aebf7588b4597.html)\n\n**Madrid’s Housing Prices Surge, Bubble Risk Rising**\nThe UBS Global Real Estate Bubble Index reports that Madrid’s housing market has seen the largest price increase among major world cities, rising 14% over the past year, and is now positioned at a moderate but rising bubble‑risk level.  The index, which covers 21 cities, places Madrid in the middle of the table, behind Miami – the highest‑risk market – but ahead of cities such as London, Paris and Milan, which have low risk.  In the global context, prices in large cities have been stable in real terms, following three years of cooling after the 2020‑2022 boom, yet Madrid “breaks the trend” as the most dynamic market in Western Europe.\n\nRent prices in Madrid have also surged, with a 10% real‑term increase in the last year, driven by \"the strong creation of new households\" and \"the limited pace of new housing construction\".  Analysts warn that demand far outstrips supply, pressuring both the sale and rental markets, and that the structural shortage of new construction – exacerbated by long urban planning timelines and a lack of final‑stage land – remains a key issue.\n\nForeign investment has been a key driver of price growth in the capital, and the end of Spain’s Golden Visa programme – which allowed residence permits through property purchase – has particularly impacted the luxury segment.  Regulatory measures to tighten rent controls have sparked debate among owners, funds and sector associations.\n\nUBS author Maciej Skoczek notes that \"more stringent rules, such as new taxes or purchase prohibitions and rent‑control measures, have reduced the attractiveness of previously highly demanded markets such as Vancouver, Sydney, Amsterdam, Paris, New York, Singapore and London, but have not fully contained the pressure when supply is insufficient.\"\nOriginal language: es\nPublish date: September 23, 2025 12:04 PM\nSource:[elEconomista.es](https://www.eleconomista.es/vivienda-inmobiliario/noticias/13559036/09/25/ni-nueva-york-ni-londres-ni-paris-el-riesgo-de-burbuja-inmobiliaria-crece-en-madrid-con-los-precios-de-la-vivienda-disparados.html)\n\n**Barceló Anticipates a Tourism Cycle Shift, Yet Prices Remain Rising**\nBarceló, Spain’s second‑largest hotel group by rooms, forecasts a shift in the tourism cycle after a record‑breaking 2024 that ended with €3.200 billion in revenue, €500 million in operating profit and €300 million in net profit.  CEO Raúl González said, 'Mi impresión es que el ciclo empieza a declinar. No va a ser una caída brusca, pero sí una desaceleración en la demanda.' He notes that while occupancy is slowing, price levels will not fall; in summer the average revenue per available room rose 6‑7 % driven solely by higher rates.  The group expects a single‑digit growth in revenue, EBITDA and net profit next year and plans to invest at least €400 million in acquisitions, targeting 20 new openings.  Key markets for expansion are Italy, Portugal and Spain’s own high‑growth destinations such as Asturias, which has maintained its pre‑pandemic hotel capacity.  González also warned that the broader tourism slowdown could moderate investor sentiment and make purchase prices more rational, but he insists the hotel sector is not responsible for negative effects like tourismophobia or rising housing costs, citing a 29 % increase in Spain’s hotel rooms between 2005 and 2025.\nOriginal language: es\nPublish date: September 23, 2025 11:55 AM\nSource:[Cinco Días](https://cincodias.elpais.com/companias/2025-09-23/barcelo-anticipa-un-cambio-de-ciclo-en-el-turismo-pero-con-precios-todavia-al-alza.html)\n\n**Real‑Estate Analyst Warns Spain: Monthly Room Rent Equals Full Apartment**\nReal‑estate analyst Ferran Font warns that the monthly rent for a single room in Spain’s major provincial capitals now equals that of a full apartment.  According to pisocompartido.com, the price of shared‑room rentals rose 12.55 % from 422.92 € in 2024 to 475.98 € in 2025, an increase of 108.13 % when compared to the previous year.  Font attributes the surge to demand outpacing supply and the contagion of residential rent hikes, noting that the price spike disproportionately affects renters aged 18‑25 (50.78 %) and 26‑35 (29.38 %).  The most affected cities are Madrid, Barcelona and Valencia, while the provinces of Madrid, Barcelona, Sevilla, Valencia and Málaga account for 61.37 % of room seekers.  Font says the market’s rapid rise undermines the traditional savings‑to‑buy model, stating, 'La mensualidad de una habitación en las capitales de provincia con mayor concentración de demanda iguala a la de un piso completo hace una década en algunos casos', and that 'el mercado de las habitaciones en pisos compartidos se ha contagiado de la subida de los alquileres residenciales'.\nOriginal language: es\nPublish date: September 21, 2025 10:07 AM\nSource:[elespanol.com](https://www.elespanol.com/sociedad/20250921/analista-inmobiliario-alerta-espana-mensualidad-habitacion-iguala-piso-completo/1003743928183_0.html)\n\n**Housing Prices Surge 12.7% in Q2, Highest Increase in 18 Years**\nThe Instituto Nacional de Estadística (INE) reported that the price of free‑market housing in Spain rose 12.7% in the second quarter of 2025 compared with the same period in 2024, marking the largest quarterly increase in 18 years. The rise is part of a 45‑quarter streak of year‑on‑year gains. New‑home prices climbed 12.1% and used‑home prices jumped 12.8%, the latter a 0.1‑point rise over the previous quarter and the highest in 18 years since Q1 2007. Regional variations were pronounced: Murcia led with a 14.6% increase, followed by Aragón and La Rioja at 13.7%, Castilla y León and Andalucía at 13.6%, and Asturias at 13.5%. Lower‑mid‑range increases were seen in Cantabria (10.8%), Castilla‑La Mancha (11.3%), Canarias and Cataluña (11.6%) and Baleares (11.7%).\n\nCaixaBank Research attributes up to 39% of the price rise to the accumulated housing deficit, which has reached 515,000 units over the past four years, rising to 600,000 if finished homes are counted and 765,000 if alternative uses are included. The deficit is most acute in high‑pressure provinces such as Madrid, Barcelona, Alicante, Valencia and Málaga.\n\nThe market remains in an expansionary phase, with 700,000 transactions recorded in the first half of 2025—19.7% more than the same period in 2024—and 132,000 new homes approved, a 13% year‑on‑year increase. Foreign demand is significant: 18% of sales (133,000 units) were purchased by foreigners, with 44% of those being non‑resident buyers, who tend to drive up prices.\n\nYolanda Díaz, vice‑president of the Spanish government, criticised the “buitre” funds that she says are taking over cities, calling for immediate rent reductions and a public social‑rent housing park. She also highlighted the impact of tourist and seasonal rentals on Galicia’s housing market. The article cites María Matos of Fotocasa, who described the price rise as \"logical\" given the limited supply, and Ferran Font of Pisos.com, who noted that the price increase is unlikely to change in the short term.\nOriginal language: es\nPublish date: September 05, 2025 11:47 AM\nSource:[esdiario.com](https://www.esdiario.com/economia/250905/166374/precio-vivienda-libre-dispara-12-7-segundo-trimestre-mayor-alza-18-anos.html)\n\n**Housing already shows signs of overvaluation, but will continue to rise this and next year**\nAccording to CaixaBank Research, the housing deficit in Spain accounts for 39 % of the price increases observed between 2021 and 2024. Between May 2024 and May 2025, 132 000 new homes were approved – a 13 % year‑over‑year rise – with projections of 140 000 in 2025 and 150 000 in 2026. New household creation is roughly 180 000 per year, so the construction gap will widen. CaixaBank warns that the expected price rise over the next two years will be 'superior al previsto para la renta disponible por hogar', making access to housing harder in high‑demand areas. Banco de España estimated that housing prices are 1.1 %–8.5 % above long‑term equilibrium by the end of 2024, up from 0.8 %–4.8 % six months earlier. The ECB estimates a 10 % overvaluation of the Spanish residential market by the end of 2024. CaixaBank notes that overvaluation is already present in most territories, with the Balearic Islands and Madrid showing the strongest signs. Despite the price rise, the market is not expected to crash; the lack of excess supply, a stronger financial sector, and lower household debt (42.5 % of GDP versus over 80 % in 2010) mean prices are unlikely to fall sharply. The study concludes that accelerating affordable housing construction is the only way to curb prices. In August, the average price per square metre reached €2 498, up 14.8 % from the previous month, according to Idealista.\nOriginal language: es\nPublish date: September 05, 2025 06:23 AM\nSource:[El Español](https://www.elespanol.com/invertia/observatorios/vivienda/20250905/vivienda-da-senales-sobrevaloracion-seguira-encareciendose-proximo-ano/1003743911616_0.html)\n\n**Housing Shortage Drives Prices Up, Explaining Up to 39 % of the Rise**\nThe housing market in Spain is in a strong expansion phase, with prices at their highest since 2010 after adjusting for inflation. According to the CaixaBank Research Sectorial Inmobiliario report, demand has risen to 700,000 transactions in the last year, a 20 % increase. The report attributes this surge to improved financing conditions, higher household purchasing power from a robust labour market, and sustained demographic growth driven by migration and new family types, while the lack of supply is the main driver of price pressure.\n\nIn the past year 132,000 new homes were approved, a 13 % rise over the previous year, yet production remains insufficient to balance the market. The authors calculate that between 2021 and 2024 the housing deficit has accumulated 765,000 units, equal to 4 % of Spain’s housing stock, and that this shortfall explains 39 % of the price increase observed during the period. The deficit is most acute in Madrid, Alicante, Barcelona, Valencia and Málaga, each needing more than 60,000 additional homes, while the “España vaciada” region has a smaller deficit but still exceeds 3,000 units in provinces such as Jaén, Guadalajara, Lugo, Albacete, Burgos and Ciudad Real.\n\nSecond‑hand purchases dominate the market, but new‑home sales are gaining ground, rising 22.2 % in the first half of the year, although still below the 2007 level when 42 % of purchases were new homes.\n\nPrices have surpassed 2010 levels in real terms. Madrid and Catalonia lead the rise, followed by Andalucía, the Balearic Islands, the Canary Islands, the Valencian Community and Murcia. The report notes that the price surge since mid‑2024 has shifted demand toward more affordable areas, also lifting prices in provinces bordering Madrid (Segovia, Ávila, Toledo, Valladolid) and Barcelona.\n\nCaixaBank Research projects a 10 % price increase this year and an additional 6.3 % in 2026, outpacing the growth of disposable household income and further tightening housing affordability.\n\nForeign demand is a key factor: more than 50,000 homes were bought by foreigners in the first half of the year, 14 % of all transactions, four points above the historical average for 2006‑2024. The Ministry of Housing data show that one in five homes is now purchased by non‑resident foreigners, compared with 7 % in 2007. Non‑resident buyers, who are mainly vacation or investment purchasers with higher purchasing power, paid an average price of €3,063 per square metre in the second half of 2024, nearly double the €1,713 per square metre paid by nationals. The price paid by non‑residents has risen 38 % since 2019.\n\nThe report states, 'Es urgente reactivar la promoción residencial para mitigar las presiones en los precios', and notes that the deficit explains 'continúan acelerándose y dificultan el acceso a la vivienda'. It concludes, 'Esta tendencia refleja que España se ha consolidado como uno de los destinos más atractivos para la inversión en inmuebles de lujo en Europa'.\nOriginal language: es\nPublish date: September 05, 2025 05:10 AM\nSource:[El Diario Vasco](https://www.diariovasco.com/economia/vivienda/falta-vivienda-agrava-explica-imparable-escalada-precios-20250905071028-ntrc.html)\n\n**Spain's Housing Shortage Drives 39% of Price Rise, Says CaixaBank Research**\nSpain’s housing market is in a sustained expansion phase, with prices at record highs and demand reaching 700,000 transactions – a 20 % increase over the previous year. A sectorial report from CaixaBank Research attributes the surge to improved financing conditions, higher household purchasing power from a strong labour market, and continued demographic growth, while a persistent supply deficit – estimated at 765,000 units (4 % of Spain’s housing stock) between 2021 and 2024 – is the main driver of price pressure, accounting for 39 % of the observed price rise. The report warns that the deficit is widening, with Madrid, Alicante, Barcelona, Valencia and Málaga each needing more than 60,000 additional homes, and that foreign buyers now represent 14 % of all transactions, with non‑resident purchases averaging €3,063 per m² versus €1,713 for nationals. Prices are projected to climb 10 % this year and 6.3 % in 2026, outpacing disposable income and tightening affordability. The report calls for urgent action to boost affordable housing construction, noting that only the province of Soria has no residential deficit. Key quotes from the study include: 'continúan acelerándose y dificultan el acceso a la vivienda', 'Es urgente reactivar la promoción residencial para mitigar las presiones en los precios', and 'Esta tendencia refleja que España se ha consolidado como uno de los destinos más atractivos para la inversión en inmuebles de lujo en Europa'.\nOriginal language: es\nPublish date: September 05, 2025 05:10 AM\nSource:[El Comercio](https://www.elcomercio.es/economia/vivienda/falta-vivienda-agrava-explica-imparable-escalada-precios-20250905071028-ntrc.html)\n\n**Housing Prices Start Showing Signs of Overvaluation**\nCaixaBank Research’s latest Sectorial Real Estate Report indicates that Spanish housing prices are showing signs of overvaluation. The study attributes 39% of the recent price rise to a deficit of 765,000 homes—about 4% of the total stock—resulting from slow construction and population growth. The report notes that the price of housing is currently 1.1% to 8.5% above its long‑term equilibrium level by the end of 2024, up from 0.8% to 4.8% six months earlier, and that the European Central Bank estimates a 10% overvaluation by the same deadline. It also highlights that foreign non‑resident purchases, which now account for 7.9% of transactions, have increased by 40% since 2019, further driving up prices. The study projects a 10.8% price rise in 2025, easing to 6% the following year. Overvaluation is most pronounced in the Balearic Islands and Madrid, where prices have decoupled from household income, making home ownership increasingly difficult for young people. Despite the current overvaluation, the report stresses that the financial position of households, the construction sector, and the banking system is stronger than during the 2007‑2008 crisis, and that the risk of a sharp price correction remains contained. \"En ambos casos, por el momento, se trata de niveles aún contenidos, pero la tendencia es claramente al alza,\" the study notes, underscoring the upward trend.\nOriginal language: es\nPublish date: September 05, 2025 04:24 AM\nSource:[LaVanguardia](https://www.lavanguardia.com/economia/20250905/11029786/precio-vivienda-empieza-dar-signos-sobrevaloracion.html)\n\n**Spain's Housing Shortfall Explains Up to 39% of Market Price Rise**\nCaixaBank Research’s sectorial real‑estate report shows that Spain’s cumulative housing deficit of 515,000 units over the last four years could explain up to 39 % of the 6 % annual price rise observed, versus a 3.7 % rise if the deficit were absent. The deficit climbs to 600 000 when finished units are counted and to 765 000 when alternative uses are subtracted. The shortfall is concentrated in high‑pressure provinces such as Madrid, Barcelona, Alicante, Valencia and Málaga, while the depopulated “España vaciada” shows a smaller gap. The market entered an expansive phase in the first half of 2025, with 700 000 property transactions recorded in the 12 months to June – a 19.7 % increase over the same period in 2024 – driven by better financing conditions, rising household purchasing power and steady demographic growth. New construction has recovered, with 132 000 new homes approved in the 12 months to May, an inter‑annual rise of 13 %. Foreign demand has become a key driver: 18 % of sales in the last year up to Q1 2025 were bought by foreigners, amounting to 133 000 transactions – a record high – with more than half from resident foreigners and 44 % from non‑resident buyers, who tend to pay higher prices for medium‑to‑high‑end properties. The Mediterranean arc and the archipelagos dominate foreign demand, but new hotspots such as Castellón, Asturias, Huelva and Córdoba are emerging. The report notes the market is ‘en plena fase expansiva’ and that foreign purchases reached ‘un máximo histórico’.\nOriginal language: es\nPublish date: September 05, 2025 02:59 AM\nSource:[europa press](https://www.europapress.es/catalunya/noticia-deficit-vivienda-espana-explica-39-subida-precio-caixabank-research-20250905045949.html)\n\n**Housing Shortage Drives Up Prices, Explains Up to 40% of the Surge | Diario Sur**\nThe Spanish housing market is in an expansionary phase, with prices at their highest since 2010 (inflation‑adjusted). According to the CaixaBank Research Sectorial Inmobiliario report, demand rose 20% to 700,000 transactions last year, driven by better financing conditions, higher household purchasing power and sustained demographic growth. However, supply remains insufficient, with a housing deficit of 765,000 units—about 4% of Spain’s stock—accumulated between 2021 and 2024. This shortfall accounts for 39% of the price increase observed in the same period. The report notes that only the province of Soria has no residential deficit, while Madrid, Alicante, Barcelona, Valencia and Málaga each need more than 60,000 homes, and provinces such as Jaén, Guadalajara, Lugo, Albacete, Burgos and Ciudad Real have deficits above 3,000 units. New‑home purchases grew 22.2% in the first half of the year, yet they still lag behind the 2007 level where 42% of sales were new homes. Prices are projected to rise 10% this year and 6.3% in 2026, outpacing disposable income growth and tightening affordability. Foreign buyers now account for 14% of transactions—50,000 homes in the first half—an increase of four points over the 2006‑2024 average, and 18% of all sales, up from 7% in 2007. The average price per square metre for foreign purchases was €3,063 in the second half of 2024, nearly double the €1,713 for national buyers, reflecting a 38% rise since 2019. The report stresses that \"Es urgente reactivar la promoción residencial para mitigar las presiones en los precios\" and that \"Esta tendencia refleja que España se ha consolidado como uno de los destinos más atractivos para la inversión en inmuebles de lujo en Europa\".\nOriginal language: es\nPublish date: September 04, 2025 10:02 PM\nSource:[Sur](https://www.diariosur.es/economia/falta-vivienda-agrava-explica-imparable-escalada-precios-20250905000247-nt.html)\n\n**Spanish Residential Market Sees Intense Activity and Rising Prices**\nThe Spanish residential market is experiencing intense activity, driven by a solid national and international demand, the renewed attractiveness of Spain as a destination for second-home investment, and a stabilization of financial conditions. According to recent data from Tinsa and CaixaBank, the price of housing could increase by up to 9% in 2025. This growth is more pronounced in markets such as Madrid, Barcelona, Málaga, and coastal areas, where demand is particularly high. In cities like Málaga, for example, the rental prices have already reached one of the highest levels in the country, as highlighted by the latest Idealista price report. The number of operations in the residential market has grown by 60% between 2023 and 2024, and the total value of transactions has increased by 157% during the same period.\nOriginal language: es\nPublish date: August 21, 2025 05:40 AM\nSource:[elEconomista.es](https://www.eleconomista.es/autor/Jorge-Perez-Curto)\n\n**Real Estate Portals: Mortgage Data Show 'Good Pulse' of Sector**\nThe real estate portals have assured that the data on new mortgages for housing show the 'good pulse' of the sector, supported by the dynamism of the real estate market and the interest of banks in continuing to grant mortgages. According to the data released by the National Institute of Statistics (INE), the number of mortgages constituted on housing increased by 14% in April compared to the same month in 2024, reaching 39,176 loans, the highest figure in a month of April since 2010. Juan Villén, director general of Idealista Hipotecas, expressed his confidence that the growth of the number of mortgages on housing will be maintained at least 'until summer', but 'certainly' until the end of the year, but he asks to 'keep an eye' on the evolution of inflation, interest rates and consumer confidence, which could 'condition or modify this positive trend'. Ferran Font, director of Studies of Pisos.com, lamented that, despite the good data on mortgages, the accessibility to housing continues 'without improving', since the demand remains 'very active' and, with good financing conditions, but the supply 'does not rise', with the prices being at 'maximums and without signs of changing in the short term'. María Matos, director of Studies of Fotocasa, highlighted that, although 2025 already has better conditions in mortgages, these may 'not be enough' to counteract the accelerated increase in the value of housing, which can cause buyers to opt for 'more accessible mortgages', but face 'higher purchase prices'. The Federation of Associations of Real Estate Companies (Fadei) has indicated that housing is going through 'a phase of great activity' due to a very favorable context for both purchase and sale, with 'competitive interest rates' and a 'very high' housing need due to 'sustained demographic growth'.\nOriginal language: es\nPublish date: June 20, 2025 08:50 AM\nSource:[europa press](https://www.europapress.es/economia/construccion-y-vivienda-00342/noticia-portales-inmobiliarios-aseguran-datos-hipotecas-muestran-buen-pulso-sector-20250620105046.html)\n\n**Housing prices in Spain continue to rise, with a 9.9% increase in May**\nThe Spanish housing market has started 2025 with a strong upward trend, with prices increasing by 9.9% in May compared to the same month in 2024, and 0.9% compared to the previous month, according to the Tinsa index. This growth exceeds inflation and shows sustained pressure in all regions, with the highest increases in the archipelagos, capitals, and large cities. The director of the studies service, Cristina Arias, has pointed out that the price increase is general, but is especially visible where the available space is scarce. 'The competition for the limited land in the islands and urban centers is generating a very acute tensioning', she has noted. CaixaBank Research has revised its forecast for 2025 upwards, predicting a 9% growth, 3.1 percentage points above its previous estimate. The economist Judit Montoriol links this trend not only to the improvement in financial conditions, but also to a recovery of household purchasing power and foreign demand pressure. The fall in interest rates has had an immediate effect on mortgage credit, with financing for the purchase of housing growing by 35.4% in the first quarter of the year compared to the same period in 2024. However, this bonanza has a negative side, as the prices are rising at a faster rate than the income, which is putting pressure on accessibility ratios. The report warns that this gap may worsen if the current imbalance between supply and demand is maintained.\nOriginal language: es\nPublish date: June 05, 2025 01:29 PM\nSource:[EL PAÍS](https://elpais.com/economia/2025-06-05/el-precio-de-la-vivienda-no-cede-y-podria-subir-hasta-un-9-en-2025.html)\n\n",
    "date": "2025-10-13T16:07:09.153171",
    "summary": "Across a diverse panel of forecasting experts—including specialists in real estate analysis, economics, urban planning, finance, and regional studies—there is strong consensus that while Madrid's housing market will likely experience robust price growth in 2025, the probability of prices rising by more than 18% (as in the exceptional 20% increase seen in 2024) is low but not negligible. All experts cite persistent and acute supply shortages and strong demand (especially from foreign and high-income buyers) as key upward pressures. However, these are balanced—or outweighed—by significant affordability constraints, policy/regulatory interventions (like the end of the Golden Visa and rent controls), and the historical rarity of back-to-back >18% price increases in mature European capitals. Consensus sector and banking forecasts for 2025 range from 6% to 14% rises, with most clustering at 8–12%, well below the 18% threshold. Experts consistently flag that after an extraordinary surge, mean reversion is likely: buyer fatigue, stretched affordability, and growing policy scrutiny are expected to moderate further gains. The main scenario envisioned is a strong, possibly double-digit increase, but not exceeding 18%. A small but meaningful probability is assigned to another outsized jump, contingent primarily on even sharper supply bottlenecks and a surge in international or speculative demand without effective policy intervention. Probabilities given for a >18% increase cluster between 10% and 22% (modal values: 10%-18%), with no expert estimating this outcome as more likely than not. The summary judgment is that robust growth is highly probable, but another year of explosive, >18% gains is unlikely barring extraordinary circumstances.",
    "forecasters": [
        "RealEstateAnalysis (ComparativeMarketAnalysis)",
        "RealEstateAnalysis (HedonicPricingModel)",
        "BankingAndFinance (RiskAssessmentStandards)",
        "UrbanPlanning (MunicipalHousingPolicyReview)",
        "Economics (SupplyAndDemandTheory)",
        "Economics (RealEstateMarketCycleTheory)",
        "Economics (MonetaryPolicyTransmission)",
        "Urban Studies (UrbanGrowthTheory)",
        "Urban Studies (LandUseEconomics)",
        "RegionalStudiesIberia (SouthernEuropeanHousingModel)"
    ]
}