{
    "deliberation_results": {
        "RegulatoryAffairs (FederalRulemakingProcess)": {
            "time_to_resolution": "About 2.5 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Regulatory Affairs and the Federal Rulemaking Process, I can critically assess the regulatory, legal, and political landscape that determines whether significant federal rules like the FTC's non-compete ban survive judicial scrutiny, administrative changes, and political headwinds. My expertise enables me to gauge the likelihood of a rule surviving through the required process to enactment in the face of litigation, shifting agency priorities, and changes in administration.",
            "status_quo": "The FTC's non-compete ban has been vacated by federal courts, and the agency has formally abandoned both the rule and its appeals, reverting the legal landscape to a patchwork of state laws. The FTC has shifted to targeted, case-by-case enforcement rather than pursuing a blanket federal ban.",
            "perspective_derived_factors": [
                {
                    "factor": "Judicial Rulings and Legal Authority",
                    "effect": "Strongly decreases probability. The rule was vacated on grounds that the FTC lacked statutory authority for a broad labor regulation. Courts have signaled skepticism toward expansive agency rulemaking under the 'major questions' doctrine."
                },
                {
                    "factor": "FTC Administrative Abandonment",
                    "effect": "Strongly decreases probability. The FTC has officially withdrawn its appeals, effectively conceding defeat and ending any attempt to enact the rule in its current form before 2026."
                },
                {
                    "factor": "Change in Presidential Administration and FTC Leadership",
                    "effect": "Strongly decreases probability. The Trump administration and its appointee, Chair Andrew Ferguson, have explicitly opposed the rule, preferring case-by-case enforcement over broad rulemaking. There is no indication of a policy reversal before 2026."
                },
                {
                    "factor": "Regulatory Process Timelines",
                    "effect": "Decreases probability. Even if the FTC reversed course immediately, the process to re-propose, justify, and defend a new rule would likely extend well past the January 2026 deadline."
                },
                {
                    "factor": "Political and Industry Opposition",
                    "effect": "Decreases probability. Business groups and Republican officials have consistently opposed the blanket ban, and the current administration is responsive to these constituencies."
                },
                {
                    "factor": "Precedent and Base Rates",
                    "effect": "Decreases probability. Historically, major administrative rules vacated on statutory authority grounds and abandoned by the agency are not resurrected within months, especially under unfavorable political conditions."
                }
            ],
            "no_scenario": "The FTC's voluntary dismissal of appeals stands, the vacatur remains in effect, and the agency continues with targeted antitrust enforcement but does not attempt to reissue or re-enact the broad non-compete ban before January 1, 2026. State laws remain the primary regulatory framework.",
            "yes_scenario": "Despite having withdrawn, the FTC somehow rapidly reverses course—perhaps due to an extraordinary legal or political development—and manages to re-enact the rule in substantially its current form before January 1, 2026, overcoming both judicial objections and political headwinds. This would require either an unexpected court reversal, emergency rulemaking, or a major political shift—none of which are indicated by any current evidence.",
            "final_reasoning": "Every primary piece of evidence—news articles, agency statements, legal developments—confirms that the FTC's broad non-compete ban is not only blocked by federal courts but also actively abandoned by the agency itself. The Trump administration and new FTC leadership are ideologically opposed to the rule, and the FTC has shifted to a narrow, case-by-case enforcement approach, with no intention or realistic pathway to re-enactment in the remaining months of 2025. The judicial rulings were based on a lack of statutory authority, a high bar that cannot be quickly or easily overcome. The base rate for similar rules suggests that, once vacated and abandoned, rules almost never return in the same form and within such a short timeframe—especially in the face of entrenched opposition and adverse court precedent. The only conceivable path to a 'Yes' outcome would require a dramatic and highly improbable reversal of both administrative and judicial posture, for which there is zero evidence. Thus, the probability that the FTC's non-compete ban is enacted in 'more or less its current form' before 2026 is effectively zero.",
            "final_probability": 0
        },
        "LaborLawPractice (EmploymentAgreementCompliance)": {
            "time_to_resolution": "Approximately 2.5 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Labor Law Practice (Employment Agreement Compliance), I analyze both statutory/regulatory frameworks and real-world employer practices, including the practical impacts of federal and state labor law changes. My understanding of administrative law, regulatory enforcement, and the interplay between federal and state authority is crucial for evaluating the likelihood of a federal rule like the FTC's non-compete ban being enacted and enforced in its proposed form, especially after major legal and administrative reversals.",
            "status_quo": "The FTC's nationwide ban on non-compete agreements has been vacated by federal courts, and the FTC has officially abandoned appeals and rulemaking on this matter. Non-compete enforceability is currently governed by a patchwork of state laws, with the FTC indicating it will pursue case-by-case enforcement against particularly egregious non-competes but not a blanket ban.",
            "perspective_derived_factors": [
                {
                    "factor": "Judicial Rulings and Precedent",
                    "effect": "Strongly decreases probability. Federal courts, especially in the 5th Circuit, have ruled the FTC lacks statutory authority for such a sweeping rule. The agency has accepted vacatur, setting a strong legal precedent against future rulemaking in this area before 2026."
                },
                {
                    "factor": "Political Administration and FTC Leadership",
                    "effect": "Strongly decreases probability. The Trump administration has replaced FTC leadership with opponents of the non-compete rule and directed the agency to abandon the blanket ban, shifting strategy to targeted enforcement and dismantling the regulatory effort."
                },
                {
                    "factor": "Regulatory Process and Timing",
                    "effect": "Strongly decreases probability. Even if a new administration or FTC leadership were to attempt reviving the rule, the rulemaking process (including notice and comment, response to legal challenges, and likely appeals) could not plausibly conclude and enact a new (or revived) ban by January 1, 2026."
                },
                {
                    "factor": "State Law Patchwork and Private Litigation",
                    "effect": "Decreases probability. With the federal rule vacated, employers and counsel are advised to follow state law, and major professional organizations are now focused on compliance with state-level restrictions rather than anticipation of a federal ban."
                },
                {
                    "factor": "FTC’s Current Enforcement Posture",
                    "effect": "Decreases probability. The FTC has publicly stated its shift to case-by-case enforcement under Section 5, issuing warning letters and consent orders targeting specific egregious cases, not a class-wide or categorical ban."
                },
                {
                    "factor": "Base Rates for Federal Labor Law Overriding State Contract Law",
                    "effect": "Decreases probability. Historically, federal labor regulations that sweepingly override state contract law, especially in the absence of explicit congressional authorization, face major judicial resistance and rarely survive in the short term."
                }
            ],
            "no_scenario": "The FTC’s ban remains vacated, with no new rulemaking or appeals initiated before January 1, 2026. State laws govern non-compete enforceability, and the FTC continues its case-by-case enforcement and public comment process. No regulatory change affecting more than a trivial share of workers occurs at the federal level before the resolution date.",
            "yes_scenario": "A highly improbable scenario would require the FTC or Congress to rapidly revive and enact a nearly identical non-compete ban, perhaps through emergency legislative action or a dramatic, successful appeal overturning the vacatur and restoring the rule before January 1, 2026. This would also require overcoming both administrative and judicial resistance and enacting the rule with at most minor changes.",
            "final_reasoning": "All available evidence points to the FTC's proposed non-compete ban being dead for the foreseeable future. The FTC has voted to abandon its appeals, formally accepted the court's vacatur, and shifted its enforcement strategy away from rulemaking. The change in presidential administration and FTC leadership has solidified this reversal. Judicial precedent, as established by the Northern District of Texas and affirmed by the FTC's withdrawal, presents a major legal obstacle to any similar rule being enacted in the near term. No legislative momentum exists to override this, and the regulatory process is too slow to allow for any meaningful reversal before the deadline. The legal, political, and practical barriers are overwhelming, and the agency's own communications are clear that a categorical ban will not be pursued further before 2026. All credible legal and labor law analyses, including those cited in the news articles, agree that the nationwide ban is off the table for the duration of this forecasting period. The only conceivable path to a 'Yes' would involve highly unlikely legal or legislative developments occurring on an implausibly short timeline.",
            "final_probability": 1
        },
        "USGovernmentRelations (LegislativeAndStakeholderEngagement)": {
            "time_to_resolution": "Approximately 2.5 months (until January 1, 2026).",
            "perspective_relevance": "As an expert in US Government Relations (Legislative and Stakeholder Engagement), my perspective is highly relevant due to direct experience with the regulatory process, administrative law, and the interplay between federal agencies, courts, and shifting political administrations. I understand how agency rulemaking can be derailed by judicial decisions and political shifts, and how rule implementation often depends on legal, political, and institutional factors beyond the initial rulemaking.",
            "status_quo": "The FTC's proposed nationwide ban on non-compete agreements for most workers is not in effect. The rule was blocked by a federal court, and as of September 2025, the FTC has officially abandoned its appeals, with new leadership publicly stating that the agency will focus on case-by-case enforcement rather than blanket rulemaking. The regulatory environment has reverted to state-level regulation and ad hoc FTC enforcement.",
            "perspective_derived_factors": [
                {
                    "factor": "Judicial Block and Vacatur",
                    "effect": "Strongly decreases probability. A nationwide injunction was granted, and the rule was vacated on grounds that the FTC lacked statutory authority. This is a high legal bar to overcome, and with appeals withdrawn, reversal is nearly impossible before 2026."
                },
                {
                    "factor": "FTC Withdrawal and Policy Shift",
                    "effect": "Strongly decreases probability. The FTC, under new (Trump-appointed) leadership, has voted to abandon the rule and withdrawn all appeals, confirming a policy shift to targeted enforcement rather than a broad rule."
                },
                {
                    "factor": "Political Environment",
                    "effect": "Strongly decreases probability. The Trump administration has rolled back numerous Biden-era rules, including this one, and installed leadership at the FTC explicitly hostile to the non-compete ban. There is no indication of a policy reversal before 2026."
                },
                {
                    "factor": "Legislative Inertia and Base Rates",
                    "effect": "Strongly decreases probability. Historically, once a federal agency rule is vacated on lack-of-authority grounds and appeals are abandoned, it is exceedingly rare for the same or a similar rule to be revived and enacted in the near term."
                },
                {
                    "factor": "Stakeholder and Legal Landscape",
                    "effect": "Strongly decreases probability. Business groups have successfully challenged the rule, and there is no indication of legislative action to override the court or clarify FTC authority before 2026."
                },
                {
                    "factor": "Case-by-Case Enforcement",
                    "effect": "Neutral to slightly decreases probability. The FTC is still pursuing targeted actions, but this does not equate to the enactment of a nationwide ban as per the original rule."
                }
            ],
            "no_scenario": "The FTC’s non-compete rule remains blocked and unenacted, with the agency focusing on case-by-case enforcement and no further appeals or attempts to revive the rule before 2026. State law continues to govern non-competes, resulting in a patchwork system.",
            "yes_scenario": "A highly improbable scenario would require a sudden reversal by the FTC and/or a successful emergency legislative or judicial action restoring the rule in its current form before 2026—despite current leadership, court rulings, and political context. There is no evidence for such a reversal.",
            "final_reasoning": "The FTC’s nationwide non-compete ban is effectively dead for the foreseeable future. The vacatur by the Northern District of Texas, subsequent withdrawal of all appeals, and explicit statements from current FTC leadership confirm that the agency will not pursue the rule, nor will it be enacted in its current form before 2026. The political environment is firmly against such regulatory action, and base rates for vacated rules being revived in the immediate term are essentially zero. All recent news articles and legal commentary corroborate this. The only remote path to a 'Yes' outcome would involve an unprecedented, immediate, and well-publicized reversal by the Trump administration or Congress—none of which is visible or plausible within the remaining timeframe.",
            "final_probability": 0
        },
        "Law (AdministrativeProceduresActDoctrine)": {
            "time_to_resolution": "About 2.5 months (question resolves January 1, 2026; today is October 13, 2025)",
            "perspective_relevance": "As an expert in Administrative Procedure Act (APA) doctrine and regulatory authority, I bring a deep understanding of how administrative agencies like the FTC can (and cannot) regulate under their enabling statutes, the limits set by courts—especially recent expansions of the 'major questions doctrine'—and how political shifts affect agency rulemaking and enforcement. This perspective is paramount for assessing whether the FTC's non-compete ban could still be enacted before 2026, given the legal and political landscape.",
            "status_quo": "The FTC's nationwide non-compete ban was vacated by a federal court (Northern District of Texas) as exceeding the FTC's statutory authority and being arbitrary and capricious under the APA. The FTC, under new leadership, has dropped its appeals and officially abandoned the rule, pivoting to case-by-case enforcement. State law continues to govern non-compete enforceability, with a patchwork of rules across the country.",
            "perspective_derived_factors": [
                {
                    "factor": "Judicial Vacatur and Precedent",
                    "effect": "Strongly decreases probability; the final rule was vacated nationwide and the district court's rationale (FTC lacks statutory authority; major questions doctrine) creates a high bar for revival of the rule in current form before 2026."
                },
                {
                    "factor": "Agency Abandonment and Political Shift",
                    "effect": "Strongly decreases probability; the FTC has officially voted to abandon the rule, withdrawn all appeals, and shifted to targeted enforcement. The Trump administration's regulatory approach is deregulatory and opposed to the rule."
                },
                {
                    "factor": "Timeline and Administrative Law Constraints",
                    "effect": "Strongly decreases probability; with less than three months left, any attempt to revive the rule would require a new rulemaking process (including notice-and-comment) or a dramatic, unlikely court reversal. The APA and Chevron/Major Questions jurisprudence make such a turnaround impossible within the timeframe."
                },
                {
                    "factor": "State Law Patchwork",
                    "effect": "Slightly decreases probability; with federal action off the table, regulation defaults to a non-uniform, state-by-state approach. No mechanism exists for emergency federal preemption by the FTC in this area before 2026."
                },
                {
                    "factor": "Potential for Supreme Court or Legislative Intervention",
                    "effect": "Minimally increases probability; theoretically, Congress could enact a statutory ban or the Supreme Court could reverse lower courts, but neither is plausible before January 2026 given the legislative calendar and the Court's current docket and jurisprudence."
                },
                {
                    "factor": "FTC's Continued Enforcement Focus",
                    "effect": "Slightly increases probability of some regulatory action, but not of enacting the original rule in 'more or less its current form'; targeted enforcement does not amount to rule enactment."
                }
            ],
            "no_scenario": "The FTC's appeals are dismissed, the agency makes no effort to re-promulgate the rule, and the status quo (state-by-state regulation, case-by-case FTC enforcement under Section 5) continues through January 1, 2026. No national ban is ever enacted, let alone in the original or substantially similar form.",
            "yes_scenario": "An extremely unlikely scenario: A successful emergency motion for reconsideration leads to the Fifth Circuit or Supreme Court reversing the Texas district court (despite the FTC abandoning appeals), or a new administration/FTC majority rapidly re-promulgates the rule and it survives all legal challenges before January 1, 2026. Alternatively, Congress enacts a statutory non-compete ban mirroring the FTC rule (again, highly improbable in the current political climate and timeframe).",
            "final_reasoning": "The overwhelming weight of evidence shows the FTC's non-compete ban is dead: the agency has voted to abandon the rule, dismissed appeals, and switched to a case-by-case enforcement model, explicitly rejecting the blanket ban approach. The Texas district court's vacatur is nationwide and rests on strong, Supreme Court-aligned 'major questions' reasoning, leaving little to no legal pathway for the rule's resurrection without new statutory authority. No emergency legislative action is on the horizon, and the short window before January 2026 makes any administrative or judicial about-face impossible. News articles repeatedly confirm the abandonment of the rule, the lack of further appeals, and the restoration of state-led regulation. There is no plausible scenario—legally, administratively, or politically—by which the FTC's original rule (or anything close) can be enacted before the deadline. The only reason not to forecast 0% is for extreme tail risks (e.g., sudden, unprecedented Congressional action), but these are functionally negligible.",
            "final_probability": 1
        },
        "Law (ChevronDeference)": {
            "time_to_resolution": "About 2.5 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in law, specifically in administrative law and Chevron deference, my perspective is critical for understanding the legal and regulatory processes by which federal agencies like the FTC enact nationwide rules, the limits of their statutory authority, the impact of judicial review, and the shifting legal landscape following recent Supreme Court decisions. I can assess how the legal doctrines governing agency power and court deference have shaped the outcome of the FTC's non-compete rule, and how recent cases and political changes have influenced administrative actions.",
            "status_quo": "The FTC's nationwide ban on non-compete agreements for most workers has been vacated by federal courts, and as of September 2025, the FTC has officially abandoned its rulemaking and appeals, stating it will instead pursue targeted enforcement against egregious non-compete agreements on a case-by-case basis. The regulatory environment has reverted to a patchwork of state laws, with no federal blanket ban in effect.",
            "perspective_derived_factors": [
                {
                    "factor": "Withdrawal of FTC Appeals and Rulemaking",
                    "effect": "Decreases probability. The FTC's voluntary dismissal of its appeals and abandonment of the rule signifies institutional acceptance that the rule will not take effect before 2026."
                },
                {
                    "factor": "Judicial Rulings on FTC Authority",
                    "effect": "Decreases probability. Courts have ruled that the FTC lacks statutory authority for such sweeping labor market regulations, and the 'major questions doctrine' (as clarified in recent Supreme Court cases) further limits agency power absent clear congressional authorization."
                },
                {
                    "factor": "Change in FTC Leadership and Administration Policy",
                    "effect": "Decreases probability. The Trump administration has shifted the FTC's focus from rulemaking to case-by-case enforcement, aligning with ideological and legal skepticism of broad regulatory action by executive agencies."
                },
                {
                    "factor": "No Pending Appeals or Prospects for Immediate Reversal",
                    "effect": "Decreases probability. With the appeals dismissed and no indication of imminent congressional action to authorize the rule, there is no realistic legal path for the rule to be enacted in its current form by the resolution deadline."
                },
                {
                    "factor": "State Law Patchwork and Targeted FTC Enforcement",
                    "effect": "Neutral to slightly decreases probability. While some states have enacted their own restrictions, these do not constitute a federal rule, and the FTC's new approach is targeted and incremental, not a blanket ban."
                },
                {
                    "factor": "Base Rate of Federal Rules Overturned After Court Defeat and Rescinded by Agencies",
                    "effect": "Decreases probability. Historically, once a federal rule is struck down and the agency abandons appeals, re-enactment before a near-term deadline is extremely rare, especially when the administration is hostile to the rule."
                }
            ],
            "no_scenario": "The FTC, having abandoned both the appeals and the rule itself, does not attempt further rulemaking before 2026. No congressional legislation restores or authorizes a similar ban. Enforcement of non-competes remains governed by state law and occasional targeted FTC enforcement under existing antitrust statutes, but no nationwide ban is enacted.",
            "yes_scenario": "A highly implausible scenario where, despite the FTC's abandonment, a dramatic legal or political reversal occurs—such as a sudden change in administration, a successful emergency appeal, or rapid congressional action granting explicit authority and re-promulgating a substantially similar rule—leading to the rule being enacted in more or less its current form before January 1, 2026.",
            "final_reasoning": "All available evidence—including the FTC's formal abandonment of the rule and appeals, public statements from current FTC leadership, multiple legal analyses, and the lack of any pending legal or legislative efforts to revive the rule—shows that the FTC's nationwide non-compete ban will not be enacted before 2026. The courts found the FTC lacked authority, the administration has accepted this outcome, and no further legal avenues are being pursued. The regulatory environment has clearly shifted back to state law and targeted enforcement, not blanket federal prohibition. The base rate for a rule in this posture being revived within a short timeframe is near zero. Thus, the probability that the FTC's proposed ban on non-compete agreements for most workers will be enacted in more or less its current form before 2026 is functionally zero.",
            "final_probability": 0
        },
        "Law (MajorQuestionsDoctrine)": {
            "time_to_resolution": "About 2.5 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Law with a focus on the Major Questions Doctrine, my perspective is critical here because the validity of the FTC's non-compete ban turned on whether the agency possessed the statutory authority to issue such a sweeping rule—a classic 'major question' implicating separation of powers and the outer bounds of agency power. Recent jurisprudence has sharply curtailed agency ability to make broad economic rules without clear congressional authorization, a trend that has directly shaped the outcome of this rule.",
            "status_quo": "The FTC's nationwide non-compete ban is dead: the agency has officially withdrawn its appeals, accepted the vacatur of the rule, and stated it will not pursue blanket rulemaking in this area. Enforcement will occur, if at all, on a case-by-case basis under existing antitrust and contract law. Employers now face a patchwork of state law, not a sweeping federal prohibition.",
            "perspective_derived_factors": [
                {
                    "factor": "Major Questions Doctrine and Judicial Precedent",
                    "effect": "Decreases probability. Courts, especially the Northern District of Texas and the Fifth Circuit, have explicitly found that the FTC lacks clear congressional authority for such a broad rule under the FTC Act, invoking the Major Questions Doctrine. Supreme Court decisions in 2022-2025 have further entrenched this doctrine, chilling agency ambition."
                },
                {
                    "factor": "Change in FTC and Presidential Administration",
                    "effect": "Decreases probability. The Trump administration replaced FTC leadership, who promptly withdrew appeals and abandoned the rulemaking, cementing the agency's new, narrow enforcement posture."
                },
                {
                    "factor": "No Ongoing Appeals or Legislative Rescue",
                    "effect": "Decreases probability. The FTC has voluntarily dismissed its appeals, and there is no sign of congressional action to explicitly authorize a ban. The issue is not live before any court, and there is no pending administrative or legislative vehicle to revive the ban before 2026."
                },
                {
                    "factor": "Stated Agency Strategy Post-Vacatur",
                    "effect": "Decreases probability. The FTC is now pursuing targeted, case-by-case enforcement and public inquiry rather than rulemaking, signaling that no blanket rule will be pursued or enacted in the current time frame."
                },
                {
                    "factor": "Political and Legal Backdrop",
                    "effect": "Decreases probability. The current administration is conducting widespread rollbacks of Biden-era regulatory initiatives, as evidenced by similar reversals in other policy areas. The political will for a federal ban is absent."
                }
            ],
            "no_scenario": "The scenario that has occurred: the FTC's ban is enjoined, vacated, and then officially abandoned. The agency does not re-issue the rule, no new appeals are filed, and Congress does not act to clarify or expand the FTC's authority. Enforcement of non-competes reverts to state law and selective federal enforcement against egregious cases under existing statutes.",
            "yes_scenario": "A highly unlikely scenario where, before January 1, 2026, either the FTC reverses course (perhaps by a dramatic change in administration or commission composition), Congress passes clear authorizing legislation, and/or a new rule is rapidly promulgated and survives judicial review without major changes. There is no credible evidence for any of these developments in the news or legal docket.",
            "final_reasoning": "All major indicators point to a definitive 'No.' The FTC has officially abandoned both the rule and the appeals, with the new chair and majority unequivocally stating the agency will not pursue rulemaking in this area. The courts have found, under the Major Questions Doctrine, that the FTC lacks authority for such a sweeping rule—an outcome reinforced by recent Supreme Court precedent. No pending litigation or regulatory process exists that could plausibly reinstate the rule in more or less its original form before 2026. The status quo is now a patchwork of state law, with the FTC confined to narrow, case-specific enforcement. Absent a shock reversal in administration or a legislative rescue, neither of which has any supporting evidence, the probability that the FTC's ban is enacted in more or less its current form before 2026 is effectively zero.",
            "final_probability": 0
        },
        "PoliticalScience (SeparationOfPowersTheory)": {
            "time_to_resolution": "Approximately 2.5 months (until January 1, 2026).",
            "perspective_relevance": "My expertise in Political Science, specifically Separation of Powers Theory, is crucial for assessing the interplay between the executive branch (FTC as an independent agency, now under a Trump-appointed Chair), the judiciary (federal courts' rulings and injunctions), and the legislature (potential for congressional override or new legislation). This perspective helps clarify the institutional constraints and possibilities for regulatory enactment or rollback, especially in the context of a major regulatory initiative facing significant judicial and partisan opposition.",
            "status_quo": "The FTC's nationwide non-compete ban is not in effect. The rule was enjoined and vacated by federal courts, and as of September 2025, the FTC has abandoned all appeals and officially withdrawn the rule. Enforcement against non-competes now proceeds on a case-by-case basis under existing antitrust law; state laws remain the primary regulatory framework.",
            "perspective_derived_factors": [
                {
                    "factor": "Judicial Block and Precedent",
                    "effect": "Strongly decreases probability. The rule was vacated by a federal court, and the FTC has dropped all appeals, leaving a clear legal precedent that the FTC lacks statutory authority for such a sweeping rule."
                },
                {
                    "factor": "Executive Branch Shift",
                    "effect": "Strongly decreases probability. The Trump administration has installed a new FTC Chair who is ideologically opposed to the ban and prefers targeted enforcement, not broad rulemaking. This represents a clear change in policy direction."
                },
                {
                    "factor": "Agency Abandonment of Rulemaking",
                    "effect": "Strongly decreases probability. The FTC has officially withdrawn the rule, dismissed appeals, and publicly stated it will not pursue the nationwide ban, focusing instead on case-by-case enforcement."
                },
                {
                    "factor": "Congressional Inaction",
                    "effect": "Decreases probability. There is no indication of imminent congressional action to override court decisions or pass a similar ban through statute, and the current congressional composition is not conducive to such action."
                },
                {
                    "factor": "State Regulatory Patchwork",
                    "effect": "Marginally decreases probability. State laws may continue to evolve, but this does not meet the federal enactment criteria specified by the question."
                },
                {
                    "factor": "Path Dependence and Bureaucratic Inertia",
                    "effect": "Marginally decreases probability. Once a rule is withdrawn and the agency's leadership and legal rationale have shifted, the likelihood of rapid reversal is extremely low, especially within the short remaining timeframe."
                },
                {
                    "factor": "Base Rate for Major Rule Resurrection Post-Vacatur",
                    "effect": "Strongly decreases probability. Historically, rules vacated and abandoned at both the agency and judicial levels are almost never resurrected in their original form within months, especially after a change in administration."
                }
            ],
            "no_scenario": "The status quo holds: the FTC's ban on non-competes remains vacated, no further appeals or rulemaking are pursued, and the agency sticks to case-by-case enforcement under existing antitrust law. No congressional action is taken. Employers continue to operate under a patchwork of state laws.",
            "yes_scenario": "A highly improbable scenario: In the next 2.5 months, the FTC abruptly reverses its course (despite current leadership and public statements), re-initiates rulemaking or litigation, rapidly overcomes existing court injunctions and vacatur, and re-enacts the rule with at most minor changes before January 1, 2026. Alternatively, Congress passes a statute enacting a similar ban with the same scope on a compressed timeline, which is not supported by current legislative activity.",
            "final_reasoning": "All available evidence from credible legal, regulatory, and news sources confirms that the FTC's non-compete ban is dead: the rule has been vacated by the courts, the FTC has dropped all appeals, and the new Trump-appointed FTC Chair has explicitly abandoned nationwide rulemaking in favor of a case-by-case enforcement strategy. There is no sign of congressional intervention or statutory override. The history of federal regulatory policy shows that, once a rule is vacated, abandoned, and leadership has shifted, the probability of resurrection within months is essentially zero. The only possible scenario for a 'Yes' would require an unprecedented, near-immediate reversal by the FTC or Congress, neither of which is remotely plausible given the current political and institutional context. The base rate for such a reversal is effectively zero, and the status quo is reinforced by both political and legal inertia. Therefore, the probability that the FTC's proposed ban on non-competes will be enacted in more or less its current form before 2026 is virtually nil.",
            "final_probability": 0
        },
        "PoliticalScience (PolicyProcessModel)": {
            "time_to_resolution": "Approximately 2.5 months (until January 1, 2026).",
            "perspective_relevance": "As an expert in Political Science with a focus on the Policy Process Model, I bring a structured understanding of how federal regulations are formulated, contested, and either implemented or abandoned in the US political system. This includes the influence of administrative law, federalism, political transitions, judicial review, and the path dependencies that generally favor the status quo, especially when authority is contested or opposed by powerful stakeholders. My perspective allows me to contextualize agency rulemaking within broader patterns of regulatory rollback during partisan transitions, the influence of courts, and the practical implementation barriers for major regulatory changes.",
            "status_quo": "The FTC's proposed ban on non-compete agreements for most workers is not enacted, following legal challenges and the agency's voluntary dismissal of its appeals. Regulation of non-competes is returned to the patchwork of state law and case-by-case FTC enforcement, rather than a blanket federal ban.",
            "perspective_derived_factors": [
                {
                    "factor": "Judicial Rulings and Legal Authority",
                    "effect": "Strongly decreases probability. Courts have ruled that the FTC lacks authority to enact such a sweeping ban, and these rulings have not been overturned. The rule was vacated nationwide by a district court, and appellate efforts have been withdrawn."
                },
                {
                    "factor": "Change in Administration and FTC Leadership",
                    "effect": "Strongly decreases probability. The transition to a Trump administration has resulted in a new FTC chair and majority, who have explicitly rejected the rule and shifted strategy from rulemaking to targeted enforcement."
                },
                {
                    "factor": "Policy Process Inertia and Status Quo Bias",
                    "effect": "Decreases probability. Major regulatory reversals are rare in the short term, especially after a rule is vacated and the agency has signaled no intention to pursue further appeals or a new rulemaking process."
                },
                {
                    "factor": "Stakeholder and Interest Group Opposition",
                    "effect": "Decreases probability. Powerful business groups (e.g., Chamber of Commerce) successfully litigated against the rule and would likely contest any attempt to revive it, especially in the current political climate."
                },
                {
                    "factor": "State-Level Policy Divergence",
                    "effect": "Neutral to slightly decreases probability. While some states continue to tighten non-compete restrictions, the absence of federal preemption means no nationwide ban in the FTC's form is likely before 2026."
                },
                {
                    "factor": "Administrative and Legislative Pathways",
                    "effect": "Decreases probability. No congressional action is pending or likely to support the ban, and the FTC has publicly announced the end of its rulemaking push, focusing instead on case-by-case enforcement."
                }
            ],
            "no_scenario": "The FTC does not re-initiate or succeed in any appeals, does not attempt a new rulemaking, and the courts' vacatur of the rule stands. The agency continues its targeted enforcement actions under existing statutes, but no federal blanket ban is enacted. Employers continue to follow state law, with no significant federal change before January 2026.",
            "yes_scenario": "An extraordinary reversal occurs: the FTC, under political or legal pressure, rapidly re-engages in rulemaking, overcomes both legal and administrative barriers, and manages to reinstate a substantially similar rule that survives judicial scrutiny and is enacted before January 1, 2026. This would likely require either an unexpected court decision in favor of the FTC’s authority or an act of Congress, both highly improbable in the current environment.",
            "final_reasoning": "The base rate for major federal regulations being enacted after a nationwide judicial vacatur and the agency’s public abandonment of the rule is extremely low, particularly in the face of a hostile administration and clear judicial precedent. The FTC’s abandonment of its appeals, public statements from the new chair, and the shift to case-by-case enforcement all signal that the blanket ban is off the table for the foreseeable future. The political, legal, and administrative obstacles are overwhelming, with no plausible pathway for the rule to be enacted in anything like its original form before 2026. All recent news articles and official statements confirm the abandonment of the rule, the lack of further appeals, and the entrenchment of the status quo. As such, the probability of a Yes outcome is near zero, consistent with both base rates and the current facts.",
            "final_probability": 1
        },
        "Economics (LaborMarketRegulationTheory)": {
            "time_to_resolution": "About 2.5 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Economics (LaborMarketRegulationTheory), I analyze the intersection of labor market outcomes, regulatory frameworks, and institutional inertia. This perspective is crucial for evaluating the likelihood of sweeping labor regulations—such as the FTC’s non-compete ban—surviving legal, political, and bureaucratic hurdles in the U.S. context. My approach incorporates base rates for major federal labor-market interventions, the path-dependence of regulatory change, interest-group dynamics, and the role of administrative law.",
            "status_quo": "The FTC’s nationwide non-compete ban has been vacated by federal courts and the agency has officially abandoned both the rule and its appeals as of September 2025. Non-compete regulation is now governed by the pre-existing patchwork of state laws and selective FTC enforcement actions. No federal blanket ban is in effect.",
            "perspective_derived_factors": [
                {
                    "factor": "Legal Defeat and Voluntary Dismissal",
                    "effect": "Strongly decreases probability; the FTC not only lost in court (on both authority and substantive grounds), but has now officially withdrawn its appeals, acceding to vacatur. This is typically fatal for near-term enactment."
                },
                {
                    "factor": "Regime Change and Political Environment",
                    "effect": "Decreases probability; the Trump administration and newly appointed FTC Chair Andrew Ferguson are hostile to the rule, favoring case-by-case enforcement rather than rulemaking, and have directed the agency to abandon the ban."
                },
                {
                    "factor": "Administrative Law and Major Questions Doctrine",
                    "effect": "Decreases probability; recent Supreme Court decisions and district court interpretations have sharply limited agency power to engage in major substantive rulemaking absent clear congressional authorization."
                },
                {
                    "factor": "Interest Group and Business Opposition",
                    "effect": "Decreases probability; powerful business lobbies (e.g., Chamber of Commerce) have successfully litigated against the rule, indicating sustained, high-capacity opposition to any similar last-minute regulatory attempt."
                },
                {
                    "factor": "Labor Market Pressures and State-Level Trends",
                    "effect": "Slightly increases probability, but only for incremental change; some states have continued to restrict non-competes, and there is public support for reform, but this is channeled through state, not federal, action in the current climate."
                },
                {
                    "factor": "FTC’s New Enforcement Strategy",
                    "effect": "Decreases probability for blanket ban, but signals continued (but narrower) regulatory focus; the pivot to targeted enforcement is a clear retreat from universal regulation and will not meet resolution criteria."
                }
            ],
            "no_scenario": "The current situation persists: the FTC’s nationwide non-compete rule remains vacated, the agency does not attempt to reissue the rule, and regulation continues under a patchwork of state laws and limited FTC enforcement on a case-by-case basis. No new federal rule meeting the original scope is enacted before January 1, 2026.",
            "yes_scenario": "A highly implausible scenario: the FTC somehow revives a near-identical rule, overcomes both the courts’ and the Trump administration’s opposition, and enacts the nationwide ban before January 1, 2026—perhaps due to a dramatic and rapid political or legal reversal (e.g., a Supreme Court ruling overturning the district court, restoration of a Democratic majority on the FTC, and an emergency re-promulgation of the rule). There is no evidence for such developments in the next 2.5 months.",
            "final_reasoning": "All key indicators point toward a NO outcome. The FTC has officially abandoned the rule and its appeals, and the agency’s leadership and strategy have changed decisively under the Trump administration. Multiple news reports document that the nationwide ban is 'dead,' and the FTC now pursues only case-by-case enforcement. The legal basis for the original rule is now even more tenuous given the major questions doctrine and recent court decisions. There is no plausible legal, political, or administrative path for the blanket ban to be revived and enacted in its current form before the resolution date. The status quo is entrenched, and the base rate for a major labor-market regulation being revived and enacted after judicial and agency abandonment within months is close to zero.",
            "final_probability": 1
        }
    },
    "deliberation_probability": [
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1
    ],
    "deliberation_mean_probability": 1.0,
    "deliberation_sd": 0.0,
    "deliberation_probability_result": 1,
    "group_results": {
        "regulatoryaffairsFederalrulemakingprocess": {
            "forecaster_to_engage": "LaborLawPractice (EmploymentAgreementCompliance)",
            "response_type": "critique",
            "response": "You gave this a probability of 1%—but that’s just hedging for the sake of hedging, not out of any reality-based scenario. You outline all the same fatal obstacles as the rest of us: the FTC has explicitly abandoned the rule and appeals, the administration is hostile, the courts have ruled against the agency’s authority, and no legal or regulatory process to revive the rule exists. Yet you still cling to a token 1% as if some deus ex machina will descend to resurrect a dead rule in a matter of weeks. The base rate for this kind of regulatory resurrection is not just 'implausibly short'—it’s zero. Giving even 1% implies you see a remotely plausible path, but your own reasoning says otherwise. Forecasting isn’t about leaving a superstitious sliver of possibility; it’s about calling it as it is. Zero means zero, and the evidence is overwhelming. Own it."
        },
        "laborlawpracticeEmploymentagreementcompliance": {
            "forecaster_to_engage": "Law (MajorQuestionsDoctrine)",
            "response_type": "defense",
            "response": "Major kudos for spelling it out with such clarity—this is a textbook example of how the Major Questions Doctrine slams the door shut on overreaching administrative action. The FTC’s non-compete rule wasn’t just blocked on technicalities; it was eviscerated on the core question of statutory authority, with the courts invoking Supreme Court precedent to say, 'Not so fast, regulators.' Your dismissal of tail-risk scenarios is spot on: there is no legislative cavalry, no sudden judicial reversal, and no agency left willing to fight. The only way this could possibly be revived in time would be via a legislative miracle or a judicial about-face so unprecedented it would make headlines for decades. That’s not forecasting, that’s science fiction. Your zero percent is empirically and doctrinally justified—no apologies needed."
        },
        "usgovernmentrelationsLegislativeandstakeholderengagement": {
            "forecaster_to_engage": "Law (ChevronDeference)",
            "response_type": "defense",
            "response": "Absolutely correct—Chevron deference is dead as a doctrinal tool for agency latitude in this context, and your forecast reflects that reality. The combination of explicit judicial vacatur for lack of statutory authority, the FTC's full retreat, and the absence of any pending legal or political effort to revive the rule means there is no plausible regulatory pathway left. Anyone clinging to a nonzero probability is ignoring not only doctrine but the agency's own public statements and the clear signals from both the White House and the courts. Your base-rate thinking is on point: once a rule is vacated and the agency walks away, there is no precedent for a miraculous comeback in the same form, especially under a hostile administration. Zero is the only defensible answer."
        },
        "lawAdministrativeproceduresactdoctrine": {
            "forecaster_to_engage": "PoliticalScience (PolicyProcessModel)",
            "response_type": "critique",
            "response": "You land at 1% probability, but your own reasoning never once describes a real-world process that could actually deliver a Yes outcome before 2026. Invoking 'base rates' is great—but the base rate for a vacated, abandoned rule being revived and enacted in months is not just 'extremely low', it's zero. All your cited obstacles—hostile administration, adverse court precedent, public abandonment—are absolute, not merely unlikely. By leaving a sliver for 'tail risk', you imply there is something in the pipeline (emergency legislation, judicial reversal, agency whiplash) when every observable fact says otherwise. Forecasting isn't about being bashful with zero; it's about accurately representing when the door is shut. Give up the 1% security blanket and call it what it is: impossible."
        },
        "lawChevrondeference": {
            "forecaster_to_engage": "Economics (LaborMarketRegulationTheory)",
            "response_type": "defense",
            "response": "This is one of the few forecasts that doesn't just regurgitate legalese but actually understands the regulatory base rate and labor market context. You nailed it: after a rule is vacated, abandoned, and the agency pivots to piecemeal enforcement, the empirical odds of a blanket rule being resurrected and enacted in months are effectively zero. The legal and political obstacles are not just high—they're absolute. Your skepticism of 'plausible legal, political, or administrative path' is exactly right. Anyone still talking about 1% tail risk is ignoring decades of regulatory history and the institutional reality. You’re not just following doctrine, you’re following the money—and the money says zero."
        },
        "lawMajorquestionsdoctrine": {
            "forecaster_to_engage": "PoliticalScience (SeparationOfPowersTheory)",
            "response_type": "defense",
            "response": "Your argument is refreshingly direct and gets to the heart of why this rule is dead: not just because of legal doctrine, but because of the entrenched power dynamics and inertia within the American separation of powers. Once a rule is vacated, the agency retreats, and a new administration is actively hostile, the odds of resurrection are not merely vanishingly small—they are functionally zero. You rightly dismiss the fantasy of congressional or agency whiplash as 'unprecedented.' The base rate for a rule in this posture coming back, especially under current political conditions, is nil. You avoid the common trap of hedging for the sake of hedging. This is how a cold-eyed political scientist should call it."
        },
        "politicalscienceSeparationofpowerstheory": {
            "forecaster_to_engage": "RegulatoryAffairs (FederalRulemakingProcess)",
            "response_type": "defense",
            "response": "RegulatoryAffairs, you hit the nail on the head by refusing to indulge in token hedging. The regulatory process isn't magic—once an agency formally abandons a rule, withdraws all appeals, and the courts have spoken with a full vacatur, that's game over. Your invocation of base rates is correct: the empirical record for a rule returning from this position, especially with a hostile administration and explicit judicial rejection, is zero. There's no plausible scenario for a regulatory Lazarus act in the remaining timeframe. Anyone suggesting otherwise is misunderstanding both the administrative state and regulatory inertia. Zero is the only logical and evidence-based forecast here."
        },
        "politicalsciencePolicyprocessmodel": {
            "forecaster_to_engage": "Law (AdministrativeProceduresActDoctrine)",
            "response_type": "critique",
            "response": "You call out the 1% tail risk in others, but let's be clear—your legal reasoning is unassailable, but you don't go far enough in trashing the idea of any plausible path for a Yes. The Administrative Procedure Act isn't some mystical loophole that can conjure a rule back from the dead in two months flat, especially once the agency has publicly walked away and the courts have slammed the door shut. You correctly highlight the nationwide vacatur and absence of legal process, but you hedge slightly by invoking 'extreme tail risks.' In reality, even the most rabid administrative law fantasist can't describe a sequence of events—legally, politically, procedurally—that gets this ban enacted before 2026. Zero means zero: don't give the doomsday preppers and miracle-mongers an inch."
        },
        "economicsLabormarketregulationtheory": {
            "forecaster_to_engage": "PoliticalScience (PolicyProcessModel)",
            "response_type": "critique",
            "response": "You give a 1% probability, but your own reasoning admits every single door is closed—no legal, administrative, or policy pathway leads to a Yes in the timeframe. Base rates matter, but the base rate for a rule this dead, abandoned, and vacated to suddenly spring back to life is not 'extremely low,' it's literally zero. There is no hidden process, no black swan legislative rescue, no pending appeal—nothing. By allowing a 1% tail, you're not forecasting, you're just refusing to commit to the reality your own argument spells out. If we can't call this a zero, what would ever qualify? The only honest answer is zero."
        }
    },
    "revision_results": {
        "RegulatoryAffairs (FederalRulemakingProcess)": {
            "my_phase1_final_probability": 0,
            "reasoning_for_revised_probability": "After reviewing my initial forecast and the group deliberation, I see nothing in the arguments or evidence presented that would warrant any revision upward from zero. Every forecaster, despite some hedging with a 1% probability, agrees that the legal, administrative, and political barriers are insurmountable within the required timeframe. The FTC has officially abandoned the rule and its appeals, and there is no plausible pathway for resurrection before 2026. The base rate for such a regulatory reversal is effectively zero. Assigning anything above 0% would require ignoring both historical precedent and the current facts.",
            "revised_probability": 0
        },
        "LaborLawPractice (EmploymentAgreementCompliance)": {
            "my_phase1_final_probability": 1,
            "reasoning_for_revised_probability": "The group deliberation, particularly the critique from the RegulatoryAffairs (FederalRulemakingProcess) forecaster, reinforced that even a 1% probability overstates the chance of the FTC's non-compete ban being enacted before 2026. The base rate for a federal rule abandoned both by agency and courts to be revived in an unchanged form, in this timeframe, is effectively zero. No plausible legal, legislative, or procedural path exists for reversal. My initial 1% was a nod to theoretical tail risks, but in reality, those are not justified given the overwhelming evidence and context. The probability should be set at zero.",
            "revised_probability": 0
        },
        "USGovernmentRelations (LegislativeAndStakeholderEngagement)": {
            "my_phase1_final_probability": 0,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, my stance is completely reinforced. Other experts across administrative law, regulatory affairs, political science, and economics unanimously identify the same hard barriers: the FTC's abandonment of the rule, a hostile administration, ironclad court rulings based on the Major Questions Doctrine, and the lack of any legal, legislative, or procedural vehicle for revival before 2026. Not a single forecaster presents a credible path to a Yes outcome, and the only outliers (1% forecasts) are criticized as unjustified hedges. The base rate for this type of regulatory resurrection remains zero. There is no new evidence or argument that warrants an upward adjustment.",
            "revised_probability": 0
        },
        "Law (AdministrativeProceduresActDoctrine)": {
            "my_phase1_final_probability": 1,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, it's clear that all expert perspectives—regulatory, legislative, doctrinal, and policy—converge on the same conclusion: there is no plausible legal, administrative, or political path for the FTC's non-compete rule to be enacted in more or less its current form before January 1, 2026. The rule was vacated on major questions grounds, the FTC has abandoned its appeals, and the agency and administration have made their opposition explicit. No pending or imminent legislative or judicial action could reverse this outcome in the remaining timeframe. The argument for even a 1% probability is entirely theoretical and unsupported by actual process or precedent. The logical and evidence-based forecast is 0%.",
            "revised_probability": 0
        },
        "Law (ChevronDeference)": {
            "my_phase1_final_probability": 0,
            "reasoning_for_revised_probability": "After reviewing both my initial reasoning and the group deliberation, I see unanimous and well-supported agreement across legal, regulatory, and policy perspectives that the probability of the FTC's non-compete ban being enacted in its current form before 2026 is effectively zero. The group reaffirmed that the rule is not just unlikely, but functionally impossible given court decisions, agency abandonment, and the hostile political climate. No new plausible scenarios or dissenting arguments emerged during deliberation to justify even a sliver of probability. Therefore, I see no reason to revise my initial forecast.",
            "revised_probability": 0
        },
        "Law (MajorQuestionsDoctrine)": {
            "my_phase1_final_probability": 0,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, there is no new evidence or argument that would justify revising my initial probability. All participating forecasters—across regulatory, legal, political, and economic perspectives—converge on the same conclusion: there is no plausible legal, administrative, or political path for the FTC's non-compete ban to be enacted in more or less its original form before 2026. The scant 1% probabilities cited by a few are thoroughly critiqued as unwarranted hedging, and the base rate for revival of a vacated, abandoned rule under hostile leadership is functionally zero. No new facts or overlooked scenarios have emerged to alter this judgment.",
            "revised_probability": 0
        },
        "PoliticalScience (SeparationOfPowersTheory)": {
            "my_phase1_final_probability": 0,
            "reasoning_for_revised_probability": "After reviewing both my initial analysis and the group deliberation, I see overwhelming consensus across legal, political, regulatory, and economic perspectives that the probability of the FTC's non-compete ban being enacted before 2026 is zero. The critiques of hedged 1% forecasts are compelling—there is no plausible legal, administrative, or political pathway for revival within the given timeframe. The status quo has been entrenched at every institutional level, and the base rate for such a reversal is empirically zero. No new information or argument in the group deliberation suggests any nonzero probability is warranted.",
            "revised_probability": 0
        },
        "PoliticalScience (PolicyProcessModel)": {
            "my_phase1_final_probability": 1,
            "reasoning_for_revised_probability": "The group deliberation overwhelmingly confirmed and even strengthened the rationale for a 0% probability, with every knowledgeable forecaster across regulatory, legal, political, and economic domains emphasizing the impossibility of the FTC's non-compete ban being enacted before 2026. There is unanimous agreement: no legal, administrative, or political path exists for revival, and the base rate for a rule in this posture being resurrected is empirically zero. The critique of even a token 1% as superstitious hedging is compelling and accurate. All observable evidence and expert consensus point to zero as the only defensible forecast.",
            "revised_probability": 0
        },
        "Economics (LaborMarketRegulationTheory)": {
            "my_phase1_final_probability": 1,
            "reasoning_for_revised_probability": "After reviewing both my initial forecast and the group deliberation, I find strong consensus across all relevant domains—legal, regulatory, political, and economic—that the probability of the FTC's non-compete ban being enacted in more or less its current form before 2026 is effectively zero. Multiple forecasters with expertise in administrative law, federal rulemaking, and political science all independently converge on a 0% or 1% estimate, with robust arguments that there is no plausible legal, procedural, or political path for revival. The critique of even a token 1% as unwarranted hedging is persuasive: there are no ongoing appeals, no pending legislative fixes, and the FTC has publicly and formally abandoned the rule. The base rate for a rule in this posture being revived is not just 'vanishingly small' but empirically zero. Therefore, I am revising my probability down to 0%.",
            "revised_probability": 0
        }
    },
    "revision_probability": [
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1
    ],
    "revision_mean_probability": 1.0,
    "revision_sd": 0.0,
    "revision_probability_result": 1,
    "question_details": {
        "id": 38814,
        "title": "Will the FTC's proposed ban on non-compete agreements for most workers be enacted in more or less its current form before 2026?",
        "created_at": "2025-08-31T05:08:15.152606Z",
        "open_time": "2025-09-29T05:00:39Z",
        "cp_reveal_time": "2025-09-29T06:30:39Z",
        "spot_scoring_time": "2025-09-29T06:30:39Z",
        "scheduled_resolve_time": "2026-01-01T15:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-09-29T06:30:39Z",
        "actual_close_time": "2025-09-29T06:30:39Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "This question is synced with an identical question on Metaculus. The original question opened on 2025-01-01 09:31:03 and can be found [here](https://www.metaculus.com/questions/31227). This question will resolve to the same value as the synced question. The original question's background info at this time is below. \n\nIn April 2024, the Federal Trade Commission (FTC) issued a [final rule](https://www.ftc.gov/news-events/news/press-releases/2024/04/ftc-announces-rule-banning-noncompetes) banning most non-compete agreements in the United States, claiming that this would generate over 8,500 new businesses each year, raise worker wages, lower health care costs, and boost innovation. The rule would prohibit employers from entering into or enforcing non-compete clauses with workers, including employees and independent contractors, with limited exceptions for senior executives. Employers would be required to rescind existing non-compete agreements and notify affected workers that such clauses are no longer in effect.\n\nThe rule was scheduled to take effect on September 4, 2024, however, on August 20, 2024, Judge Ada Brown of the U.S. District Court for the Northern District of Texas [blocked the rule](https://hrdailyadvisor.blr.com/2024/10/11/after-judge-blocks-ftcs-worker-non-compete-ban-now-what/) nationwide, ruling that the FTC lacked the statutory authority to implement such a ban and that the rule was \"arbitrary and capricious\". On October 18, 2024, the FTC [filed an appeal](https://www.psca.org/news/psca-news/2024/10/where-does-the-ftcs-non-compete-ban-stand-now/) with the U.S. Court of Appeals for the Fifth Circuit.\n\n`{\"format\":\"metac_closes_in_period\",\"info\":{\"post_id\":31227,\"question_id\":30897}}`",
        "resolution_criteria": "This question will resolve as **Yes** if FTC's [ban on noncompetes](https://www.ftc.gov/legal-library/browse/rules/noncompete-rule) is enacted before January 1, 2026 with at most minor changes.\n\nAs of December 2024, the current form of the regulation would apply to all workers at companies which are under FTC's jurisdiction, with a single exception of individuals earning more than $151,164 who are in a \"policy-making position\". It also applies to both existing and future non-compete agreements.\n\nMinor changes are defined as amendments in the current exceptions that affect less than 10% of workers under FTC's jurisdiction (as judged by Metaculus), as changes to the notice requirements employers should give to their employees, or other changes of a similar scope as judged by Metaculus admins.\n\nIf the rule is not enacted before January 1, 2026 or if it is enacted with other changes, including but not limited to changes that affect at least 10% of workers or changes to if the rule would be applied to existing contracts at all, would resolve this question as **No**.",
        "fine_print": "This question resolves based on the first day the corresponding rule is enacted. If the rule is enacted and then subsequently amended or blocked, the resolution of this question will not be affected.",
        "post_id": 39437,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**The Knowledge Group Has Scheduled a Live Webcast on U.S. Non-Compete Agreements Post-FTC: What Employers and Counsel Need to Know - PR.com**\nThe Knowledge Group announced a live webcast titled 'The Knowledge Group Has Scheduled a Live Webcast on U.S. Non-Compete Agreements Post-FTC: What Employers and Counsel Need to Know' that will take place on Tuesday, October 14, 2025, from 12:00 PM to 1:00 PM (ET). The event follows the Federal Trade Commission's (FTC) decision to ban its recent non‑compete rule and to withdraw all appeals related to that ban, a move that has left employers and counsel facing a patchwork of inconsistent state laws across the country. James Gale, Co‑Chair of Intellectual Property Litigation at Cozen O'Connor, will lead the discussion, offering practical guidance on navigating the post‑FTC environment, assessing the impact on existing agreements, and exploring alternative contractual strategies. The agenda includes an overview of the FTC’s prior rule and its current status, anticipated litigation trends, recent state‑law changes affecting non‑compete enforcement, implications for existing agreements, alternative protective measures for confidential information and trade secrets, drafting enforceable non‑solicitation and non‑disclosure agreements, and compliance strategies for multi‑state employers. The webcast is part of The Knowledge Group’s continuing‑education program, which has served lawyers, accountants, and business professionals since 2006.\nOriginal language: en\nPublish date: September 28, 2025 05:18 PM\nSource:[PR.com](https://www.pr.com/press-release/949407)\n\n**5 Policies the US Has Rolled Back So Far in 2025 (and How It Affects Your Money)**\nAccording to the Brookings Institute, the Trump administration has rolled back more than 60 regulatory changes in 2025, including five major policies. First, the Department of Health and Human Services (HHS) proposed new rules that would change the enrollment period, add verification requirements, eliminate certain recipients, and roll back tax credits for the Affordable Care Act (ACA). The Center for American Progress says these changes increase costs for people with ACA marketplace coverage and shrink enrollment. Second, the Department of Transportation (DOT) rescinded a Biden rule that required cash refunds for delayed flights and a rule that required disclosure of baggage and other fees. Airline industry groups welcomed the change, while passenger groups warned it could raise air‑travel costs. Tomasz Pawliszyn, CEO of AirHelp, said, 'To revert back now will hinder the air travel experience and leave millions of travelers without adequate compensation in the event of a disruption.' Third, the administration rescinded a Biden executive order that capped out‑of‑pocket drug costs at pharmacies and lowered prices for Medicare beneficiaries. The HHS secretary was directed to select payment models for specific drugs and submit a report within 90 days. Supporters said it could further cap prescription drug prices for Medicare beneficiaries. Fourth, a federal judge overturned a Biden policy that kept medical debt off credit reports, a rule that was designed to relieve the burden of health‑care expenses affecting nearly one‑third of Americans. The ruling was seen as a major blow to the Consumer Financial Protection Bureau and could make it harder for some Americans to obtain credit. Fifth, the administration rescinded a Biden executive order that raised the minimum wage for federal contractors to $15 an hour (or $10.50 for tipped workers) from $10.95 or $7.65. The order was already facing lawsuits and is still litigated. If the change sticks, federal contractors may see less income than they would have otherwise.\nOriginal language: en\nPublish date: September 28, 2025 10:55 AM\nSource:[GOBankingRates](https://www.gobankingrates.com/money/economy/policies-us-rolled-back-so-far-2025-how-affects-money/)\n\n**FTC Walks Away From Rulemaking -- But Not The Fight On Non-Competes**\nOn September 5, 2025, the Federal Trade Commission (FTC) shifted its strategy on non‑compete agreements by voting 3‑1 to abandon the Non‑Compete Clause Rule, a regulation that had banned most non‑compete clauses nationwide. The decision followed the FTC’s voluntary dismissal of appeals in two lawsuits—Ryan, LLC v. FTC (5th Cir.) and Properties of the Villages, Inc. v. FTC (11th Cir.)—which had issued nationwide injunctions against the Rule. Commissioner Holyoak and Chairman Ferguson stated that the Rule was \"patently obvious\" illegal, arguing that the FTC lacked authority to preempt state law and that it would \"render categorically unlawful a species of contract that has been lawful since the eighteenth century.\" Ferguson also warned that the FTC would continue to enforce antitrust laws against non‑compete agreements on a case‑by‑case basis under Section 5 of the FTC Act.\n\nCommissioner Meador concurred, calling the Rule overbroad and noting that economic considerations require a balanced approach. Commissioner Slaughter dissented, citing potential harms such as barriers to worker mobility, wage suppression, and stifled innovation, and urged the FTC to follow the Administrative Procedure Act’s notice‑and‑comment process before withdrawing the Rule.\n\nThe Rule had been promulgated on April 23, 2024 after a January 5, 2023 notice‑and‑comment period. It applied prospectively and retrospectively, preempting state non‑compete laws except those more restrictive. The Rule was originally adopted by a 3‑2 party‑line vote and was scheduled to take effect in September 2024, but was stayed by injunctions in the Ryan and Properties cases. The Ryan Court’s August 20, 2024 ruling set the Rule aside nationwide, finding it violated the APA because the FTC lacked statutory authority and the Rule was arbitrary and capricious.\n\nDespite the Rule’s repeal, the FTC remains focused on non‑compete enforcement. Chairman Ferguson has directed a Joint Labor Task Force and issued a Request for Information to assess the scope and effects of non‑compete agreements. In September 2025, the FTC sent letters to large healthcare employers urging them to eliminate unfair or anticompetitive non‑competes, especially in rural areas. The agency also targeted Gateway Services, Inc., the largest pet cremation business, for broad non‑compete agreements that allegedly stifled job mobility and competition. The proposed consent order would require Gateway to stop enforcing existing non‑competes and prohibit future agreements.\n\nOverall, the FTC’s strategy has moved from a blanket ban to a more tailored, case‑by‑case enforcement approach, while continuing to monitor and address non‑compete agreements that may harm competition and workers.\nOriginal language: en\nPublish date: September 28, 2025 09:10 AM\nSource:[Mondaq Business Briefing](https://www.mondaq.com/unitedstates/employee-rights-labour-relations/1683444/ftc-walks-away-from-rulemaking-but-not-the-fight-on-non-competes)\n\n**\"Preparatory steps\" don't breach non-compete clauses**\nOn September 26 2025 the Fair Work Commission’s full bench ruled that employees who take preparatory steps to set up a competing business while still employed are unlikely to breach fiduciary or contractual obligations. The bench said, 'The fiduciary and contractual obligations of employees do not provide an absolute bar to employees who may wish to make preparations for the establishment of a competitive business whilst remaining in the service of their existing employer.' The decision followed Commissioner Benjamin Redford’s hearing of a case in which Plumbtrax Pty Ltd dismissed an employee in December 2024 for alleged serious misconduct, claiming the employee had created and registered his own business and promoted it using the employer’s resources during work time. The bench refused the employer’s unfair dismissal appeal, concluding that the employee’s preparatory activities did not constitute a breach of non‑compete clauses.\nOriginal language: en\nPublish date: September 26, 2025 11:14 AM\nSource:[hrdaily.com.au](https://www.hrdaily.com.au/news/preparatory-steps-don-t-breach-non-compete-clauses-12941)\n\n**No Unbudgeted Spending: Government Imposes Tough New Measures to Curb Overspending**\nThe Zimbabwean government has issued Treasury Circular 10 of 2025, imposing strict spending controls that require all Ministries, Departments and Agencies (MDAs) to operate strictly within the 2025 Approved Budget. Treasury says that years of unplanned spending have eroded budget credibility and widened the fiscal deficit, so any unbudgeted expenditure will now be considered void and subject to penalties. A key provision is that any contract worth US$2 million or more must receive prior written approval from Treasury; contracts below that threshold must stay within the current year’s budget allocation, and contracts signed outside these rules will not be honoured. Workshops, conferences and foreign travel are largely suspended for the remainder of 2025, with training limited to government facilities such as ZIPAM and PSC Academies and events held close to participants to cut transport costs. Special per diem rates have been abolished, and vehicle hiring for MDAs funded from the Consolidated Revenue Fund is banned; pool vehicles must be logged and audited every two weeks. A general recruitment freeze is introduced, except for critical sectors such as health, education and security, and all institutions funded from the Consolidated Revenue Fund must migrate to the Salary Service Bureau payroll system immediately to enhance transparency. Fuel allocations to all government institutions have been cut by 25 %, and capital expenditure is restricted to only three categories of projects: high‑impact projects driving growth or reducing life‑risk, protective works, and ongoing projects with existing payment commitments. Procurement of new vehicles, furniture and equipment is deferred until 2026 unless already approved. Treasury says these measures are necessary to contain expenditures, rebuild trust in the national budget, reduce arrears and strengthen economic stability. 'Any unbudgeted expenditure will now be considered void, with penalties for non‑compliance,' the circular states.\nOriginal language: en\nPublish date: September 29, 2025 02:31 AM\nSource:[iharare.com](https://iharare.com/no-unbudgeted-spending-government-imposes-tough-new-measures-to-curb-overspending/)\n\n**Saiz to Facilitate Partial Retirement in the Administration with Interim Staff**\nThe Spanish government is studying the opening of a transitional period that would allow temporary staff to act as releasers, thereby unblocking the backlog of partial‑retirement requests for public‑sector labour personnel. The Ministry of Social Security is finalising a formula to reverse the block caused by the new partial‑retirement regime that entered into force on 1 April. The last tripartite pension agreement, reached a little over a year ago, introduced changes that did not consider the impact on public‑sector labour staff. The new rule requires that a releaser be hired permanently, full‑time, and remain employed for at least two years after the partial‑retirement process ends. This rigidity has made it difficult for administrations to create fixed positions, leading to a backlog that previously could be resolved by hiring temporary staff. According to the article, there were about 250,000 labour contracts in the administration in 2024, and the total public workforce was 3.5 million, of which 981,000 were temporary, giving a temporary rate of almost 28 %. The EU Court of Justice, in a 13 June 2024 ruling, declared that successive temporary contracts in the public sector constitute abuse and urged administrations to convert them to permanent contracts or provide deterrent compensation. The Supreme Court has submitted a question to the Court of Justice about the procedure for long‑duration interim staff, which could clarify the application of the ruling. The Ministry says it will wait for an agreement with social partners before finalising the solution, but sources say the plan is to keep the old rule for a transitional period until public administrations can fill the positions with permanent staff. Sources quoted the plan as: 'La idea es mantener la norma anterior durante un periodo de tiempo', indicating that the temporary window is intended to allow administrations to recruit permanent staff once the new regulations are fully implemented.\nOriginal language: es\nPublish date: September 28, 2025 08:38 PM\nSource:[Expansión](https://www.expansion.com/economia/politica/2025/09/28/68d99c9e468aebac118b4583.html)\n\n**The Knowledge Group Has Scheduled a Live Webcast on U.S. Non-Compete Agreements Post-FTC: What Employers and Counsel Need to Know - PR.com**\nThe Knowledge Group announced a live webcast titled 'The Knowledge Group Has Scheduled a Live Webcast on U.S. Non-Compete Agreements Post-FTC: What Employers and Counsel Need to Know' that will take place on Tuesday, October 14, 2025, from 12:00 PM to 1:00 PM (ET). The event follows the Federal Trade Commission's (FTC) decision to ban its recent non‑compete rule and to withdraw all appeals related to that ban, a move that has left employers and counsel facing a patchwork of inconsistent state laws across the country. James Gale, Co‑Chair of Intellectual Property Litigation at Cozen O'Connor, will lead the discussion, offering practical guidance on navigating the post‑FTC environment, assessing the impact on existing agreements, and exploring alternative contractual strategies. The agenda includes an overview of the FTC’s prior rule and its current status, anticipated litigation trends, recent state‑law changes affecting non‑compete enforcement, implications for existing agreements, alternative protective measures for confidential information and trade secrets, drafting enforceable non‑solicitation and non‑disclosure agreements, and compliance strategies for multi‑state employers. The webcast is part of The Knowledge Group’s continuing‑education program, which has served lawyers, accountants, and business professionals since 2006.\nOriginal language: en\nPublish date: September 28, 2025 05:18 PM\nSource:[PR.com](https://www.pr.com/press-release/949407)\n\n**5 Policies the US Has Rolled Back So Far in 2025 (and How It Affects Your Money)**\nAccording to the Brookings Institute, the Trump administration has rolled back more than 60 regulatory changes in 2025, including five major policies. First, the Department of Health and Human Services (HHS) proposed new rules that would change the enrollment period, add verification requirements, eliminate certain recipients, and roll back tax credits for the Affordable Care Act (ACA). The Center for American Progress says these changes increase costs for people with ACA marketplace coverage and shrink enrollment. Second, the Department of Transportation (DOT) rescinded a Biden rule that required cash refunds for delayed flights and a rule that required disclosure of baggage and other fees. Airline industry groups welcomed the change, while passenger groups warned it could raise air‑travel costs. Tomasz Pawliszyn, CEO of AirHelp, said, 'To revert back now will hinder the air travel experience and leave millions of travelers without adequate compensation in the event of a disruption.' Third, the administration rescinded a Biden executive order that capped out‑of‑pocket drug costs at pharmacies and lowered prices for Medicare beneficiaries. The HHS secretary was directed to select payment models for specific drugs and submit a report within 90 days. Supporters said it could further cap prescription drug prices for Medicare beneficiaries. Fourth, a federal judge overturned a Biden policy that kept medical debt off credit reports, a rule that was designed to relieve the burden of health‑care expenses affecting nearly one‑third of Americans. The ruling was seen as a major blow to the Consumer Financial Protection Bureau and could make it harder for some Americans to obtain credit. Fifth, the administration rescinded a Biden executive order that raised the minimum wage for federal contractors to $15 an hour (or $10.50 for tipped workers) from $10.95 or $7.65. The order was already facing lawsuits and is still litigated. If the change sticks, federal contractors may see less income than they would have otherwise.\nOriginal language: en\nPublish date: September 28, 2025 10:55 AM\nSource:[GOBankingRates](https://www.gobankingrates.com/money/economy/policies-us-rolled-back-so-far-2025-how-affects-money/)\n\n**FTC Walks Away From Rulemaking -- But Not The Fight On Non-Competes**\nOn September 5, 2025, the Federal Trade Commission (FTC) shifted its strategy on non‑compete agreements by voting 3‑1 to abandon the Non‑Compete Clause Rule, a regulation that had banned most non‑compete clauses nationwide. The decision followed the FTC’s voluntary dismissal of appeals in two lawsuits—Ryan, LLC v. FTC (5th Cir.) and Properties of the Villages, Inc. v. FTC (11th Cir.)—which had issued nationwide injunctions against the Rule. Commissioner Holyoak and Chairman Ferguson stated that the Rule was \"patently obvious\" illegal, arguing that the FTC lacked authority to preempt state law and that it would \"render categorically unlawful a species of contract that has been lawful since the eighteenth century.\" Ferguson also warned that the FTC would continue to enforce antitrust laws against non‑compete agreements on a case‑by‑case basis under Section 5 of the FTC Act.\n\nCommissioner Meador concurred, calling the Rule overbroad and noting that economic considerations require a balanced approach. Commissioner Slaughter dissented, citing potential harms such as barriers to worker mobility, wage suppression, and stifled innovation, and urged the FTC to follow the Administrative Procedure Act’s notice‑and‑comment process before withdrawing the Rule.\n\nThe Rule had been promulgated on April 23, 2024 after a January 5, 2023 notice‑and‑comment period. It applied prospectively and retrospectively, preempting state non‑compete laws except those more restrictive. The Rule was originally adopted by a 3‑2 party‑line vote and was scheduled to take effect in September 2024, but was stayed by injunctions in the Ryan and Properties cases. The Ryan Court’s August 20, 2024 ruling set the Rule aside nationwide, finding it violated the APA because the FTC lacked statutory authority and the Rule was arbitrary and capricious.\n\nDespite the Rule’s repeal, the FTC remains focused on non‑compete enforcement. Chairman Ferguson has directed a Joint Labor Task Force and issued a Request for Information to assess the scope and effects of non‑compete agreements. In September 2025, the FTC sent letters to large healthcare employers urging them to eliminate unfair or anticompetitive non‑competes, especially in rural areas. The agency also targeted Gateway Services, Inc., the largest pet cremation business, for broad non‑compete agreements that allegedly stifled job mobility and competition. The proposed consent order would require Gateway to stop enforcing existing non‑competes and prohibit future agreements.\n\nOverall, the FTC’s strategy has moved from a blanket ban to a more tailored, case‑by‑case enforcement approach, while continuing to monitor and address non‑compete agreements that may harm competition and workers.\nOriginal language: en\nPublish date: September 28, 2025 09:10 AM\nSource:[Mondaq Business Briefing](https://www.mondaq.com/unitedstates/employee-rights-labour-relations/1683444/ftc-walks-away-from-rulemaking-but-not-the-fight-on-non-competes)\n\n**Student Loan Update: Trump Admin Faces New Lawsuit Over Forgiveness Student loan update: Trump admin faces new lawsuit over forgiveness**\nOn September 16, 2025, the American Federation of Teachers (AFT) filed a request for class certification and a preliminary injunction in the U.S. District Court for the District of Columbia, alleging that the U.S. Department of Education (ED) and Secretary Linda McMahon unlawfully delayed or shut down income‑driven repayment (IDR) and Public Service Loan Forgiveness (PSLF) relief. The complaint cites an IDR backlog of more than 1.08 million pending applications as of August 31, 2025, and 74,510 pending PSLF Buyback requests, with only 5,600 decisions in August. AFT argues that these delays could push IDR discharges past December 31, 2025, when the current federal tax exemption expires; discharges dated January 1, 2026 or later would become taxable, while PSLF discharges remain tax‑free.\n\nThe lawsuit coincides with ED’s proposed PSLF rules that would allow the Secretary to deem employers ineligible if their activities involve a ‘substantial illegal purpose’. NASFAA senior policy analyst Megan Walter warned that granting the Secretary unilateral authority to make such determinations “without a court finding” undermines due‑process and could create a legal limbo for borrowers and employers. Walter urged the Department to rely on existing judicial and IRS determinations and to include detailed due‑process procedures.\n\nED’s stance, announced in April, is to resume aggressive collections on defaulted federal loans, framing forgiveness as a taxpayer burden. This approach clashes with AFT’s focus on ensuring timely, lawful processing of statutory relief. AFT’s claim of ‘irreparable harm’ is bolstered by the risk that borrowers who qualify for cancellation may face wage garnishment or offsets while their IDR/PSLF applications remain pending.\n\nKey dates: AFT filed its suit on March 19, 2025; ED paused IDR intake around February 26, reopened on March 26; a July 14 letter confirmed monthly status reports on the backlog. The court will hear AFT’s preliminary‑injunction and class‑certification motions on October 31, 2025, potentially affecting borrowers seeking IDR cancellation before 2026.\n\nQuotes: ‘I think the most significant legal risk is granting the Secretary of Education what NASFAA sees as unilateral authority to determine that an employer has a ‘substantial illegal purpose’ without that determination being based on an actual court finding.’ – Megan Walter. ‘The government can and will collect defaulted federal student loan debt by withholding money from borrowers, tax refunds, federal pensions and even their wages,’ – Karoline Leavitt, White House press secretary.\n\nThe article presents the facts and statements from involved parties without editorializing, offering a clear, evidence‑based overview of the legal dispute and its potential impact on student‑loan borrowers.\nOriginal language: en\nPublish date: September 27, 2025 09:00 AM\nSource:[Newsweek](https://www.newsweek.com/student-loan-update-trump-admin-faces-new-lawsuit-over-forgiveness-10790279)\n\n**EEOC to Close All Pending Disparate Impact Investigations by September 30, 2025**\nOn September 27, 2025 the Equal Employment Opportunity Commission (EEOC) announced it will administratively close all pending charges that rely solely on disparate impact by the end of September 2025. The decision follows President Trump’s April 23, 2025 executive order, 'Restoring Equality of Opportunity and Meritocracy', which directed federal agencies to eliminate reliance on disparate impact liability. According to an internal agency memorandum, staff must close those cases by September 30 and issue 'right to sue' letters by October 31, giving charging parties 90 days to pursue litigation in federal court. The EEOC will no longer investigate or resolve charges based solely on disparate impact; ongoing matters that also allege intentional discrimination may proceed only on that theory. The agency has already withdrawn from several suits, and other federal agencies—Department of Justice, Department of Housing and Urban Development, Consumer Financial Protection Bureau, and Federal Trade Commission—must apply similar restrictions in fair housing, credit, and consumer protection. This change marks a significant shift, as disparate impact has been a cornerstone of systemic discrimination enforcement since the Supreme Court recognized it in Griggs v. Duke Power Co. and codified it into Title VII in 1991. While Title VII still prohibits disparate impact discrimination, workers will now need to seek private counsel and file lawsuits on their own, bearing the cost and complexity of proving the case.\nOriginal language: en\nPublish date: September 27, 2025 05:11 AM\nSource:[JD Supra](https://www.jdsupra.com/legalnews/eeoc-to-close-all-pending-disparate-8881352/)\n\n**BREAKING: FTC Abandons Noncompete Rule, Announces Targeted Enforcement Actions Amidst FTC Staffing Shake-ups**\nThe Federal Trade Commission (FTC) announced on September 5 2025 that it will dismiss its appeals of district‑court decisions blocking its Non‑compete Rule, effectively abandoning the nationwide ban on non‑compete agreements. The rule, approved 3‑2 in April 2024 and published in the Federal Register (89 FR 38342) on May 7 2024, would have prohibited new post‑employment non‑competes and invalidated existing ones, affecting roughly 30 million workers—about one in five American employees. The rule was challenged on three grounds: lack of statutory authority, unconstitutional delegation of power, and arbitrary and capriciousness. Courts were split: the Eastern District of Pennsylvania sided with the FTC, while the Northern District of Texas enjoined the rule. The FTC appealed to the Fifth and Eleventh Circuits, but under new Chair Andrew Ferguson—appointed by President Trump on Inauguration Day 2025—the agency decided to withdraw its appeals and accept the vacatur. Ferguson said the FTC would shift from rulemaking to “aggressive enforcement,” issuing enforcement actions and warning letters to employers. The article also notes ongoing litigation over Trump’s removal of Democratic commissioners and the Supreme Court’s recent “major questions” decision. While the FTC will no longer pursue a nationwide ban, it remains committed to enforcing antitrust laws against non‑compete agreements.\n\nKey metrics and facts:\n- 30 million workers (1 in 5) bound by non‑competes.\n- Rule approved 3‑2; published 89 FR 38342.\n- Courts: Eastern District of Pennsylvania (FTC‑friendly) vs. Northern District of Texas (enjoined rule).\n- FTC withdrew appeals in Ryan, LLC v. FTC (5th Cir.) and Properties of the Villages v. FTC (11th Cir.) on Sept 5 2025.\n\nNotable quotes:\n- Ferguson’s dissent: ‘by far the most extraordinary assertion of authority in the Commission’s history.’\n- Ferguson’s statement: ‘aggressive enforcement’.\n\nEvidence: The article cites court decisions, FTC press releases, the Federal Register, and statements from Ferguson and other officials.\n\nOriginal language: en\nPublish date: September 26, 2025 08:15 PM\nSource:[JD Supra](https://www.jdsupra.com/legalnews/breaking-ftc-abandons-noncompete-rule-4803669/)\n\n**\"Preparatory steps\" don't breach non-compete clauses**\nOn September 26 2025 the Fair Work Commission’s full bench ruled that employees who take preparatory steps to set up a competing business while still employed are unlikely to breach fiduciary or contractual obligations. The bench said, 'The fiduciary and contractual obligations of employees do not provide an absolute bar to employees who may wish to make preparations for the establishment of a competitive business whilst remaining in the service of their existing employer.' The decision followed Commissioner Benjamin Redford’s hearing of a case in which Plumbtrax Pty Ltd dismissed an employee in December 2024 for alleged serious misconduct, claiming the employee had created and registered his own business and promoted it using the employer’s resources during work time. The bench refused the employer’s unfair dismissal appeal, concluding that the employee’s preparatory activities did not constitute a breach of non‑compete clauses.\nOriginal language: en\nPublish date: September 26, 2025 11:14 AM\nSource:[hrdaily.com.au](https://www.hrdaily.com.au/news/preparatory-steps-don-t-breach-non-compete-clauses-12941)\n\n**FTC Walks Away from Noncompete Ban Appeals -- But Not from Noncompetes**\nThe Federal Trade Commission (FTC) has officially dropped its appeals in the two cases that struck down its nationwide non‑compete ban, following a 3‑1 vote earlier this month. The agency decided to walk away from the fight, leaving in place court rulings that vacated the rule, after weighing its options for more than six months following a change in presidential administrations. The abandoned rule, finalized in April 2024, would have banned nearly all post‑employment non‑compete agreements across the country and required employers to notify workers that their existing non‑competes were unenforceable, with only narrow exceptions for senior executives and business sales. At the time the FTC estimated that roughly 30 million workers—about one in five—were bound by non‑competes. Legal challenges came fast: a Texas federal court struck down the ban nationwide in August 2024, finding the agency lacked statutory authority, and a Florida court issued a narrower injunction soon after. The FTC initially appealed both decisions but changed its posture after the administration shift, ultimately concluding that continuing the appeals was not the right move. The agency is not abandoning non‑compete enforcement altogether; it plans to use its adjudicatory powers to target what it calls \"onerous\" or \"unfair\" non‑compete agreements on a case‑by‑case basis, especially in sectors such as healthcare and staffing. Recent enforcement actions and warning letters underscore that message. The era of a blanket ban may be over, but employers should expect continued scrutiny—and a more surgical approach—from the FTC going forward.\nOriginal language: en\nPublish date: September 26, 2025 10:19 AM\nSource:[JD Supra](https://www.jdsupra.com/legalnews/ftc-walks-away-from-noncompete-ban-9360267/)\n\n**The FTC's Employee Noncompete Rule is Officially Dead, but Substantial Barriers to Noncompetes Remain in Effect**\nIn May 2024 the Federal Trade Commission (FTC) issued a final rule that would have banned almost all non‑compete agreements nationwide, classifying them as an unfair method of competition under Section 5 of the FTC Act. The rule would have prohibited new non‑competes for all workers, including senior executives, and would have invalidated existing non‑compete clauses for workers other than senior executives from September 2024 onward, while allowing senior‑executive clauses to remain in force. The rule contained only narrow exceptions, such as agreements tied to a bona fide sale of a business.\n\nTwo developments halted the rule. First, litigation challenged the rule’s substance and the FTC’s authority, resulting in injunctions against the rule. Second, the new Trump administration signaled it would review the rule and pursue appellate review of court rulings that struck it down.\n\nOn September 5 2025 the FTC withdrew its pending appeals, effectively ending the national policy. The FTC Chairman, however, stated the agency would \"continue to enforce the antitrust laws aggressively against non‑compete agreements,\" but on a case‑by‑case basis. Employers must still navigate a patchwork of state and local laws that regulate non‑compete enforceability.\n\nUnder federal law, non‑compete agreements will be evaluated under the \"rule of reason,\" balancing a legitimate pro‑competitive purpose against potential anti‑competitive effects. The FTC and the Department of Justice will scrutinize whether the restraint is reasonably necessary and whether less restrictive alternatives exist.\n\nFollowing the rule’s abandonment, FTC Chairman Ferguson issued warning letters to large healthcare and staffing companies, saying \"many healthcare employers and staffing companies include noncompete[s]… in employment contracts that may unreasonably limit employment options for… nurses, physicians, and other medical professionals\" and urged a thorough review of agreements. The FTC also noted that \"narrowly tailored noncompetes\" may serve valid purposes, but many are overbroad in duration, geographic scope, or inappropriate for certain roles.\n\nEmployers no longer face an absolute federal ban, but the FTC signals a high bar for proving a non‑compete is reasonable. Four states—California, Minnesota, North Dakota, and Oklahoma—have near‑total bans, and many others impose significant restrictions. Employers are advised to seek legal counsel on both state and federal law before drafting or renewing non‑compete agreements and to consider less risky means of protecting business interests.\n\nKey dates and facts: May 2024 rule issuance; September 2024 effective date for worker non‑competes; September 5 2025 FTC withdrawal; four states with near‑total bans; FTC’s \"rule of reason\" approach.\n\nQuotes: \"continue to enforce the antitrust laws aggressively against noncompete agreements\"; \"many healthcare employers and staffing companies include noncompete[s]… in employment contracts that may unreasonably limit employment options for… nurses, physicians, and other medical professionals\"; \"narrowly tailored noncompetes\" may serve valid purposes.\nOriginal language: en\nPublish date: September 23, 2025 06:09 PM\nSource:[JD Supra](https://www.jdsupra.com/legalnews/the-ftc-s-employee-noncompete-rule-is-7249961/)\n\n**https://natlawreview.com/article/five-takeaways-ftcs-decision-abandon-noncompete-rule**\nOn September 5 2025 the FTC announced it would accept the Texas court’s vacatur of its 2024 Non‑compete Rule, ending the agency’s attempt to ban most employee non‑compete agreements. The rule had been struck down in August 2024 and the FTC had appealed, but the change in administration led to the decision to 'accede to the vacatur.' The ruling means the rule cannot take effect or be enforced. The FTC, however, said it will continue to target over‑broad non‑competes. A week before the announcement it issued a consent order against the nation’s largest pet‑cremation company, requiring it to abandon non‑competes for all hires outside California except key employees. On September 10 it sent warning letters to several large healthcare employers and staffing firms, urging them to review and, if necessary, 'discontinue' restrictive covenants. The agency also requested information on non‑compete use to inform future enforcement. The article notes that the FTC’s authority to adopt substantive rules was limited by a 1973 D.C. Circuit decision, and a 2025 Texas district court held the FTC lacks such authority for labor practices. The FTC will focus on cases involving low‑wage, unskilled workers, broad geographic or temporal scopes, and agreements that violate state law. Nine states—including Arkansas, Louisiana, Maryland, Pennsylvania, Utah, Texas, Indiana, Wyoming, and Virginia—have recently tightened or limited non‑compete enforceability, while Florida has strengthened it. The FTC’s new approach treats non‑competes on a case‑by‑case basis, with employers bearing the burden to prove necessity and narrow tailoring.\nOriginal language: en\nPublish date: September 15, 2025 10:25 PM\nSource:[The National Law Review - A Free To Use Nationwide Database of Legal Publications](https://natlawreview.com/article/five-takeaways-ftcs-decision-abandon-noncompete-rule)\n\n**Trump Administration Ends FTC's Attempt To Ban Noncompetes**\nThe Federal Trade Commission (FTC) ended its attempt to ban non‑competition agreements nationwide by voluntarily dismissing its appeal of court rulings that blocked its Final Rule. On September 5, 2025, the FTC announced that it would no longer pursue enforcement of the rule that had been adopted during the Biden administration, which aimed to prohibit the majority of non‑compete clauses in employer‑worker agreements. The rule had attracted over 26,000 public comments and was challenged in three lawsuits—first in Pennsylvania, then Texas, and finally Florida. The courts in Texas and Florida ruled against the FTC, with the Northern District of Texas blocking the rule from taking effect on August 20, 2024. The Trump administration reversed the FTC’s course, and new Chair Andrew Ferguson stated that the agency would instead address unlawful non‑compete agreements through enforcement actions rather than formal rulemaking. The FTC has already launched an enforcement action against Gateway Services, Inc. and issued a request for information to better understand the scope and effects of non‑compete agreements. The voluntary dismissal of the appeals marks the end of the debate over the Final Rule, ensuring it will never go into effect. Employers can continue to operate under existing state laws regarding non‑compete practices, and the FTC will monitor enforcement actions and state legislation for future guidance.\nOriginal language: en\nPublish date: September 14, 2025 10:03 AM\nSource:[Mondaq Business Briefing](https://www.mondaq.com/unitedstates/employee-rights-labour-relations/1677104/trump-administration-ends-ftcs-attempt-to-ban-noncompetes)\n\n**Federal Trade Commission Ends Appeals, Shifts Focus to Noncompete Enforcement**\nThe Federal Trade Commission (FTC) has abandoned its 2024 non‑compete ban rule, after courts in Texas and Florida issued injunctions that halted the rule’s enforcement. The Texas court vacated the rule entirely, citing an overreach of FTC authority, while the Florida court issued a narrower, plaintiff‑specific injunction under the major‑questions doctrine. Following the appointment of Chair Andrew N. Ferguson, the FTC voluntarily dismissed both appeals, effectively ending the rule it had announced just over a year ago. \n\nDespite dropping the blanket ban, the FTC remains active on non‑compete enforcement. On September 4, 2025, it filed an action against Gateway Services, Inc., alleging that the company’s widespread use of one‑year non‑compete agreements violated Section 5 of the FTC Act. The proposed consent order would bar the firm from enforcing most of these agreements and impose long‑term compliance obligations, with limited exceptions for executives and business sales. \n\nThe agency’s strategy has shifted from a universal prohibition to a case‑by‑case ‘rule‑of‑reason’ analysis of the most egregious non‑compete uses. On the same day, the FTC issued a Request for Information to gather public input on the use and impact of non‑competes, with comments due by November 3, 2025. \n\nWith the federal standard shelved, state laws and court decisions will continue to govern non‑compete enforceability, creating a patchwork of statutes and judicial interpretations that vary widely across jurisdictions. Employers operating in multiple states or industries under scrutiny are advised to review their non‑compete practices with legal counsel. \n\nKey quotes: The original rule, championed by former Chair Lina Khan, argued that non‑compete clauses \"keep wages low, suppress new ideas, and rob the American economy of dynamism.\" The FTC’s new focus is to target \"the most egregious uses of noncompetes\" on a case‑by‑case basis.\nOriginal language: en\nPublish date: September 12, 2025 04:48 PM\nSource:[JD Supra](https://www.jdsupra.com/legalnews/federal-trade-commission-ends-appeals-1888797/)\n\n**Rule Abandoned, Crackdown Continues: The Federal Trade Commission's New Non-compete Strategy**\nOn September 5, 2025, the FTC withdrew its appeal in the case over its 2024 Non‑compete Clause Rule, effectively abandoning the challenge to a district court ruling that invalidated the rule. The court, led by Judge Ada E. Brown, found the FTC lacked authority to promulgate the rule, deeming it arbitrary and capricious and issuing a nationwide vacatur and injunction in August 2024. FTC Chair Andrew Ferguson and Commissioner Melissa Holyoak said the agency 'lacked authority for a sweeping rule' but would continue to police illegal non‑competes through enforcement. The 2024 rule had aimed to ban almost all post‑employment non‑compete agreements, requiring employers to rescind clauses and notify workers, with narrow exceptions. With the rule vacated, the FTC is pivoting to targeted enforcement under Section 5 of the FTC Act, focusing on cases where non‑compete clauses are coercive, exploitative, or harm competition. The agency has already filed a complaint against Gateway Services, alleging anticompetitive use of non‑competes that could affect about 1,800 employees, and proposed a consent order limiting such clauses. Future enforcement will target low‑ and middle‑wage workers, non‑compete restrictions on roles without competitively sensitive information, and market‑wide effects that suppress mobility and wages. The FTC also launched a public inquiry through its Joint Labor Task Force, inviting comments on non‑compete use, with submissions due by November 3, 2025. While the nationwide ban is gone, employers should expect continued scrutiny through complaints, consent orders, and litigation, and should review their policies to comply with federal and state laws, especially in states like California and Minnesota that have strict non‑compete bans.\nOriginal language: en\nPublish date: September 12, 2025 12:00 AM\nSource:[The National Law Review - A Free To Use Nationwide Database of Legal Publications](https://natlawreview.com/article/rule-abandoned-crackdown-continues-federal-trade-commissions-new-non-compete)\n\n**Trump's Federal Trade Commission Abandons Noncompete Ban**\nOn September 12 2025 the FTC voted 3‑1 to dismiss its appeal of a district‑court ruling that barred the agency from enforcing a nationwide ban on non‑compete agreements. The ban, announced by the FTC in April 2024 after a proposed rule in January 2023, would have invalidated nearly all existing non‑competes and prohibited new ones except in rare circumstances. The rule was supported by Commissioners Lina M. Khan, Rebecca Kelly Slaughter, and Alvaro M. Bedoya, and opposed by Andrew N. Ferguson and Melissa Holyoak. The ban never took effect because the U.S. Chamber of Commerce successfully challenged the FTC’s authority in a May 9 2024 lawsuit (Ryan LLC v. FTC), and the Northern District of Texas granted summary judgment in favor of the Chamber. The Fifth Circuit later granted a 120‑day pause on the FTC’s appeal, which was extended to September 8 2025. The FTC’s new chair, Andrew Ferguson, announced that the agency would focus on case‑by‑case enforcement rather than a broad ban, a shift that critics say will do little to protect the 30 million Americans subject to non‑compete agreements. The FTC also announced a 60‑day comment period on Regulations.gov to gather data on non‑compete prevalence. Lina M. Khan had said of the ban, 'Noncompete clauses keep wages low, suppress new ideas, and rob the American economy of dynamism, including from the more than 8,500 new startups that would be created a year once noncompetes are banned...' The article argues that the FTC’s ad‑hoc enforcement will impact fewer than 2,000 employees in a niche industry, and that the agency’s reversal is a win for corporations and a loss for workers.\nOriginal language: en\nPublish date: September 12, 2025 12:00 AM\nSource:[The National Law Review - A Free To Use Nationwide Database of Legal Publications](https://natlawreview.com/article/trumps-federal-trade-commission-abandons-noncompete-ban)\n\n**FTC Noncompete Ban Overturned: What It Means for Your Business - Law 4 Small Business (L4SB)**\nThe Federal Trade Commission (FTC) has withdrawn its appeal of a federal court ruling that blocked a proposed nationwide ban on non‑compete agreements, effectively ending the effort to invalidate most existing clauses. The FTC’s April 2024 rule, which would have prohibited nearly all non‑compete clauses, was estimated to affect about one in five American workers—roughly 30 million people—and was projected to boost worker wages by up to $300 billion annually. Business groups, including the U.S. Chamber of Commerce and Ryan LLC, sued, arguing the FTC overstepped its authority by pre‑empting state contract laws; a Texas judge agreed and issued a ruling that blocked the ban before it could take effect. In a joint statement, new FTC Chair Andrew Ferguson and Commissioner Melissa Holyoak called the rule an “extraordinary assertion of authority” that unlawfully over‑rode state laws, noting it “preempted the laws of all fifty States, and actively displaced hundreds of existing laws across forty‑six States.” With the appeal withdrawn, the Texas court’s decision stands, leaving non‑compete enforcement to a patchwork of state laws. The FTC will now focus on challenging non‑compete agreements that it deems anticompetitive under existing statutes such as the Sherman Act. Chair Ferguson acknowledged that non‑compete clauses can be abused and “severely inhibit workers’ ability to make a living.” The agency’s recent order to a large pet cremation company to stop enforcing non‑competes with nearly 1,800 employees illustrates this targeted approach. For small businesses, the reversal means they can continue to use non‑compete agreements, provided they comply with state‑specific laws, and must work closely with counsel to draft enforceable contracts. The change also restores the status quo of state‑by‑state regulation, creating complexity for employers and affecting talent mobility in regions where non‑competes are common.\nOriginal language: en\nPublish date: September 08, 2025 04:45 PM\nSource:[Law 4 Small Business](https://www.l4sb.com/blog/ftc-noncompete-ban-overturned-what-it-means-for-your-business/)\n\n**Under Trump, the Federal Trade Commission is abandoning its ban on noncompetes**\nThe Federal Trade Commission (FTC) has voted 3‑1 to dismiss the appeal of a Texas federal judge that halted its 2024 rule banning non‑compete agreements, effectively moving to vacate the ban that had been championed by former chair Lina Khan. The ban, which never took effect, was challenged by the Dallas‑based tax‑services firm Ryan LLC, which argued that the FTC had exceeded its authority. A 5th Circuit Court of Appeals ruling in September 2024 halted the ban nationwide, and the Biden administration appealed. In March 2025 the Trump administration asked the court for a 120‑day pause on the appeal, citing the change in administration and comments from new FTC chair Andrew Ferguson that the agency should reconsider the rule. The court granted a 60‑day pause in July, ending on September 8. Just before that deadline, the FTC announced it had voted 3‑1 to dismiss the appeal and take steps to vacate the rule. The dissenting vote was cast by Rebecca Kelly Slaughter, who returned to the commission after a court ruling. The FTC estimates that roughly 30 million people—about 1 in 5 American workers—are bound by non‑compete agreements, and that the rule would have prevented the creation of 8,500 new businesses and the loss of nearly $300 billion in wages annually. The FTC received 26,000 public comments on the rule, almost all supporting a nationwide ban. Andrew Ferguson, who has said non‑compete agreements can be ‘pernicious’ and that he prefers enforcement of the Sherman Act against non‑compete and no‑poach agreements, told Fox Business that his priority is to target violations rather than impose a blanket ban. Rebecca Slaughter argues that enforcement alone does not protect workers such as hair‑salon employees or fast‑food workers. Elizabeth Wilkins, former chief of staff to Khan and architect of the rule, warns that the FTC’s enforcement strategy will be insufficient, citing the agency’s limited staff of about 1,400 employees. The article also recounts the experience of Rebecca Denton, a real‑estate transaction coordinator in Colorado, who was trapped by a non‑compete when she wanted to leave her job during the pandemic surge. She ultimately quit and took lower‑paying gig work, citing the lack of a protective law until Colorado passed a limiting statute in 2022. The piece concludes that a clear, simple ban on non‑competes is the only way to truly protect workers, according to Wilkins.\nOriginal language: en\nPublish date: September 05, 2025 09:46 PM\nSource:[wlrh.org](https://www.wlrh.org/npr-news/2025-09-05/under-trump-the-federal-trade-commission-is-abandoning-its-ban-on-noncompetes)\n\n**Trump FTC Moves to Stop Defending Worker Noncompete Rule**\nThe Federal Trade Commission (FTC) announced it will no longer pursue appeals of court rulings that blocked a near‑total ban on worker non‑compete agreements, effectively ending the Biden administration’s effort to invalidate the rule. The FTC voluntarily dismissed cases in two separate appeals courts, reversing the litigation stance of its Democratic predecessor. The rule, adopted in 2024, would have barred the use of most non‑compete contracts, which affect roughly one in five U.S. workers, according to agency estimates. FTC Chairman Andrew Ferguson, a Republican at the time of the vote, dissented, arguing the regulation exceeded the FTC’s rule‑making authority. The rule was vacated by Judge Ada Brown of the U.S. District Court for the Northern District of Texas in August after a lawsuit by the U.S. Chamber of Commerce and Ryan LLC, which echoed Ferguson’s arguments. The Supreme Court’s June decision curtailed judges’ power to make such rulings under the ‘major questions’ doctrine. The FTC had appealed the decision to the Fifth Circuit and the Eleventh Circuit. Former FTC Chair Lina Khan defended the ban, noting the agency received more than 25,000 public comments supporting it and stating, 'a basic reality: robbing people of their economic liberty also robs them of all sorts of other freedoms, chilling speech, infringing on religious practice, and impeding people’s right to organize.' The FTC’s move follows a July 8 decision by the Eighth Circuit that vacated a rule requiring businesses to simplify cancellation of recurring memberships, another blow to regulatory efforts pursued during Khan’s tenure.\nOriginal language: en\nPublish date: September 05, 2025 09:22 PM\nSource:[news.bloomberglaw.com](https://news.bloomberglaw.com/white-collar-and-criminal-law/trump-ftc-moves-to-stop-defending-worker-noncompete-rule)\n\n",
    "date": "2025-10-13T17:41:53.344751",
    "summary": "All forecasting experts—drawing from regulatory affairs, labor law, administrative/constitutional law, political science, economics, and government relations—strongly agree there is virtually no chance that the FTC's proposed ban on non-compete agreements for most workers will be enacted in more or less its current form before January 1, 2026. Key consistent points in their reasoning include: \n\n- The FTC's rule was decisively vacated by a federal court on statutory authority and 'major questions doctrine' grounds, rendering swift legal reversal highly improbable.\n- The FTC, under new Trump-era leadership, has not only accepted the court's decision but has also officially abandoned both its appeals and the broad rulemaking approach, now favoring case-by-case enforcement.\n- There is no indication of imminent action by Congress to explicitly authorize such a ban, and all regulatory and political momentum has evaporated after the leadership transition.\n- Once a rule is vacated and the agency has voluntarily withdrawn appeals, the historical (base rate) likelihood of a revived, nearly identical rule returning in such a short time frame (2.5 months) is vanishingly small.\n- The only hypothetical 'yes' scenarios (e.g., emergency reversal, unprecedented legal/legislative action) are universally considered practically impossible given the political, legal, and bureaucratic situation.\n\nFinal probabilities given by experts almost all round to 0%, with slight 1% allowances in a few cases for extreme tail risks, but all affirm a de facto impossibility under the criteria. The collective assessment is firm: the FTC's nationwide non-compete ban for most workers will not be enacted before 2026, and the thrust of policy remains with state-level law and narrowly tailored FTC enforcement actions.",
    "forecasters": [
        "RegulatoryAffairs (FederalRulemakingProcess)",
        "LaborLawPractice (EmploymentAgreementCompliance)",
        "USGovernmentRelations (LegislativeAndStakeholderEngagement)",
        "Law (AdministrativeProceduresActDoctrine)",
        "Law (ChevronDeference)",
        "Law (MajorQuestionsDoctrine)",
        "PoliticalScience (SeparationOfPowersTheory)",
        "PoliticalScience (PolicyProcessModel)",
        "Economics (LaborMarketRegulationTheory)"
    ]
}