{
    "deliberation_results": {
        "Comparative Politics Analyst (Cabinet Formation Process)": {
            "time_to_resolution": "Approximately 3.5 months (question closes January 1, 2026; today is September 19, 2025)",
            "perspective_relevance": "As a comparative politics analyst specializing in cabinet formation, I assess the mechanisms of transitional governments, elite negotiation, legitimacy, and the institutional and societal forces influencing leadership selection, especially in crisis and post-revolutionary contexts. Nepal’s multi-party, highly factionalized parliamentary system—combined with extra-constitutional street mobilization (Gen-Z protest movement), caretaker arrangements, and military involvement—provides a rich case for applying stuck government, ‘outsider’ inclusion, and post-protest political settlement theories.",
            "status_quo": "Sushila Karki, selected as interim prime minister (caretaker), heads a minimalist cabinet. Elections are scheduled for March 2026. Kulman Ghising is a newly appointed caretaker minister (energy, infrastructure), but not prime minister. No non-caretaker prime minister has been sworn in following Oli’s resignation; thus, the baseline is that a traditional party leader or technocratic outsider will be elected or appointed following parliamentary elections.",
            "perspective_derived_factors": [
                {
                    "factor": "Interim/Caretaker Framework and Status Quo Bias",
                    "effect": "Decreases—The system and current appointment procedures point toward a neutral, procedural caretaker PM (Karki) until elections. Major constitutional actors (President, Army) and Gen-Z leaders appear to favor a technocratic/temporary solution, not instant elevation of Ghising or another outsider to full prime minister."
                },
                {
                    "factor": "Protest Outcomes & Popularity of Ghising",
                    "effect": "Small Increase—While Gen-Z protestors and factions have discussed Ghising as an option for PM (notably as 'everyone’s favourite' and a problem-solver for energy crises), the interim outcome was a compromise: Karki as caretaker, Ghising as an influential minister. He may benefit from ongoing popular support, but faces institutional barriers."
                },
                {
                    "factor": "Elite Settlement and Army/Presidential Influence",
                    "effect": "Decreases—Karki was selected after military, presidential, and Gen-Z negotiations; she is described as a respected, honest non-politician, but a conditionally temporary choice. The process (until after March 2026 elections) likely restricts the immediate elevation of other individuals, including Ghising, unless major crisis or deadlock recurs."
                },
                {
                    "factor": "Historical Base Rate—Past Technocrats, Outsiders as Nepal PMs",
                    "effect": "Decreases—Looking at Nepal’s political history, technocrats or independent public servants rarely become PM except in exceptional breakdowns (King’s direct rule, or pre-2008 monarchy transitions). Even the 2021-2022 caretaker phase reverted quickly to party/elite figures. The base rate for non-parliamentary technocrats or ministers jumping directly to PM roles is very low."
                },
                {
                    "factor": "Gen-Z Movement Factionalism",
                    "effect": "Neutral/Minor Increase—Some Gen-Z supporters clashed in favor of Ghising as interim PM, but ultimately accepted Karki’s leadership for the transition. Unless another rupture occurs, their current sway was channeled into securing representation within the cabinet, not the top job. If Ghising builds a profile during caretaking, he could potentially emerge as a compromise candidate in case of future gridlock, but this is speculative."
                }
            ],
            "no_scenario": "Post-caretaker elections or negotiations among established parties, new party leaders, or protest-movement-aligned figures produce a new PM (potentially Balen Shah, Sampang, or traditional party compromise), but not Ghising. The current cabinet remains interim-only, with Ghising continuing as minister or returning to technocratic roles without moving up to PM. Either (1) elections are postponed and Karki’s government continues caretaker role; or (2) after March 2026, a parliamentary coalition forms and selects a party politician or prominent Gen-Z leader but not Ghising.",
            "yes_scenario": "A dramatic political rupture or deadlock occurs before January 1, 2026, and Ghising is propelled to the premiership as a compromise non-partisan figure. This could happen if (1) Karki resigns or loses legitimacy, (2) major parties and Gen-Z leaders endorse Ghising en masse as the only candidate who can broker peace, or (3) caretaker government collapses and, under pressure from popular mobilization and/or the military, Ghising is sworn in and wins a vote of confidence. However, such a scenario is highly contingent and not supported by current institutional signals.",
            "final_reasoning": "The evidence from news reports and Nepal’s constitutional trajectory indicates a strong status quo bias toward Sushila Karki as caretaker PM until the March 2026 elections. Ghising was seriously considered for the interim PM post, especially among sections of the protest movement, and his popularity and integrity are well noted, but the compromise outcome placed him as a prominent minister instead. The process that produced this compromise involved all key stakeholders (President, Army, Gen-Z leaders), and was defined explicitly as a six-month technocratic caretaker phase, with the goal of fresh parliamentary elections. Historically, cabinet ministers—even high-profile technocrats—have not jumped to the premiership without broad factional breakdowns or electoral mandates. The election timeline is set for March 2026, beyond the question’s cut-off. For Ghising to become non-caretaker PM and pass a confidence vote before January 2026 would require the collapse or abrupt replacement of the new caretaker government and an extraordinary, consensus-driven process in his favor. In the absence of such systemic disruption, and given Nepal’s parliamentary and crisis-management patterns, such a leap is highly improbable. Thus, while Ghising remains a notable public figure and possible future contender under different circumstances, his odds for this specific outcome are quite low.",
            "final_probability": 2
        },
        "Comparative Politics Analyst (Elite Bargaining Analysis)": {
            "time_to_resolution": "About 3.5 months until January 1, 2026.",
            "perspective_relevance": "As a Comparative Politics Analyst with expertise in Elite Bargaining Analysis, my perspective is highly relevant here. Nepal’s rapid leadership change, following violent youth-led protests, puts elite coalition-building, protester influence, and the military's role at the center of political outcomes. Understanding how caretaker technocratic cabinets emerge, who captures the legitimacy of protest, and how the elite allocate power amid turmoil, allows for informed forecasting of who will be elevated to PM after a fresh round of bargaining post-interim period.",
            "status_quo": "The current status quo is a caretaker government led by Sushila Karki, charged with overseeing elections due March 2026. Kulman Ghising is a newly appointed interim minister—he holds substantial administrative jobs but is not PM. The status quo outcome is that after March 2026 elections, the next non-caretaker PM will be either an established party leader, a protest-aligned technocratic figure, or a surprise consensus candidate. Ghising has profile and credibility but has not previously led a party or headed a government.",
            "perspective_derived_factors": [
                {
                    "factor": "Elite Preferences and Coalition Dynamics",
                    "effect": "Decreases probability. The established parties (e.g., UML, Congress, Maoists) have strong incentives to regain the premiership after a transitional caretaker phase. Ghising, though popular, lacks a deep party base or proven coalition-building record as required to form a stable government and win a confidence vote in parliament."
                },
                {
                    "factor": "Popular Protest Legitimacy",
                    "effect": "Increases probability. The new elite consensus, forced by Gen-Z protests and violence, imposed nontraditional, technocratic, or protest-mandated leaders—demonstrated by Karki's appointment. Ghising, with wide name recognition, especially for reducing load-shedding, is viewed as untainted and enjoys youth support."
                },
                {
                    "factor": "Caretaker Cabinet and Constitutional Constraints",
                    "effect": "Decreases probability. Caretaker governments rarely transcend into full leadership unless a vacuum persists or elections decisively reward technocrats. Nepal's constitution outlines that the PM must command majority support in parliament, a hurdle for outsiders without established party infrastructure."
                },
                {
                    "factor": "Military and Presidential Influence",
                    "effect": "Neutral to slight increase. The military acquiesced to a popular caretaker, showing flexibility, but ultimately prefers stability and predictability, which favors established elites. However, if the crisis lingers, a technocrat like Ghising—if acceptable to both protestors and the security sector—could be a compromise."
                },
                {
                    "factor": "Base Rate for Technocratic/Energy Czar-type PMs",
                    "effect": "Strongly decreases probability. Historically, technocratic ministers, especially those with narrow administrative portfolios (e.g., electricity chiefs), rarely leap directly to PM. Nepalese PMs have almost always been party leaders or coalition brokers."
                },
                {
                    "factor": "Ghising's Individual Profile and Cross-Faction Support",
                    "effect": "Slightly increases probability. Ghising is seen as pragmatic, non-corrupt, and moderately charismatic, with some genuine cross-party and protester appeal, especially as a crisis manager."
                }
            ],
            "no_scenario": "After the March 2026 elections, mainstream party leaders (e.g., Maoist Center, UML, Nepali Congress) successfully bargain to form a coalition. Either a senior politician or possibly Karki herself (should technicalities render her eligible) is appointed PM. Ghising resumes his ministerial/technocratic role or exits the interim government. Any attempts to nominate him as PM do not secure sufficient parliamentary backing, as party elites close ranks.",
            "yes_scenario": "The election results in a deadlock, established parties prove unable to agree or their mandates are discredited, and protester movements retain leverage, pressuring for a unity technocratic government. Elite infighting, legality issues regarding political figures, or external mediation (military, president) push Ghising—respected by protestors, elites, and the public—as a consensus figure. With significant cross-party abstentions, Ghising wins a parliamentary confidence vote to become Nepal’s next non-caretaker PM.",
            "final_reasoning": "Although the Gen-Z protests have elevated technocratic/clean figures and Ghising is present in the interim government, Nepal’s entrenched party system, constitutional arrangements, and elite bargaining patterns favor established party leaders for the premiership. The most likely outcome is that after March 2026 elections, parliamentary arithmetic enables one of the major parties or their allies to claim the premiership. The status quo heavily weights toward party elites, and there is little precedent for energy czars or similar non-party technocrats becoming PM absent extraordinary deadlock. Ghising’s popularity and current ministerial post may earn him seniority, a deputy PM slot, or even a more prominent reformist role, but elite coalition dynamics and the constitutional requirement for parliamentary confidence make it a major stretch for him to emerge as PM. Thus, the probability is low though not negligible: public anger and protest actor leverage are at historic highs. On balance, 10% reflects a strong base-rate bias towards elite politicians, discounted slightly upward due to protest-mandated technocratic governance.",
            "final_probability": 10
        },
        "Nepal Political Journalism (Political Party Leadership Tracking)": {
            "time_to_resolution": "About 3.5 months (until December 31, 2025)",
            "perspective_relevance": "As an expert in Nepalese political journalism with a focus on tracking party leadership and cabinet formation, I have a nuanced understanding of Nepal’s elite dynamics and grassroots mobilization. I can contextualize recent anti-corruption protests, the surge of Gen Z influence, and how figures like Kulman Ghising are positioned within both the technocratic and populist frameworks that tend to shape government formation in Nepal, especially during caretaker and subsequent transition periods.",
            "status_quo": "The status quo is that Sushila Karki is serving as caretaker/interim Prime Minister, leading a cabinet composed of technocrats and Gen Z movement-aligned figures, including Kulman Ghising, who is currently Minister for Energy (and related portfolios). Sushila Karki and her government are not permanent; their explicit mandate is to steer the country until elections in March 2026.",
            "perspective_derived_factors": [
                {
                    "factor": "Kulman Ghising’s Non-political Technocrat Background",
                    "effect": "Decreases probability. Despite Ghising’s popularity and clean image, Nepalese Prime Ministers are typically seasoned politicians with deep party backing. Ghising has not held party office or shown alignment with major political parties’ leadership tiers."
                },
                {
                    "factor": "Gen Z Protest Movement’s Influence",
                    "effect": "Increases probability. The movement’s sudden, powerful role in shaping the caretaker government opens unusual space for outside figures—potentially breaking from elite party patterns. Ghising enjoys significant grassroots popularity and could, in theory, be propelled by protester momentum."
                },
                {
                    "factor": "Elite Bargaining and Constitutional Constraints",
                    "effect": "Decreases probability. Nepal’s post-conflict democracy is dominated by a handful of major parties (NC, UML, Maoists), and transitions—even in times of crisis—are typically resolved by compromise among these parties. A non-party technocrat lacks the machinery to secure a confidence vote in Parliament unless post-election arithmetic collapses party discipline."
                },
                {
                    "factor": "Proximity and Visibility from Caretaker Role",
                    "effect": "Increases probability slightly. Serving as a prominent minister in the caretaker cabinet raises Ghising’s national profile, making it somewhat easier to imagine either a civil society–led push or backroom deal installing him in the top job if politics become deadlocked again."
                },
                {
                    "factor": "Elections Scheduled for March 2026",
                    "effect": "Decreases probability for interim period. All available reporting states that Karki’s government is designed to last until the March elections. Unless there is another abrupt collapse of the caretaker government, the next 'non-caretaker' (i.e., political) Prime Minister will be chosen after the elections as per normal procedure."
                }
            ],
            "no_scenario": "The caretaker government, led by Sushila Karki, steers Nepal peacefully to the March 2026 elections. The established parties (NC, UML, Maoists, etc.) contest, and whichever party or coalition wins parliamentary majority forms a government headed by one of their established leaders (possibly Balen Shah, Prachanda, or another figure), not Ghising. Alternatively, if instability returns but party elites coalesce around a compromise candidate, it is another party leader or coalition-builder, not Ghising.",
            "yes_scenario": "A new round of crisis or deadlock—e.g., if the caretaker government fails, or if after the March elections there is deadlock and no established party leader can form a government—creates a power vacuum. Popular demand or the Gen Z movement demands further reforms; a broad alliance of protesters and elites agree on Ghising as neutral/unifying PM, and he then takes the oath and wins the parliamentary confidence vote, possibly as a stopgap or outside compromise.",
            "final_reasoning": "Examining the news and recent events, Ghising is certainly a national figure due to his energy-sector reforms and is associated with the hopeful, technocratic populism that the Gen Z movement admires. However, even in Nepal’s moments of dramatic upheaval, the transition to prime minister-ship has favored major party figures with intricate elite backing and parliamentary arithmetic on their side. The Karki caretaker government is explicitly intended to last until elections, and there is little precedent for a technocrat with no party power to immediately vault to the top post unless there is sustained outside protest and the party system collapses into further crisis. If, instead, the status quo hesitantly persists toward elections, the next 'non-caretaker' PM will be chosen post-election—and there, base rates strongly favor party elites, not technocrats. Ghising is made more visible by his ministerial role, but the fundamental barriers of Nepali parliamentary and elite party politics remain. Therefore, the base rate for non-politicians becoming PM is extremely low, with only minor elevation due to the protest-driven context.",
            "final_probability": 4
        },
        "Nepal Political Journalism (Electoral Trends Nepal)": {
            "time_to_resolution": "Approximately 3.5 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Nepal Political Journalism specializing in electoral trends, I bring an in-depth understanding of coalition-building, constitutional requirements, factional realignments, and the interplay between youth-led movements, traditional parties, and the military/establishment. My detailed grasp of both the base rates for political outsider breakthroughs and knowledge of how caretaker/transitional governments operate in Nepal are highly pertinent for this forecast.",
            "status_quo": "The status quo is that Sushila Karki leads an interim caretaker government formed with the backing of Gen-Z activists and the military. Kulman Ghising is currently Energy Minister and a prominent, popular technocrat, but not PM. The plan is for Karki to oversee the period until new elections in March 2026. Traditionally, Nepal’s caretaker/interim PMs rarely transition to full, elected PMs in subsequent regular governments without party/coalition power bases.",
            "perspective_derived_factors": [
                {
                    "factor": "Caretaker Nature of Current Government",
                    "effect": "Decreases probability. The constitutional mandate is for Karki to serve as a caretaker only and oversee elections. Precedent firmly supports a return to party politics for full PM appointment afterward."
                },
                {
                    "factor": "Popularity and Rising Profile of Kulman Ghising",
                    "effect": "Increases probability somewhat. Ghising is a well-known reformer, and his name was floated in Gen-Z circles as a transitional or even longer-term leader, but he lacks direct party affiliation and a traditional base in Parliament."
                },
                {
                    "factor": "Base Rate for Technocrat Outsiders Winning PM in Nepal",
                    "effect": "Decreases probability. Nepalese PM selection is overwhelmingly dominated by senior party figures with legislative bases. Technocrats, even extremely popular ones, almost never secure the PM role in multiparty negotiations post-crisis."
                },
                {
                    "factor": "Public Mood and Gen-Z Protest Movement Influence",
                    "effect": "Slightly increases probability. The legitimacy crisis and eruption of protest provide momentum for new faces; Ghising’s Gen-Z support is notable. But this influence is already reflected in interim rather than permanent appointment."
                },
                {
                    "factor": "Negotiations, Factionalism, and Army/Praetorian Input",
                    "effect": "Neutral to Decreasing. While the military helped facilitate caretaker appointments, it typically returns governing power to established parties after transitional stability is restored. No signal indicates preference for an outsider as the long-term PM."
                },
                {
                    "factor": "Ghising’s New Portfolio and Visibility",
                    "effect": "Slightly increases probability. As Energy Minister and visible cabinet member, Ghising could increase further public profile—but this alone is unlikely to overcome deep-rooted structural obstacles to a non-party outsider becoming PM."
                },
                {
                    "factor": "Timing of Elections/Parliamentary Process",
                    "effect": "Strongly decreases probability. The timing means the new PM post-transition will almost certainly emerge from March 2026 elections and coalition arithmetic. As things stand, Ghising is not positioned as a party leader or coalition anchor."
                }
            ],
            "no_scenario": "After Sushila Karki’s caretaker tenure, fresh elections are held as scheduled and the new PM is selected among established major-party leaders (e.g., Balen Shah, leaders from CPN-UML, Congress, or Maoist Centre). Ghising remains a respected technocratic minister, but is not considered by the main parties for the PM post due to his lack of a party mandate or coalition leadership.",
            "yes_scenario": "An extraordinary sequence occurs: either national trauma from further unrest, or a broad, cross-party and public consensus emerges to pick an outsider as a symbolic unity figure. Kulman Ghising, buoyed by immense public support and possible Gen-Z–military–party elite agreement, is nominated and wins a confidence vote in parliament, despite not commanding a traditional political base.",
            "final_reasoning": "Despite his public stature and Gen-Z endorsement for possible leadership, Kulman Ghising’s lack of a party machine, legislative base, or coalition support is a decisive structural barrier. Nepal’s history overwhelmingly favors established senior party figures as PMs, especially when it comes to forming governments post-election or post-transition. The caretaker/interim government model is a stopgap—the actual non-caretaker PM will be chosen after the scheduled elections, almost certainly from among parties able to command a majority or lead a coalition. Ghising’s current visibility is a product of this extraordinary moment, but barring an unforeseen crisis/shock or a radical breakdown among political parties, technocrats like him will remain on the sidelines of ultimate executive power. The base rate for a figure like Ghising becoming Nepal’s non-caretaker PM is extremely low, and recent events—while they increase his profile—do not change the fundamental coalition arithmetic or party-centric realities of Nepalese governance.",
            "final_probability": 3
        },
        "Political Science (Parliamentary Democracy Nepal)": {
            "time_to_resolution": "Approximately 3.5 months; closes January 1, 2026.",
            "perspective_relevance": "As an expert in Political Science focused on Nepal’s parliamentary democracy, I bring deep understanding of party dynamics, informal power negotiations, coalition logic, Gen-Z protester motivations, the evolving constitutional order under stress, and the reputational constraints on caretaker/interim appointments, especially in times of crisis and anti-corruption revolt. I can contextualize political shifts following mass mobilization and elite consensus-building as seen in past Nepali transitions.",
            "status_quo": "Sushila Karki is currently the caretaker Prime Minister, leading an interim technocratic cabinet (including Kulman Ghising as energy/infrastructure minister), mandated by a Gen-Z–military–presidential consensus to oversee calm and conduct elections in March 2026. The status quo outcome is for Karki or another technocratic figure—not Ghising—to remain/ascend as interim caretaker; a non-caretaker (politically mandated, confidence winning) PM is not imminent unless elections or a constitutional pivot/motion occurs.",
            "perspective_derived_factors": [
                {
                    "factor": "Current caretaker mandate and limited caretaker role",
                    "effect": "Decreases probability. The interim government is explicitly defined as a caretaker to oversee elections, not to produce a substantive new non-caretaker PM during the term. Any change before scheduled elections would require an out-of-cycle crisis or breakdown."
                },
                {
                    "factor": "Gen-Z protest movement's anti-establishment sentiment and elite negotiations",
                    "effect": "Slightly increases probability for outsiders, but tempers with unpredictability. Kulman Ghising is a popular outsider, symbolizing technocratic ability and relative incorruptibility, making him an attractive protest candidate in certain crises. However, protest movement’s leaders accepted a consensus caretaker in Sushila Karki, not Ghising, signaling a preference for rule/procedure first."
                },
                {
                    "factor": "Party system fluidity and distrust of legacy elites",
                    "effect": "Increases probability, but only in a scenario of new crisis or parliamentary collapse. Major parties have been sidelined after mass protests, but their machinery could still ‘return to form’ post-crisis. If parties remain weak and a popular technocrat is required for legitimacy, Ghising becomes plausible, but only if the status quo collapses or Karki is forced out."
                },
                {
                    "factor": "Electoral calendar (March 2026 general election)",
                    "effect": "Significantly decreases probability. There is little time/opportunity for a confidence-vote, non-caretaker PM to emerge by January 1, 2026, unless a wholly unexpected constitutional/electoral collapse happens and a new interim caretaker pivots into a ‘full’ term."
                },
                {
                    "factor": "Kulman Ghising’s role and constitutional eligibility",
                    "effect": "Slightly increases probability, but with caveats. Ghising holds a senior ministerial post and is a trusted technocrat. In theory, he could be advanced as a consensus leader if further deadlock/paralysis occurs. However, as of September 19, 2025, there is zero credible reporting or constitutional move to install him as PM outside a strict caretaker context."
                },
                {
                    "factor": "Lack of parliamentary process and transitional instability",
                    "effect": "Decreases probability. Parliament has been dissolved, political parties are disrupted, and the caretaker government’s explicit charge is limited. No momentum currently for a parliamentary realignment or vote of confidence for Ghising as PM."
                }
            ],
            "no_scenario": "Nepal continues under an interim caretaker government (currently led by Sushila Karki) through January 1, 2026, as mandated, with elections scheduled for March and no new full-term prime minister is chosen (least of all Ghising) in the interim period. Kulman Ghising retains his role as minister but never becomes prime minister, or if he does, it is only as a caretaker/interim leader (which does not satisfy the ‘non-caretaker’ and confidence-voted criteria).",
            "yes_scenario": "A major and unforeseen breakdown of the caretaker arrangement (such as health crisis for Karki, internal revolt within the interim cabinet, or a further protest wave) leads to the elevation of Kulman Ghising as acting/interim prime minister, and parliament is reconvened for an urgent vote of confidence installing him as a non-caretaker (full authority) PM before the January 1, 2026 resolution deadline. This would likely require consent from the President, military, protest movement, and what remains of the parliament—an extraordinary convergence of crisis events.",
            "final_reasoning": "While Kulman Ghising holds a prominent role and is a symbolically resonant figure with credibility among the protest generation, the structure, intent, and parliamentary logic of Nepal’s current caretaker government drastically constrain the emergence of a new non-caretaker PM before the mandated March 2026 elections. All public reporting and political statements indicate Ghising is not even the principal caretaker (that role is Sushila Karki), and there is no parliamentary process underway to install a new, confidence-voted head of government. To see a ‘Yes’ outcome, not only would the caretaker norm have to break down, but a new prime ministerial rotation would have to occur within months, and it would have to be Ghising, not another candidate. Given the powerful incentives in Nepali crisis politics to avoid further instability and prioritize technocratic caretaker leadership, and the complete lack of any current parliamentary project to make Ghising PM, I assess the probability as extremely low, above zero only to acknowledge the ongoing unpredictability of Nepal’s post-uprising context.",
            "final_probability": 2
        },
        "Political Science (Coalition Politics Theories)": {
            "time_to_resolution": "Approximately 3.5 months (Question closes January 1, 2026; forecast dated September 19, 2025)",
            "perspective_relevance": "As a Political Science expert in Coalition Politics Theories, my perspective is valuable in dissecting the dynamics of coalition formation, the roles of protest movements in political bargaining, the impact of interim/caretaker governments, the relationship between technocrats and populist actors, and the historic likelihood of outsider technocrats like Kulman Ghising ascending to the highest executive office in Nepal. Nepal’s history with party-driven coalition governments, deep ideological divides, and clever balancing of elite and popular pressures make the theoretical toolkit for coalition politics especially salient for sorting scenarios post-mass protest and amid a weak/fragmented political landscape.",
            "status_quo": "The status quo is a caretaker/interim government led by Sushila Karki, with key technocrats (including Kulman Ghising) as ministers; this government is tasked with preparing for general elections in March 2026. Nepalese prime ministers are usually party political figures produced by post-election coalition deals among mainstream parties, not technocrat interim figures.",
            "perspective_derived_factors": [
                {
                    "factor": "Technocrat/Outsider Odds in Executive Selection",
                    "effect": "Decreases the probability significantly. Historically, Nepal selects PMs from among established political party leaders as the product of elite coalition bargaining after general elections––technocrats rarely, if ever, make it to the top executive position except as short-lived caretakers. Ghising is presently a minister in the caretaker cabinet; the jump to PM is distinct and would require elite consensus."
                },
                {
                    "factor": "Gen-Z Protest Influence",
                    "effect": "Increases probability slightly, but only in the context of the current atypical situation. The Gen-Z movement has upended conventional elite politics and promoted outsider/technocrat figures, as seen in Sushila Karki’s installation. However, elite accommodation and system reversion are likely as unrest and revolutionary energy dissipate or are co-opted."
                },
                {
                    "factor": "Caretaker Mandate and Election Timeline",
                    "effect": "Decreases probability. The Karki government is explicitly labeled as caretaker, given a defined mandate until the March 2026 elections. The next non-caretaker PM is thus almost certain to be the leader of the coalition or party able to command a parliamentary majority after elections, rather than a member of the caretaker cabinet."
                },
                {
                    "factor": "Political Party System Resilience",
                    "effect": "Decreases probability. Despite upheavals, Nepal’s established parties (e.g., Communist factions, Congress, etc.) have proven resilient, recovering after protest waves or elite ruptures. They control patronage and coalition mathematics."
                },
                {
                    "factor": "Kulman Ghising’s Political Capital and Public Popularity",
                    "effect": "Increases probability very slightly. He is widely lauded for his role solving Nepal's power crisis and is regarded as a competent, honest technocrat. But popularity alone and favorable protest movement opinion rarely suffice to override party calculations post-election in parliamentary systems."
                }
            ],
            "no_scenario": "Status quo persists: After March 2026 elections, established parties bargain for coalition government, producing a party leader (mainstream or possibly Gen-Z-aligned but a party figure) as PM. Ghising remains a technocrat or exits government when the caretaker cabinet dissolves. No elite convergence on Ghising for the premiership materializes, or he lacks direct party organizational backing. Thus, another figure—likely from major parties or prodemocracy coalitions—becomes PM.",
            "yes_scenario": "Extraordinary scenario post-election: Either established parties are utterly discredited, or no coalition can form a viable government, leading to a confidence/leadership vacuum and the President, with military/accommodation from Gen-Z movement, pushes for a widely respected technocrat (Ghising) as a compromise PM. Alternatively, a populist/anti-corruption coalition emerges, wins a near-majority, and nominates Ghising, despite his lack of party background. Both require extreme institutional breakdown or a truly revolutionary shift—rare in parliamentary systems and unprecedented in Nepal’s democratic era.",
            "final_reasoning": "Base rates in Nepal and comparable parliamentary democracies show the next PM almost always emerges from established parties via coalition negotiations post-election. Ghising’s caretaker minister status and his technocratic reputation, while helping him to be in the mix for interim posts, are insufficient for traversing to the top executive post after the elections—especially as the system is engineered to revert to established party control. The Gen-Z movement’s impact has been high in the interim period but is unlikely to fundamentally change coalition logics when elections are held and parliament reconvenes: party apparatuses, not technocratic popularity, generally dominate PM selection. All recent news confirms Karki’s government is caretaker; Ghising is not even described as a leading post-election contender except among a minority of protest activists—he has no party machine support and is not leading a movement or being seriously floated by top elites/power brokers for PM in the regular government. Thus, 'No' (i.e. Ghising not becoming the next non-caretaker PM) is extremely likely barring extremely unusual upheaval or total party collapse.",
            "final_probability": 3
        },
        "Political Science (Leadership Selection Party Politics)": {
            "time_to_resolution": "Approximately 3.5 months remain, as the window is from after September 11, 2025 to before January 1, 2026.",
            "perspective_relevance": "As a political scientist specializing in leadership selection and party politics, I draw on base rates of technocrat/minority candidate elevation during crisis caretaker periods, coalition bargaining dynamics, and the unique configuration of Nepal’s parliament and patronage system. My expertise in analyzing protest-induced leadership transitions and interim governments, especially where non-traditional actors are empowered, is highly relevant to evaluating Ghising's prospects.",
            "status_quo": "Sushila Karki is serving as a caretaker prime minister with a small, technocratic interim cabinet (including Ghising), pending elections scheduled for March 2026. Major parties and Gen-Z protest leaders have endorsed Karki’s caretaker role, with a mandate to restore order and oversee free elections. If no extraordinary developments occur, the next PM after the election will likely emerge from a major political party, and the interim PM role will not convert into a full premiership for any caretaker minister, including Ghising.",
            "perspective_derived_factors": [
                {
                    "factor": "Caretaker government’s explicit mandate",
                    "effect": "Decreases probability. The caretaker set-up is formally and informally limited to stabilization and preparatory tasks; post-election transition is overwhelmingly expected to produce a conventional, party-backed prime minister, not a technocratic caretaker or one of her ministers."
                },
                {
                    "factor": "Caretaker exclusion from contestation",
                    "effect": "Strongly decreases probability. Political precedents and Nepalese constitutional norms discourage, and usually bar, current interim ministers from standing as full PMs immediately after serving as caretaker government. Ghising’s role as a technocrat and non-party caretaker further reduces the likelihood of a transition to the full PM post."
                },
                {
                    "factor": "Lack of independent party base for Ghising",
                    "effect": "Decreases probability. Ghising is a well-regarded technocrat but has no record of leading a party or significant parliamentary group, both of which are essential for winning a vote of confidence post-election. Nepali politics remain dominated by major parties with entrenched parliamentary blocs."
                },
                {
                    "factor": "Unusual recent volatility—Gen-Z protest influence",
                    "effect": "Very slightly increases probability. The power vacuum and the extraordinary influence of non-traditional, youth-led Gen-Z groups in this transition do marginally improve the chances for technocratic or activist candidates, especially those with popular or anti-corruption reputations (like Ghising). However, this factor is insufficient to overcome institutional inertia and party dominance."
                },
                {
                    "factor": "Public popularity and recognition of Ghising",
                    "effect": "Slightly increases probability. Ghising’s prominence as winner over Nepal’s power crisis and as a cabinet minister enhances his visibility and some degree of cross-partisan popularity, making his technical candidacy at least plausible in an ongoing crisis. Nonetheless, in Nepal’s parliamentary system, popularity alone rarely suffices without elite and party backing."
                }
            ],
            "no_scenario": "Parliamentary elections are held on or before March 5, 2026 (as mandated). Post-election, a major party coalition or alliance (potentially UML, Nepali Congress, or CPN-MC) forms the government. The leader chosen is from within these parties—not Ghising—who returns to private life or a ministerial role, as technocrats usually do. No caretaker/interim minister is selected as full PM. Ghising does not take the oath as PM and fails to win a vote of confidence.",
            "yes_scenario": "Extraordinary instability persists after the elections—perhaps due to a deadlock between parties, collapse of coalition negotiations, or renewed massive social mobilization and youth protest that reject all major party leaders. In such a systemic crisis, Ghising (as a highly regarded and non-partisan figure with Gen-Z support) is selected as a consensus candidate for PM, is appointed, takes the oath, and wins a vote of confidence due to a broad, crisis-forged parliamentary accord.",
            "final_reasoning": "Base rates in global and Nepalese politics overwhelmingly favor the return of a party politician as the next non-caretaker PM, not a technocrat serving in a caretaker cabinet. Ghising has no party machine, parliamentary bloc, or precedent of such a leap; caretaker ministers almost never become full PMs immediately. Even with the Gen-Z movement’s outsized role in precipitating the caretaker government, the process for selecting a permanent PM is controlled by parliamentary arithmetic and party agreement. Ghising’s popularity provides a very slim, outside path—should the election lead to continued deadlock, and the new mass movement insists. But this is highly improbable: the most compelling scenario is a reassertion of party politics after the acute caretaker period. I incorporate 3-5% for high-impact tail events (new violence, protest paralyzing parliament, party system collapse), but overall assign very low odds on Ghising becoming the next non-caretaker PM.",
            "final_probability": 4
        },
        "South Asian Studies (Nepalese Political History)": {
            "time_to_resolution": "About 3.5 months (from 2025-09-19 to before 2026-01-01)",
            "perspective_relevance": "My expertise in South Asian Studies with a focus on Nepalese political history equips me to contextualize current events within Nepal's unique patterns of elite contestation, youth protest, constitutional norms, and post-conflict institutional fragility. Recent history (since 2006) includes abrupt government collapses, intense street politics, and the periodic rise of technocrats or reformist outsiders under public pressure, but persistent institutional norms often favor established party figures or those who can broker cross-party/army deals.",
            "status_quo": "Nepal is under a caretaker government led by Sushila Karki, with Kulman Ghising serving as energy minister. The system is in a holding pattern until fresh elections scheduled for March 2026; Ghising is not currently PM.",
            "perspective_derived_factors": [
                {
                    "factor": "Technocratic Popularity of Kulman Ghising",
                    "effect": "Increases probability moderately—Ghising has a strong reputation as a corruption fighter and practical technocrat, admired by the Gen-Z movement and a hero to many for ending Nepal's energy crisis. The Gen-Z protests have propelled unlikely candidates to prominence."
                },
                {
                    "factor": "Constitutional and Institutional Norms",
                    "effect": "Decreases probability—Nepal’s constitutional arrangements and the historical behavior of the president, military, and major parties tend to favor either experienced politicians or well-respected institutional figures (e.g., former Chief Justice Karki) in transitions. Nepal has rarely (perhaps never) elevated a technocratic figure directly from minister/agency chief to PM except under coalition party support."
                },
                {
                    "factor": "Gen-Z Movement and Youth Street Power",
                    "effect": "Moderately increases probability—The extraordinary influence of protest movements this cycle means outsiders like Ghising may have unusually high leverage, and the chaos may permit a break with precedent."
                },
                {
                    "factor": "Role of Established Parties and Army",
                    "effect": "Decreases probability—Even as the Gen-Z movement dominates the street, the top-down mechanism of selecting a PM ultimately requires buy-in from the president, major parties, and army. Current reporting suggests Karki was a compromise among these factions, with Ghising as cabinet, not PM, and no recent sign of a change."
                },
                {
                    "factor": "Sequencing: Interim Government versus Permanent Government",
                    "effect": "Decreases probability—The next 'non-caretaker' PM per the resolution will only be named after parliamentary elections scheduled for March 2026. Kulman Ghising is in the interim cabinet but there is little to no indication from the reporting that he has either (A) the party backing, (B) personal ambition, or (C) a mechanism to become PM in the period between now and Jan 1, 2026, unless an extraordinary breakdown occurs."
                },
                {
                    "factor": "Base rate for Technocrats Becoming PM",
                    "effect": "Sharply decreases probability—Historically, Nepal's PMs are senior party leaders (with only narrow or party-brokered exceptions), and there is no precedent since the advent of the Republic for a career technocrat like Ghising to leap directly to PM outside a caretaker context."
                },
                {
                    "factor": "Recent Appointments and Media Signals",
                    "effect": "Strongly decreases probability—All major outlets describe Ghising as a minister under Sushila Karki in a cabinet clearly labelled as 'interim' until elections, with no reporting of a plan to elevate him to the premiership."
                }
            ],
            "no_scenario": "Nepal proceeds under the interim Karki government, holds elections in March 2026, and the major parties nominate one of their own as the next PM. Even if the Gen-Z movement tries to push for Ghising, the presidency, parties, and army will not allow such a break with norms before Jan 1, 2026. Ghising continues in his ministerial role or leaves with the rest of the caretaker government.",
            "yes_scenario": "Extreme instability or a new crisis (e.g., the interim government collapses) results in public and elite consensus for a non-partisan, technocratic PM. Ghising's strong anti-corruption credentials, popularity with Gen-Z, and prior recognition as a trustworthy crisis manager lead the president, army, and key factions to appoint him as PM, and he wins the parliamentary confidence vote between Sep 11, 2025 and Jan 1, 2026. This would require the interim government to fall and elite/Gen-Z compromise to coalesce around Ghising—an unlikely but not impossible 'break-glass' scenario.",
            "final_reasoning": "While Kulman Ghising enjoys rare cross-generational popularity—especially among the Gen-Z movement—and was part of the inner circle of cabinet formation, all public, legal, and practical signals point to his current ceiling as a (powerful) interim minister. His path to the prime ministership in the relevant timeframe would require either: (A) the interim Karki government collapsing and political actors agreeing (against precedent and large-party interests) to make him PM in a non-caretaker capacity, OR (B) the implementation of a novel solution outside established party/army channels. The base rate of technocrats becoming PM outside party sponsorship is near-zero in Nepal's post-2006 history. Furthermore, all public statements and media coverage since the protests identify Sushila Karki as interim PM until the election, with Ghising as her energy minister—nothing supports an imminent switch. The military, president, and parties have little incentive to endorse Ghising unless a wholly new breakdown/consensus emerges. Therefore, weighted most heavily toward the status quo (Karki until elections, then a party leader), but allowing a sliver of probability on revolutionary exceptionalism given the unusual political environment.",
            "final_probability": 3
        },
        "South Asian Studies (Regional Power Dynamics South Asia)": {
            "time_to_resolution": "Approximately 3.5 months (from 19 September 2025 to 1 January 2026).",
            "perspective_relevance": "As a South Asian regional power dynamics expert, I bring deep insight into Nepal’s civil-military relations, elite politics, social movements, and historical succession processes. Understanding the interplay among mass protests, caretaker arrangements, and the evolving power of youth-led (Gen Z) movements, as well as how extra-parliamentary pressures and institutional constraints shape the emergence of new political leaders, places me in a strong position to analyze the plausibility of a technocratic figure like Kulman Ghising becoming the next permanent/non-caretaker prime minister.",
            "status_quo": "Interim PM Sushila Karki, a former chief justice, leads a transitional cabinet (including Kulman Ghising as energy/infrastructure minister) tasked with overseeing Nepal until elections scheduled for March 2026. The establishment typically returns to major-party figures (e.g., KP Oli, Sher Bahadur Deuba, Pushpa Kamal Dahal) as PMs after interim periods.",
            "perspective_derived_factors": [
                {
                    "factor": "Nepal’s political establishment inertia",
                    "effect": "Decreases: Historically, even after disruptive events, Nepal’s legislature and patronage networks reassert themselves, typically producing PMs from among established party leaders once constitutional process resumes post-interim."
                },
                {
                    "factor": "Gen Z protest movement and desire for anti-corruption/technocratic leadership",
                    "effect": "Increases: The shock of 72+ deaths, collapse of the Oli government, and youth-led agitation has created unprecedented demand for new faces and nontraditional contenders like Ghising. His prior popularity for resolving the power crisis enhances his public profile."
                },
                {
                    "factor": "Caretaker principle and constitutional timing",
                    "effect": "Decreases: The interim government is explicitly tasked with conducting elections, not producing a new full-term government. The system is designed to revert to electoral legitimacy; technocrats rarely transition from caretaker roles directly to permanent heads of government in Nepal."
                },
                {
                    "factor": "Ghising’s ministerial portfolio and limited political base",
                    "effect": "Decreases: While he was a serious contender for the caretaker post, he lacks a mass party organization, electoral history, or factional machinery—key prerequisites for becoming PM in Nepal’s multiparty, coalition-heavy parliamentary system."
                },
                {
                    "factor": "Possible split in Gen Z revolutionary unity after transition",
                    "effect": "Decreases: Notes of schisms and infighting among Gen Z and protest groups post-uprising (reflected in scuffles over interim leadership, various figures backed by different factions). A fragmented movement may not rally around Ghising, further diluting his momentum."
                },
                {
                    "factor": "Unique establishment constraints (e.g., skepticism about former justices, military influence, President’s role)",
                    "effect": "Decreases: Army and President have historically shown reticence to endorse complete outsiders for PM once normalcy returns, preferring known quantities even if rebels or technocrats are temporarily elevated during crisis."
                }
            ],
            "no_scenario": "Upon completion of the caretaker government’s mandate, Nepal conducts elections as scheduled (March 2026). The parliamentary system rewards a coalition of major parties (Nepali Congress, NCP factions, etc.), and as usual, a traditional politician with party machinery and a legislative seat is selected as PM. Ghising, without an electoral mandate or party backing, does not take the oath as non-caretaker PM.",
            "yes_scenario": "Against expectations, either one of three things happens: (a) further collapse of party legitimacy leads to a broad-based consensus around Ghising as a unity figure even post-election; (b) intervention by President or military accelerates his nomination due to continued unrest or public demand for a non-political technocrat; or (c) protest movement's organizational cohesion miraculously holds, propelling Ghising into formal party nomination and a legislative seat, thus enabling him to take oath as the full, non-caretaker prime minister after new elections.",
            "final_reasoning": "While Kulman Ghising’s popularity and technocratic reputation are high, driven by Gen Z’s demand for genuine change, the Nepali political ecosystem consistently defaults to established actors in the aftermath of caretaker periods—especially under constitutional mandates for a fresh electoral process. Ghising’s absence of a dedicated party base, limited history in party politics, and the caretaker government’s explicit remit to return to normal parliamentary proceedings make his elevation to non-caretaker PM extremely unlikely. The most probable path is a reversion to major-party candidates following elections. For Ghising to become the next full PM would require an unprecedented, coordinated bypass of electoral and party realities—which, despite the unique tumult, remains improbable.",
            "final_probability": 3
        }
    },
    "deliberation_probability": [
        2,
        10,
        4,
        3,
        2,
        3,
        4,
        3,
        3
    ],
    "deliberation_mean_probability": 3.7777777777777777,
    "deliberation_sd": 2.438123139721299,
    "deliberation_probability_result": 4,
    "group_results": {
        "comparativePoliticsAnalystCabinetFormationProcess": {
            "forecaster_to_engage": "Comparative Politics Analyst (Elite Bargaining Analysis)",
            "response_type": "critique",
            "response": "While the Elite Bargaining Analysis correctly highlights the importance of party-centric parliamentary politics and the extraordinary leverage of protest actors at the apex of the crisis, the assigned 10% probability appears disproportionately high relative to actual Nepali political base rates and the post-uprising institutional settlement. Nepal's system—especially in moments of instability—nearly always defaults to major-party-negotiated solutions, and even technocratic/outsider episodes (e.g., during royal or post-coup transitions) were brief, exceptional, and tightly circumscribed. The interim Karki-led cabinet is explicitly contracted to manage elections, and all major elite actors—including the president and army—have actively sought reversion to constitutional process. There is no indication that either a broad elite consensus or a renewed breakdown is accelerating Ghising, a technocratic caretaker minister with limited party or military ties, into the highest office before elections. Historic Nepali transitions show an extraordinarily low rate of direct technocrat-to-PM jumps in non-caretaker, confidence-winning roles. While a modest tail risk exists for systemic collapse, the jump from status quo to a 1-in-10 chance is excessive. Probabilities closer to the 2-4% range more accurately reflect both history and process as they stand."
        },
        "comparativePoliticsAnalystEliteBargainingAnalysis": {
            "forecaster_to_engage": "Nepal Political Journalism (Political Party Leadership Tracking)",
            "response_type": "defense",
            "response": "This forecaster provide a sound integration of both Nepal’s party-driven parliamentary logic and the specific exceptional context produced by the Gen-Z protests. By noting Ghising’s technocratic popularity but emphasizing the enduring power of party organization and coalition arithmetic, their forecast synthesizes short-term crisis conditions with enduring structural factors. Their reasoning also correctly recognizes that heightened profile as a protest-era minister may help Ghising in future political contests or reforms, but is not sufficient for the leap to prime ministership under the current parliamentary timeline. The forecaster’s near-zero probability aligns with Nepal’s base rates, yet remains incrementally above zero to incorporate the truly unusual volatility in current events—a practice well grounded in comparative historical and institutional analysis."
        },
        "nepalPoliticalJournalismPoliticalPartyLeadershipTracking": {
            "forecaster_to_engage": "Political Science (Leadership Selection Party Politics)",
            "response_type": "defense",
            "response": "This forecaster convincingly applies global and Nepali base rates, accurately reflecting the extreme rarity of technocrats or caretaker ministers ascending directly to the full premiership. Their analysis is especially strong in explaining how party machine control and parliamentary numbers, rather than public popularity or even Gen Z protest leverage, almost universally determine the selection of non-caretaker prime ministers. The forecast also wisely allots a minimal but nonzero probability to account for systemic shocks—acknowledging uncertainty without inflating tail-risk. The scenario construction is robust, and the overall probability is closely aligned with recent Nepali experience, constitutional norms, and coalition logic. Their forecast is thus a precise, status quo-weighted appraisal that withstands scrutiny both in comparative and local context."
        },
        "nepalPoliticalJournalismElectoralTrendsNepal": {
            "forecaster_to_engage": "South Asian Studies (Nepalese Political History)",
            "response_type": "defense",
            "response": "This forecaster offers a particularly nuanced reading of Nepal's political trajectories, carefully distinguishing between protest-period volatility and the entrenched structural logics that dominate the PM selection process. Their assessment puts appropriate weight on both the historical incapacity of technocrats to secure the PM role absent a durable party base, and the explicit caretaker remit of the current government. By accounting for exceptional protest-driven dynamics while ultimately grounding the forecast in post-2006 patterns—where caretaker ministers nearly never transition directly to the premiership—they justify a low, but nonzero, probability. Their reasoning demonstrates a sophisticated appreciation for both history's inertia and the low-probability possibilities that seismic events could open a spot for a figure like Ghising. This blend of foundational analysis and allowance for rare events mirrors best practice in high-stakes political forecasting."
        },
        "politicalScienceParliamentaryDemocracyNepal": {
            "forecaster_to_engage": "Political Science (Coalition Politics Theories)",
            "response_type": "defense",
            "response": "This forecaster provides a well-reasoned, historically attuned argument rooted in coalition theory and the Nepali case's distinct status quo bias. They correctly emphasize that coalition arithmetic overwhelmingly determines the identity of the executive in parliamentary systems like Nepal's, especially after periods of exceptional instability are managed by technocratic or caretaker governments. Their recognition that the Gen-Z protest wave has influenced the caretaker phase without fundamentally altering the underlying party-centric foundation of PM selection is key, and fits the available news coverage demonstrating all major stakeholders' preference for returning to normal parliamentary procedure after elections. The argument further distinguishes between symbolic prominence (which Ghising clearly has) and sustainable elite support and party infrastructure (which he lacks). Ultimately, the assignment of a low (yet slightly nonzero) probability accurately reflects the theoretical possibility of discontinuity in crisis, without departing from empirical and historical realities of Nepali politics. Their approach demonstrates best-practice calibration for base rates versus rare contingencies."
        },
        "politicalScienceCoalitionPoliticsTheories": {
            "forecaster_to_engage": "South Asian Studies (Regional Power Dynamics South Asia)",
            "response_type": "defense",
            "response": "This forecaster’s reasoning astutely applies historical analysis of party dominance in Nepali executive selection post-caretaker transitions and supplements it with sensitivity to the unique but ultimately insufficiently transformative Gen-Z protest context. They appropriately highlight the decisive barriers posed by Ghising’s lack of party machine or coalition base, and emphasize that caretaker governments in Nepal are designed precisely to prevent direct technocratic ascension to full executive authority. Their forecast’s minimal probability judiciously reflects the theoretical risk of further party collapse or a revolutionary event, but is otherwise harmonized with the overwhelming parliamentary and constitutional inertia that will—barring systemic breakdown—redirect executive power to party elites after elections. This nuanced weighting between historical continuity and rare volatility upholds high standards of political forecasting discipline."
        },
        "politicalScienceLeadershipSelectionPartyPolitics": {
            "forecaster_to_engage": "Comparative Politics Analyst (Cabinet Formation Process)",
            "response_type": "defense",
            "response": "This forecaster rightly foregrounds the critical significance of the status quo caretaker arrangement and Nepal's post-crisis institutional processes. By detailing the centrality of the negotiated presidency-army-Gen-Z compromise and emphasizing the purpose-bound, temporary remit for both Karki and her ministers (including Ghising), their analysis accurately captures the low propensity for deviation toward a technocratic jump to the premiership. They are correct to cite both the lack of current evidence for elite collapse and the practical barriers for a caretaker minister to win a parliamentary confidence vote—given party dominance in post-2006 Nepal. The probability selected (2%) reflects a disciplined application of base rates, allowing only the slimmest tail risk for unprecedented breakdown or creative consensus. This approach exemplifies both thoroughness and prudent calibration when the historical record and current mechanisms so heavily favor continuity."
        },
        "southAsianStudiesNepalesePoliticalHistory": {
            "forecaster_to_engage": "Nepal Political Journalism (Electoral Trends Nepal)",
            "response_type": "defense",
            "response": "This forecaster demonstrates a judicious and historically informed approach, combining a clear-eyed grasp of Nepal’s political realities with an appropriate calibration for protest-driven volatility. The crux of their argument lies in recognition that—despite Ghising’s popularity and symbolic appeal due to the Gen-Z movement—the mechanisms determining Nepal’s non-caretaker PM have always been anchored in party competition and coalition numbers. They precisely anchor their forecast to the frequency with which established politicians, rather than high-profile technocrats or protest-era ministers, have acquired executive authority. The forecast is further strengthened by noting that unless a sustained, radical system shock recurs, Ghising’s present role is more likely to boost his reformist credentials for the future than to signal any immediate route to the premiership. Their extremely low, but nonzero, probability enables prudent tail-risk management while never losing sight of the base-rate dominance of party actors. This is a model of clear and compelling comparative and local political analysis."
        },
        "southAsianStudiesRegionalPowerDynamicsSouthAsia": {
            "forecaster_to_engage": "Comparative Politics Analyst (Elite Bargaining Analysis)",
            "response_type": "critique",
            "response": "The 10% probability assigned here is difficult to justify in light of actual Nepali historical base rates and the clear signals from all major settlement actors. The post-uprising compact returned to constitutional process: even disruptive protest moments in modern Nepali politics have quickly reverted to party-centric settlements, usually bypassing technocrats. While public demand and the shock of the Gen-Z movement are unusually intense, Ghising’s current role as a popular but (so far) non-party-affiliated minister, and the explicit caretaker/technocratic design of the current government, mean the leap to full premiership—with confidence vote and post-caretaker legitimacy in just over three months—is vanishingly unlikely. The probability of system collapse, broad elite consensus for a technocratic unity PM, or the failure of all party mechanisms is very low. In context, a 2-4% estimate (as reflected by several other forecasters) more accurately mirrors both the historical record and the emerging settlement than 10% does."
        }
    },
    "revision_results": {
        "Comparative Politics Analyst (Cabinet Formation Process)": {
            "my_phase1_final_probability": 2,
            "reasoning_for_revised_probability": "Reviewing the group deliberation confirms the original assessment: there is strong, multi-perspective consensus among comparative politics, party politics, journalism, and South Asian studies experts that Nepal's post-protest settlement reverts heavily to status quo institutional actors. All agree that technocrats like Ghising—however popular or momentarily prominent—face extremely steep structural and procedural barriers to becoming the next non-caretaker prime minister. The only somewhat divergent forecast was from the Elite Bargaining Analysis, which assigned a 10% probability; upon critique, it was concluded that this over-weights tail risk relative to actual historical base rates and current institutional evidence. There has been no new information or credible scenario elevating Ghising's likelihood above vanishingly low levels, and all foreseeable scenarios over the next 3.5 months strongly favor continuity with caretaker rule until elections, then a party-based selection. Accordingly, the original 2% probability remains well justified—if anything, group consensus supports keeping or even rounding slightly downward.",
            "revised_probability": 2
        },
        "Comparative Politics Analyst (Elite Bargaining Analysis)": {
            "my_phase1_final_probability": 10,
            "reasoning_for_revised_probability": "After reviewing the additional perspectives in group deliberation, especially the critique emphasizing Nepal’s extremely low base rate for technocratic ministers ascending directly to full premiership in non-caretaker capacity, I find the consensus robustly supports an even stronger status quo bias. The arguments highlighting the explicit institutional endpoint of the Karki caretaker government, the lack of any parliamentary or elite initiative toward making Ghising PM, and the enduring dominance of established party politics after crisis periods are compelling. My original 10% assessment intentionally over-weighted the possibility of ongoing volatility and protest leverage, but the repeated historical pattern in Nepal, as documented by several forecasters, indicates that technocrats like Ghising face nearly insurmountable structural barriers absent another major systemic rupture. In light of this, I am revising my probability downward.",
            "revised_probability": 4
        },
        "Nepal Political Journalism (Political Party Leadership Tracking)": {
            "my_phase1_final_probability": 4,
            "reasoning_for_revised_probability": "After reviewing group deliberations, especially the critiques highlighting Nepal’s history of party-dominated parliamentary transitions and the rarity of non-party technocrats ascending to the premiership, I find my original probability well-supported. Multiple independent experts, across comparative politics, South Asian studies, and political science, converged around a 2–4% base rate, robustly defending the dominance of status quo elite-driven outcomes. The only slightly higher probability (10%) provided was effectively critiqued as excessive for the real-world constraints of Nepal’s constitutional and party system. No new compelling evidence or argument shifts my quantitative or qualitative assessment. Tail risk is sufficiently captured in my original probability.",
            "revised_probability": 4
        },
        "Nepal Political Journalism (Electoral Trends Nepal)": {
            "my_phase1_final_probability": 3,
            "reasoning_for_revised_probability": "Reviewing both my initial forecast and the strong consensus reflected in the group deliberation solidifies my view that the probability for Kulman Ghising becoming the next non-caretaker Prime Minister of Nepal is extremely low. Nearly every specialist across relevant fields cited historic base rates, parliamentary logic, and the explicit caretaker nature of the current government as insurmountable barriers, with all plausible scenarios for a 'Yes' outcome requiring an unprecedented political breakdown or consensus shift. Critiques highlighted that even a 10% probability likely overstates the risk, with most credible estimates converging tightly in the 2-4% range. My original probability (3%) is appropriately placed to reflect both the stickiness of parliamentary norms and limited but real volatility introduced by the Gen-Z protest context. The recent appointment of Ghising as a minister further confirms his ceiling within the current structure; no substantive new evidence suggests a jump to PM is pending. Thus, I see no justification to move my forecast materially either way, and will retain my original 3%.",
            "revised_probability": 3
        },
        "Political Science (Parliamentary Democracy Nepal)": {
            "my_phase1_final_probability": 2,
            "reasoning_for_revised_probability": "Reviewing the group deliberation confirms a consistently low-probability consensus across comparative, historical, elite-bargaining, and coalition-based analytical lenses. Nearly all expert participants weigh Nepal’s strong status-quo bias and party-centric selection process as decisive barriers, with minor variation only in how much tail risk to attribute to ongoing volatility. Probabilities ranging from 2-4% (with one notable but arguably high outlier at 10%) triangulate the most defensible estimate. No new evidence emerged suggesting credible momentum for Kulman Ghising to become the non-caretaker PM within the relevant timeframe. The majority position, including robust defenses of coalition and historical base rates, supports my initial analytically minimal—but nonzero—assignment. Therefore, I see no compelling reason to change my previously stated probability.",
            "revised_probability": 2
        },
        "Political Science (Coalition Politics Theories)": {
            "my_phase1_final_probability": 3,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, the consensus across multiple experts with different but overlapping domain perspectives is strongly aligned with my initial assessment. The logic of party-driven coalition politics, the historic resilience of party elites in Nepali executive selection, and the explicit interim/caretaker mandate for both the Karki government and Ghising’s ministerial role were affirmed repeatedly. Both comparative and country-expert forecasters argued persuasively that, despite the extraordinary nature of the recent protests and Ghising’s unique popularity, there is no credible precedent or current process that would move him into the non-caretaker PM slot before the mandated elections. No new arguments or information arose to warrant even a modest upward revision. Thus, the consensus supports and strengthens my original estimate.",
            "revised_probability": 3
        },
        "Political Science (Leadership Selection Party Politics)": {
            "my_phase1_final_probability": 4,
            "reasoning_for_revised_probability": "After engaging in group deliberation and reviewing the arguments presented by other forecasters, I see broad, well-reasoned consensus for an extremely low probability (in the 2-4% range) that Ghising will become the next non-caretaker PM. The comparative and historical expertise further emphasizes the near-zero base rate for a caretaker technocrat ascending to the full premiership in Nepal amidst return to constitutional, party-dominated electoral politics. All group contributions support my initial weighting of a narrow tail risk for total party or institutional breakdown, but there is no compelling reason to alter my estimate. Some equally qualified forecasters choose slightly lower values (2-3%) and one outlier at 10%, but the dominant argument set validates my own initial calibration.",
            "revised_probability": 4
        },
        "South Asian Studies (Nepalese Political History)": {
            "my_phase1_final_probability": 3,
            "reasoning_for_revised_probability": "The group deliberation overwhelmingly supports my initial analysis: every engaged expert and forecaster, drawing from diverse theoretical and empirical vantage points, converges tightly on a very low probability that Kulman Ghising will become the next non-caretaker PM of Nepal within the resolution window. Defense of low-probability estimates is repeatedly justified by Nepal's entrenched party-parliamentary selection mechanisms, the caretaker mandate of the current Karki government, the non-party status of Ghising, and the lack of any evidence for a near-term institutional crisis or elite consensus to upend the post-uprising compromise. The only mild counterpoint is a slightly higher (10%) estimate by one analyst, but multiple critiques (including mine) persuasively demonstrate this outlier overstates tail-risk given the procedural inertia and historical base rates. Thus, no material new evidence or argument compels adjustment, and the modal expert range (2-4%) is both precise and well justified.",
            "revised_probability": 3
        },
        "South Asian Studies (Regional Power Dynamics South Asia)": {
            "my_phase1_final_probability": 3,
            "reasoning_for_revised_probability": "Upon reviewing the group deliberation, I find substantial consensus that status quo structural factors—soundly grounded in both comparative politics and Nepali historical experience—overwhelm even the unusually turbulent protest context and Ghising’s momentary prominence. Multiple forecasters emphasized the vanishingly rare base rate of technocrats or caretaker ministers making the leap to a full, confidence-winning premiership, especially when the entire caretaker arrangement is designed for stabilization ahead of elections. The most optimistic counterarguments set a maximum plausible probability in the low single digits; the lone outlier (10%) was critiqued and found unpersuasive based on fallbacks to status quo party coalition logic. No new or overlooked variables emerged in discussion that would justify increasing my probability estimate. On the contrary, the deliberation reinforces the accuracy of my original synthesis—if anything, it suggests 3% is already at the upper bound for credible outlier disruption scenarios and very slightly generous.",
            "revised_probability": 3
        }
    },
    "revision_probability": [
        2,
        4,
        4,
        3,
        2,
        3,
        4,
        3,
        3
    ],
    "revision_mean_probability": 3.111111111111111,
    "revision_sd": 0.7817359599705717,
    "revision_probability_result": 3,
    "question_details": {
        "id": 39510,
        "title": "Who will be the next non-caretaker prime minister of Nepal? (Kulman Ghising)",
        "created_at": "2025-09-15T10:14:54.797753Z",
        "open_time": "2025-09-17T10:42:39Z",
        "cp_reveal_time": "2025-09-17T12:12:39Z",
        "spot_scoring_time": "2025-09-17T12:12:39Z",
        "scheduled_resolve_time": "2026-01-01T06:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-09-17T12:12:39Z",
        "actual_close_time": "2025-09-17T12:12:39Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 0.69,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "The Federal: [Who could be Nepal's next prime minister? Here are 5 top contenders](https://thefederal.com/category/international/nepals-next-prime-minister-after-olis-controversial-exit-206263)\n\n> Scuffles were reported among Gen-Z factions backing different contenders outside the Nepal Army headquarters in Kathmandu on Wednesday evening, as talks to pick an interim leader after the violent overthrow of the government extended into the third day.\n\n> KP Sharma Oli resigned as prime minister on Tuesday, leaving the post vacant while the anti-corruption revolt continues without a clear leader.\n\n`{\"format\":\"metac_reveal_and_close_in_period\",\"info\":{\"post_id\":39851,\"question_id\":39393}}`",
        "resolution_criteria": "This question is a subquestion of a group question. This subquestion specifically targets the option 'Kulman Ghising'. The resolution criteria for the parent question is below. \n\nThis question resolves as **Yes** for the individual who, after September 11, 2025 and before January 1, 2026 takes the [oath](https://www.constituteproject.org/constitution/Nepal_2016#s852) of office and secrecy as the new [Prime Minister of Nepal](https://en.wikipedia.org/wiki/Prime_Minister_of_Nepal) and wins a vote of confidence in the House of Representatives as required by [section 76](https://www.constituteproject.org/constitution/Nepal_2016#s795) of the Constitution of Nepal. The question resolves as **No** for everyone else. If none of the listed candidates fulfills the criteria during that time period, then the question resolves as **No** for every option.",
        "fine_print": "This is a Group question, so you do not have to assess probabilities for every option. More options may be added after the question opens, if there is [credible](https://www.metaculus.com/faq/#definitions) reporting that a particular individual has a material probability of coming the next PM of Nepal.",
        "post_id": 39967,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Nepal's interim PM appoints cabinet amid post-protest recovery**\nIn an effort to stabilize Nepal after deadly anti‑government protests, Prime Minister Sushila Karki, the country’s first female prime minister, appointed an interim cabinet on Monday.  The new ministers—Kalman Gurung as energy minister, Rameshore Khanal as finance minister, and Om Prakash Aryal as home minister—were sworn in outside a government building that had been attacked and set ablaze by protesters the week before.  The appointments come after violent demonstrations sparked by a brief social media ban and widespread anger over corruption that resulted in at least 72 deaths and hundreds of injuries, leading to the collapse of the previous administration.  Karki, 73, who was appointed on September 12, took office following an agreement with leaders of the largely youth‑led ‘Gen Z’ protest movement.  The military, which enforced a curfew during the unrest, ultimately consented to her leadership of a caretaker government charged with overseeing elections within six months.  At a conference on Sunday, Karki stated, 'What we need now is to work to end corruption, bring about good governance, and achieve economic equality. This is what the people truly desire at this moment.'  Businessman Shrawan Dahl expressed confidence in her ability to lead, saying, 'Her objective is to conduct the election, and we hope she will accomplish this task successfully.'\nOriginal language: en\nPublish date: September 15, 2025 03:28 PM\nSource:[Africanews](https://www.africanews.com/2025/09/15/nepals-interim-pm-appoints-cabinet-amid-post-protest-recovery/)\n\n**Nepal's PM Karki appoints ministers after deadly Gen Z protests**\nNeal's Prime Minister Sushila Karki, the country’s first female leader, appointed Om Prakash Aryal as home minister, Rameshwar Prasad Khanal as finance minister, and Kulman Ghising as energy minister on Monday, following the dissolution of parliament after deadly protests that killed at least 72 people. Aryal is a human‑rights lawyer, Khanal a former finance secretary who recommended major economic reforms, and Ghising a former state power utility chief credited with eliminating load‑shedding. President Ramchandra Paudel swore them in during a televised ceremony outside the fire‑damaged presidential office. The interim government, which will last six months until early‑March elections, is pledged to tackle corruption. The appointments came less than a week after former PM KP Sharma Oli resigned amid unrest that escalated when demonstrators were shot dead by police on Monday. The protests, led by Gen Z, began on 8 September over a brief social‑media ban and grew into widespread anger over corruption and poverty. In her first public remarks, Karki said the country should rebuild together and would work 'according to the thinking of the Gen Z generation'. Subash Dhakal, a 19‑year‑old protester shot in the knees, told AFP he had no regrets and that the pain was temporary but would bring change.\nOriginal language: en\nPublish date: September 15, 2025 12:46 PM\nSource:[Al Jazeera Online](https://www.aljazeera.com/news/2025/9/15/nepals-pm-karki-appoints-ministers-after-deadly-gen-z-protests)\n\n**Nepal PM Sushila Karki appoints three new ministers for interim cabinet**\nOn September 15 2025, the Hindustan Times reported that Nepal President Ramchandra Paudel swore in three ministers—Kulman Ghising, Rameshwor Khanal and Om Prakash Aryal—appointed by caretaker Prime Minister Sushila Karki for her newly formed cabinet. The oath ceremony took place at the President's Office, Sheetal Niwas, Maharajgunj, after which all three ministers immediately assumed their posts. Khanal, the former finance secretary, was sworn in as finance minister. Ghising, the former managing director of the Nepal Electricity Authority, was given charge of energy, water resources and irrigation; physical infrastructure and transport; and urban development. Aryal, an advocate, was appointed minister for home affairs and for law, justice and parliamentary affairs. The article notes that Karki, 73, became Nepal's first female prime minister on September 12, at the recommendation of the agitating 'Gen Z' group, to lead a caretaker government tasked with conducting fresh elections on March 5 2026. It also recounts that former Prime Minister KP Sharma Oli resigned after widespread anti‑government protests led by the 'Gen Z' group against a social media ban and corruption allegations; the protests turned violent, with at least 72 people losing their lives in the nationwide unrest.\nOriginal language: en\nPublish date: September 15, 2025 09:23 AM\nSource:[Hindustan Times](https://www.hindustantimes.com/world-news/nepal-pm-sushila-karki-appoints-three-new-ministers-for-interim-cabinet-101757927752490.html)\n\n**Three ministers inducted by Nepal's new caretaker PM Karki sworn in**\nOn September 15 2025, the Business Standard reported that Nepal President Ramchandra Paudel administered the oath of office to three ministers—Kulman Ghising, Rameshwor Khanal, and Om Prakash Aryal—inducted by the newly appointed caretaker Prime Minister Sushila Karki. The swearing‑in ceremony took place at the President's Office, Sheetal Niwas, Maharjgunj, and the ministers assumed their respective portfolios: Khanal as Finance Minister; Ghising as Minister for Energy, Water Resources and Irrigation, Physical Infrastructure and Transport, and Urban Development; and Aryal as Minister for Home Affairs and for Law, Justice and Parliamentary Affairs. The article notes that Karki, 73, is the Himalayan nation's first woman prime minister and that she assumed office on Sunday, following the resignation of former PM K P Sharma Oli after widespread protests that left at least 72 people dead. The caretaker government, appointed at the recommendation of an agitating 'Gen Z' group, is mandated to conduct fresh elections on March 5 2026. The article also cites the headline 'Those involved in violence will face justice' as a statement from PM Karki.\nOriginal language: en\nPublish date: September 15, 2025 08:59 AM\nSource:[Business Standard](https://www.business-standard.com/world-news/three-ministers-inducted-by-nepal-s-new-caretaker-pm-karki-sworn-in-125091500626_1.html)\n\n**Nepal: 3 ministers inducted by new caretaker PM Sushila Karki sworn in**\nOn Monday, Nepal President Ramchandra Paudel administered the oath of office to three ministers appointed by caretaker Prime Minister Sushila Karki, the country’s first woman prime minister. Karki, 73, assumed office on Sunday. The ministers sworn in were Kulman Ghising, Rameshwor Khanal and Om Prakash Aryal. Khanal became Finance Minister; Ghising took charge of energy, water resources and irrigation, physical infrastructure and transport, and urban development; Aryal was appointed Minister for Home Affairs and for Law, Justice and Parliamentary Affairs. The swearing‑in ceremony was held at the President’s Office, Sheetal Niwas, Maharjgunj. Karki was appointed prime minister at the recommendation of the agitating 'Gen Z' group, which demanded a caretaker government to hold fresh elections on March 5 2026. She took oath on September 12, ending a period of political uncertainty after former prime minister K P Sharma Oli resigned following widespread anti‑government protests led by the same 'Gen Z' group over a ban on social media and alleged corruption. The protests resulted in at least 72 deaths nationwide.\nOriginal language: en\nPublish date: September 15, 2025 12:00 AM\nSource:[newsdrum.in](https://www.newsdrum.in/international/nepal-3-ministers-inducted-by-new-caretaker-pm-karki-sworn-in-10466225)\n\n**Nepal: Last rites of fallen Gen-Z protesters performed with national honours**\nOn September 16, 2025, the newly‑appointed government ministers attended the cremation of protestors who were killed during the Gen‑Z protests on September 8 and 9. The first cabinet meeting of the new government had declared those who died to be 'martyrs', and the deceased were cremated with national honours beside the 'Pashupatinath temple', with the national flag draped over them. Interim ministers 'Kulman Ghising' and 'Om Prakash Aryal' were present, and armed police offered a salute. A funeral procession moved from 'Tribhuwan University Teaching Hospital' to the site. The cabinet also announced a day of mourning on September 17, with the flag flown at half‑mast, free medical treatment for the injured, and the construction of a 'Gen‑Z Memorial park'. According to police, at least 72 people died in the protests, with 19 killed on the first day, and hundreds were hospitalised. The protests, sparked by Gen‑Z youths against corruption and a social media ban, turned violent when police fired on demonstrators, leading to the death of 19 on September 8. The unrest caused vandalism and arson of government buildings and private properties, prompting then‑Prime Minister 'K P Sharma Oli' to resign. In the aftermath, top leaders of major parties, including Communist Party of Nepal (Maoist Centre) leader 'Pushpa Kamal Dahal aka Prachanda', have returned to public life; the party headquarters they visited had been burnt down during the protests.\nOriginal language: en\nPublish date: September 16, 2025 11:25 AM\nSource:[Social News XYZ](https://www.socialnews.xyz/2025/09/16/nepal-last-rites-of-fallen-gen-z-protesters-performed-with-national-honours/)\n\n**New govt takes shape**\nThe interim government of Nepal was formed on 15 September 2025 after anti‑corruption protests that toppled the previous administration. President Ram Chandra Paudel administered the oath of office to three ministers at Shital Niwas, the presidential building in Kathmandu. The new cabinet includes Finance Minister Rameshwor Khanal, Energy Minister Kulman Ghising, and Home Minister Om Prakash Aryal. The protests, sparked by a ban on social media and long‑standing economic grievances, began on 8 September and escalated into violent unrest that left at least 72 people dead and 191 injured, according to government figures. Prime Minister Sushila Karki, a 73‑year‑old former chief justice, was appointed to lead the interim administration and is tasked with addressing demands for a corruption‑free future ahead of March elections. Sushila Karki said she had \"not wished\" to take the post, but that her \"name was brought from the streets\" and that her government would work \"according to the thinking of the Gen Z generation\", seeking \"the end of corruption, good governance and economic equality\". The appointments were the result of negotiations involving army chief General Ashok Raj Sigdel and representatives of the youth protest movement, who used the Discord app to endorse Sushila Karki.\nOriginal language: en\nPublish date: September 15, 2025 11:54 PM\nSource:[The Star ](https://www.thestar.com.my/aseanplus/aseanplus-news/2025/09/16/new-govt-takes-shape)\n\n**Nepal's interim PM appoints cabinet amid post-protest recovery**\nIn an effort to stabilize Nepal after deadly anti‑government protests, Prime Minister Sushila Karki, the country’s first female prime minister, appointed an interim cabinet on Monday.  The new ministers—Kalman Gurung as energy minister, Rameshore Khanal as finance minister, and Om Prakash Aryal as home minister—were sworn in outside a government building that had been attacked and set ablaze by protesters the week before.  The appointments come after violent demonstrations sparked by a brief social media ban and widespread anger over corruption that resulted in at least 72 deaths and hundreds of injuries, leading to the collapse of the previous administration.  Karki, 73, who was appointed on September 12, took office following an agreement with leaders of the largely youth‑led ‘Gen Z’ protest movement.  The military, which enforced a curfew during the unrest, ultimately consented to her leadership of a caretaker government charged with overseeing elections within six months.  At a conference on Sunday, Karki stated, 'What we need now is to work to end corruption, bring about good governance, and achieve economic equality. This is what the people truly desire at this moment.'  Businessman Shrawan Dahl expressed confidence in her ability to lead, saying, 'Her objective is to conduct the election, and we hope she will accomplish this task successfully.'\nOriginal language: en\nPublish date: September 15, 2025 03:28 PM\nSource:[Africanews](https://www.africanews.com/2025/09/15/nepals-interim-pm-appoints-cabinet-amid-post-protest-recovery/)\n\n**Nepal's PM Karki appoints ministers after deadly Gen Z protests**\nNeal's Prime Minister Sushila Karki, the country’s first female leader, appointed Om Prakash Aryal as home minister, Rameshwar Prasad Khanal as finance minister, and Kulman Ghising as energy minister on Monday, following the dissolution of parliament after deadly protests that killed at least 72 people. Aryal is a human‑rights lawyer, Khanal a former finance secretary who recommended major economic reforms, and Ghising a former state power utility chief credited with eliminating load‑shedding. President Ramchandra Paudel swore them in during a televised ceremony outside the fire‑damaged presidential office. The interim government, which will last six months until early‑March elections, is pledged to tackle corruption. The appointments came less than a week after former PM KP Sharma Oli resigned amid unrest that escalated when demonstrators were shot dead by police on Monday. The protests, led by Gen Z, began on 8 September over a brief social‑media ban and grew into widespread anger over corruption and poverty. In her first public remarks, Karki said the country should rebuild together and would work 'according to the thinking of the Gen Z generation'. Subash Dhakal, a 19‑year‑old protester shot in the knees, told AFP he had no regrets and that the pain was temporary but would bring change.\nOriginal language: en\nPublish date: September 15, 2025 12:46 PM\nSource:[Al Jazeera Online](https://www.aljazeera.com/news/2025/9/15/nepals-pm-karki-appoints-ministers-after-deadly-gen-z-protests)\n\n**Nepal Cabinet Expansion: Meet 3 Ministers Inducted By New Caretaker PM Sushila Karki**\nOn Monday, caretaker Prime Minister Sushila Karki inducted three ministers—Kulman Ghising, Rameshwor Khanal, and Om Prakash Aryal—into her cabinet. The oath was administered by President Ramchandra Paudel at the President's Office, Sheetal Niwas, Maharjgunj in Kathmandu. Ghising was given the portfolios of energy, water resources and irrigation; physical infrastructure and transport; and urban development. He is a former managing director of the Nepal Electricity Authority, credited with resolving the country’s long‑standing power crisis. Khanal was sworn in as Finance Minister and will also handle Communications and Information Technology; he previously served as finance secretary. Aryal was appointed Minister for Home Affairs, Law, Justice and Parliamentary Affairs, and Labour, Employment and Social Security; he is an advocate known for public‑interest litigation and has served as legal advisor to Kathmandu Metropolitan City. Karki, 73, became Nepal’s first woman prime minister on Friday, September 12, after a meeting between President Paudel, the military and youth protesters. She was sworn in following the resignation of KP Oli over protests about social‑media bans and corruption.\nOriginal language: en\nPublish date: September 15, 2025 11:36 AM\nSource:[Free Press Journal](https://www.freepressjournal.in/world/nepal-cabinet-expansion-meet-3-ministers-inducted-by-new-caretaker-pm-sushila-karki)\n\n**Nepal PM Sushila Karki appoints three new ministers for interim cabinet**\nOn September 15 2025, the Hindustan Times reported that Nepal President Ramchandra Paudel swore in three ministers—Kulman Ghising, Rameshwor Khanal and Om Prakash Aryal—appointed by caretaker Prime Minister Sushila Karki for her newly formed cabinet. The oath ceremony took place at the President's Office, Sheetal Niwas, Maharajgunj, after which all three ministers immediately assumed their posts. Khanal, the former finance secretary, was sworn in as finance minister. Ghising, the former managing director of the Nepal Electricity Authority, was given charge of energy, water resources and irrigation; physical infrastructure and transport; and urban development. Aryal, an advocate, was appointed minister for home affairs and for law, justice and parliamentary affairs. The article notes that Karki, 73, became Nepal's first female prime minister on September 12, at the recommendation of the agitating 'Gen Z' group, to lead a caretaker government tasked with conducting fresh elections on March 5 2026. It also recounts that former Prime Minister KP Sharma Oli resigned after widespread anti‑government protests led by the 'Gen Z' group against a social media ban and corruption allegations; the protests turned violent, with at least 72 people losing their lives in the nationwide unrest.\nOriginal language: en\nPublish date: September 15, 2025 09:23 AM\nSource:[Hindustan Times](https://www.hindustantimes.com/world-news/nepal-pm-sushila-karki-appoints-three-new-ministers-for-interim-cabinet-101757927752490.html)\n\n**Kulman Ghising, Two Others Sworn In As Ministers In Nepal PM Sushila Karki's Cabinet**\nOn September 15 2025, Nepal President Ramchandra Paudel administered the oath of office to three new ministers in Prime Minister Sushila Karki's caretaker cabinet. The ministers are Kulman Ghising, Rameshwor Khanal and Om Prakash Aryal. Khanal, a former finance secretary, will head the Finance Ministry. Ghising, former head of the Nepal Electricity Authority, will oversee Energy, Water Resources and Irrigation; Physical Infrastructure and Transport; and Urban Development. Aryal, a lawyer, will manage the Home Ministry and the Ministry of Law, Justice and Parliamentary Affairs. Karki, 73, became the country's first woman prime minister after the resignation of KP Sharma Oli, who stepped down amid nationwide protests by the Gen Z movement over social media restrictions and corruption allegations. The protests turned violent, resulting in at least 72 deaths. The caretaker government is responsible for conducting general elections on March 5 2026.\nOriginal language: en\nPublish date: September 15, 2025 09:17 AM\nSource:[News18](https://www.news18.com/world/kulman-ghising-two-others-sworn-in-as-ministers-in-nepal-pm-sushila-karkis-cabinet-9573115.html)\n\n**Three ministers inducted by Nepal's new caretaker PM Karki sworn in**\nOn September 15 2025, the Business Standard reported that Nepal President Ramchandra Paudel administered the oath of office to three ministers—Kulman Ghising, Rameshwor Khanal, and Om Prakash Aryal—inducted by the newly appointed caretaker Prime Minister Sushila Karki. The swearing‑in ceremony took place at the President's Office, Sheetal Niwas, Maharjgunj, and the ministers assumed their respective portfolios: Khanal as Finance Minister; Ghising as Minister for Energy, Water Resources and Irrigation, Physical Infrastructure and Transport, and Urban Development; and Aryal as Minister for Home Affairs and for Law, Justice and Parliamentary Affairs. The article notes that Karki, 73, is the Himalayan nation's first woman prime minister and that she assumed office on Sunday, following the resignation of former PM K P Sharma Oli after widespread protests that left at least 72 people dead. The caretaker government, appointed at the recommendation of an agitating 'Gen Z' group, is mandated to conduct fresh elections on March 5 2026. The article also cites the headline 'Those involved in violence will face justice' as a statement from PM Karki.\nOriginal language: en\nPublish date: September 15, 2025 08:59 AM\nSource:[Business Standard](https://www.business-standard.com/world-news/three-ministers-inducted-by-nepal-s-new-caretaker-pm-karki-sworn-in-125091500626_1.html)\n\n**Kulman Ghising, 2 other ministers inducted into interim Nepal PM's cabinet**\nOn September 15, 2025, India Today reported that a day after Sushila Karki assumed office as the interim Prime Minister of Nepal following massive Gen Z protests that toppled the previous government, former Nepal Electricity Authority chief Kulman Ghising and two others were sworn in as ministers. Ghising was appointed Minister for Energy, Water Resources and Irrigation and will also head the Ministries of Physical Infrastructure and Transport and Urban Development. Rameshore Khanal was named Finance Minister, and Om Prakash Aryal became Home Affairs Minister while also taking on the law, justice and parliamentary affairs portfolio. The oath of secrecy was administered by President Ramchandra Paudel at Sheetal Niwas in Kathmandu. The interim cabinet now has four members, including Karki, who will oversee the remaining portfolios. The cabinet is tasked with holding parliamentary elections on March 6, 2026. Karki, a former Chief Justice, was sworn in as Nepal's first woman Prime Minister on September 12, following protests that began after a social media ban and led to 72 deaths. At least 79 inmates escaped during the protests but were later caught by SSB personnel; among them were two Nigerians, a Brazilian and a Bangladeshi national aged 29‑40. 'She was sworn in as Nepal's first woman Prime Minister.'\nOriginal language: en\nPublish date: September 15, 2025 08:28 AM\nSource:[India Today](https://www.indiatoday.in/world/story/nepal-cabinet-expansion-three-ministers-sworn-in-interim-prime-minister-sushila-karki-gen-z-protests-2787536-2025-09-15)\n\n**Nepal: 3 ministers inducted by new caretaker PM Sushila Karki sworn in**\nOn Monday, Nepal President Ramchandra Paudel administered the oath of office to three ministers appointed by caretaker Prime Minister Sushila Karki, the country’s first woman prime minister. Karki, 73, assumed office on Sunday. The ministers sworn in were Kulman Ghising, Rameshwor Khanal and Om Prakash Aryal. Khanal became Finance Minister; Ghising took charge of energy, water resources and irrigation, physical infrastructure and transport, and urban development; Aryal was appointed Minister for Home Affairs and for Law, Justice and Parliamentary Affairs. The swearing‑in ceremony was held at the President’s Office, Sheetal Niwas, Maharjgunj. Karki was appointed prime minister at the recommendation of the agitating 'Gen Z' group, which demanded a caretaker government to hold fresh elections on March 5 2026. She took oath on September 12, ending a period of political uncertainty after former prime minister K P Sharma Oli resigned following widespread anti‑government protests led by the same 'Gen Z' group over a ban on social media and alleged corruption. The protests resulted in at least 72 deaths nationwide.\nOriginal language: en\nPublish date: September 15, 2025 12:00 AM\nSource:[newsdrum.in](https://www.newsdrum.in/international/nepal-3-ministers-inducted-by-new-caretaker-pm-karki-sworn-in-10466225)\n\n**When will Nepal get new PM? Gen-Z 'cracks', suspense grows as names shuffle | What we know so far**\nScuffles were reported among Gen‑Z factions backing different contenders outside the Nepal Army headquarters in Kathmandu on Wednesday evening, as talks to pick an interim leader after the violent overthrow of the government extended into the third day. The post of prime minister has been vacant since KP Sharma Oli resigned on Tuesday. Four names have emerged as potential candidates: Kathmandu mayor and rapper Balendra Shah 'Balen', former chief justice Sushila Karki, former chief of the electricity board Kulman Ghising, and current mayor of Dharan Harka Raj Sampang Rai. The scuffle on Thursday evening involved supporters of Balen, Karki or Sampang, according to multiple outlets. No final decision has yet been reached; talks are ongoing among Gen‑Z representatives, President Ram Chandra Paudel and the army chief. The President issued an appeal for calm and said he was doing his best to find a solution, with a letter seen as a signal to Gen‑Z representatives to 'take the onus and decide'.\nOriginal language: en\nPublish date: September 11, 2025 11:19 AM\nSource:[Hindustan Times](https://www.hindustantimes.com/world-news/when-will-nepal-get-new-leader-wait-extends-gen-z-cracks-what-we-know-so-far-101757588087511.html)\n\n**Nepal President Issues Message Amid Talks with Gen Z to Select Interim PM**\nOn September 11, 2025, Nepal President Ram Chandra Paudel issued a letter urging calm and patience amid talks to appoint an interim prime minister after the resignation of KP Sharma Oli amid violent protests led by students and Gen‑Z groups. The letter, written in Nepali and seen by HT, states: 'I am deliberating and making every effort to find a way out of the current difficult situation in the country within the constitutional framework and to protect democracy.' Paudel, together with Army Chief Ashok Raj Sigdel, has been pressing Gen‑Z representatives to finalize a candidate. A source said: 'The onus is on them (Gen‑Z representatives), so they can't blame the President and army later.' Meetings on Thursday involved Gen‑Z leaders, the President, and the army chief, with names such as former chief justice Sushila Karki, former Nepal Electricity Authority chief Kulman Ghising, and Kathmandu mayor Balendra Shah under consideration. The army spokesperson confirmed ongoing consultations but declined to name candidates, adding: 'We are holding rounds of talks with different stakeholders. The talks are mainly focused on finding a way out from the current stalemate and at the same time maintaining law and order situation in the country.' The interim prime minister, once chosen, will govern until fresh elections are held within a specified timeframe. Meanwhile, students aligned with major parties staged demonstrations in Kathmandu, demanding the Constitution be preserved and democracy safeguarded during the transition. Dozens of young people gathered outside the army headquarters in Kathmandu awaiting the outcome.\nOriginal language: en\nPublish date: September 11, 2025 11:11 AM\nSource:[Oneindia](https://www.oneindia.com/international/nepal-president-urges-calm-as-gen-z-army-hold-talks-to-pick-interim-pm-7856763.html)\n\n**Gen Z factions clash outside Nepal Army HQ amid leadership dispute**\nThe article reports that on Thursday, a clash erupted outside the Nepal Army headquarters when factions of Gen Z protesters fought over who should lead the country’s interim government after Prime Minister KP Sharma Oli’s resignation. Witnesses described the demonstrators, who have led Nepal’s biggest protests in decades, as engaging in heated arguments that escalated into scuffles. The army had been negotiating with Gen Z representatives to agree on an interim leader, but the dispute over leadership intensified outside the headquarters. One faction supported former Chief Justice Sushila Karki, who is described in the article as a popular choice for her reputation as 'honest and fearless'; another faction rejected her nomination and instead proposed Kulman Ghising, the former chief of the Nepal Electricity Authority, arguing that appointing Karki would deepen the deadlock because the constitution bars former justices from becoming prime minister.\nOriginal language: en\nPublish date: September 11, 2025 11:02 AM\nSource:[India Today](https://www.indiatoday.in/world/story/gen-z-factions-clash-outside-nepal-army-headquarters-amid-leadership-dispute-2785755-2025-09-11)\n\n**After Sushila Karki, Kulman Ghising in the race for Nepal's interim PM post. Who is he?**\nAfter Prime Minister KP Sharma Oli resigned, Gen‑Z protesters are pushing former Nepal Electricity Authority chief Kulman Ghising (54) to become interim prime minister. Ghising, who led NEA from 2016 to 2025, is credited with ending a 2016 energy emergency that saw 18‑hour load‑shedding and 50 % of power imported from India. He cut power‑loss, upgraded the grid and reduced pilferage. The article quotes protesters calling him 'a patriot and everyone's favourite' and notes that the 35‑year‑old Kathmandu mayor Balendra Shah has also been floated, but he has endorsed Sushila Karki, the former chief justice, as a candidate. Karki’s age (over 70) and constitutional restrictions (Article 132) raise doubts. The Nepal army chief, General Ashok Raj Sigdel, reportedly met with Karki, while army spokesperson Raja Ram Basnet says 'Initial talks are on… we are trying to normalise the situation.' The article reports that protesters are staging demonstrations outside the army headquarters demanding transparent discussions.\nOriginal language: en\nPublish date: September 11, 2025 10:49 AM\nSource:[Firstpost](https://www.firstpost.com/explainers/nepal-gen-z-protests-sushila-karki-kulman-ghising-interim-pm-power-crisis-13932837.html)\n\n**Nepal President has a message amid talks with Gen Z to pick interim PM**\nOn September 11, 2025, Nepal’s President Ram Chandra Paudel issued a letter urging all parties to resolve the political stalemate within the constitutional framework and protect democracy. The letter, dated September 11, states: 'I am deliberating and making every effort to find a way out of the current difficult situation in the country within the constitutional framework and to protect democracy.' It also appeals: 'I appeal to all parties to be confident that a solution to the problem is being sought as soon as possible to address the demands of the agitating citizens.' The President, the highest ceremonial authority after the violent protests that toppled the previous government, is pressing the army and Gen‑Z representatives to finalize a name for the interim prime minister. Army chief Ashok Raj Sigdel is also involved, and an army spokesperson said: 'We are holding rounds of talks with different stakeholders. The talks are mainly focused on finding a way out from the current stalemate and at the same time maintaining law and order situation in the country.' Potential candidates mentioned include former chief justice Sushila Karki, ex‑chief of the Nepal power board Kulman Ghising, and Kathmandu mayor Balendra Shah. The interim PM will replace KP Sharma Oli, who resigned on Tuesday after a student‑led agitation. The article notes that in parts of Kathmandu, students from major parties demonstrated, demanding the Constitution be preserved and democracy protected while a new government is formed. The new executive head will have to ensure fresh elections within a specified timeframe, and the army spokesperson did not provide any names.\nOriginal language: en\nPublish date: September 11, 2025 10:25 AM\nSource:[Hindustan Times](https://www.hindustantimes.com/world-news/nepal-president-has-message-amid-talks-with-gen-z-to-pick-interim-pm-sushila-karki-balen-shah-kulman-ghising-options-101757584599327.html)\n\n**'Otherwise, grave misfortune may follow': Nepal ex-PM suggests way out to form new govt**\nFormer Nepal prime minister Baburam Bhattarai urged the country to form a new government within the existing Constitution after Gen‑Z protests toppled the coalition of former PM KP Sharma Oli.  He warned that \"Otherwise, grave misfortune may follow,\" and posted the proverb, 'It is harder to deliver the offering to the priest than to perform the funeral rite itself,' to illustrate the difficulty of the process.  Bhattarai criticised unnamed \"self‑proclaimed intellectuals\" who called Nepal \"constitutionless or stateless,\" and stressed that the Constitution, Parliament, Head of State and permanent organs remain intact even if the government resigns.  He called for a three‑pronged approach: meaningful dialogue between the movement’s official representatives and the President, convening Parliament to make constitutional arrangements, and preventing new parties from resigning from Parliament in a rash manner.  He warned that failure could plunge the nation into \"a terrifying dark tunnel, a Black Hole.\"  The article also noted that Bhattarai’s house was torched amid widespread arson linked to a social media ban, and that interim PM candidates include Kulman Ghising and former chief justice Sushila Karki.  The post was shared on X on September 11, 2025.\nOriginal language: en\nPublish date: September 11, 2025 09:52 AM\nSource:[Hindustan Times](https://www.hindustantimes.com/world-news/grave-misfortune-may-follow-if-nepal-ex-pm-suggests-way-out-to-form-new-govt-101757582493098.html)\n\n**Army out, curfew clamped as Nepal hunts for a new leader**\nOn September 10, 2025, soldiers guarded Nepal’s parliament and patrolled deserted streets under a curfew after Prime Minister KP Sharma Oli resigned amid deadly anti‑corruption protests. The death toll had risen to 25 and 633 were injured, according to the health ministry. In addition, five juvenile inmates died during a clash with security at a western Nepal jail, and more than 7,000 prisoners escaped from prisons nationwide. Negotiations between representatives and protesters began at the army headquarters, but no succession plan was agreed upon. Tribhuvan International Airport resumed services the same evening, 24 hours after closing. The army deployed armoured personnel carriers and used loudspeakers to call for calm. Former PM Jhala Nath Khanal’s wife, Ravi Laxmi Chitrakar, who sustained serious burn injuries, is critical but stable, as reported by Dr Kiran Nakarmi of Kirtipur Hospital. Nepali Army chief General Ashok Raj Sigdel held consultations with stakeholders and met with representatives of the Gen Z protest movement, according to Rajaram Basnet. Former chief justice Sushila Karki, Kathmandu mayor Balendra Shah, and former electricity board chief Kulman Ghising were named as potential interim leaders. Karki said, 'Experts need to come together to figure out the way forward' and added, 'When they requested me, I accepted.' The army announced that curfew orders would remain in force until Thursday morning, warning that demonstrations, vandalism, looting, arson, and attacks in the name of protest would be considered punishable crimes.\nOriginal language: en\nPublish date: September 10, 2025 09:36 PM\nSource:[Hindustan Times](https://www.hindustantimes.com/world-news/army-out-curfew-clamped-as-nepal-hunts-for-a-new-leader-101757540191643.html)\n\n**After Oli's exit, who will lead Nepal? Inside details of GenZ meeting on Interim Government - The Statesman**\nViolent Gen Z protests over alleged corruption and nepotism have erupted across Nepal, with demonstrators setting fire to the Parliament building and the residences of the President, Prime Minister and several ministers. Prime Minister KP Sharma Oli resigned amid the unrest, and a meeting of Gen Z protesters and allies was held on 18 September 2025 at Jangi Adda, Army Headquarters in Bhadrakali, Kathmandu, to discuss who should lead the interim government. The meeting considered several potential leaders: Kathmandu Mayor Balenndra Shah, former Chief Justice Shushila Karki (who said 'I am ready to lead the interim government if I have unanimous support'), Sumana Shrestha (who declined due to her affiliation with the Rastriya Swatantra Party), Harka Samparg (Mayor of Dharan), Sagar Dhakal (federal election candidate), Kulman Ghising (former Managing Director of Nepal Electricity Authority), and Rastra Bimochan Timalsena (YouTuber and lawyer who goes by 'Random Nepali').\nOriginal language: en\nPublish date: September 10, 2025 12:05 PM\nSource:[thestatesman.com](https://www.thestatesman.com/world/after-olis-exit-who-will-lead-nepal-inside-details-of-genz-meeting-on-interim-government-1503484209.html)\n\n",
    "date": "2025-09-19T01:08:52.380831",
    "summary": "Across a diverse panel of experts—including comparative politics analysts, Nepal political journalists, political scientists, and South Asian regional specialists—consensus is strongly against the likelihood of Kulman Ghising becoming the next non-caretaker prime minister of Nepal before January 1, 2026. All experts note the current status quo: Sushila Karki is serving as interim/caretaker PM after Gen-Z-led protests, and elections are scheduled for March 2026. Ghising, a popular technocrat and energy minister, enjoys public support and some backing among Gen-Z activists, but lacks deep party infrastructure, a legislative base, or a history of coalition brokering—key prerequisites for the premiership in Nepal’s parliamentary system. The base rates from Nepali political history heavily favor senior party leaders as PMs, especially after crisis caretaker periods. While several experts allow for a minor increase in Ghising's odds due to the unusual context of Gen-Z protest influence and current political volatility, all stress that the constitutional caretaker mandate and entrenched party dominance render a leap from technocratic minister to permanent PM extremely improbable. Only unprecedented crisis, total party collapse, or extraordinary consensus among elite actors and protest movements could create an opening for Ghising, and current signals and institutional incentives do not support this. Expert probability estimates cluster tightly between 2% and 10%, with most (and the modal value) between 2–4%. The group chat and independent analyses reinforce that, barring a major rupture or shock, the post-caretaker PM will likely be a party-backed figure, not Ghising.",
    "forecasters": [
        "Comparative Politics Analyst (Cabinet Formation Process)",
        "Comparative Politics Analyst (Elite Bargaining Analysis)",
        "Nepal Political Journalism (Political Party Leadership Tracking)",
        "Nepal Political Journalism (Electoral Trends Nepal)",
        "Political Science (Parliamentary Democracy Nepal)",
        "Political Science (Coalition Politics Theories)",
        "Political Science (Leadership Selection Party Politics)",
        "South Asian Studies (Nepalese Political History)",
        "South Asian Studies (Regional Power Dynamics South Asia)"
    ]
}