{
    "deliberation_results": {
        "Comparative Politics Consulting (Electoral Systems Analysis)": {
            "time_to_resolution": "Resolution period is after September 11, 2025 and before January 1, 2026. Today is September 19, 2025—so approximately 3.5 months until resolution closes. The new non-caretaker PM will need to take oath and pass a vote of confidence within this window.",
            "perspective_relevance": "As an expert in Comparative Politics Consulting with a specialization in Electoral Systems Analysis, my perspective is uniquely valuable for evaluating the probability of Balendra Shah becoming the next non-caretaker PM. I can assess Nepal's constitutional processes, power-sharing norms, institutional breakdowns, interim versus permanent government precedents, party system fluidity, the effects of mass protest, youth mobilization, and the likelihood of outsiders versus insiders being selected through either conventional parliamentary means or extra-constitutional arrangements.",
            "status_quo": "The de facto status quo at this moment is a caretaker/interim government led by Sushila Karki, appointed after Gen-Z–led protests ousted KP Sharma Oli. Karki’s mandate is explicitly to oversee a rapid transition (within ~6 months) to fresh elections in March 2026. If nothing changes, the caretaker cabinet will persist until those elections, and the next non-caretaker PM will be selected by the new parliament/government after the 2026 polls.",
            "perspective_derived_factors": [
                {
                    "factor": "Caretaker Mandate and Legal Framework",
                    "effect": "Decreases probability. Constitutionally, Sushila Karki is an interim PM, tasked to hold elections, not to cede power to a new full-term PM before the elections. Changing this requires either abrupt resignation or collapse of the caretaker government or a negotiated elite arrangement falling outside the current roadmap."
                },
                {
                    "factor": "Historical and Regional Precedent",
                    "effect": "Decreases probability. In Nepal and South Asia, interim or caretaker governments rarely hand over to another non-caretaker PM without an election—especially after such a disruptive transfer involving youth protest and the military. The next non-caretaker PM typically arises from general elections."
                },
                {
                    "factor": "Political System Disarray and Weak Party System",
                    "effect": "Increases probability slightly. If the caretaker government collapses under protest, or if further disruptive events occur, there is potential for more extra-constitutional or elite-negotiated appointments, possibly including an outsider like Balendra Shah. The party system is unstable and the protest movement bypassed traditional parties."
                },
                {
                    "factor": "Balendra Shah’s Profile and Support Base",
                    "effect": "Increases probability. Shah has significant street legitimacy: won Kathmandu as an independent and has high Gen Z/youth visibility. He was seen as a leading contender during the transition chaos, with open support from protest factions. This lends him potential as an emergency compromise figure in an elite stalemate (especially under heavy youth/public pressure)."
                },
                {
                    "factor": "Balendra Shah’s Own Candidacy Behavior",
                    "effect": "Decreases probability. Public reporting confirms he was offered the caretaker post but declined; he also supported Karki’s appointment and did not fight to lead the interim government. This implies limited appetite to maneuver for leadership before elections."
                },
                {
                    "factor": "Elite and Institutional Preferences",
                    "effect": "Decreases probability. The army, president, and caretaker government coalesced around Karki to stabilize the situation and quickly restore constitutional order. There is no indication they favor an additional transfer before elections, and there is some party/elite caution about Shah’s populist, outsider profile."
                },
                {
                    "factor": "Timing of Elections",
                    "effect": "Decreases probability. New elections are scheduled for March 2026, barely 5-6 months away. With little time for further non-electoral transitions, the window for a new non-caretaker PM to emerge before the election is very limited."
                },
                {
                    "factor": "Base Rate for Outsider PMs via Protest/Unconventional Means",
                    "effect": "Decreases probability. Historically, in Nepal and similar systems, outsider mayors or protest leaders (even with high popularity) almost always have to wait for general elections to make the leap to premiership."
                }
            ],
            "no_scenario": "Sushila Karki remains caretaker PM and oversees elections as scheduled. No collapse or abrupt resignation of the interim government occurs, and no elite or military intervention sidelines the current caretaker. After March 2026, the new PM will be chosen from the parties or coalitions emerging from the elections, and Shah either contests at that time (as party candidate or leader of a new movement), or remains mayor. Thus, no oath/vote of confidence for Shah in the current (2025) window.",
            "yes_scenario": "A dramatic shift occurs: the caretaker government collapses (due to renewed mass protest, caretaker resignation, elite infighting, or outside pressure), and Shah—by virtue of youth support and perceived street legitimacy—is tapped as an emergency consensus/technocratic PM until 2026 polls. He is invited by the president, takes the oath, and receives a vote of confidence in parliament under emergency arrangements, likely backed by the youth/movement, technocrats, and possibly parts of the elite. This would be highly unusual and would require an explicit break with the original caretaker mandate.",
            "final_reasoning": "While Balendra Shah was regarded as a frontrunner among Gen Z activists and protest factions, all credible reporting indicates he declined to pursue (or was not selected for) the interim caretaker post, instead endorsing Sushila Karki. Karki, with support from protesters and the military/presidency, has assumed the caretaker role, with a clear legal and constitutional mandate to hold elections in March 2026. The Nepali system and regional precedent heavily favor the status quo, with non-caretaker transitions only occurring after elections or, rarely, following fresh elite pacts in the event of absolute deadlock. The appointment of a new non-caretaker PM before the polls would require a major crisis or total collapse of the current arrangement, for which there is no evidence as of now. Shah’s window to become PM in the present period is extremely narrow: it presupposes either the ouster/resignation of the interim government, a new crisis, or the breakdown of all existing constitutional roadmaps. As matters stand, institutional players are highly incentivized to keep the current caretaker until March 2026. Therefore, incorporating base rates, Shah’s own behavior, the legal context, and comparative precedent, the probability must be set very low for Shah to become non-caretaker PM of Nepal before January 1, 2026.",
            "final_probability": 1
        },
        "Comparative Politics Consulting (Cabinet Formation Process)": {
            "time_to_resolution": "Between now (2025-09-19) and January 1, 2026; approximately 3.5 months remain.",
            "perspective_relevance": "As an expert in Comparative Politics and Cabinet Formation, my approach emphasizes coalition behavior, elite-mass interactions, caretaker/interim structures, and the mechanisms by which outsider candidates or movement-backed figures (like Balen Shah) translate popular support into formal parliamentary power in post-crisis parliamentary systems. This is especially pertinent in Nepal, where mass mobilization, transitional moments, and coalition bargaining are crucial determinants of executive formation.",
            "status_quo": "The status quo is that Sushila Karki, a former Chief Justice, is serving as Nepal's caretaker Prime Minister. No non-caretaker government has formed. New general elections are scheduled for March 2026, with the interim government mandated to serve until then.",
            "perspective_derived_factors": [
                {
                    "factor": "Caretaker government mandate and constitutional process",
                    "effect": "Decreases probability. Sushila Karki is explicitly leading a caretaker administration with a narrow, time-limited, and technocratic mandate to hold elections in March 2026. The constitutionality and legitimacy of appointing a new, non-caretaker PM before those elections is low unless there's significant breakdown."
                },
                {
                    "factor": "Balendra Shah's popular support and outsider status",
                    "effect": "Increases probability. Shah enjoys significant Gen Z, youth, and urban support and was considered for both interim and non-caretaker roles by protest movements and international media; he symbolizes the anti-establishment wave."
                },
                {
                    "factor": "Balendra Shah's own political strategy/positioning",
                    "effect": "Decreases probability. Multiple articles report that Shah was considered for, but declined, the interim PM role and endorsed Karki. No evidence he is lobbying for an immediate premiership or has the parliamentary base to secure appointment and win a confidence vote."
                },
                {
                    "factor": "Institutional constraints – party system and parliamentary math",
                    "effect": "Heavily decreases probability. After Parliament was dissolved and given the fractured, personalized, and weak party system, Shah lacks formal party or parliamentary support required for appointment as PM and to win a confidence vote unless the Gen Z movement or another coalition assumes sweeping control and reverses the caretaker mandate."
                },
                {
                    "factor": "Precedent and base rates of outsider/independent PM transitions after crises",
                    "effect": "Decreases probability. In global parliamentary systems, outsider/technocratic or protest-backed figures very rarely—immediately after mass unrest—leap from local mayor positions to PM without elections or party-brokered deals. Nepal's prior caretaker governments have stuck with technocrats until elections."
                },
                {
                    "factor": "Ongoing instability and movement demands for rapid change",
                    "effect": "Marginally increases probability. If protests rekindle or the current caretaker government collapses, Shah as a widely respected movement figure could be thrust into contention, though only if the constitutional and procedural barriers break down further."
                }
            ],
            "no_scenario": "Sushila Karki continues as caretaker PM through to the March 2026 elections (as currently planned), after which a new PM is chosen via parliamentary bargaining and elections. Balendra Shah remains mayor, supports protest goals from the outside, or positions himself/electoral allies for the next election, but does not become PM before January 1, 2026.",
            "yes_scenario": "Fresh unrest, elite split, or total caretaker government collapse forces an acceleration of the transition; the Gen Z coalition, unable to sustain Karki or find a compromise, turns to Shah as a unity candidate; he is somehow appointed by the President and Army (possibly after negotiations with parliamentarians or bypassing them altogether) and miraculously wins a formal confidence vote before the new year.",
            "final_reasoning": "While Balendra Shah is a high-profile, popular protest leader and has been mentioned frequently as a potential PM, the current equilibrium is a legally-mandated, movement-driven, caretaker/technocratic government headed by Karki. The constitutional and parliamentary norms, weak as they may be, point toward preserving the caretaker arrangement until elections. Shah himself has declined interim posts, has no visible legislative base or explicit plan to seize power outside regular elections, and is not leading an armed or revolutionary push for executive office. The base rate for mayors or protest figures becoming PM in a parliamentary system without intermediate elections is extremely low. The only plausible 'yes' scenario is if there is a spectacular collapse of the caretaker government and constitutional/party barriers that propels Shah to the PM role—something for which there is scant concrete evidence in the reporting to date. Accordingly, the probability should be low, albeit nonzero due to mass volatility and instability.",
            "final_probability": 7
        },
        "Nepalese Constitutional Law (Nepal Constitution 2015 Interpretation)": {
            "time_to_resolution": "About 3.5 months (until Jan 1, 2026, given forecast date is Sept 19, 2025)",
            "perspective_relevance": "As a specialist in Nepalese constitutional law, I am able to interpret both the formal requirements for becoming Prime Minister under Nepal’s 2015 Constitution (notably Article 76: appointment, majority confirmation, vote of confidence timelines) and the practical functioning of legal and extra-legal mechanisms in periods of crisis or constitutional breakdown. My expertise enables a clear-eyed view of what would constitute a valid and recognized prime ministership (including the distinctions among caretaker, acting, and substantive/confirmed PMs), factoring in legal, procedural, and political legitimacy under the law—especially after severe social unrest.",
            "status_quo": "Sushila Karki is currently caretaker prime minister, tasked with leading Nepal through to fresh elections in March 2026, after violent anti-corruption protests toppled KP Sharma Oli. Balendra Shah is currently Mayor of Kathmandu and was discussed as a possible Gen Z-backed contender, but declined the interim role. The general expectation is for the current interim government (caretaker, not substantive under Article 76) to persist until elections.",
            "perspective_derived_factors": [
                {
                    "factor": "Constitutional Provisions and Precedent",
                    "effect": "Decreases probability. The text of the Nepal Constitution (Article 76) mandates a prime minister be appointed, secure a vote of confidence, and not be serving merely in a caretaker/interim capacity. Sushila Karki has taken oath as caretaker PM explicitly for the period until the March 2026 elections. The context (parliament dissolved, a technocratic/neutral cabinet), and the constitutional mandate make it unlikely for a new, full-term substantive PM to be appointed before elections, barring further major upheaval."
                },
                {
                    "factor": "Balendra Shah’s Recent Positioning and Statements",
                    "effect": "Greatly decreases probability. Multiple reputable reports (e.g., El Confidencial, The Statesman, Hindustan Times) confirm Shah was considered by Gen Z protest factions for the interim PM post but declined, preferring to support Karki (and previously stating he has no personal ambition for the PM role at present). There is no evidence that he is actively seeking or is being repositioned for the near-term PM position as of mid-September 2025."
                },
                {
                    "factor": "Political Dynamics and Gen Z Movement Fragmentation",
                    "effect": "Decreases probability. While Shah does command some youth support and has Gen Z icon status, the movement itself is fractious. Sushila Karki’s appointment—despite youth agitation—is the result of a consolidation among leading stakeholders (Gen Z reps, president, army chief), and leading Gen Z activists (Sudan Gurung et al) now express dissatisfaction not by pushing a Shah premiership but by rejecting the notion of any leader being installed without broadest possible consensus. There is no visible unified demand for Shah’s immediate progression to the premiership."
                },
                {
                    "factor": "Stability Preference Among Elites and Incumbency Advantage",
                    "effect": "Decreases probability. After the trauma of mass protests, elite actors—the presidency, army, and remnant political class—show clear preference for a 'safe pair of hands' in the run-up to elections. Karki, a former chief justice and neutral figure, is seen as least controversial. Installing Shah as substantive PM would require bypassing many institutional actors and is unlikely unless a fresh constitutional rupture or government collapse occurs."
                },
                {
                    "factor": "Base Rates—Frequency of Out-of-Party, Non-Elite Technocrat/Loktantrik Figures Becoming PM Midterm",
                    "effect": "Greatly decreases probability. Modern Nepali political history demonstrates that, outside revolutionary windows or general elections, outsider/anti-establishment figures rarely ascend to the premiership. Mayors (including Shah) have not previously been tapped for national executive service between elections, especially given Shah’s lack of parliamentary experience and limited ties to dominant power structures."
                }
            ],
            "no_scenario": "Sushila Karki and her caretaker cabinet remain in office until March 2026 elections, with Balendra Shah continuing as Kathmandu mayor and remaining a prominent youth leader and potential future MP/PM candidate. Shah neither seeks nor is appointed to the PM role, and no interim political consensus makes him a compromise candidate. The House remains dissolved or is reconstituted only after the scheduled elections.",
            "yes_scenario": "Extraordinary developments occur—for example, Sushila Karki is forced to resign prematurely (through coercion, loss of legitimacy, health, or renewed violent Gen Z protests), and there is no consensus among political parties or the army. Under immense public youth pressure and elite deadlock, the president or a transitional mechanism selects Shah (with or without formal elections) as caretaker or even as substantive PM, and he takes the oath and wins a vote of confidence within the House (if it is reconstituted before March 2026)—or legal mechanisms are sufficiently bent to allow for his appointment. This would require a collapse or rapid mutation of the current constitutional process.",
            "final_reasoning": "While Balendra Shah is a popular Gen Z-backed outsider and was at one point in the conversation for interim prime minister, all subsequent credible reporting confirms he declined to pursue the post and instead publicly supported the consensus appointment of Sushila Karki. The constitutional circumstances post-uprising led to a technocratic, caretaker administration pending elections, rather than a full-fledged, non-caretaker government. The elite settlement strongly favors stability, and historical precedent does not support rapid promotion of outsider figures like Shah in tumultuous transition periods (outside elections or total regime collapse). For resolution, Shah would not only have to be appointed PM (not as caretaker) but also secure a formal vote of confidence per Article 76, which is highly improbable given current dissolution of parliament, legal path dependencies, his lack of parliamentary power base, and relative lack of effort or demand from key Gen Z factions for his immediate elevation. Only a further extraordinary crisis would alter this path, for which there is currently scant evidence. Given the above, I estimate the probability that Balendra Shah will become the next non-caretaker prime minister before Jan 1, 2026, at a very low level.",
            "final_probability": 2
        },
        "Nepalese Constitutional Law (Precedents Nepal Executive Leadership)": {
            "time_to_resolution": "Resolution window: September 11, 2025 to January 1, 2026. Approximately 3.5 months remaining.",
            "perspective_relevance": "As an expert in Nepalese Constitutional Law with emphasis on executive leadership precedents, my perspective allows a precise assessment of the constitutional process for appointing the next non-caretaker Prime Minister, the likelihood of disruptive transitional scenarios, the legal legitimacy required for the appointment, and the interpretation of whether a figure like Balendra Shah could legally (and practically) become PM following the unique youth-driven governmental transition.",
            "status_quo": "Sushila Karki, a respected former chief justice, is currently serving as caretaker Prime Minister, appointed to lead an interim government mandated to hold elections in March 2026. The system currently favors a technocratic caretaker administration leading up to these elections, with no strong status quo momentum for a dramatic Balen Shah ascent as PM in the immediate term.",
            "perspective_derived_factors": [
                {
                    "factor": "Constitutional Precedents for Appointment of Non-Caretaker PM between Governments",
                    "effect": "Decreases probability. The Nepalese Constitution mandates that the Prime Minister must command a majority in the House of Representatives (Art. 76). Traditionally, after caretaker/interim governments, the next PM has emerged from established party politics or a newly formed majority after elections, not from sudden, extra-constitutional, post-uprising direct appointment."
                },
                {
                    "factor": "Current Role and Public Position of Balendra Shah",
                    "effect": "Decreases probability. Shah is mayor of Kathmandu, an outsider to established parliamentary coalitions. Reports indicate he declined the interim PM post and instead supported Karki. No evidence he is actively building a parliamentary majority or that he is poised to supplant Karki before the March 2026 elections."
                },
                {
                    "factor": "Youth-led Gen-Z Political Unpredictability and Agitation",
                    "effect": "Neutral to mildly increases probability. The youth revolt toppled the previous regime, and they have shown influence over non-traditional processes (e.g., Discord voting). However, after initial enthusiasm, the focus appears to be on ensuring transparent elections, not on parachuting Shah into the premiership before that point."
                },
                {
                    "factor": "Endorsements and Legitimacy Among Protest Leaders",
                    "effect": "Decreases probability. Initial momentum existed for Balen Shah (and others), but major Gen-Z and youth leaders, including Sudan Gurung, have recently expressed disillusionment with top-down or personality-driven solutions and seem to prefer systemic change via upcoming elections. Shah is not the Gen-Z consensus at this time."
                },
                {
                    "factor": "Legal Barriers and Parliamentary Mechanics",
                    "effect": "Strongly decreases probability. Unless Shah forms or leads a party or parliamentary grouping able to secure a majority post-caretaker phase, or if an unexpected vacancy is exploited via constitutional loophole (highly unlikely in the presence of intense scrutiny), it is difficult to see a legal route for him to become PM before new elections."
                },
                {
                    "factor": "Transitional Crisis or Further Collapse Scenario",
                    "effect": "Marginally increases probability. If Karki’s interim regime collapses or is toppled, rapid, extra-parliamentary selection could favor a figure like Shah, who embodies Gen-Z legitimacy. Yet, such a constitutional breakdown is a much lower-probability scenario, especially now as the caretaker government stabilizes."
                }
            ],
            "no_scenario": "The most plausible scenario (status quo) is that Sushila Karki remains as caretaker PM until the March 2026 elections, after which a new majority emerges from parliamentary elections. Balendra Shah remains mayor of Kathmandu, possibly runs for parliament or emerges as a national political leader later, but does not become PM in the relevant window (Sept 11, 2025 - Jan 1, 2026).",
            "yes_scenario": "A highly disruptive scenario emerges: mass protests force out Sushila Karki, with Gen-Z leaders pushing for direct, extra-constitutional appointment of Balen Shah (who accepts), and the military, president, and/or a makeshift/factional parliament rally around him. He then manages to secure the necessary vote of confidence in the House. Alternatively, Karki renounces the role early and Shah, with unforeseen cross-party and Gen-Z coalition support, is able to legally take the oath and win the confidence vote. Both outcomes would require unprecedented constitutional contortion and a rapid, large-scale political realignment.",
            "final_reasoning": "Weighing the above factors and the relevant news, the status quo is overwhelmingly favored: Karki, supported by considerable civil society, Gen-Z, and international actors, is locked in as the interim PM with a mandate strictly limited to organizing elections by March 2026. The constitutional process for appointing a non-caretaker PM between governments highly favors parliamentarians with support from the legislative majority, of which Shah is not presently a part. Historical precedent strongly disfavors an independent mayor making such a leap outside a general election. News articles indicate Shah declined the interim PM role, is endorsing Karki, and is not currently leading a parliamentary power base. While further unrest or crisis could change this, and Gen-Z could rally unexpectedly around him, as of now there is no active movement to install him before elections. Therefore, this probability must reflect both the near total absence of an immediate political/legal path for his PM-ship and the persistent albeit low risk of radical systemic rupture.",
            "final_probability": 3
        },
        "Political Science (Coalition Theory)": {
            "time_to_resolution": "Approximately 3.5 months, until December 31, 2025.",
            "perspective_relevance": "As an expert in coalition theory within political science, my perspective is especially relevant to this question due to the fluid, non-traditional, and fragmented coalition dynamics currently in Nepal. The abrupt toppling of the old elite, ongoing youth-led mobilization, weak party system, and involvement of military actors have created a highly contingent and coalition-driven context. Understanding how interim, caretaker, and consensus prime ministers arise from new political alignment and negotiation among street movements, parties, military, and the presidency provides critical insight into the likely winners and losers.",
            "status_quo": "The current interim prime minister is Sushila Karki, a non-partisan figure appointed largely through Gen-Z protester endorsement and the acquiescence of formal state institutions (president, army) after KP Sharma Oli resigned. Karki has stated that her mandate is as a caretaker, aiming to conduct new elections in March 2026, not as a long-term political leader. The machinery for the new coalition and selection of a substantive (non-caretaker) PM has not activated yet and is unlikely to do so before the coming elections.",
            "perspective_derived_factors": [
                {
                    "factor": "Caretaker vs. Non-Caretaker Role",
                    "effect": "Strongly decreases probability. The constitutional framework and public statements establish Sushila Karki as an explicitly caretaker/interim PM; there is no credible report that Balen Shah (or anyone else) will become non-caretaker, substantive PM before March 2026 polling. The base rate in parliamentary systems is that interim governments persist until scheduled elections following a crisis."
                },
                {
                    "factor": "Gen Z movement’s Cohesion and Influence",
                    "effect": "Slightly decreases probability. While Balen Shah garners youth support, the movement is fragmented and has instead rallied around Sushila Karki as a consensus figure. Multiple sources indicate Balen declined the interim post, and youth demands are now split between reforming the system and executive appointments."
                },
                {
                    "factor": "Political Institutions’ Conservatism and Army Involvement",
                    "effect": "Decreases probability. The president and army facilitated a compromise by picking a neutral, established, and non-threatening figure (Karki) rather than a newly emergent, less experienced political actor like Shah. Nepali elite and power-brokers favor stability over disruption, especially after recent violent unrest."
                },
                {
                    "factor": "Balendra Shah’s Profile and Intentions",
                    "effect": "Strongly decreases probability. Multiple articles confirm Shah is focused on his mayoral responsibilities, is hesitant to accept a national PM role (especially interim), and has publicly supported Karki for the transitional arrangement. No credible, recent indication he seeks or will accept the next non-caretaker PM post."
                },
                {
                    "factor": "Base Rates in Nepali and Comparative Parliamentary Politics",
                    "effect": "Strongly decreases probability. Since the restoration of multi-party democracy, no major city mayor has been directly selected as PM amid a crisis; rather, non-threatening judges or technocrats with an interim or consensus label fill gaps until party competition resumes."
                }
            ],
            "no_scenario": "Sushila Karki remains as interim/caretaker PM, facilitating elections in March 2026. When those elections are held, a new government forms through the traditional parliamentary process; the next non-caretaker PM is someone other than Balendra Shah (e.g., a leader of a major party, another technocrat, or a fresh youth coalition-headed figure). Shah may influence events, potentially campaign, but does not become PM within the resolution window.",
            "yes_scenario": "In a highly unlikely scenario, continued deadlock, renewed breakdown of order, or an unforeseen consensus triggers the military, protesters, and institutions to select Balendra Shah as a substantive (not caretaker) PM before January 1, 2026, bypassing the caretaker arrangement and before a national election. This would either involve a dramatic collapse of the present interim consensus, Sushila Karki’s resignation or incapacity, and unprecedented willingness by old and new elites to hand formal executive power to a non-legislator and outsider.",
            "final_reasoning": "All available credible reporting—both international and Nepali—confirms that the consensus after the September 2025 unrest is to maintain Sushila Karki as an interim/caretaker PM tasked with holding new elections in March 2026. Balendra Shah was discussed as a potential candidate by Gen Z factions during the post-Oli power vacuum, but he publicly declined the interim post, supported Karki, and has since neither campaigned nor maneuvered for an immediate national role. The caretaker formula is institutionalized: even Gen Z leaders, despite protest cracks, have converged on using the March 2026 elections as the avenue for new, substantive leadership. Shah remains mayor and a protest icon, not an executive-in-waiting. Nepali constitutional and coalition-crafting practice—with direct parallels to Sri Lanka (2022) and Italy (2011-2013)—strongly favors stability and political neutralization until ordinary party competition resumes. Given the above, Shah’s probability of being the next non-caretaker PM before the 2026 election is exceedingly low.",
            "final_probability": 2
        },
        "Political Science (Elite Theory)": {
            "time_to_resolution": "Approximately 3.5 months (question resolves between September 11, 2025 and January 1, 2026; today is September 19, 2025).",
            "perspective_relevance": "As a political scientist specializing in Elite Theory, I focus on the dynamics of elite circulation, the persistence of entrenched networks, and the pathways by which new actors ascend to national executive office. I analyze whether individuals with outsider or populist credentials can break through elite closure, or whether the system reshapes insurgent movements to reproduce elite preferences and preserve stability. This is central in analyzing whether a figure like Balendra Shah, who is youth-supported but unconventional, has a plausible path to become the next substantive (non-caretaker) Prime Minister of Nepal.",
            "status_quo": "Nepal is currently under the interim premiership of Sushila Karki, an unaffiliated figure chosen to placate Gen Z protestors and manage the transition to elections scheduled for March 2026. Shah remains the mayor of Kathmandu and is an external, albeit popular, contender for national executive power.",
            "perspective_derived_factors": [
                {
                    "factor": "Elite Entrenchment and Institutional Resilience",
                    "effect": "Decreases probability. Nepali elites (major party coalitions, bureaucracy, security apparatus, economic stakeholders) typically engineer post-crisis caretaker governments that protect elite interests and offer stability, marginalizing outsiders like Shah in favour of establishment candidates or unaligned technocrats."
                },
                {
                    "factor": "Youth Mobilization and Anti-Elite Insurgency",
                    "effect": "Increases probability, but only moderately. The 2025 uprising was remarkable in scale, resulting in the toppling of KP Sharma Oli. However, historically, such waves often achieve caretaker concessions but rarely institutionalize outsider leadership at the national executive level in the near-term."
                },
                {
                    "factor": "Balendra Shah’s Profile and Popularity",
                    "effect": "Increases probability. As an independently elected, Gen Z-aligned, reformist mayor with national notoriety, Shah theoretically fits the moment. Yet, even his supporters note he declined interim posts, and he has signaled unwillingness to become a caretaker-paced appointee."
                },
                {
                    "factor": "Intra-Movement Fractures and Political Negotiation",
                    "effect": "Decreases probability. Gen Z factions, previously united, are fracturing over direction, with some viewing Shah as too moderate or already compromised by establishment ties from his position as mayor. Violent scuffles, shifting demands, and leaderless posturing undermine a unified push for Shah."
                },
                {
                    "factor": "Legal and Constitutional Constraints",
                    "effect": "Decreases probability. The process set by Section 76 of the Constitution and the army/presidency’s role in managing transition favour compromise candidates, caretaker cabinets, or figures with broad institutional acceptability. Shah is not currently in Parliament, and the path to premiership would require swift legislative maneuvers or extraconstitutional consensus."
                },
                {
                    "factor": "Precedent from South Asian Political Transitions",
                    "effect": "Decreases probability, based on base rate. Across South Asia, youth protest movements often bring brief, symbolic inclusion of outsiders at the city/ministerial level, while national leadership reverts to establishment or consensus technocrats."
                }
            ],
            "no_scenario": "The interim Karki government manages a technocratic caretaker period until elections in March 2026. Elite and military actors maintain order, Shah continues as mayor and, though popular, lacks the institutional or coalition backing to become the next non-caretaker prime minister. Instead, either an establishment figure or a consensus outsider with elite acceptability (not Shah) is chosen.",
            "yes_scenario": "Faced with sustained youth unrest and a further legitimacy crisis, the caretaker period collapses rapidly. Elites, recognizing they cannot govern without Gen Z acquiescence and desperate for rapid stabilization, yield to popular will. Against precedent, they nominate Balendra Shah, who—perhaps reluctantly—accepts and quickly marshals parliamentary and presidential support to gain the oath of office and a confidence vote before the 2026 elections.",
            "final_reasoning": "While Nepal is in a moment of exceptional flux, base rates and elite theory analysis indicate it is highly improbable that Balendra Shah will be the next non-caretaker prime minister before January 2026. Shah is an unusually popular outsider, but he has thus far refused to take on even interim roles. The current system responded to mass protest by installing Karki as a caretaker; the roadmap is toward new elections, not an immediate handover to a figurehead mayor. Elites and security actors are incentivized to avoid further disruption and instability—handing executive national power to a disruptive non-insider like Shah would violate all prior institutional patterns. Furthermore, significant Gen Z fragmentation, legal obstacles, and a lack of parliamentary process favour a technocratic caretaker followed by electoral legitimation. While a Yes scenario is conceivable with sudden elite collapse, it remains low probability in the face of status quo forces.",
            "final_probability": 3
        },
        "Political Science (Parliamentary Systems)": {
            "time_to_resolution": "Approximately 3.5 months, from September 19 to before January 1, 2026.",
            "perspective_relevance": "As an expert in Political Science specializing in Parliamentary Systems, I bring an understanding of how parliamentary crises resolve in South Asian multiparty contexts, the impact of protest-driven legitimacy, coalition-making, caretaker conventions, and the specific obstacles emergent leaders face when parliamentary institutions are in turmoil. Familiarity with Nepal’s constitutional procedures (notably section 76), the informal power of President and Army during breakdown, and the translation of street-level legitimacy into parliamentary support underpins my forecast.",
            "status_quo": "Sushila Karki is the caretaker Prime Minister, appointed following violent Gen Z-led protests and the resignation of KP Sharma Oli. The caretaker cabinet is mandated to oversee interim governance and hold new elections (March 2026). There is no immediate or obvious process for Balendra Shah to become PM, since Karki holds the post and is widely accepted by the Gen Z movement, the president, and the army.",
            "perspective_derived_factors": [
                {
                    "factor": "Caretaker Norms and Mandate for Fresh Elections",
                    "effect": "Decreases probability. Parliamentary systems generally insulate caretaker governments barring extreme breakdowns, with explicit mandates to conduct elections, not install new full-term prime ministers. Nepal's president, with army backing, is committed to this caretaker arrangement."
                },
                {
                    "factor": "Street vs. Parliamentary Legitimacy",
                    "effect": "Decreases probability. While Balendra Shah has street legitimacy and high youth support, there is scant evidence he commands a parliamentary majority or that the process is shifting toward direct appointment by popular acclaim. Nepal’s constitutional process (section 76) still requires a parliamentary vote of confidence."
                },
                {
                    "factor": "Public Mood for Reform, Anti-Establishment Candidates",
                    "effect": "Slightly increases probability. The same public discontent that drove the youth movement could create continued delegitimization of current leadership, especially if Karki’s government loses public trust or is accused of being co-opted."
                },
                {
                    "factor": "Balendra Shah’s Own Positioning",
                    "effect": "Decreases probability. Multiple sources state Shah declined the interim prime ministership. While that does not foreclose a later bid, it signals an absence of personal ambition/coalition organization for PM now."
                },
                {
                    "factor": "Elite, Army, and President’s Preference for Stability",
                    "effect": "Decreases probability. These actors have sided with Karki as a consensus, technically capable, and symbolically reformist but unthreatening interim figure. There is little evidence they would support an abrupt, youthful outsider takeover absent renewed breakdown."
                },
                {
                    "factor": "Potential for Renewed Crisis or Collapse of Caretaker",
                    "effect": "Minor increase. Given ongoing unrest, if the caretaker government collapsed or failed spectacularly, the establishment might resort to installing a new outsider like Shah in a desperate attempt to restore order. However, this is a tail risk."
                }
            ],
            "no_scenario": "The caretaker government, led by Sushila Karki, maintains enough legitimacy until the March 2026 election. Balendra Shah remains mayor of Kathmandu and prominent youth leader. Even if unrest continues, the establishment retains Karki, or, in the event of another collapse, appoints another consensus caretaker or interim PM from the technocratic elite rather than Shah. Shah might be a leading candidate for PM in the post-election government but does not become PM in the current crisis window.",
            "yes_scenario": "The Karki caretaker government rapidly collapses under public pressure, factional splits, or new violence; youth movements intensify demands, pushing parliament and/or the president to turn to Balendra Shah as the only figure able to restore calm and credibility. He is appointed PM, takes the oath, and wins parliamentary confidence (perhaps through a cross-factional youth coalition or emergency transitional arrangement). This requires either a constitutional workaround or a resumption of parliament for a vote.",
            "final_reasoning": "The overarching trend in parliamentary systems facing unrest is to install broad-consensus caretakers who represent a compromise among the street, establishment, and constitutional order—Sushila Karki fits this mold perfectly. While Shah is visible and popular, he has explicitly declined the interim role, and the establishment (President and Army) currently backs Karki. No credible reports suggest Karki’s imminent fall or Shah’s ascendancy as PM in this three-month window. Parliamentary base rates for non-party, youth-movement leaders becoming PM after initial caretaker selection are extremely low unless the caretaker government collapses or is forced out. Populist energy and public pressure could alter things if the transitional government falters, but the window for such an outcome is narrow. Shah is better positioned for future elections or #1 role after 2026, not as the immediate or next PM. Thus, the balance of probability highly favors a No outcome, but allows a minimal tail risk in case of renewed collapse.",
            "final_probability": 5
        },
        "Area Studies South Asian Studies (Nepalese Political History)": {
            "time_to_resolution": "Resolution window is September 11, 2025 to January 1, 2026 (approximately 3.5 months remaining).",
            "perspective_relevance": "My expertise in South Asian/Nepalese political history is relevant because the crisis is unprecedented in terms of youth mobilisation, institutional breakdown, and possible regime transformation, recalling both the Maoist insurgency era and the more recent patterns of urban/populist anti-elite backlash in Nepal’s 2006 and 2015-16 mobilisations. I can identify the roots and limits of transformative moments vis-à-vis established institutional and extralegal powerbrokers (President, Army, political elite), and assess whether figures such as Balendra Shah could translate popular momentum into constitutional victory and actual authority.",
            "status_quo": "The current Prime Minister is Sushila Karki, serving in an explicitly caretaker/interim role after being installed at the urging of Gen Z protestors and with the cooperation of traditional authorities. Fresh elections are scheduled for March 2026. Karki is expected to serve only briefly; the next non-caretaker PM is to be determined, but is not currently in place.",
            "perspective_derived_factors": [
                {
                    "factor": "Caretaker Government’s Strength and Mandate",
                    "effect": "Decreases probability. The Karki interim caretaker cabinet is charged only with stabilising the system and running elections; it is not authorized to transition quietly into a partisan/radical administration. Its existence, with strong public/Gen Z/reformist and establishment backing, forecloses major extra-constitutional departures in the short term."
                },
                {
                    "factor": "Momentum, Legitimacy, and Popularity of Balendra Shah",
                    "effect": "Slightly increases probability. Shah is arguably Nepal’s most popular reformist youth leader, with acclaim as Kathmandu’s mayor, widespread Gen Z support, and a reformist/anti-corruption brand. He is a plausible face of the future post-Karki government within the context of a broader societal demand for new leadership."
                },
                {
                    "factor": "Institutional Constraints and Army/President Role",
                    "effect": "Decreases probability. Nepalese political transitions, even during crises, balance revolutionary demands against the stabilising roles of presidency, army, and constitutional law (see especially the events of 2006 and 2015). These actors, even after violence, have acted to prevent radical outsiders from assuming power directly unless system/party elites are thoroughly delegitimised or forcibly removed, with broad coalitional support."
                },
                {
                    "factor": "Precedent and Party Fragmentation",
                    "effect": "Slightly increases probability. Parties are delegitimised, and Gen Z mobilisation hints at a preference for charismatic, uncorrupted newcomers. In historical crises, outsider figures (e.g., Gyanendra as king in 2005, or the Maoists in 2008) sometimes became kingmakers, but usually within negotiated frameworks."
                },
                {
                    "factor": "Shah’s Own Position and Recent Moves",
                    "effect": "Decreases probability. Multiple credible reports (El Confidencial, Rediff, ThePrint, Mediapart) state that Shah was considered as interim PM, but publicly declined an interim caretaker post, instead backing Karki. This signals he is not positioned to claim the post before the election as part of the current transition."
                },
                {
                    "factor": "Base Rate for Outsider, Reformist, or Non-Partisan Figures Rising to PM Immediately After Uprising",
                    "effect": "Low base rate. In Nepal, outsized figures (esp. those outside mainline parties/army/judiciary) rarely become PM in non-revolutionary transitions, especially when order is restored and an interim government is tasked to prepare elections. It is more common for such individuals to enter through the next general election."
                }
            ],
            "no_scenario": "After Karki’s caretaker government stabilises the country, elections are carried out in March 2026. Balendra Shah may run or lead a new force but does NOT become PM in the interim period between September 11, 2025, and January 1, 2026. Instead, Karki (caretaker) continues, or another establishment/compromise candidate is named as a caretaker if Karki resigns. The next substantive PM is chosen only post-election.",
            "yes_scenario": "Karki’s government collapses (through renewed unrest, interim inability to form consensus, or elite/President/Army intervention); a renewed Gen Z/popular demand or negotiated coalition props up Balendra Shah as an emergency, consensus or youth-backed PM. He is nominated, takes the oath, and secures the required House vote of confidence before the election period, possibly as a means of regime transformation or compromise if all other processes break down irretrievably.",
            "final_reasoning": "While Balendra Shah is the face of Nepal’s reformist youth movement and is frequently cited as a top contender for the future, all current evidence and process suggest he will not become PM during the resolution window in question. First, Shah explicitly declined the interim/caretaker post, backing Sushila Karki and demurring from front-line institutional power during the most recent transition. No credible report places him as the agreed candidate for the next immediate government; all account for his own withdrawal and support for Karki. Second, the status quo—an explicit, Gen Z–endorsed caretaker government—enjoys sufficient broad-based support from both youth and traditional powers, whose preferred path is to stabilise, hold elections, and address demands within constitutional channels. The only substantial pathway for Shah to become PM in this window is a near-total failure of the caretaker arrangement and a further round of system breakdown or unpredictable mass-mobilised regime change within 3.5 months. On historical precedent, non-caretaker, youth-populist outsiders do not become PM immediately after such crises except after elections or total revolutionary breakdown, which is possible but now substantially mitigated by the restoration of order and the explicit roadmap to March 2026 elections. In summary: Shah’s odds are nonzero, because the situation remains volatile and his popularity is immense, but the overwhelming probability is that he will not fill the non-caretaker PM slot in the required window. Base rate, process status, and Shah’s own choices all weigh strongly against a Yes resolution.",
            "final_probability": 7
        },
        "Area Studies South Asian Studies (State Society Relations Nepal)": {
            "time_to_resolution": "Resolution period: September 11, 2025 – January 1, 2026 (approx. 3.5 months left)",
            "perspective_relevance": "As an expert in South Asian and Nepalese state-society relations, my analysis reflects both the importance of Nepal's recent youth-led political upheaval and the entrenched patterns of elite power circulation, civil-military relations, and the fluid, personality-centered nature of Nepali politics. I bring to bear a nuanced understanding of how mass mobilization interacts with constitutional process, elite bargaining within crisis, historical instability, and emerging trends toward 'outsider' politics as embodied by figures like Balendra Shah ('Balen').",
            "status_quo": "Sushila Karki, as a non-party, anti-corruption figure, is serving as caretaker prime minister—her mandate is to run a technocratic interim government and oversee fresh elections on March 5, 2026. She is NOT expected to continue as non-caretaker PM. Shah is mayor of Kathmandu but not presently in the caretaker cabinet.",
            "perspective_derived_factors": [
                {
                    "factor": "Status of caretaker government and mandate",
                    "effect": "Decreases probability; the explicit caretaker mandate (to conduct elections, not to govern as a substantive PM) means those in interim posts are unlikely to transition directly to full PM under current arrangements."
                },
                {
                    "factor": "Widespread youth support for anti-establishment figures (e.g. Balen Shah)",
                    "effect": "Increases probability; unprecedented youth mobilization has broken some rules of Nepali politics and Shah is the foremost Gen Z icon, with an outsider, clean image, popular mandate in Kathmandu, and media attention."
                },
                {
                    "factor": "Balendra Shah's own positioning and recent actions/statements",
                    "effect": "Decreases probability; despite speculation, Shah declined the interim PM role (per El Confidencial and other sources). He lent support to Karki and has, so far, signaled willingness to act as a movement figure, not a direct contender—at least until normal constitutional process resumes."
                },
                {
                    "factor": "Constitutional procedure: party formation, votes of confidence, and electoral law",
                    "effect": "Decreases probability; after the caretaker period, any candidate must command a parliamentary majority and win a vote of confidence. Shah's lack of parliamentary seat, party machine, or coalition backing is a severe obstacle unless the constitutional process is further upended or exceptional procedures remain."
                },
                {
                    "factor": "Elite and military disposition",
                    "effect": "Decreases probability; even amid crisis, the army and leading parties prefer stability, legal continuity, and have accepted Karki as a consensus interim option. Installing a Gen-Z mayor as PM may be seen as risky unless regular elections entirely break elite logjams."
                },
                {
                    "factor": "Potential for ongoing mass disruption or constitutional rupture",
                    "effect": "Slightly increases probability; another round of mass protest, or if elections are delayed or subverted and Shah is drafted as a unity or emergency candidate, the probability grows—but only if further exceptional events occur."
                },
                {
                    "factor": "Base rate: Nepali PMs since 1990",
                    "effect": "Decreases probability; virtually all PMs since multiparty democracy have risen from established parties, through parliamentary processes, not direct election or mass elevation from local government."
                }
            ],
            "no_scenario": "Nepal holds fresh elections as scheduled. Political parties engage in coalition formation. The new House elects a party-affiliated PM who wins a vote of confidence under constitutional procedures—either a veteran (Prachanda, Deuba, etc.), a new party leader, or, less likely, another technocratic consensus figure. Shah remains mayor and movement leader but does not ascend constitutionally to PM during the resolution window.",
            "yes_scenario": "Cascading breakdown of party system persists. Elections produce a landslide for youth-backed independent or new party candidates, with Shah as their de facto leader. He is either directly elected to parliament during a by-election, or rules and norms are further suspended, and a mass movement demands his appointment. The President, under pressure, invites Shah to form a government, and he successfully secures the required vote of confidence.",
            "final_reasoning": "The core status quo is a technocratic caretaker period followed by regular multi-party elections. The prevailing pattern in Nepalese politics is for established parties (even new ones like Rastriya Swatantra Party) or technocrats (Karki) with coalition backing to produce PMs—not mayors or outsiders. Although youth-driven protest has shattered some norms, and Balen Shah is Nepal’s most plausible non-elite, youth-backed PM candidate, current evidence shows: (a) Shah declined the interim post and is noncommittal about seeking national office before the next general elections; (b) the caretaker government and constitutional order are reaffirmed by army, president, and most protest organizers for now; (c) despite continued unrest, the primary procedural mechanism for naming a non-caretaker PM will be via parliamentary elections, where parties (existing and possibly new) are dominant and Shah’s vehicle is weak; (d) base rate for local outsider-mayor leaping to PM within a single crisis cycle is extremely low, even in crisis moments—especially as Nepal’s elites, under pressure, tend to revert to coalition-building and legal continuity where possible. Still, mass discontent means an outside scenario exists—Shah could be drafted if the current order collapses again. However, on balance, the probability of Balen Shah (Balendra Shah) becoming the next non-caretaker PM of Nepal during the resolution period, given constitutional, strategic, and historical constraints, is very low.",
            "final_probability": 7
        }
    },
    "deliberation_probability": [
        1,
        7,
        2,
        3,
        2,
        3,
        5,
        7,
        7
    ],
    "deliberation_mean_probability": 4.111111111111111,
    "deliberation_sd": 2.4209731743889917,
    "deliberation_probability_result": 4,
    "group_results": {
        "comparativePoliticsConsultingElectoralSystemsAnalysis": {
            "forecaster_to_engage": "Area Studies South Asian Studies (Nepalese Political History)",
            "response_type": "defense",
            "response": "I defend this forecast's approach, as it acknowledges both the volatility of Nepal's recent crisis and the immense popularity of Balendra Shah among youth and protest factions—while ultimately demonstrating that structural, institutional, and procedural factors in Nepalese politics strongly impede the immediate elevation of such an outsider to the premiership within the specified period. The forecast is compelling in its careful balance between nonzero, crisis-driven tail risk (rooted in Shah's public profile and mass mobilization) and the fundamental weight of status quo political processes favoring technocrats and party figures under caretaker arrangements. The use of historical precedent from Nepal and the broader region aptly reinforces why even charismatic outsiders rarely seize the PM's office between election cycles except in cases of total regime collapse, which is now less likely post-restoration of caretaker government. The nuanced reasoning captures both the transient allure of protest leaders and the persistent resilience of parliamentary and elite-dominated appointment mechanisms."
        },
        "comparativePoliticsConsultingCabinetFormationProcess": {
            "forecaster_to_engage": "Nepalese Constitutional Law (Nepal Constitution 2015 Interpretation)",
            "response_type": "critique",
            "response": "While this forecaster correctly emphasizes the constitutional and procedural obstacles to Balendra Shah's ascension, their estimate (2%) may be too low given the extreme volatility of the current context and the observed erosion of formerly 'ironclad' processes during the September upheaval. In times of dramatic system stress—especially when formal parliamentary procedure is suspended, elite alignments breakdown, and popular mobilization is as unprecedented as here—the base rate for truly irregular outcomes, while still markedly low, is not negligible. Furthermore, the existence of active street-level divisions, unresolved Gen Z demands, and references in news sources to possible caretaker collapse slightly widen the Overton window, justifying a probability point or two higher. While the strict constitutional reading is sound, comparative experience shows that during ongoing flux (and especially if Karki falters), it's prudent to reflect a bit more uncertainty."
        },
        "nepaleseConstitutionalLawNepalConstitution2015Interpretation": {
            "forecaster_to_engage": "Political Science (Parliamentary Systems)",
            "response_type": "defense",
            "response": "This forecast insightfully connects the status quo bias in parliamentary transitions—especially after upheaval—to the extremely low probability of Balen Shah becoming the next non-caretaker PM. The reasoning is well-grounded in institutional functionality: systems in crisis nearly always revert to consensus or technocratic caretakers, as has occurred here. The assessment appropriately acknowledges a residual tail risk—that public unrest or sudden caretaker collapse could yield a left-field result—yet correctly frames this as highly improbable within Nepal's constitutional and historical experience. The recognition that Shah is much better positioned for the post-2026 electoral cycle, and not for an immediate leap, demonstrates a realistic appreciation for parliamentary mechanics and the limitations faced even by wildly popular outsiders."
        },
        "nepaleseConstitutionalLawPrecedentsNepalExecutiveLeadership": {
            "forecaster_to_engage": "Comparative Politics Consulting (Cabinet Formation Process)",
            "response_type": "defense",
            "response": "I defend this forecast for its sophisticated calibration of risk in a volatile post-uprising environment. It recognizes that Balendra Shah’s popularity and initial prominence among Gen-Z factions could—under extraordinary conditions—create a pathway to the premiership, but it properly weighs both legal and practical impediments, such as the absence of a parliamentary base and Shah’s own explicit disinterest in the role. Importantly, this forecaster highlights the crucial distinction between theoretical instability (which does open a thin tail risk for an outsider) and the deep-rooted status quo forces—constitutional, coalition, and elite pressures—that resist unprecedented power transfers. The conclusion to assign a low, but nonzero, probability reflects a nuanced understanding that the window for radical, irregular outcomes has not closed entirely, even as Karki’s caretaker regime and systemic inertia dominate."
        },
        "politicalScienceCoalitionTheory": {
            "forecaster_to_engage": "Area Studies South Asian Studies (State Society Relations Nepal)",
            "response_type": "critique",
            "response": "While this forecast makes a strong case for the persistence of elite coalition-building and legal continuity—citing the dominance of technocratic caretaker arrangements even in moments of mass unrest—its probability (7%) arguably overshoots the true likelihood of Balendra Shah becoming the next non-caretaker PM. The justification for a still 'plausible' outside scenario relies heavily on generalized volatility, but specific current facts undermine this: Shah declined the interim role, Gen Z is fractured rather than consolidating behind him, institutional actors are reinforcing the caretaker system, and there's no credible pathway now visible for the abrupt reversal required to vault Shah into power. Though systemic collapse always remains a tail risk, the empirical record from Nepal and comparable crises favors stabilization and a return to regularized elections over rapid outsider elevation—especially after the reassertion of order and elite consensus post-uprising. Thus, a lower estimate would better fit the immediate structural and behavioral evidence."
        },
        "politicalScienceEliteTheory": {
            "forecaster_to_engage": "Comparative Politics Consulting (Electoral Systems Analysis)",
            "response_type": "defense",
            "response": "This forecast stands out for rigorously grounding its reasoning in both historical and comparative base rates for executive transitions in parliamentary systems during crisis. Unlike more speculative accounts, it leverages clear electoral-system logics, pointing to the near universality of technocratic/caretaker regimes as a stabilizing response when elected governments fall outside the regular electoral cycle. Its emphasis on the narrowness of the procedural and political window available to Balendra Shah, and the strong incentives for insiders to defer any radical change until after scheduled elections, reflects a deep understanding of how formal and informal institutions interact to preserve elite continuity. The low probability estimate is well-defended by both Shah’s unwillingness to disrupt the status quo process and the lack of meaningful structural collapse beyond what has already produced an interim, not a full, government. While the analysis leaves a thin tail for further crisis, its weighting toward 'No' is compelling and methodologically sound."
        },
        "politicalScienceParliamentarySystems": {
            "forecaster_to_engage": "Area Studies South Asian Studies (State Society Relations Nepal)",
            "response_type": "critique",
            "response": "Your analysis correctly highlights the entrenched nature of technocratic caretaker arrangements and the historical unlikelihood of rapid outsider elevation to PM in Nepal. However, assigning a probability as high as 7% seems to overstate the likelihood of this outcome, given the sequence of events and the clear consolidation of both establishment and protest support behind Karki's caretaker government. Relative to similar cases across the region, the degree of elite and institutional lock-in—expressed in the explicit interim mandate, Shah’s own public withdrawal, and absence of an organized parliamentary push—points to a more remote chance of abrupt reversal absent an unforeseeable second wave of systemic collapse. The current moment, while volatile, is not radically open: procedural inertia after caretaker installation is very strong, and the fragmentation of Gen Z makes a unified rally behind Shah much less likely. For these reasons, your tail-risk allowance could be trimmed, and the probability more closely brought in line with lower-bound estimates."
        },
        "areaStudiesSouthAsianStudiesNepalesePoliticalHistory": {
            "forecaster_to_engage": "Political Science (Parliamentary Systems)",
            "response_type": "defense",
            "response": "Your reasoning effectively integrates both the status quo bias intrinsic to parliamentary systems in times of crisis and Nepal-specific constraints: the push for consensus, technocratic interim leadership, and the explicit role of elite/establishment actors (President, Army) as stabilizers. I concur with your assessment that even amid high volatility, the probability for someone like Balendra Shah to leap directly to the premiership—without an election, without a legislative majority, and without fresh breakdowns in the caretaker process—is exceptionally low. The tail risk exists but is correctly minimized given the rapid consolidation around Karki, Shah’s own non-aspirational posture, and the lack of institutional or organized movement to propel him immediately. This careful parsing of comparative parliamentary outcomes and Nepali precedent robustly justifies a 'No' forecast."
        },
        "areaStudiesSouthAsianStudiesStateSocietyRelationsNepal": {
            "forecaster_to_engage": "Political Science (Coalition Theory)",
            "response_type": "defense",
            "response": "This forecast is strong in emphasizing the overwhelming tendency of Nepal's political coalitions and power brokers to revert to a technocratic caretaker and electoral legitimacy after episode of upheaval. The forecaster situates the youth/protest phenomena within the longer arc of Nepali coalition dynamics, drawing valuable parallels to other recent caretaker regimes regionally. Their assertion that the Overton window for radical outsider elevation is 'exceedingly low' is well justified: Shah's lack of parliamentary network, absence from formal coalition-building, and clear lack of army or elite parliamentary backing now dominate the scenario space. By downgrading speculation sparked by transient protest activity in favor of classic coalition logic and the consolidation of the caretaker government, this forecast captures the resilient structural logic of Nepali regime transition. Its low probability assignment is highly defensible given the present evidence, even while acknowledging possible instability tails."
        }
    },
    "revision_results": {
        "Comparative Politics Consulting (Electoral Systems Analysis)": {
            "my_phase1_final_probability": 1,
            "reasoning_for_revised_probability": "After reviewing all group deliberation forecasts, I find strong consensus among both comparative politics and area studies experts, as well as Nepalese constitutional lawyers, that Balendra Shah's likelihood of becoming the next non-caretaker PM before January 1, 2026, is extremely low. While some forecasters assign slightly higher (though still single-digit) probabilities to account for Nepal's recent volatility and Shah's immense popularity, these adjustments stem more from tail-risk management rather than substantive evidence for imminent regime destabilization or Shah's candidacy. The legal-institutional path and Shah's own disinterest in seizing the interim or immediate office are underscored by all. There is not enough new evidence or argument in group deliberation to shift away from my very low initial probability. My forecast remains at 1%.",
            "revised_probability": 1
        },
        "Comparative Politics Consulting (Cabinet Formation Process)": {
            "my_phase1_final_probability": 7,
            "reasoning_for_revised_probability": "Upon reviewing the group deliberation, I see strong consensus among comparative, legal, coalition, and area studies experts that the base probability for Balendra Shah becoming non-caretaker PM in this window is extremely low—typically 1–7%, depending on the precise weight accorded to volatility versus structural/constitutional obstacles. The most compelling new consideration comes from the critique of the lowest estimates: even in periods of acute system crisis, there is a (small but real) possibility of further breakdown or rapid elite collapse, as highlighted during the recent events. However, the arguments I originally presented about status quo resilience remain, and my probability was already at the higher end of the reasoned range, reflecting that slight, persistent tail risk. No new developments—or overlooked cracks—have emerged to warrant revising above or below this value. I therefore maintain my initial assessment as sound and appropriate.",
            "revised_probability": 7
        },
        "Nepalese Constitutional Law (Nepal Constitution 2015 Interpretation)": {
            "my_phase1_final_probability": 2,
            "reasoning_for_revised_probability": "Upon reviewing group deliberation, my original estimate of 2% remains appropriate but could be nudged slightly upward. The critique from Comparative Politics Consulting (Cabinet Formation Process) rightly highlights that while the constitutional and elite barriers are strong, the unprecedented volatility, fragmentation of the Gen Z movement, and the rapid collapse of prior 'ironclad' arrangements leave open a slightly wider window for extraordinary, irregular developments—particularly if the caretaker government falters. Several forecasters set the probability at 5-7% on comparable logic, anchoring on base rates but allowing greater space for unanticipated upheaval. However, as the defense of status quo arguments remains analytically dominant, and there is no new evidence indicating a sudden change of mood or direction by Shah or by the main institutional actors, any adjustment should be cautious. I therefore revise slightly upward to better reflect the group consensus around irreducible but low volatility-driven risk.",
            "revised_probability": 4
        },
        "Nepalese Constitutional Law (Precedents Nepal Executive Leadership)": {
            "my_phase1_final_probability": 3,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, the range of probabilities offered by other forecasters for Balendra Shah becoming the next non-caretaker PM is consistently low (1-7%), with detailed justification rooted in both comparative politics and constitutional law. Critiques suggest my original estimate is already near the upper end of reasoned tail-risk calibration. There is consensus that, while the system is not immune to renewed instability, the convergence of constitutional process, institutional inertia, and Shah’s explicit choices makes a near-term Shah premiership nearly impossible. Minor critiques indicate one could nudge the probability slightly higher in acknowledgment of possible extraordinary collapse, but given my initial recognition of this narrow scenario, and the lack of additional evidence for imminent upheaval or caretaker failure, I maintain that my original 3% is reasonable and well-supported.",
            "revised_probability": 3
        },
        "Political Science (Coalition Theory)": {
            "my_phase1_final_probability": 2,
            "reasoning_for_revised_probability": "Having reviewed the group deliberation, my initial low probability is strongly validated by near-consensus across expertise domains: all forecasters agree the prospect of Balendra Shah becoming the next non-caretaker PM is extremely remote due to the stabilization around Sushila Karki and strong institutional, constitutional, and historical constraints. The only dissent comes from slightly higher tail-risk estimates (5–7%) rooted in general volatility and mass protest, but critique and further argument show these are overestimating the likelihood—given Shah's own disinterest, divided Gen Z politics, and reassertion of procedural order. There is still a nonzero risk if systemic collapse resumes, but the odds are truly minimal now that the caretaker framework and elite agreement are holding. Nothing in the collective arguments provides grounds for an upward revision—in fact, if anything, the evidence supports a 1–2% range. I therefore maintain my original 2% estimate.",
            "revised_probability": 2
        },
        "Political Science (Elite Theory)": {
            "my_phase1_final_probability": 3,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I find my prior estimate remains well-justified. The discussion reinforced the extreme unlikelihood of Balendra Shah becoming the next non-caretaker PM before January 1, 2026, citing not only the strength of constitutional and elite constraints but also comparative base rates across South Asia. Multiple forecasters (across Constitutional Law, Coalition Theory, Electoral Systems, and Area Studies) converged on the rarity of successful outsider leaps to premiership in the absence of further system breakdown—which current reporting does not indicate is imminent. Critiques of slightly higher estimates argued persuasively that volatility remains, but not at a level to justify even moderate single-digit probabilities. Voices that defended probabilities at or below 3% relied on strong procedural, legal, and behavioral factors: the restoration of a caretaker consensus, Shah’s public stance, and the lack of a parliamentary or coalition pathway for his ascent. Therefore, my assessment remains unchanged: a very low, but not zero, probability for a 'Yes' resolution.",
            "revised_probability": 3
        },
        "Political Science (Parliamentary Systems)": {
            "my_phase1_final_probability": 5,
            "reasoning_for_revised_probability": "The group deliberation overwhelmingly corroborated my initial reasoning: nearly all forecasters, especially those with expertise in legal process and comparative parliamentary coalitions, converged on extremely low probabilities (generally between 1% and 7%). The main points of debate focused on whether the probability should be at the absolute lower bound (1-2%) or allow for a slightly wider tail risk (up to 7%) given the ongoing volatility, potential for systemic rupture, and Nepal's unique post-crisis context. Critiques of the higher 7% estimate (which I find persuasive) emphasized that, despite volatility, the combination of Shah's explicit withdrawal, entrenchment of the Karki caretaker government, and lack of clear mechanism for a sudden Shah-powered reversal makes the mid-single-digit probability slightly too high. The evidence for an imminent collapse or regime reversal is weaker than that for strong institutional inertia. As a result, I am persuaded to adjust modestly downward. My revised probability is 3%, which reflects a minimal but nonzero chance of a shock scenario but better fits the prevailing constitutional and behavioral realities.",
            "revised_probability": 3
        },
        "Area Studies South Asian Studies (Nepalese Political History)": {
            "my_phase1_final_probability": 7,
            "reasoning_for_revised_probability": "Group deliberation confirmed near-unanimity among domain and comparative-system experts on the overwhelming status quo bias and procedural/structural blockages facing Balendra Shah, specifically in the disposition of interim/caretaker governments and the historical rarity of a mayor-to-PM leap absent elections or regime collapse. Critiques correctly argue that my original 7% probability slightly overweighs generalized volatility, since Shah has removed himself from contention, Gen Z is fragmented, and caretaker stability has significant buy-in. Practically all forecasters—with expertise ranging from coalition theory to constitutional precedent—converge in the 1-5% range and underscore that only an extraordinary crisis or system-wide collapse in the next three months could propel Shah into the PM role before the election (with no current trajectory pointing there). Given this consensus, the base rate, clearer view of post-upheaval consolidation, and the lack of credible new threats to the caretaker model, I am revising downward.",
            "revised_probability": 2
        },
        "Area Studies South Asian Studies (State Society Relations Nepal)": {
            "my_phase1_final_probability": 7,
            "reasoning_for_revised_probability": "After considering the group deliberation, especially critiques by forecasters specializing in coalition theory and parliamentary systems, I detect a strong consensus that my initial estimate (7%) was potentially generous relative to the structural and procedural closure evident in post-crisis Nepal. Multiple forecasters point out that (a) the explicit and robust installation of Karki as caretaker PM with cross-coalition backing, (b) Balendra Shah’s own disavowal of the interim role and lack of parliamentary or formal movement machinery, and (c) elite and security sector consolidation behind technocratic continuity, all severely constrain the plausibility of a Yes scenario within the resolution period. Furthermore, the current status quo status appears more entrenched than my scenario analysis initially weighted, and the granular political situation lacks signs of renewed collapse or unified mass demand for Shah’s elevation that could rapidly flip the state. Thus, aligning with the comparative, constitutional, and coalition analyses—without reducing the probability to true zero to acknowledge a tail risk—I will downward revise the probability to reflect an even more remote possibility.",
            "revised_probability": 3
        }
    },
    "revision_probability": [
        1,
        7,
        4,
        3,
        2,
        3,
        3,
        2,
        3
    ],
    "revision_mean_probability": 3.111111111111111,
    "revision_sd": 1.6914819275153699,
    "revision_probability_result": 3,
    "question_details": {
        "id": 39513,
        "title": "Who will be the next non-caretaker prime minister of Nepal? (Balendra Shah)",
        "created_at": "2025-09-15T10:14:57.150084Z",
        "open_time": "2025-09-17T10:42:39Z",
        "cp_reveal_time": "2025-09-17T12:12:39Z",
        "spot_scoring_time": "2025-09-17T12:12:39Z",
        "scheduled_resolve_time": "2026-01-01T06:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-09-17T12:12:39Z",
        "actual_close_time": "2025-09-17T12:12:39Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 0.69,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "The Federal: [Who could be Nepal's next prime minister? Here are 5 top contenders](https://thefederal.com/category/international/nepals-next-prime-minister-after-olis-controversial-exit-206263)\n\n> Scuffles were reported among Gen-Z factions backing different contenders outside the Nepal Army headquarters in Kathmandu on Wednesday evening, as talks to pick an interim leader after the violent overthrow of the government extended into the third day.\n\n> KP Sharma Oli resigned as prime minister on Tuesday, leaving the post vacant while the anti-corruption revolt continues without a clear leader.\n\n`{\"format\":\"metac_reveal_and_close_in_period\",\"info\":{\"post_id\":39851,\"question_id\":39395}}`",
        "resolution_criteria": "This question is a subquestion of a group question. This subquestion specifically targets the option 'Balendra Shah'. The resolution criteria for the parent question is below. \n\nThis question resolves as **Yes** for the individual who, after September 11, 2025 and before January 1, 2026 takes the [oath](https://www.constituteproject.org/constitution/Nepal_2016#s852) of office and secrecy as the new [Prime Minister of Nepal](https://en.wikipedia.org/wiki/Prime_Minister_of_Nepal) and wins a vote of confidence in the House of Representatives as required by [section 76](https://www.constituteproject.org/constitution/Nepal_2016#s795) of the Constitution of Nepal. The question resolves as **No** for everyone else. If none of the listed candidates fulfills the criteria during that time period, then the question resolves as **No** for every option.",
        "fine_print": "This is a Group question, so you do not have to assess probabilities for every option. More options may be added after the question opens, if there is [credible](https://www.metaculus.com/faq/#definitions) reporting that a particular individual has a material probability of coming the next PM of Nepal.",
        "post_id": 39970,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**After Bangladesh and Sri Lanka, Nepal’s Youth Dismisses Its Political Class**\nThe article reports that on 8 September 2024 a peaceful gathering in Kathmandu turned into an uprising that toppled Nepal’s political elite, leading to the resignation of Prime Minister Khadga Prasad Sharma Oli.  According to the piece, at least 72 people were killed and 2 000 injured, and preliminary estimates put the damage at 2 to 20 billion euros.  The protests destroyed key state buildings – the Parliament, the Supreme Court, ministries, police stations, hotels and the headquarters of *The Kathmandu Post* – and set fire to the historic Singha Durbar complex.  A Ministry of Health employee lamented, ‘I understand that the youth want change, but it is a mess, all the archives go up in smoke,’ while a transport ministry official said, ‘Do not confuse politicians with the buildings that serve the people.’  The unrest was inspired by earlier youth‑led movements in Indonesia, Bangladesh and Sri Lanka, and the article notes that the youth of Nepal, often called ‘Nepo‑kids,’ used TikTok and Discord to organize.  After the army imposed a curfew, the youth elected former Supreme Court chief Sushila Karki as prime minister via a Discord vote, a move described as ‘the first government head elected on Discord.’  The article quotes economist Raghu Bir Bista: ‘Beyond the amounts, Generation Z burned symbols. This explosion reflects the feeling that to change the country, one must topple a gangrenous system.’  It also highlights the country’s economic woes – a GDP per capita of 1 447 € (the lowest in South Asia) and youth unemployment above 20 % – and the frustration that drives many to consider emigration.  The piece concludes that the youth’s rapid political mobilisation, though unprecedented, may lead to a new democratic era if the upcoming 2026 elections bring fresh representatives.\nOriginal language: fr\nPublish date: September 15, 2025 03:57 PM\nSource:[Mediapart](https://www.mediapart.fr/journal/international/150925/apres-le-bangladesh-et-le-sri-lanka-la-jeunesse-du-nepal-congedie-sa-classe-politique)\n\n**Prime Minister of Nepal Resigns Amid Massive Protests**\nPrime Minister K.P. Sharma Oli resigned on September 15, 2025, amid violent protests that left at least 19 people dead and hundreds injured. The demonstrations, led by Generation Z, escalated when thousands tried to storm Parliament and government offices, burning former leaders' residences and demanding an end to endemic corruption in Oli's communist regime. Police responded with live fire, tear gas and water cannons, creating chaos in Kathmandu, a curfew was imposed and the army was deployed. Oli, who had been in power since July 2024, stepped down after the assault on his office, citing the failure of communist regimes to respond to popular demands without repression. 'Al Jazeera reporta que los manifestantes, inspirados en movimientos globales, rechazan la prohibición de redes sociales impuesta para censurar críticas', highlighting the hypocrisy of a government that preaches equality but enriches an elite. International groups such as Amnesty International condemn the excessive use of force, while former U.S. President Trump has called for global pressure against such authoritarian governments.\nOriginal language: es\nPublish date: September 15, 2025 09:50 AM\nSource:[noticialibre.com](https://noticialibre.com/2025/09/renuncia-el-primer-ministro-de-nepal-en-medio-de-protestas-masivas/)\n\n**Nepal PM Sushila Karki appoints three new ministers for interim cabinet**\nOn September 15 2025, the Hindustan Times reported that Nepal President Ramchandra Paudel swore in three ministers—Kulman Ghising, Rameshwor Khanal and Om Prakash Aryal—appointed by caretaker Prime Minister Sushila Karki for her newly formed cabinet. The oath ceremony took place at the President's Office, Sheetal Niwas, Maharajgunj, after which all three ministers immediately assumed their posts. Khanal, the former finance secretary, was sworn in as finance minister. Ghising, the former managing director of the Nepal Electricity Authority, was given charge of energy, water resources and irrigation; physical infrastructure and transport; and urban development. Aryal, an advocate, was appointed minister for home affairs and for law, justice and parliamentary affairs. The article notes that Karki, 73, became Nepal's first female prime minister on September 12, at the recommendation of the agitating 'Gen Z' group, to lead a caretaker government tasked with conducting fresh elections on March 5 2026. It also recounts that former Prime Minister KP Sharma Oli resigned after widespread anti‑government protests led by the 'Gen Z' group against a social media ban and corruption allegations; the protests turned violent, with at least 72 people losing their lives in the nationwide unrest.\nOriginal language: en\nPublish date: September 15, 2025 09:23 AM\nSource:[Hindustan Times](https://www.hindustantimes.com/world-news/nepal-pm-sushila-karki-appoints-three-new-ministers-for-interim-cabinet-101757927752490.html)\n\n**Three ministers inducted by Nepal's new caretaker PM Karki sworn in**\nOn September 15 2025, the Business Standard reported that Nepal President Ramchandra Paudel administered the oath of office to three ministers—Kulman Ghising, Rameshwor Khanal, and Om Prakash Aryal—inducted by the newly appointed caretaker Prime Minister Sushila Karki. The swearing‑in ceremony took place at the President's Office, Sheetal Niwas, Maharjgunj, and the ministers assumed their respective portfolios: Khanal as Finance Minister; Ghising as Minister for Energy, Water Resources and Irrigation, Physical Infrastructure and Transport, and Urban Development; and Aryal as Minister for Home Affairs and for Law, Justice and Parliamentary Affairs. The article notes that Karki, 73, is the Himalayan nation's first woman prime minister and that she assumed office on Sunday, following the resignation of former PM K P Sharma Oli after widespread protests that left at least 72 people dead. The caretaker government, appointed at the recommendation of an agitating 'Gen Z' group, is mandated to conduct fresh elections on March 5 2026. The article also cites the headline 'Those involved in violence will face justice' as a statement from PM Karki.\nOriginal language: en\nPublish date: September 15, 2025 08:59 AM\nSource:[Business Standard](https://www.business-standard.com/world-news/three-ministers-inducted-by-nepal-s-new-caretaker-pm-karki-sworn-in-125091500626_1.html)\n\n**Nepal: 3 ministers inducted by new caretaker PM Sushila Karki sworn in**\nOn Monday, Nepal President Ramchandra Paudel administered the oath of office to three ministers appointed by caretaker Prime Minister Sushila Karki, the country’s first woman prime minister. Karki, 73, assumed office on Sunday. The ministers sworn in were Kulman Ghising, Rameshwor Khanal and Om Prakash Aryal. Khanal became Finance Minister; Ghising took charge of energy, water resources and irrigation, physical infrastructure and transport, and urban development; Aryal was appointed Minister for Home Affairs and for Law, Justice and Parliamentary Affairs. The swearing‑in ceremony was held at the President’s Office, Sheetal Niwas, Maharjgunj. Karki was appointed prime minister at the recommendation of the agitating 'Gen Z' group, which demanded a caretaker government to hold fresh elections on March 5 2026. She took oath on September 12, ending a period of political uncertainty after former prime minister K P Sharma Oli resigned following widespread anti‑government protests led by the same 'Gen Z' group over a ban on social media and alleged corruption. The protests resulted in at least 72 deaths nationwide.\nOriginal language: en\nPublish date: September 15, 2025 12:00 AM\nSource:[newsdrum.in](https://www.newsdrum.in/international/nepal-3-ministers-inducted-by-new-caretaker-pm-karki-sworn-in-10466225)\n\n**Neptune Youths Use Discord to Elect Interim Prime Minister**\nThe article reports that in Nepal, Generation Z youth used the messaging platform Discord to directly elect an interim prime minister after a wave of protests sparked by perceived corruption and economic hardship.  The protests began in early September after TikTok videos of former Prime Minister Khadga Prasad Sharma Oli’s children flaunting luxury led to widespread anger, with 4,000‑5,000 demonstrators occupying the capital’s main square.  The government’s attempt to shut down social media backfired, prompting attacks on government buildings and the resignation of Oli.  With no clear leadership, the youth organized a vote among roughly 100,000 Discord members, choosing former Supreme Court president Sushila Karki.  Karki, who said ‘no era su deseo’ to take the role, pledged to hold elections within six months and to hand power to a new parliament.  She has already appointed three ministers—Interior, Energy and Finance—and plans to form the rest of her cabinet.  The youth also considered former Kathmandu mayor Balendra Shah (Balen) as a potential candidate, though he declined the interim post.  The article notes that less than 20 % of Nepal’s population has internet access, highlighting a digital divide that may affect the democratic process.  The narrative includes direct quotes such as ‘no nos quedaremos aquí más de seis meses’ and ‘para nosotros es la más preparada’.\nOriginal language: es\nPublish date: September 16, 2025 03:18 AM\nSource:[El Confidencial](https://www.elconfidencial.com/mundo/2025-09-16/nepal-protesta-generacion-z_4209406/)\n\n**Sushila Karki to lead Nepal as interim PM, tasked with conducting fresh polls**\nFormer chief justice Sushila Karki will be sworn in as Nepal’s interim prime minister on Friday at 9 pm, becoming the country’s first woman to hold the post, according to the president’s office. The decision follows inconclusive talks between President Ramchandra Paudel, Gen‑Z protest representatives and the army. Karki, who has no party affiliation and a strong anti‑corruption record, was suggested by the protesters and will lead a caretaker government that will address their demands and organise fresh elections. She was born in Biratnagar in 1952, holds degrees in political science and law, and previously worked as a lawyer and assistant teacher. The move comes after former prime minister K.P. Sharma Oli resigned amid widespread Gen‑Z protests over corruption and a ban on social media, which led to at least 51 deaths. The article states, 'Karki will become the first woman to hold the office of prime minister in the country.' It also reports, 'Karki will be sworn in around 9pm on Friday.' and that, 'The caretaker government headed by former chief justice Karki will address the demands of Gen‑Z protesters and conduct fresh elections in the country hit by violent protests.'\nOriginal language: en\nPublish date: September 15, 2025 07:23 PM\nSource:[The Week](https://www.theweek.in/news/world/2025/09/12/sushila-karki-to-lead-nepal-as-interim-pm-tasked-with-conducting-fresh-polls.html)\n\n**After Bangladesh and Sri Lanka, Nepal’s Youth Dismisses Its Political Class**\nThe article reports that on 8 September 2024 a peaceful gathering in Kathmandu turned into an uprising that toppled Nepal’s political elite, leading to the resignation of Prime Minister Khadga Prasad Sharma Oli.  According to the piece, at least 72 people were killed and 2 000 injured, and preliminary estimates put the damage at 2 to 20 billion euros.  The protests destroyed key state buildings – the Parliament, the Supreme Court, ministries, police stations, hotels and the headquarters of *The Kathmandu Post* – and set fire to the historic Singha Durbar complex.  A Ministry of Health employee lamented, ‘I understand that the youth want change, but it is a mess, all the archives go up in smoke,’ while a transport ministry official said, ‘Do not confuse politicians with the buildings that serve the people.’  The unrest was inspired by earlier youth‑led movements in Indonesia, Bangladesh and Sri Lanka, and the article notes that the youth of Nepal, often called ‘Nepo‑kids,’ used TikTok and Discord to organize.  After the army imposed a curfew, the youth elected former Supreme Court chief Sushila Karki as prime minister via a Discord vote, a move described as ‘the first government head elected on Discord.’  The article quotes economist Raghu Bir Bista: ‘Beyond the amounts, Generation Z burned symbols. This explosion reflects the feeling that to change the country, one must topple a gangrenous system.’  It also highlights the country’s economic woes – a GDP per capita of 1 447 € (the lowest in South Asia) and youth unemployment above 20 % – and the frustration that drives many to consider emigration.  The piece concludes that the youth’s rapid political mobilisation, though unprecedented, may lead to a new democratic era if the upcoming 2026 elections bring fresh representatives.\nOriginal language: fr\nPublish date: September 15, 2025 03:57 PM\nSource:[Mediapart](https://www.mediapart.fr/journal/international/150925/apres-le-bangladesh-et-le-sri-lanka-la-jeunesse-du-nepal-congedie-sa-classe-politique)\n\n**Nepal's PM Karki appoints ministers after deadly Gen Z protests**\nNeal's Prime Minister Sushila Karki, the country’s first female leader, appointed Om Prakash Aryal as home minister, Rameshwar Prasad Khanal as finance minister, and Kulman Ghising as energy minister on Monday, following the dissolution of parliament after deadly protests that killed at least 72 people. Aryal is a human‑rights lawyer, Khanal a former finance secretary who recommended major economic reforms, and Ghising a former state power utility chief credited with eliminating load‑shedding. President Ramchandra Paudel swore them in during a televised ceremony outside the fire‑damaged presidential office. The interim government, which will last six months until early‑March elections, is pledged to tackle corruption. The appointments came less than a week after former PM KP Sharma Oli resigned amid unrest that escalated when demonstrators were shot dead by police on Monday. The protests, led by Gen Z, began on 8 September over a brief social‑media ban and grew into widespread anger over corruption and poverty. In her first public remarks, Karki said the country should rebuild together and would work 'according to the thinking of the Gen Z generation'. Subash Dhakal, a 19‑year‑old protester shot in the knees, told AFP he had no regrets and that the pain was temporary but would bring change.\nOriginal language: en\nPublish date: September 15, 2025 12:46 PM\nSource:[Al Jazeera Online](https://www.aljazeera.com/news/2025/9/15/nepals-pm-karki-appoints-ministers-after-deadly-gen-z-protests)\n\n**'Will topple this govt too' -- why Gen Z are protesting against Nepal's new PM Sushila Karki**\nAccording to a report by ThePrint (published 15 September 2025), protests that began on 8 September in Kathmandu and spread nationwide have created a power vacuum in Nepal. The movement is led by the youth‑led foundation Hami Nepal, whose leader Sudan Gurung has demanded the immediate dissolution of Parliament and the installation of an interim administration that reflects the Gen Z demographic. Gurung criticized the appointment of Om Prakash Aryal as home minister, saying 'This Om Prakash lawyer is making himself the home minister by sitting inside,' and accused him of bypassing the youth coalition. The article notes that Gurung’s supporters claim the Gen Z movement, which helped elevate Sushila Karki to prime minister, has now been hijacked by political insiders. Gurung declared outside the prime minister’s residence that 'The most powerful people in Nepal are the people. No one can stop us. I will pull them down from the place where we have placed them.' A press conference held by Gurung at the Reporters Club in Kathmandu turned violent; Gurung warned 'If our demands are not met, this government will also be toppled,' and the event ended in a scuffle between his supporters and journalists. Gurung clarified that the movement seeks an amendment, not repeal, of the constitution and reiterated demands for dissolution of Parliament, an interim government reflecting Gen Z aspirations, and governance by new, capable, uncorrupted leaders. Despite initially endorsing Karki, Gurung now states 'We are not seeking a prime minister. We don't need a government. If we did, I would have taken the post myself. We want change. After reaching the chair, there should be no arrogance. Now, every Nepali's voice must be heard.' The article also mentions that Balen Shah, a Gen Z rapper and mayor of Kathmandu, supported Karki and won the mayoralty in 2022 as an independent candidate.\nOriginal language: en\nPublish date: September 15, 2025 10:20 AM\nSource:[ThePrint](https://theprint.in/world/nepal-gen-z-protesting-pm-sushil-karki-ministers/2743564/)\n\n**Prime Minister of Nepal Resigns Amid Massive Protests**\nPrime Minister K.P. Sharma Oli resigned on September 15, 2025, amid violent protests that left at least 19 people dead and hundreds injured. The demonstrations, led by Generation Z, escalated when thousands tried to storm Parliament and government offices, burning former leaders' residences and demanding an end to endemic corruption in Oli's communist regime. Police responded with live fire, tear gas and water cannons, creating chaos in Kathmandu, a curfew was imposed and the army was deployed. Oli, who had been in power since July 2024, stepped down after the assault on his office, citing the failure of communist regimes to respond to popular demands without repression. 'Al Jazeera reporta que los manifestantes, inspirados en movimientos globales, rechazan la prohibición de redes sociales impuesta para censurar críticas', highlighting the hypocrisy of a government that preaches equality but enriches an elite. International groups such as Amnesty International condemn the excessive use of force, while former U.S. President Trump has called for global pressure against such authoritarian governments.\nOriginal language: es\nPublish date: September 15, 2025 09:50 AM\nSource:[noticialibre.com](https://noticialibre.com/2025/09/renuncia-el-primer-ministro-de-nepal-en-medio-de-protestas-masivas/)\n\n**Nepal PM Sushila Karki appoints three new ministers for interim cabinet**\nOn September 15 2025, the Hindustan Times reported that Nepal President Ramchandra Paudel swore in three ministers—Kulman Ghising, Rameshwor Khanal and Om Prakash Aryal—appointed by caretaker Prime Minister Sushila Karki for her newly formed cabinet. The oath ceremony took place at the President's Office, Sheetal Niwas, Maharajgunj, after which all three ministers immediately assumed their posts. Khanal, the former finance secretary, was sworn in as finance minister. Ghising, the former managing director of the Nepal Electricity Authority, was given charge of energy, water resources and irrigation; physical infrastructure and transport; and urban development. Aryal, an advocate, was appointed minister for home affairs and for law, justice and parliamentary affairs. The article notes that Karki, 73, became Nepal's first female prime minister on September 12, at the recommendation of the agitating 'Gen Z' group, to lead a caretaker government tasked with conducting fresh elections on March 5 2026. It also recounts that former Prime Minister KP Sharma Oli resigned after widespread anti‑government protests led by the 'Gen Z' group against a social media ban and corruption allegations; the protests turned violent, with at least 72 people losing their lives in the nationwide unrest.\nOriginal language: en\nPublish date: September 15, 2025 09:23 AM\nSource:[Hindustan Times](https://www.hindustantimes.com/world-news/nepal-pm-sushila-karki-appoints-three-new-ministers-for-interim-cabinet-101757927752490.html)\n\n**Three ministers inducted by Nepal's new caretaker PM Karki sworn in**\nOn September 15 2025, the Business Standard reported that Nepal President Ramchandra Paudel administered the oath of office to three ministers—Kulman Ghising, Rameshwor Khanal, and Om Prakash Aryal—inducted by the newly appointed caretaker Prime Minister Sushila Karki. The swearing‑in ceremony took place at the President's Office, Sheetal Niwas, Maharjgunj, and the ministers assumed their respective portfolios: Khanal as Finance Minister; Ghising as Minister for Energy, Water Resources and Irrigation, Physical Infrastructure and Transport, and Urban Development; and Aryal as Minister for Home Affairs and for Law, Justice and Parliamentary Affairs. The article notes that Karki, 73, is the Himalayan nation's first woman prime minister and that she assumed office on Sunday, following the resignation of former PM K P Sharma Oli after widespread protests that left at least 72 people dead. The caretaker government, appointed at the recommendation of an agitating 'Gen Z' group, is mandated to conduct fresh elections on March 5 2026. The article also cites the headline 'Those involved in violence will face justice' as a statement from PM Karki.\nOriginal language: en\nPublish date: September 15, 2025 08:59 AM\nSource:[Business Standard](https://www.business-standard.com/world-news/three-ministers-inducted-by-nepal-s-new-caretaker-pm-karki-sworn-in-125091500626_1.html)\n\n**Nepal: 3 ministers inducted by new caretaker PM Sushila Karki sworn in**\nOn Monday, Nepal President Ramchandra Paudel administered the oath of office to three ministers appointed by caretaker Prime Minister Sushila Karki, the country’s first woman prime minister. Karki, 73, assumed office on Sunday. The ministers sworn in were Kulman Ghising, Rameshwor Khanal and Om Prakash Aryal. Khanal became Finance Minister; Ghising took charge of energy, water resources and irrigation, physical infrastructure and transport, and urban development; Aryal was appointed Minister for Home Affairs and for Law, Justice and Parliamentary Affairs. The swearing‑in ceremony was held at the President’s Office, Sheetal Niwas, Maharjgunj. Karki was appointed prime minister at the recommendation of the agitating 'Gen Z' group, which demanded a caretaker government to hold fresh elections on March 5 2026. She took oath on September 12, ending a period of political uncertainty after former prime minister K P Sharma Oli resigned following widespread anti‑government protests led by the same 'Gen Z' group over a ban on social media and alleged corruption. The protests resulted in at least 72 deaths nationwide.\nOriginal language: en\nPublish date: September 15, 2025 12:00 AM\nSource:[newsdrum.in](https://www.newsdrum.in/international/nepal-3-ministers-inducted-by-new-caretaker-pm-karki-sworn-in-10466225)\n\n**World News | Nepal: Public Voices Confidence in Ex-Chief Justice Sushila Karki as Interim PM Amid Gen Z Protests | LatestLY**\nIn September 2025, after the resignation of Prime Minister KP Sharma Oli amid Gen‑Z protests, public support for former Chief Justice Sushila Karki as interim Prime Minister has grown. Gen‑Z leaders and citizens, including Kathmandu residents Nanda Prasad Tiwari and Bimala Khatiwada, praise Karki’s legal background and integrity. Tiwari said 'The criminal activities that took place during this adverse situation will be controlled, and the good governance we have waited for so long will finally be witnessed. Hopes are high,' he said. 'While leading the interim government, she will be able to make the state corruption‑free as per the interest of the people; she will be able to hold the election on time and take the nation on the path of prosperity.' Khatiwada added 'Being a Nepali woman, I am happy that we are getting a Nepali female Prime Minister. On top of that, she is a person with a legal background,' she said. 'Once she takes power, I expect peace will prevail in the nation. I hope the situation will return to normal very soon. I extend my good wishes to Sushila Karki and have confidence she will call the election on time and give a solution to the state.' Gen‑Z leaders Diwakar Dangal, Junal Gadal and Anil Baniya also endorsed Karki, citing her integrity and the need to tackle corruption. The protests, which began on September 8 after a ban on social media platforms, have highlighted frustration over political stagnation, corruption and economic disparity. Mayor Balendra Shah 'Balen' of Kathmandu Metropolitan City echoed the support, strengthening Karki’s standing as the probable candidate.\nOriginal language: en\nPublish date: September 12, 2025 04:24 AM\nSource:[LatestLY](https://www.latestly.com/agency-news/world-news-nepal-public-voices-confidence-in-ex-chief-justice-sushila-karki-as-interim-pm-amid-gen-z-protests-7106735.html)\n\n**Engineers In, Judges Out... Nepal's Seat Fight Intensifies, Interim PM Stuck in a Catch**\nIn Kathmandu, outside the Nepal Army headquarters, a clash erupted among JEN‑Z factions while discussions were underway to select an interim leader. The Prime Minister position has been vacant since the resignation of K.P. Sharma Oli. Names currently in the race for the PM post include Balendra Shah, Balen Sushila Karki, and Kulan Gishing, but no decision has yet been made. The article states, 'काठमांडू में नेपाल सेना मुख्यालय के बाहर जेन-जेड गुटों में झड़प हुई', 'केपी शर्मा ओली के इस्तीफे के बाद यह पद खाली है', and 'बलेंद्र शाह बालेन सुशीला कार्की और कुलमान घिसिंग जैसे नाम पीएम पद की दौड़ में हैं', which provide the factual basis for the summary.\nOriginal language: hi\nPublish date: September 11, 2025 11:53 AM\nSource:[दैनिक जागरण (Dainik Jagran)](https://www.jagran.com/world/other-when-will-nepal-get-new-prime-minister-suspense-grows-as-name-shuffle-engineer-in-judge-out-24043484.html)\n\n**When will Nepal get new PM? Gen-Z 'cracks', suspense grows as names shuffle | What we know so far**\nScuffles were reported among Gen‑Z factions backing different contenders outside the Nepal Army headquarters in Kathmandu on Wednesday evening, as talks to pick an interim leader after the violent overthrow of the government extended into the third day. The post of prime minister has been vacant since KP Sharma Oli resigned on Tuesday. Four names have emerged as potential candidates: Kathmandu mayor and rapper Balendra Shah 'Balen', former chief justice Sushila Karki, former chief of the electricity board Kulman Ghising, and current mayor of Dharan Harka Raj Sampang Rai. The scuffle on Thursday evening involved supporters of Balen, Karki or Sampang, according to multiple outlets. No final decision has yet been reached; talks are ongoing among Gen‑Z representatives, President Ram Chandra Paudel and the army chief. The President issued an appeal for calm and said he was doing his best to find a solution, with a letter seen as a signal to Gen‑Z representatives to 'take the onus and decide'.\nOriginal language: en\nPublish date: September 11, 2025 11:19 AM\nSource:[Hindustan Times](https://www.hindustantimes.com/world-news/when-will-nepal-get-new-leader-wait-extends-gen-z-cracks-what-we-know-so-far-101757588087511.html)\n\n**Nepal President has a message amid talks with Gen Z to pick interim PM**\nOn September 11, 2025, Nepal’s President Ram Chandra Paudel issued a letter urging all parties to resolve the political stalemate within the constitutional framework and protect democracy. The letter, dated September 11, states: 'I am deliberating and making every effort to find a way out of the current difficult situation in the country within the constitutional framework and to protect democracy.' It also appeals: 'I appeal to all parties to be confident that a solution to the problem is being sought as soon as possible to address the demands of the agitating citizens.' The President, the highest ceremonial authority after the violent protests that toppled the previous government, is pressing the army and Gen‑Z representatives to finalize a name for the interim prime minister. Army chief Ashok Raj Sigdel is also involved, and an army spokesperson said: 'We are holding rounds of talks with different stakeholders. The talks are mainly focused on finding a way out from the current stalemate and at the same time maintaining law and order situation in the country.' Potential candidates mentioned include former chief justice Sushila Karki, ex‑chief of the Nepal power board Kulman Ghising, and Kathmandu mayor Balendra Shah. The interim PM will replace KP Sharma Oli, who resigned on Tuesday after a student‑led agitation. The article notes that in parts of Kathmandu, students from major parties demonstrated, demanding the Constitution be preserved and democracy protected while a new government is formed. The new executive head will have to ensure fresh elections within a specified timeframe, and the army spokesperson did not provide any names.\nOriginal language: en\nPublish date: September 11, 2025 10:25 AM\nSource:[Hindustan Times](https://www.hindustantimes.com/world-news/nepal-president-has-message-amid-talks-with-gen-z-to-pick-interim-pm-sushila-karki-balen-shah-kulman-ghising-options-101757584599327.html)\n\n**Gen Z leaders endorse former CJ for interim Nepal PM**\nThe article reports that Gen Z leaders in Nepal have collectively endorsed former Chief Justice Sushila Karki as the nominee for interim prime minister following the resignation of Prime Minister K P Sharma Oli.  The protests, which began on 8 September 2025 after the government banned major social‑media platforms, have escalated into violent clashes that have left 31 people dead and more than 1,000 injured, according to the Kathmandu Post.  Gen Z leaders such as Diwakar Dangal, Junal Gadal, Anil Baniya and Ojashwi Raj Thapa have spoken at a press conference, with Dangal saying ‘We are staging this movement against corruption, as it is rampant.’  Gadal added ‘We should choose Sushila Karki as the best option as the guardian of the country.’  The leaders claim that the movement’s violence was caused by political infiltrators, not by the protesters themselves.  They also state that they are not seeking to change the constitution but to amend it, and that they will hold elections within six months.  Kathmandu Metropolitan City Mayor Balendra Shah ‘Balen’ has publicly supported Karki, strengthening her candidacy.  The article notes that the protests have prompted a curfew in several cities, including Kathmandu, which is set to lift on Friday morning, and that the government’s ban on social media was justified by concerns over tax revenue and cybersecurity.  The piece presents the Gen Z perspective on institutionalised corruption and the need for greater accountability and transparency in governance.\nOriginal language: en\nPublish date: September 11, 2025 10:14 AM\nSource:[Rediff.com India Ltd.](https://www.rediff.com/news/report/gen-z-leaders-endorse-former-cj-for-interim-nepal-pm/20250911.htm)\n\n**Army out, curfew clamped as Nepal hunts for a new leader**\nOn September 10, 2025, soldiers guarded Nepal’s parliament and patrolled deserted streets under a curfew after Prime Minister KP Sharma Oli resigned amid deadly anti‑corruption protests. The death toll had risen to 25 and 633 were injured, according to the health ministry. In addition, five juvenile inmates died during a clash with security at a western Nepal jail, and more than 7,000 prisoners escaped from prisons nationwide. Negotiations between representatives and protesters began at the army headquarters, but no succession plan was agreed upon. Tribhuvan International Airport resumed services the same evening, 24 hours after closing. The army deployed armoured personnel carriers and used loudspeakers to call for calm. Former PM Jhala Nath Khanal’s wife, Ravi Laxmi Chitrakar, who sustained serious burn injuries, is critical but stable, as reported by Dr Kiran Nakarmi of Kirtipur Hospital. Nepali Army chief General Ashok Raj Sigdel held consultations with stakeholders and met with representatives of the Gen Z protest movement, according to Rajaram Basnet. Former chief justice Sushila Karki, Kathmandu mayor Balendra Shah, and former electricity board chief Kulman Ghising were named as potential interim leaders. Karki said, 'Experts need to come together to figure out the way forward' and added, 'When they requested me, I accepted.' The army announced that curfew orders would remain in force until Thursday morning, warning that demonstrations, vandalism, looting, arson, and attacks in the name of protest would be considered punishable crimes.\nOriginal language: en\nPublish date: September 10, 2025 09:36 PM\nSource:[Hindustan Times](https://www.hindustantimes.com/world-news/army-out-curfew-clamped-as-nepal-hunts-for-a-new-leader-101757540191643.html)\n\n**After Oli's exit, who will lead Nepal? Inside details of GenZ meeting on Interim Government - The Statesman**\nViolent Gen Z protests over alleged corruption and nepotism have erupted across Nepal, with demonstrators setting fire to the Parliament building and the residences of the President, Prime Minister and several ministers. Prime Minister KP Sharma Oli resigned amid the unrest, and a meeting of Gen Z protesters and allies was held on 18 September 2025 at Jangi Adda, Army Headquarters in Bhadrakali, Kathmandu, to discuss who should lead the interim government. The meeting considered several potential leaders: Kathmandu Mayor Balenndra Shah, former Chief Justice Shushila Karki (who said 'I am ready to lead the interim government if I have unanimous support'), Sumana Shrestha (who declined due to her affiliation with the Rastriya Swatantra Party), Harka Samparg (Mayor of Dharan), Sagar Dhakal (federal election candidate), Kulman Ghising (former Managing Director of Nepal Electricity Authority), and Rastra Bimochan Timalsena (YouTuber and lawyer who goes by 'Random Nepali').\nOriginal language: en\nPublish date: September 10, 2025 12:05 PM\nSource:[thestatesman.com](https://www.thestatesman.com/world/after-olis-exit-who-will-lead-nepal-inside-details-of-genz-meeting-on-interim-government-1503484209.html)\n\n**Nepal’s interim PM race: Gen Z icons vs the consensus dark horse**\nThe article reports that Nepal is in a constitutional crisis and that Army Chief General Ashok Raj Sigdel has called for public input on the next interim leadership team. It identifies three main candidates: Balen Shah, Mayor of Kathmandu; Bhaskar Raj Rajkarnikar, a senior businessman and media founder; and Rabi Lamichhane, a media personality and party leader. The piece evaluates each candidate’s strengths and risks. Balen Shah is described as an \"untainted outsider\" who mobilises youth but lacks broader governance experience and may alienate elites. Bhaskar Raj Rajkarnikar is portrayed as a \"stable, moderate, and consensus‑oriented\" figure with strong business and diplomatic ties, though he has limited mass appeal. Rabi Lamichhane is noted for mass appeal and anti‑corruption rhetoric but faces legal controversies and credibility questions. The article concludes that Bhaskar Raj Rajkarnikar is the most internationally palatable candidate for an interim prime minister, offering a balanced, neighbour‑friendly statesmanship. The analysis is supported by the article’s own descriptions of each candidate’s profile and the stated international perceptions of India, China, SAARC, and the EU.\nOriginal language: en\nPublish date: September 10, 2025 12:00 AM\nSource:[newsdrum.in](https://www.newsdrum.in/analysis/nepals-interim-pm-race-gen-z-icons-vs-the-consensus-dark-horse-10068653)\n\n**New PM or Army rule? What's next for Nepal after deadly protests topple government**\nThe article reports that Nepal is in its most severe political crisis in recent memory after a youth‑led Gen Z movement protested the government’s abrupt ban on 26 major social media platforms, including Facebook, X (formerly Twitter) and YouTube. The ban, intended to enforce registration and regulatory oversight, sparked widespread outrage among young citizens frustrated by corruption, unemployment and lack of political transparency. Violent clashes between demonstrators and security forces have resulted in at least 19 deaths and hundreds of injuries, with protests targeting key state structures and the residences of political leaders. Under mounting pressure, Prime Minister KP Sharma Oli and President Ram Chandra Poudel resigned on 9 September 2025, and Home Minister Ramesh Lekhak also stepped down, citing moral responsibility for the police‑related deaths. Oli reportedly fled the country after his resignation. Although the social media ban was lifted, protests continue, demanding deeper systemic changes beyond restoring digital access. The Nepalese Army issued a statement urging restraint and pledging to safeguard sovereignty, cultural heritage and public property. Under Article 267 of Nepal’s Constitution, the military may be deployed for development work or disaster relief (Clause 4) or during armed rebellion, external threats or severe civil unrest (Clause 6) with approval from the President, the National Security Council and the Cabinet; many analysts argue that invoking Clause 6 would be constitutionally permissible given the scale of violence. As the political vacuum deepens, Balendra Shah, the Mayor of Kathmandu and former musician, has emerged as a leading contender for the premiership, rallying Gen Z activists with his independent, youthful image and calls for reform. However, with Parliament, the Supreme Court and the presidency implicated, a power transition may involve coalition‑led caretaker arrangements until fresh elections or stabilization efforts can be initiated under a consensus‑driven approach, leaving uncertainty about who will assume effective control in the interim.\nOriginal language: en\nPublish date: September 09, 2025 04:00 PM\nSource:[India TV News](https://www.indiatvnews.com/news/world/new-pm-or-army-rule-what-s-next-for-nepal-after-deadly-protests-overthrow-government-nepal-protests-latest-news-and-updates-2025-09-09-1007462)\n\n**Nepal PM Oli resigns amid violent anti-corruption protests by youth & pandemonium on streets**\nThe Prime Minister of Nepal, K.P. Sharma Oli, resigned on September 9, 2025, according to a statement signed by him that 'he has resigned to pave the way for a constitutional solution to the ongoing crisis', as confirmed by his secretariat (BBC). The resignation came hours after the ban on unregistered social media sites was lifted, a key demand of protesters (BBC). Demonstrators set fire to the private residences of President Ramchandra Paudel and PM Oli in Bohratar and Balkot, party offices and buildings in Janakpur, and broke windows, threw stones, and set buildings ablaze following the deaths of at least 19 protesters on Monday (The Kathmandu Post). The Tribhuvan International Airport was fully closed amid escalating demonstrations (The Kathmandu Post). Police fired tear gas to disperse the crowd; authorities said no live ammunition was authorised, yet reports of gunfire and bullet injuries emerged (The Himalayan Times). Protesters also set fire to the house of Minister for Communication and Information Technology Prithvi Subba Gurung, pelted stones at the residence of Deputy Prime Minister and Finance Minister Bishnu Paudel, Nepal Rastra Bank Governor Biswo Paudel, and attacked the house of former Home Minister Ramesh Lekhak (The Kathmandu Post).\nOriginal language: en\nPublish date: September 09, 2025 09:17 AM\nSource:[ThePrint](https://theprint.in/world/nepal-pm-oli-resigns-amid-violent-anti-corruption-protests-by-youth-pandemonium-on-streets/2739274/)\n\n**Who is Balendra Shah, Kathmandu mayor who might become Nepal's next PM?**\nOn September 9 2025, the Daily News and Analysis reported that protests in Nepal over a temporary social media ban and corruption led to at least 19 deaths and more than 300 injuries. Prime Minister KP Sharma Oli resigned, and Kathmandu mayor Balendra Shah, 33, emerged as a potential successor. Shah, a civil engineer and rapper, won the 2022 mayoral election as an independent and has pursued anti‑corruption reforms such as cleaning city streets, improving public schooling and cracking down on tax‑evading institutions. He posted on Facebook: 'My full sympathy is with the youth,' urging leaders not to exploit the agitation for personal or party gains. Time magazine named him among its Top 100 Emerging Leaders and The New York Times praised his transparency and grassroots style of politics. The article portrays Shah as a youth‑backed reformist who could become Nepal’s next prime minister.\nOriginal language: en\nPublish date: September 09, 2025 09:07 AM\nSource:[Daily News and Analysis (DNA) India](https://www.dnaindia.com/world/report-nepal-genz-protest-who-is-balendra-shah-kathmandu-mayor-who-might-become-nepal-s-next-pm-kp-sharma-oli-3179425)\n\n",
    "date": "2025-09-19T01:14:39.237270",
    "summary": "Across a range of expert perspectives—including comparative politics, constitutional law, coalition theory, elite theory, parliamentary systems, and area studies on Nepal—all forecasters converge on a very low probability that Balendra Shah will be the next non-caretaker prime minister of Nepal during the resolution window (September 11, 2025–January 1, 2026). Key points shared by the experts are: (1) Nepal is currently under a caretaker/technocratic government led by Sushila Karki, whose explicit and widely backed mandate is to oversee new elections scheduled for March 2026, not to transition into a substantive PM or install another non-caretaker before then; (2) Balendra Shah, despite being seen as a top Gen Z/youth-backed contender and widely popular as Kathmandu mayor, has publicly declined the interim PM role and shown no active effort or coalition-building to become the immediate next PM; (3) legal, institutional, and historical constraints—including Nepal's constitution (especially Article 76), lack of a parliamentary base for Shah, and the tendency of both Nepali elites and precedents in comparable South Asian crises to favor technocratic or consensus caretakers until elections—strongly impede his appointment before 2026 elections; (4) while renewed instability or another crisis could open a path for an extraordinary appointment, such conditions are not present per news and expert analysis as of September 19, 2025. Base rates for similar outsider ascents to national executive power between elections are extremely low. Final probability estimates for Shah range between 1% and 7%, with most clustering at the lower end, reflecting consensus that while nonzero due to ongoing volatility, the odds are overwhelmingly against a Yes resolution for Balendra Shah in the relevant period.",
    "forecasters": [
        "Comparative Politics Consulting (Electoral Systems Analysis)",
        "Comparative Politics Consulting (Cabinet Formation Process)",
        "Nepalese Constitutional Law (Nepal Constitution 2015 Interpretation)",
        "Nepalese Constitutional Law (Precedents Nepal Executive Leadership)",
        "Political Science (Coalition Theory)",
        "Political Science (Elite Theory)",
        "Political Science (Parliamentary Systems)",
        "Area Studies South Asian Studies (Nepalese Political History)",
        "Area Studies South Asian Studies (State Society Relations Nepal)"
    ]
}