{
    "deliberation_results": {
        "Military Strategy (Doctrine of National Emergency)": {
            "time_to_resolution": "Approximately 3 weeks until November 5, 2025.",
            "perspective_relevance": "As an expert in Military Strategy and the Doctrine of National Emergency, my perspective is uniquely equipped to assess the logic, historical patterns, and strategic incentives behind the imposition and extension of martial law in wartime. I understand both the doctrinal justifications for emergency rule and the political-military dynamics that frame such decisions, especially during ongoing existential conflicts.",
            "status_quo": "Martial law has been continuously extended in 90-day increments since February 2022, with no interruption, and remains in force as of the latest extension to November 5, 2025. The default expectation, absent a major change, is that martial law will be extended again.",
            "perspective_derived_factors": [
                {
                    "factor": "Ongoing Active War with Russia",
                    "effect": "Increases probability. As long as large-scale combat persists and Ukraine faces existential threats, the justification for martial law (mobilization, emergency powers, suspension of elections) remains robust and aligned with both military doctrine and recent precedent."
                },
                {
                    "factor": "Lack of Negotiated Peace or Ceasefire",
                    "effect": "Increases probability. No meaningful diplomatic breakthrough or ceasefire appears imminent based on recent stalemates and mutual intransigence. Martial law is unlikely to be lifted while hostilities continue."
                },
                {
                    "factor": "Political Incentives for Zelenskyy and Government",
                    "effect": "Increases probability. Martial law provides strong political advantages (control over media, suspension of elections, consolidation of executive power). Despite criticism over 'authoritarianism,' there is little internal or external pressure strong enough to force a return to peacetime governance while the war endures."
                },
                {
                    "factor": "Parliamentary and Domestic Support",
                    "effect": "Slightly decreases probability. While there is some vocal opposition and growing war weariness, surveys show only 11% of Ukrainians support holding elections before the war ends, and public trust in Zelenskyy (60%) remains sufficient for legitimacy. Some dissent within parliament does not yet threaten the regime's ability to extend martial law."
                },
                {
                    "factor": "Western Support and Legitimacy Concerns",
                    "effect": "Neutral to slightly decreases probability. Western allies have generally accepted martial law as necessary under the circumstances; only if Western support became conditional on ending martial law (which is not presently the case) would this exert significant downward pressure."
                },
                {
                    "factor": "Recent Precedent and Base Rate",
                    "effect": "Strongly increases probability. Martial law has been extended 16 consecutive times, with every extension passing smoothly through parliament. Historically, countries at war seldom lift martial law until the security crisis abates."
                },
                {
                    "factor": "Impact of Stalemate and War Fatigue",
                    "effect": "Slightly decreases probability. Prolonged stalemate and social hardship (desertion, blackouts, economic strain) could, in theory, increase pressure to end martial law, but current evidence shows this has not yet translated into a viable political movement or parliamentary bloc."
                }
            ],
            "no_scenario": "A No outcome would require either a sudden, decisive cessation of hostilities (e.g., a formal ceasefire or peace agreement reached before November 5, 2025), or an unexpected political crisis (such as mass protests, parliamentary revolt, or Western pressure) compelling the government to refrain from extending martial law. Given the entrenched stalemate and ongoing combat, this appears highly improbable.",
            "yes_scenario": "A Yes outcome follows if the Ukrainian government determines that substantial military threats remain and parliament approves (as it has 16 times before) another extension. The absence of a ceasefire, ongoing Russian strikes, and the need for continued mobilization make this the overwhelmingly likely scenario. Even with some increased dissent, the regime retains the tools and legitimacy to secure another extension.",
            "final_reasoning": "The base rate for martial law extension in Ukraine during the war is 100%. All recent indicators—ongoing combat, lack of peace negotiations, continued Russian attacks, and the strategic necessity for mobilization—align with the doctrine of national emergency and historical precedent. Political incentives for the Zelenskyy administration to maintain martial law remain powerful. While there is growing criticism and limited parliamentary dissent, these have not (yet) reached the threshold to block extension. Only a dramatic and rapid change in the military or diplomatic situation—neither of which appears likely within three weeks—could plausibly reverse the status quo. Therefore, the probability that Ukraine extends martial law beyond November 5, 2025, is extremely high.",
            "final_probability": 97
        },
        "Comparative Law (Martial Law Legal Standards)": {
            "time_to_resolution": "Approximately 3 weeks (question resolves on or just after November 5, 2025; today is October 15, 2025)",
            "perspective_relevance": "As an expert in Comparative Law, specifically Martial Law Legal Standards, I can assess Ukraine's adherence to martial law procedures, the legal-political logic behind extensions, international precedents for martial law in wartime democracies, and the interplay between the ongoing conflict, domestic legitimacy, and the suspension of normal democratic processes. This expertise allows for a nuanced understanding of both the legal and practical constraints on lifting or extending martial law in Ukraine's unique context.",
            "status_quo": "Martial law has been in place continuously since February 2022 and has been extended every 90 days, with the 16th extension currently set to expire November 5, 2025. The war with Russia is ongoing and key democratic processes (national elections) remain suspended.",
            "perspective_derived_factors": [
                {
                    "factor": "Ongoing Kinetic Conflict",
                    "effect": "Strongly increases probability of extension. Martial law is justified under Ukrainian law when the country is under attack. The frontlines remain active, and military/political stalemate persists with no imminent peace agreement."
                },
                {
                    "factor": "Legal-Political Precedent",
                    "effect": "Increases probability. Ukraine has set a strong precedent since 2022 of extending martial law for 90-day increments, with no deviations even during periods of relative operational lull. The status quo is deeply entrenched."
                },
                {
                    "factor": "Domestic Legitimacy and Public Opinion",
                    "effect": "Slightly increases probability. While there is growing criticism of Zelenskyy and martial law, only 11% of the population favors holding elections before the war ends. Most accept the necessity of emergency powers while the war persists."
                },
                {
                    "factor": "International Norms and Pressure",
                    "effect": "Neutral to slightly decreases probability. Some Western partners are critical of Ukraine’s indefinite postponement of elections, but there is no strong push to end martial law while fighting is ongoing. International legal standards generally allow for martial law during existential wars."
                },
                {
                    "factor": "Parliamentary Support/Opposition",
                    "effect": "Slightly decreases probability. There is growing dissent among MPs, with some openly refusing to support further extensions, citing war fatigue and accusations of authoritarianism. However, the opposition is fragmented and not yet a decisive force."
                },
                {
                    "factor": "Potential for Sudden Political Settlement",
                    "effect": "Slightly decreases probability, but base rates are very low. There is ongoing diplomatic activity (e.g., US-Ukraine talks), but both sides' positions remain irreconcilable, and analysts expect the conflict to continue for months at least."
                }
            ],
            "no_scenario": "A No outcome would require a sudden and significant change: either a negotiated ceasefire or armistice is reached in the next three weeks, or there is a decisive political shift in the Ukrainian parliament, such that a critical mass of MPs refuse to extend martial law, forcing its expiration. Alternatively, overwhelming domestic or international pressure (e.g., Western aid made conditional on elections) could force an end to martial law. None of these are likely given current trends.",
            "yes_scenario": "A Yes outcome (martial law extended beyond November 5, 2025) occurs if current conditions persist: ongoing fighting, continued use of martial law to justify suspension of elections, parliamentary majority in favor of extension, and no breakthrough in negotiations. The government submits the routine extension bill in late October or early November, and parliament passes it as before.",
            "final_reasoning": "All key indicators—military, legal, and political—point toward the extension of martial law. The war is ongoing, there is no imminent peace, and domestic resistance to martial law is still relatively muted. Past behavior suggests strong path dependence, and the government has managed to secure successive extensions despite some growing dissent. Comparative legal standards support the continuation of martial law in the face of ongoing existential threat. The main risk to a Yes outcome would be a sudden, unforeseen peace deal or a parliamentary revolt, but there is no credible evidence these are likely in the next three weeks. Therefore, the probability is extremely high.",
            "final_probability": 97
        },
        "Regional Security Analysis (Black Sea Regional Security)": {
            "time_to_resolution": "Approximately 3 weeks (as of October 15, 2025, with martial law set to expire on November 5, 2025).",
            "perspective_relevance": "As a regional security analyst specializing in the Black Sea, I monitor military, political, and societal trends shaping Ukraine's wartime governance. My expertise allows me to weigh the interplay between ongoing conflict, regime stability, public attitudes, and external diplomatic pressures that affect martial law extensions.",
            "status_quo": "Martial law has been extended 16 times since February 2022, always for 90-day increments, amidst an ongoing, unresolved war. The default (status quo) is that martial law is extended as long as the war continues and political-military conditions remain unchanged.",
            "perspective_derived_factors": [
                {
                    "factor": "Military Stalemate and Protracted War",
                    "effect": "Increases probability. The conflict remains unresolved with active fighting and no credible ceasefire or settlement in sight, making continuation of martial law highly likely for security and mobilization reasons."
                },
                {
                    "factor": "Domestic Political Legitimacy and Public Attitudes",
                    "effect": "Increases probability. Despite some erosion in Zelenskyy's popularity and growing discontent, surveys show only a small minority (11%) favor holding elections before the war ends. Martial law is still seen as legitimate by a majority, and opposition to its extension is limited and fragmented."
                },
                {
                    "factor": "International Pressure and Western Support",
                    "effect": "Slightly decreases probability. There is some criticism of democratic backsliding and concerns about authoritarian tendencies, but Western partners overwhelmingly prioritize Ukraine's ability to defend itself over immediate restoration of peacetime procedures. No major aid threats or diplomatic ultimatums have been issued regarding martial law."
                },
                {
                    "factor": "Ukrainian Political Dynamics and Parliamentary Support",
                    "effect": "Increases probability. The Rada (parliament) has repeatedly approved extensions, and the opposition is divided. While some MPs now publicly oppose further extensions, their numbers remain insufficient to block government initiatives."
                },
                {
                    "factor": "Potential for Diplomatic Breakthrough or Ceasefire",
                    "effect": "Decreases probability (but only marginally). While there is more talk about peace negotiations and U.S. involvement, both sides remain far apart, and analysts forecast no imminent resolution. A diplomatic breakthrough before November 5 is highly unlikely."
                },
                {
                    "factor": "Socioeconomic Strain and Desertion/Mobilization Issues",
                    "effect": "Slightly decreases probability. Reports of mass desertion, economic hardship, and public fatigue could, in theory, force a policy shift. However, the government has shown willingness and ability to impose unpopular measures, and these pressures have not yet translated into institutional paralysis."
                }
            ],
            "no_scenario": "A ceasefire or credible, internationally-brokered peace agreement is reached by early November 2025, making martial law no longer justifiable. Alternatively, a parliamentary rebellion or mass protests force the government to lift martial law in order to hold overdue elections, restore civil liberties, or placate public anger. Both scenarios appear improbable given current military, diplomatic, and political realities.",
            "yes_scenario": "The war remains unresolved with ongoing Russian aggression, limited diplomatic progress, and continued need for mobilization and internal security. The government, with parliamentary backing, extends martial law for another 90 days, citing national security imperatives and lack of a peace settlement. This scenario aligns with the status quo and prevailing trends.",
            "final_reasoning": "Base rates strongly favor extension: for over three years, martial law has been renewed without interruption. The war remains at a stalemate, with no ceasefire or settlement on the horizon. Public support for lifting martial law or holding elections during hostilities is low, and the majority still view wartime governance as legitimate. Despite some erosion in elite consensus and growing societal fatigue, there is no sign of a critical mass opposing extension. International partners remain focused on Ukraine's survival rather than its peacetime legalism. The only plausible reversal—a peace deal or war-ending ceasefire—is not credibly forecasted to occur before November 5. Thus, the probability that Ukraine will extend martial law beyond November 5, 2025, remains extremely high.",
            "final_probability": 95
        },
        "Political Science (Democratic Resilience Theory)": {
            "time_to_resolution": "Approximately 3 weeks (as of 2025-10-15, martial law is due to expire on 2025-11-05)",
            "perspective_relevance": "As a specialist in Democratic Resilience Theory, my expertise lies in understanding how democracies respond to existential threats, the conditions under which emergency powers are extended, and the risk factors for democratic backsliding or resilience. I can analyze Ukraine’s ongoing use of martial law in the context of war, public opinion, elite dynamics, and international pressures, focusing on the interplay between security needs and democratic norms.",
            "status_quo": "Martial law has been continuously extended for 90-day periods since February 2022. The status quo expectation, if nothing changes, is another extension, as the war with Russia remains unresolved and the government has repeatedly justified extensions on national security grounds.",
            "perspective_derived_factors": [
                {
                    "factor": "Ongoing war and security threat",
                    "effect": "Strongly increases probability. As long as active hostilities with Russia continue and the situation remains volatile, the government has a legitimate rationale (domestically and internationally) to maintain martial law."
                },
                {
                    "factor": "Elite consensus and parliamentary dynamics",
                    "effect": "Moderately increases probability. Historically, the Rada has supported martial law extensions. Recent news suggests some fracturing (e.g., MP Anna Skorohod withdrawing support), but there is no evidence of a parliamentary revolt that would block extension."
                },
                {
                    "factor": "Public opinion and legitimacy",
                    "effect": "Mildly increases probability. While there is growing criticism of Zelenskyy and a majority want him to step down postwar, only 11% currently support holding elections before the war ends. Martial law thus still has public toleration or acquiescence."
                },
                {
                    "factor": "International pressure and Western support",
                    "effect": "Neutral to slightly increases probability. While Western partners value democratic norms, there is no sign of major pressure to end martial law while the war continues. Aid and support remain contingent on Ukraine maintaining stability and resisting Russian aggression."
                },
                {
                    "factor": "War trajectory and peace negotiations",
                    "effect": "Slightly decreases probability, but only if there is a sudden breakthrough. Currently, the front is at a stalemate, and negotiations are not imminent; thus, this factor does not meaningfully change the base rate."
                },
                {
                    "factor": "Democratic resilience and risk of backsliding",
                    "effect": "Slightly decreases probability over the long term, but in the short term (by November 2025), the imperative for survival and regime continuity outweighs immediate democratic restoration."
                }
            ],
            "no_scenario": "A Yes outcome is avoided if, in the next three weeks, a sudden ceasefire or peace agreement is reached (highly unlikely given stalemate and ongoing hostilities), or if there is a dramatic change in elite or parliamentary alignment (e.g., mass defection in the Rada) and/or a groundswell of public protest that makes extending martial law politically untenable.",
            "yes_scenario": "The government, citing ongoing Russian aggression and unresolved security threats, submits its regular bill to extend martial law. The Rada, despite some dissenting voices, again passes the extension. Elections remain suspended, and martial law continues beyond November 5, 2025.",
            "final_reasoning": "The overwhelming evidence from both historical precedent (16 prior extensions), the current stalemate in the war, public opinion (reluctance to demand elections before war's end), and the lack of decisive elite or international opposition points toward extension. The default in high-threat environments is for emergency measures to persist, especially when the existential threat is ongoing. Even with some parliamentary dissent and growing public frustration, there is not yet sufficient pressure or alternative security guarantee to prompt a return to normal constitutional order. The war is the decisive structural factor, and the base rate for extension under these conditions is very high.",
            "final_probability": 95
        },
        "Political Science (Civil-Military Relations)": {
            "time_to_resolution": "Approximately 3 weeks (question resolves on November 5, 2025; today is October 15, 2025)",
            "perspective_relevance": "As a political scientist specializing in civil-military relations, my expertise is directly relevant because martial law is fundamentally a civil-military institution. Its extension or termination is influenced by the military situation, elite cohesion, public opinion, and the executive’s calculations about legitimacy, regime stability, and international support. Understanding the dynamics between the military, political leadership, and society is crucial for assessing the likelihood of martial law being extended.",
            "status_quo": "Since February 2022, Ukraine has continuously extended martial law in 90-day increments, always with the justification of ongoing Russian aggression. The status quo is that martial law is extended as long as the war is unresolved and significant hostilities continue.",
            "perspective_derived_factors": [
                {
                    "factor": "Ongoing Hostilities and Stalemate",
                    "effect": "Increases probability. The war remains active, with no ceasefire or peace agreement in sight. As long as active fighting continues and territorial integrity is threatened, the government has a strong incentive and plausible justification to maintain martial law."
                },
                {
                    "factor": "Elite and Parliamentary Dynamics",
                    "effect": "Slightly decreases probability. There is emerging dissent within parliament (e.g., MP Anna Skorohod and others expressing opposition to further extensions), but so far, opposition is not strong or organized enough to block extensions given the executive’s dominance and wartime framing."
                },
                {
                    "factor": "Public Opinion and Legitimacy",
                    "effect": "Maintains or increases probability. Despite growing criticism and desire for Zelenskyy to step down after the war, only a small minority (11%) support elections before the war ends. Martial law is not seriously contested by the public given the ongoing conflict."
                },
                {
                    "factor": "International Pressure and Legitimacy",
                    "effect": "Neutral or slightly decreases probability. Western partners express concern about democratic backsliding, but have not made martial law extension a red line. Russia attempts to delegitimize Zelenskyy by pointing to the lack of elections, but this has little practical effect on internal Ukrainian decisions as long as the West continues support."
                },
                {
                    "factor": "Executive Incentives and Authoritarian Drift",
                    "effect": "Increases probability. The executive benefits from the continuation of martial law, which suspends elections, consolidates control, and allows for rapid decision-making and military mobilization. Accusations of authoritarian drift exist but are not currently sufficient to force a change."
                },
                {
                    "factor": "Civil-Military Relations and Security Environment",
                    "effect": "Strongly increases probability. As long as the military situation is unresolved and the threat environment is high, the military and security services will support the continuation of martial law as a necessity."
                }
            ],
            "no_scenario": "A rapid breakthrough in peace negotiations leads to a formal ceasefire or armistice before November 5, 2025, possibly under strong international pressure or due to a sudden shift in the battlefield. As a result, the executive faces overwhelming parliamentary or public pressure to end martial law, and the Verkhovna Rada blocks or refuses to extend it. Alternatively, an acute legitimacy crisis or elite split occurs, making extension politically impossible.",
            "yes_scenario": "The war remains unresolved, with no new ceasefire or peace agreement reached. The security situation is dangerous, and the government argues that extension is essential. Parliamentary dissent is contained or ignored, and the Verkhovna Rada passes the extension as it has 16 times before, perhaps with a slightly narrower margin or more vocal opposition, but not enough to block the measure.",
            "final_reasoning": "Base rates for martial law extension in Ukraine during the war (16/16 times) are extremely high. The security situation remains perilous, with no peace deal, ceasefire, or major battlefield change. Public opinion is not demanding elections or the lifting of martial law, and elite dissent is present but not decisive. The executive and military retain both the incentive and capacity to extend martial law. There are no signs of imminent international or domestic developments that would force a break from the status quo. Therefore, the likelihood of extension is extremely high, barring a wholly unanticipated breakthrough.",
            "final_probability": 96
        },
        "International Relations (Security Dilemma)": {
            "time_to_resolution": "About 3 weeks (question resolves November 5, 2025; today is October 15, 2025)",
            "perspective_relevance": "As an expert in International Relations specializing in the Security Dilemma, my perspective is uniquely suited to analyze the interplay of external threats (primarily from Russia), domestic political dynamics, regime security, and institutional path dependency in the context of Ukraine’s martial law. The security dilemma literature highlights how states under existential threat adopt extraordinary domestic measures—often persisting beyond strictly military necessity—to safeguard regime survival and deter adversaries.",
            "status_quo": "Martial law has been extended repeatedly (16 times) since the Russian invasion began. The current practice is 90-day renewals, and martial law is scheduled to expire November 5, 2025. No credible signals indicate a sudden shift toward peace or demobilization.",
            "perspective_derived_factors": [
                {
                    "factor": "External Security Threat",
                    "effect": "Strongly increases probability. The war with Russia is ongoing, with no active peace process and both sides preparing for protracted conflict. Martial law is justified as long as the existential threat persists."
                },
                {
                    "factor": "Domestic Political Legitimacy & Regime Survival",
                    "effect": "Moderately increases probability. Zelenskyy’s legitimacy is grounded in wartime leadership, but his formal mandate has expired and elections have been suspended under martial law. Ending martial law would trigger elections, potentially destabilizing the regime when unity is needed and risking internal contestation."
                },
                {
                    "factor": "Public Sentiment & Social Endurance",
                    "effect": "Slightly increases probability. While polls show the public wants Zelenskyy to leave after the war, only 11% favor elections before the war ends. Martial law is broadly tolerated as necessary during ongoing hostilities, despite grumbling about authoritarian drift."
                },
                {
                    "factor": "Institutional and International Pressures",
                    "effect": "Marginally decreases probability. Western partners (EU/NATO) occasionally warn about democratic backsliding, but their priority remains Ukraine’s survival. Some MPs and civil society actors are voicing dissent, but there is no significant movement to end martial law imminently."
                },
                {
                    "factor": "Conflict Stalemate and Absence of Peace Process",
                    "effect": "Strongly increases probability. The front remains static, negotiations are stalled, and both sides are engaging in attritional strategies. No diplomatic breakthrough is on the horizon before November 5."
                },
                {
                    "factor": "Base Rate/Historical Inertia",
                    "effect": "Strongly increases probability. Martial law has never been allowed to lapse during this war. There is a strong path dependency toward renewal barring a dramatic change."
                }
            ],
            "no_scenario": "A sudden, credible ceasefire or peace agreement is reached before November 5, with security guarantees sufficient to convince Ukrainian leadership that the existential threat has abated. Western partners pressure Kyiv to restore democratic processes, and the Ukrainian parliament declines to approve an extension, forcing martial law to lapse and triggering elections.",
            "yes_scenario": "The war with Russia continues with no diplomatic breakthrough. Parliament, under pressure from the executive and given the ongoing threat, votes for a 17th extension, maintaining martial law past November 5. Elections remain suspended, and the government justifies the decision by citing continued hostilities, security needs, and public reluctance to hold elections during war.",
            "final_reasoning": "The status quo is extremely sticky. The war is ongoing, with neither side prepared for peace talks or a ceasefire in the immediate future. There is no indication of a breakthrough that would justify ending martial law. The Ukrainian public, while critical of Zelenskyy’s long tenure, still overwhelmingly supports postponing elections until the war ends. Historically, martial law has always been extended without interruption. Some MPs are voicing opposition, but there is not enough momentum—nor is there sufficient external pressure from Ukraine's Western allies—to force a change. From a security dilemma perspective, so long as Ukraine faces an existential military threat, the state will err on the side of maintaining exceptional measures, including martial law, to ensure regime and national survival. The base rate of extension is 100% for the past 16 periods. The only plausible path to a 'No' outcome would be a dramatic and unlikely diplomatic breakthrough, or a sudden collapse in regime legitimacy or parliamentary support, neither of which are credibly signaled in the news. Thus, the probability of extension is extremely high.",
            "final_probability": 97
        },
        "International Relations (International Conflict Theory)": {
            "time_to_resolution": "Approximately 3 weeks (question resolves November 5, 2025; today is October 15, 2025).",
            "perspective_relevance": "As an expert in International Relations and International Conflict Theory, I am able to analyze both the structural (systemic) incentives and domestic political dynamics that drive states to maintain emergency measures during protracted conflicts. This includes the interplay between ongoing war, elite incentives, legitimacy, and the risks of regime instability or collapse.",
            "status_quo": "Martial law has been continuously extended in Ukraine for 16 consecutive periods since February 2022. The war remains unresolved; no ceasefire or peace agreement is in place. Elections remain postponed, and government legitimacy is maintained mainly via the ongoing existential threat posed by Russian aggression.",
            "perspective_derived_factors": [
                {
                    "factor": "Ongoing War and Security Imperative",
                    "effect": "Strongly increases the probability of extension. As long as Russia continues military operations, the Ukrainian leadership has a strong rationale—both domestically and internationally—to maintain martial law for national security and mobilization."
                },
                {
                    "factor": "Domestic Political Incentives and Elite Survival",
                    "effect": "Increases the probability. Zelenskyy and the current elite benefit from the suspension of elections and the consolidation of power under martial law. There is little incentive for them to risk a transition in wartime."
                },
                {
                    "factor": "Public Opinion and Legitimacy",
                    "effect": "Moderately increases the probability. Despite some erosion of support, surveys show that only 11% of Ukrainians want elections before the war ends, and Zelenskyy maintains a 60% approval rating. The population largely accepts martial law as necessary while existential threat persists."
                },
                {
                    "factor": "Stalemated Conflict and Absence of Peace Process",
                    "effect": "Strongly increases the probability. No ceasefire or peace deal is imminent; the war is described as entering a phase of strategic exhaustion with no clear path to resolution. Both sides remain committed to their positions."
                },
                {
                    "factor": "International Pressure and Western Support",
                    "effect": "Slightly decreases the probability. Western partners, especially the EU, occasionally voice concerns about democratic backsliding, but these concerns are outweighed by the overriding security context. No major Western actor is pressing Ukraine to lift martial law before the war ends."
                },
                {
                    "factor": "Elite and Parliamentary Discontent",
                    "effect": "Slightly decreases the probability. Some MPs and political rivals accuse Zelenskyy of authoritarianism and publicly oppose further extensions. However, such opposition remains a minority and is unlikely to block extension while the war continues."
                },
                {
                    "factor": "Socioeconomic Strain and Mobilization Fatigue",
                    "effect": "Slightly decreases the probability. Problems with desertion, economic hardship, and mobilization fatigue may eventually erode support for martial law, but not enough in the short term to prevent extension."
                }
            ],
            "no_scenario": "A 'No' outcome (martial law not extended) would require a sudden breakthrough in peace negotiations leading to a ceasefire or settlement before November 5, 2025, or a major political crisis—such as mass elite defection or widespread civil resistance—forcing the government to lift martial law. Neither scenario is supported by current evidence.",
            "yes_scenario": "A 'Yes' outcome (martial law extended) occurs if the current pattern continues: the war remains unresolved, no ceasefire is reached, and the Ukrainian parliament (likely under strong executive pressure and/or public acquiescence) votes to extend martial law for another 90 days or more.",
            "final_reasoning": "The base rate is extremely high: since February 2022, martial law has been extended every time it was due to expire. The war is ongoing, with both military and diplomatic stalemate, and no evidence of imminent peace. Domestic support for elections in wartime is low, and Zelenskyy’s legitimacy—though not unchallenged—remains solid enough for him to extend emergency powers. Parliamentary and societal opposition exists but is insufficient to outweigh elite and security imperatives. Unless there is a sudden, dramatic change in the war or political crisis, the rational choice for the Ukrainian leadership is to extend martial law. Therefore, the probability of extension is extremely high, although not quite 100% due to the inherent unpredictability of war and politics.",
            "final_probability": 95
        },
        "Slavic and East European Studies (Post Soviet State Transformation)": {
            "time_to_resolution": "Approximately 21 days (until November 5, 2025)",
            "perspective_relevance": "As an expert in Slavic and East European Studies, especially post-Soviet state transformation, I bring knowledge of the political, institutional, and social dynamics under martial law in Ukraine, the political culture of wartime states in the region, and the historical patterns of emergency rule in post-Soviet contexts. I also have a nuanced grasp of how legitimacy, war outcomes, and elite competition interact with external pressures and domestic opinion, particularly in Ukraine’s ongoing struggle for democratic resilience amid existential threat.",
            "status_quo": "Martial law is in force and has been extended 16 times, with the government showing no sign of readiness to lift it amid a protracted war and stalemate. The default is extension unless a major change occurs.",
            "perspective_derived_factors": [
                {
                    "factor": "Military Stalemate and Security Threat",
                    "effect": "Strongly increases probability. The war with Russia is ongoing, the frontlines are static, and no ceasefire or peace agreement is imminent. In post-Soviet Eurasia, martial law is rarely lifted until a security threat abates."
                },
                {
                    "factor": "Political Incentives for Incumbents",
                    "effect": "Increases probability. Zelenskyy and his government benefit from martial law, avoiding elections in a context where legitimacy is eroding but not yet collapsed. Elite incentives align with status quo extension."
                },
                {
                    "factor": "Parliamentary and Public Attitudes",
                    "effect": "Slightly increases probability. While some MPs now oppose further extension, the majority still supports martial law as long as active fighting continues. Public opinion largely opposes elections until the end of war."
                },
                {
                    "factor": "International Pressure and Legitimacy Concerns",
                    "effect": "Slightly decreases probability. Western partners are increasingly concerned about democratic backsliding and authoritarian tendencies, but as long as existential war continues, most tolerate martial law."
                },
                {
                    "factor": "Potential for Negotiated Settlement or Ceasefire",
                    "effect": "Decreases probability if a major breakthrough occurs before November 5, but current evidence is that negotiations are stalled and both sides expect a war of attrition."
                },
                {
                    "factor": "Historical Base Rate of Emergency Rule in Wartime Ukraine and Post-Soviet States",
                    "effect": "Strongly increases probability. The base rate for ending martial law before the end of an existential war is exceedingly low in the region."
                }
            ],
            "no_scenario": "A sudden and unexpected ceasefire or peace deal is brokered between Russia and Ukraine before November 5, 2025, leading to a rapid de-escalation of hostilities and the Ukrainian government judging it safe (and politically necessary under Western and domestic pressure) to let martial law expire. Alternatively, a major political crisis or collapse of executive authority forces parliament to end martial law to restore legitimacy.",
            "yes_scenario": "The war remains at a strategic stalemate, with periodic escalations and no significant progress toward peace or ceasefire. The Ukrainian government, citing ongoing hostilities and security concerns, requests and receives another extension of martial law from parliament, maintaining the current regime of emergency powers.",
            "final_reasoning": "The overwhelming evidence points to the continuation of martial law beyond November 5, 2025. The status quo is deeply entrenched due to the ongoing war, which shows no signs of resolution or ceasefire in the short term. Both elite and public opinion—while showing some fatigue and criticism—still largely accept the necessity of martial law under the circumstances. The historical base rate for ending martial law before a cessation of hostilities in Ukraine or similar post-Soviet states is extremely low. There are emerging cracks in elite consensus and some international concern, but not enough to outweigh the perceived security imperatives. Unless there is an unforeseen negotiating breakthrough or collapse of military hostilities in the next three weeks, Ukraine will extend martial law again. Therefore, the probability is very high, but not absolute due to the (low) possibility of a rapid diplomatic breakthrough or internal crisis.",
            "final_probability": 93
        }
    },
    "deliberation_probability": [
        97,
        97,
        95,
        95,
        96,
        97,
        95,
        93
    ],
    "deliberation_mean_probability": 95.625,
    "deliberation_sd": 1.407885953173359,
    "deliberation_probability_result": 96,
    "group_results": {
        "militaryStrategyDoctrineOfNationalEmergency": {
            "forecaster_to_engage": "Slavic and East European Studies (Post Soviet State Transformation)",
            "response_type": "defense",
            "response": "This forecaster appropriately highlights an important historical contextual factor: in the post-Soviet space, emergency measures such as martial law are rarely lifted prior to the cessation of hostilities, even when there is mounting public fatigue or elite dissent. Their nuanced discussion of 'emerging cracks in elite consensus' and 'some international concern, but not enough' reflects a realistic assessment of the situation—acknowledging these pressures but correctly weighting them against the overwhelming inertia produced by ongoing war and security imperatives. This mirrors patterns seen in other post-Soviet states, where fears of regime instability and existential threats typically override moves toward rapid normalization. Their slightly lower probability (93%) reflects a prudent appreciation for the inherent unpredictability of war, but does not undermine the core logic that the base rate and structural incentives overwhelmingly favor extension. Thus, their forecast is well-grounded and aligns closely with empirical and doctrinal expectations."
        },
        "comparativeLawMartialLawLegalStandards": {
            "forecaster_to_engage": "International Relations (Security Dilemma)",
            "response_type": "critique",
            "response": "While the security dilemma framework powerfully explains the persistence of martial law under existential threat, this forecaster's reasoning could benefit from greater engagement with the internal legal-political dynamics specific to Ukraine. In particular, the forecast somewhat underplays the mounting parliamentary dissent and the risk—however small—of a legitimacy crisis or procedural deadlock within the Rada, which, unlike in some more autocratic security dilemma cases, could at least theoretically disrupt the routine extension process. Additionally, the argument presumes that international partners will remain passive, but does not fully consider the potential for last-minute leverage (such as aid conditionality) as Ukraine's Western partners become more sensitive to democratic backsliding. These are low-probability but non-negligible risks that temper a strictly structuralist account, and could have been more explicitly weighed in setting the probability."
        },
        "regionalSecurityAnalysisBlackSeaRegionalSecurity": {
            "forecaster_to_engage": "Political Science (Civil-Military Relations)",
            "response_type": "defense",
            "response": "This forecast demonstrates a clear understanding of how civil-military relations shape the persistence of martial law in Ukraine. The forecaster correctly emphasizes the executive's incentive and capacity to extend martial law, noting that elite dissent is present but not decisive—a critical distinction in the Ukrainian context where the executive branch and military maintain strong institutional control. They also accurately recognize that the base rate (16/16 extensions) is a powerful structural factor. Importantly, they do not overlook public opinion, observing that there is no widespread demand for elections or lifting of martial law, which further supports regime stability. Their reasoning is well-calibrated for the regional context, and their probability (96) reflects appropriately the very high likelihood of extension without claiming absolute certainty."
        },
        "politicalScienceDemocraticResilienceTheory": {
            "forecaster_to_engage": "Comparative Law (Martial Law Legal Standards)",
            "response_type": "defense",
            "response": "This forecast is particularly strong in its use of comparative legal standards to contextualize Ukraine's behavior. It rightly identifies path dependence as a key factor: once a democracy adopts emergency measures under existential threat, extensions become the default unless extraordinary factors intervene. The emphasis on the lack of imminent peace and relatively muted domestic resistance is accurate and aligns with public opinion data showing minimal support for elections during wartime. Furthermore, the forecaster is correct to note that the main risks to a 'Yes' outcome—an unforeseen peace deal or parliamentary revolt—are not credibly forecasted for the current window. The probability (97%) is well justified by both the legal and empirical record. This approach complements political science perspectives by foregrounding the legal-institutional constraints and precedents that make continuation of martial law overwhelmingly likely in the short term."
        },
        "politicalScienceCivilmilitaryRelations": {
            "forecaster_to_engage": "International Relations (International Conflict Theory)",
            "response_type": "critique",
            "response": "While your structural analysis of the ongoing war and associated incentives is strong, your forecast might slightly underweight the specific civil-military mechanisms at play in Ukraine. In cases of protracted conflict, the relationship between the executive, parliament, and the military is not purely rational-choice or driven by elite cohesion alone. The Ukrainian military’s operational requirements and the need for uninterrupted legal cover for mobilization reinforce the executive’s hand, but also create their own path dependencies within the security apparatus. Moreover, your forecast could more explicitly address the risks of cumulative fatigue among mid-level officials and MPs, some of whom now publicly dissent, which—while unlikely to alter the outcome this cycle—could foreshadow more significant institutional frictions in future extensions. Thus, while your high probability is justified, a fuller account would benefit from attention to these internal civil-military feedbacks, which might slightly increase tail risk."
        },
        "internationalRelationsSecurityDilemma": {
            "forecaster_to_engage": "Regional Security Analysis (Black Sea Regional Security)",
            "response_type": "defense",
            "response": "This forecast aptly recognizes the decisive influence of regional security dynamics and the structural inertia produced by ongoing conflict. The forecaster correctly identifies that the war’s stalemate, persistent external threat, and lack of international pressure for rapid democratization all reinforce the path-dependent extension of martial law. Their attention to the low but nonzero possibility of a reversal—such as a diplomatic breakthrough or sudden elite fragmentation—demonstrates prudent calibration. By explicitly acknowledging both societal fatigue and the lack of a critical mass in opposition, the analysis avoids both complacency and unwarranted alarmism. This balanced, regionally informed perspective robustly supports the very high probability assigned to extension."
        },
        "internationalRelationsInternationalConflictTheory": {
            "forecaster_to_engage": "Political Science (Democratic Resilience Theory)",
            "response_type": "defense",
            "response": "This forecaster's analysis is compelling in its incorporation of both historical precedent and structural factors that shape state behavior in existential crises. The emphasis on the default persistence of emergency measures under high threat aligns with International Conflict Theory, which recognizes that war conditions systematically privilege security and regime survival over procedural democratic practices. The forecast also rightly weighs the absence of decisive elite or international pressure for change, and accurately interprets public reluctance to resume elections as a legitimizing factor for ongoing martial law. By clearly identifying the war as the 'decisive structural factor,' the reasoning avoids overemphasizing transient dissent or fatigue, providing a sound and empirically grounded base for the very high probability given. This approach complements IR conflict theory by foregrounding the interplay between threat environment and democratic resilience."
        },
        "slavicAndEastEuropeanStudiesPostSovietStateTransformation": {
            "forecaster_to_engage": "Comparative Law (Martial Law Legal Standards)",
            "response_type": "defense",
            "response": "This forecast stands out for its attention to legal-institutional inertia and the comparative perspective on emergency powers. It correctly emphasizes path dependence: once martial law has been repeatedly extended in the context of ongoing existential threat, the legal and political machinery becomes accustomed to routine renewal. The analysis accurately notes the relative weakness of domestic resistance and the lack of any credible signals of a parliamentary revolt or imminent peace, which are the only plausible legal grounds for not extending martial law. By situating Ukraine's actions within broader comparative legal standards, the forecast provides a valuable cross-national anchor and avoids overemphasizing Ukraine's unique features to the exclusion of the general pattern observed in wartime democracies. The high probability (97%) is justified, and the scenario construction is realistic given the available evidence."
        }
    },
    "revision_results": {
        "Military Strategy (Doctrine of National Emergency)": {
            "my_phase1_final_probability": 97,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, particularly the defense of the Slavic and East European Studies perspective, my confidence in the original assessment is reinforced. The consensus across all expert perspectives is that the base rate for martial law extension in Ukraine during wartime is extremely high, with no credible signals of an imminent peace, ceasefire, or political crisis that would interrupt the pattern of repeated extensions. The slightly lower probability (93%) presented by the Slavic and East European Studies expert prudently acknowledges the low-probability, high-impact possibility of a sudden diplomatic breakthrough or unexpected internal upheaval, but this does not outweigh the overwhelming evidence supporting extension. All relevant factors—military, legal, political, public opinion, and comparative historical precedent—continue to point toward extension as the status quo outcome. Therefore, I see no reason to revise my probability.",
            "revised_probability": 97
        },
        "Comparative Law (Martial Law Legal Standards)": {
            "my_phase1_final_probability": 97,
            "reasoning_for_revised_probability": "The group deliberation reinforced my initial assessment that the probability of Ukraine extending martial law beyond November 5, 2025, is extremely high. The Military Strategy and International Relations perspectives both emphasize the overwhelming base rate and the absence of credible paths to a No outcome within the short timeframe. However, the critique of the Security Dilemma forecast highlighted a small but real possibility of parliamentary or international disruption. While I already incorporated these as low-probability risks, the consensus among forecasters is that such scenarios remain remote. The defense of the Slavic and East European Studies perspective also underscores that, in this regional context, security concerns nearly always override steps toward normalization. Therefore, my confidence in the initial probability is validated, and I see no compelling reason to revise it.",
            "revised_probability": 97
        },
        "Regional Security Analysis (Black Sea Regional Security)": {
            "my_phase1_final_probability": 95,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, including the strong consensus among forecasters from diverse fields (military strategy, law, civil-military relations, international relations, and regional studies) all citing extremely high base rates and overwhelmingly sticky status quo, I see no new information that would warrant a meaningful downward or upward revision. The critiques did raise the possibility of low-probability risks such as parliamentary deadlock or last-minute Western leverage, but these remain speculative and not credibly signaled in current news or political developments. The overwhelming evidence and structural incentives for extension remain. Therefore, I maintain my initial forecast.",
            "revised_probability": 95
        },
        "Political Science (Democratic Resilience Theory)": {
            "my_phase1_final_probability": 95,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, my initial assessment is strongly reinforced. All domain experts—across military strategy, legal standards, civil-military relations, international relations, and regional studies—converge on the overwhelming likelihood of martial law extension, citing the unbroken pattern of prior renewals, the ongoing existential threat from Russia, stable (if somewhat eroding) public and elite tolerance, and the absence of credible signals of imminent peace or parliamentary revolt. The few dissenting points (elite fatigue, minor parliamentary dissent, theoretical Western pressure) are consistently deemed insufficient to offset the status quo bias. Notably, no forecaster argued for a substantially lower probability or offered evidence of a pending breakthrough that would disrupt the established pattern. Therefore, I see no compelling reason to adjust my probability upward or downward. The original estimate appropriately reflects a very high likelihood while acknowledging the slim tail risk of an unexpected event.",
            "revised_probability": 95
        },
        "Political Science (Civil-Military Relations)": {
            "my_phase1_final_probability": 96,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I found broad consensus among forecasters from different disciplines that the probability of Ukraine extending martial law is extremely high, with most estimates clustering between 93 and 97. No forecaster articulated a plausible scenario for a 'No' outcome within the three-week window, and the structural, legal, and civil-military arguments for extension remain overwhelming. Critiques highlighted minor risks (such as parliamentary dissent, legitimacy fatigue, and potential international leverage), but these are acknowledged as low-probability tail risks and do not materially affect the base rate for this cycle. Given this, and in the absence of new, concrete signals of an imminent peace deal or elite rupture, I see no compelling reason to revise my probability. If anything, the convergence of expert opinion reinforces the robustness of my initial estimate.",
            "revised_probability": 96
        },
        "International Relations (Security Dilemma)": {
            "my_phase1_final_probability": 97,
            "reasoning_for_revised_probability": "After reviewing the group deliberations, there is strong consensus across disciplinary perspectives that the probability of extension is extremely high, with nearly all forecasters clustering between 93 and 97. The critiques and defenses surfaced no new concrete evidence of imminent change, and the additional points raised—such as minor parliamentary dissent, legal standards, civil-military feedbacks, and historical patterns in the post-Soviet region—are already captured in the original analysis or only marginally increase tail risks. No forecaster identified a credible, immediate mechanism for a 'No' outcome within three weeks. Thus, I see no compelling reason to adjust my initial probability, which remains well-calibrated given the available evidence and consensus.",
            "revised_probability": 97
        },
        "International Relations (International Conflict Theory)": {
            "my_phase1_final_probability": 95,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, there is a strong consensus among experts from multiple disciplines that the probability of Ukraine extending martial law is extremely high, with most probabilities ranging from 93 to 97. The additional perspectives—especially those from Comparative Law, Military Strategy, and Civil-Military Relations—reinforce the dominance of structural, legal, and institutional factors in favor of extension. The critiques and defenses exchanged highlight minor tail risks (such as parliamentary dissent or international pressure), but all agree these are low-probability events for this extension cycle. No new evidence emerged to suggest a sudden peace or major political crisis is likely before November 5, 2025. Thus, my initial probability of 95 remains well-calibrated and justified.",
            "revised_probability": 95
        },
        "Slavic and East European Studies (Post Soviet State Transformation)": {
            "my_phase1_final_probability": 93,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I find broad consensus for an extremely high likelihood of martial law extension, with most peers assigning probabilities of 95-97%. The strongest arguments reinforce the base rate logic, structural security imperatives, and the weakness of elite and public opposition at this juncture. Critiques of the extreme high end (near 100%) probabilities cite only low-probability tail risks—sudden elite revolt or unforeseen breakthrough in peace talks—that remain unsubstantiated by current evidence. My original probability (93%) already accounts for these minimal risks and reflects both the post-Soviet context and unpredictability of wartime politics. While the deliberation strengthens the case for an even higher probability, I do not see compelling new evidence to justify moving to 95% or higher, which would imply almost total certainty. I therefore maintain my forecast at 93%.",
            "revised_probability": 93
        }
    },
    "revision_probability": [
        97,
        97,
        95,
        95,
        96,
        97,
        95,
        93
    ],
    "revision_mean_probability": 95.625,
    "revision_sd": 1.407885953173359,
    "revision_probability_result": 96,
    "question_details": {
        "id": 39837,
        "title": "Will Ukraine extend martial law beyond November 5, 2025?",
        "created_at": "2025-10-08T17:48:42.243010Z",
        "open_time": "2025-10-13T15:30:00Z",
        "cp_reveal_time": "2025-10-13T17:00:00Z",
        "spot_scoring_time": "2025-10-13T17:00:00Z",
        "scheduled_resolve_time": "2025-11-05T22:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-10-13T17:00:00Z",
        "actual_close_time": "2025-10-13T17:00:00Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "President Volodymyr Zelenskyy declared [martial law](https://en.wikipedia.org/wiki/Martial_law_in_Ukraine#2022_martial_law) in Ukraine on February 24, 2022, in response to the Russian invasion of Ukraine that began earlier that day. As the [ensuing war](https://en.wikipedia.org/wiki/Russo-Ukrainian_war_\\(2022%E2%80%93present\\)) has dragged on, the government has extended martial law [16 times](https://newsukraine.rbc.ua/news/ukraine-prolongs-martial-law-mobilization-1752577500.html). (At first, each declaration of martial law was good for thirty days, but since May 2022, martial law has been extended for 90-day periods.)\n\nOne consequence of this lengthy period of martial law is that national elections, which would have occurred [in 2023](https://en.wikipedia.org/wiki/Next_Ukrainian_parliamentary_election), have been postponed indefinitely. Nevertheless, [some observers](https://www.saisjournal.eu/article/98-George-Kent-War-and-Democracy.cfm) argue that the rule of law in Ukraine remains strong.\n\nThe current period of martial law is scheduled to expire on [November 5, 2025](https://newsukraine.rbc.ua/news/zelenskyy-signs-extension-of-martial-law-1753442234.html), unless the government again renews it.\n\n`{\"format\":\"metac_reveal_and_close_in_period\",\"info\":{\"post_id\":40227,\"question_id\":39761}}`",
        "resolution_criteria": "This question will resolve as Yes if Ukraine extends martial law beyond November 5, 2025.",
        "fine_print": "",
        "post_id": 40285,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Half of Ukrainians Say Zelenskyy Should Step Down After War Ends**\nA survey by the Kyiv International Institute of Sociology (KIIS) revealed that 36% of Ukrainians believe President Volodymyr Zelenskyy should leave politics and 15% believe he should face prosecution after the end of the war with Russia, totaling 51% who support his departure or legal consequences. Only 41% believe he should remain in politics, with just 25% supporting him holding a top leadership position. Additionally, 69% of respondents said former President Petro Poroshenko, a political rival, should also leave politics or face prosecution. The study concludes that 45% of respondents want both Zelenskyy and Poroshenko to exit politics after the war. Despite the criticism, Zelenskyy maintains 60% public trust, a significant rise from 37% before the war in February 2022, when it surged to 90% in May 2022 and has remained around 60% since. The institute notes that while there is criticism regarding the lack of pre-war elections and the extension of Zelenskyy’s term under martial law, he still holds sufficient public legitimacy. Russia has cited the legality of Zelenskyy’s extended term as a barrier to peace negotiations. Only 11% of respondents believe a presidential election should be held before the war ends.\nOriginal language: ko\nPublish date: October 13, 2025 10:58 AM\nSource:[KBS](https://news.kbs.co.kr/news/pc/view/view.do?ncd=8379436)\n\n**Half of Ukrainians Say Zelenskyy Should Step Down After War Ends | Yonhap News Agency**\nA survey by the Kyiv International Institute of Sociology (KIIS) revealed that half of Ukrainian citizens believe President Volodymyr Zelenskyy should either leave politics or face prosecution after the end of the war with Russia. According to the results, 36% of respondents said Zelenskyy should step down from politics, and 15% said he should be prosecuted. Only 41% believed he should remain in politics, with just 25% supporting his continued leadership in top positions. Additionally, 69% of respondents said former President Petro Poroshenko, a political rival of Zelenskyy, should also leave politics or be prosecuted. The research institute concluded that 45% of respondents want both Zelenskyy and Poroshenko to exit politics after the war. Zelenskyy, who was elected in 2019 and whose term ended in May 2023, has extended his rule under a state of emergency due to the ongoing war and has not held a presidential election. In January 2025, he approved sanctions against Poroshenko, including travel bans and asset freezes. Russia has criticized Zelenskyy’s extended term as a barrier to peace negotiations. However, only 11% of respondents supported holding a presidential election before a ceasefire. Despite this, Zelenskyy’s approval rating remains at 60%, having risen from 37% before the war in February 2022 to 90% in May 2022, and has stabilized around 60% since. The institute stated that, considering public trust and critical attitudes toward a pre-war election, Zelenskyy still maintains necessary legitimacy among the population.\nOriginal language: ko\nPublish date: October 13, 2025 10:27 AM\nSource:[연합뉴스](https://www.yna.co.kr/view/AKR20251013157600082)\n\n**Zelensky: 'It Would Be Madness'—Ukraine's President Doubts Russia Would Use Nuclear Weapons**\nUkrainian President Volodymyr Zelensky stated in an interview with Fox News that he does not believe Russia would use nuclear weapons, calling such an action 'madness' and a 'suicidal decision' that would require a new planet. He emphasized that it does not matter how large a country with nuclear weapons is, as starting a Third World War would be irrational. Zelensky also highlighted that there are 'very painful' consequences for the aggressor, urging international partners—including the United States, Europe, Canada, and Japan—to impose tariffs and sanctions on Russian energy carriers, maritime fleet, and banking system. He stressed that the U.S. should enforce comprehensive sanctions, especially on energy and banking sectors, to prevent Russia from circumventing existing restrictions. This comes amid reports that Russian leader Vladimir Putin announced in September 2025 his readiness to comply with the New START Treaty (SNW-III) after its expiration on February 5, 2026. The Institute for the Study of War (ISW) interprets this move as an attempt by Moscow to pressure the U.S. administration under Donald Trump to initiate arms control negotiations, aiming to foster U.S.-Russia rapprochement and gain concessions on Ukraine. On October 6, 2025, Trump described Putin’s proposal to voluntarily extend strategic arms limitations as 'a good idea.' The New START Treaty, signed in 2010 by Russia and the U.S., limits strategic offensive arms and their delivery systems, and has been extended previously, most recently in 2020.\nOriginal language: ru\nPublish date: October 13, 2025 07:14 AM\nSource:[Новое Время](https://nv.ua/ukraine/events/zelenskiy-ocenil-riski-primeneniya-rossiey-yadernogo-oruzhiya-50552057.html)\n\n**Latest SVO News: October 12, 2025 – Zelenskyy’s Diplomacy, Desertion Crisis, and Escalating Hardship**\nOn October 12, 2025, the article reports on developments in the ongoing Special Military Operation (SVO), highlighting several key points: Ukrainian 'procrastinated' leader Vladimir Zelenskyy spoke again with U.S. President Donald Trump, seeking support including Tomahawk missiles and promising to pressure China, though no concrete outcomes were reached. Former NATO Secretary General Jens Stoltenberg revealed in his memoirs that Zelenskyy surprised allies by publicly criticizing NATO’s lack of a clear Ukraine membership roadmap during the Vilnius summit, causing friction with U.S. officials, including President Biden, who reportedly called Zelenskyy 'a thorn in the side.' Ukrainian MP Mariana Bezuhla reported that 250,000 Ukrainian soldiers are listed as having deserted (SZZ), equaling the pre-war army size, attributing this to poor leadership, demoralization, and flawed training—claims opponents suggest may understate the true number, with some experts estimating up to 500,000 desertions. Zelenskyy is accused of obstructing peace talks to prolong conflict and retain power. Hungarian Prime Minister Viktor Orbán launched a campaign to collect signatures against EU military aggression, criticizing the 'Brussels military plan' and accusing the EU of launching a campaign against Hungary. In Ukraine, electricity blackouts led to a 30% surge in prices for backup power equipment, with officials condemning price speculation. Deputy MP Anna Skorohod announced she will no longer support extending martial law, arguing the government benefits from war and that peace talks would lead to elections, which Zelenskyy may not survive politically. Former Ukrainian General Romanenko claimed Patriot missile effectiveness dropped from 42% to 6%, citing improved Russian missile maneuverability. Danish Prime Minister Mette Frederiksen’s husband, Bo Tengberg, is producing a film on Zelenskyy, funded by state grants, raising concerns about bias. Ukrainian MP Roman Gorbenko falsely claimed Russia has blocked all male travel abroad, using this to justify a new mobilization narrative. A survey by ifo Institute found 47% of Ukrainian refugees would return if Ukraine restored 1991 borders and joined NATO and the EU; only 3% would return without NATO membership. The heating season is being delayed due to gas shortages, and bread shortages have emerged in Kyiv after Russian strikes. Ukrainian forces are evacuating civilians and government assets from the Slavyansk-Kramatorsk agglomeration.\nOriginal language: ru\nPublish date: October 12, 2025 12:00 AM\nSource:[kp.ru](https://www.kp.ru/daily/27728.5/5155422/)\n\n**Zelensky intent on imposing ‘authoritarianism’ – Ukrainian MP**\nOn October 10, 2025, Ukraine’s parliament passed a resolution to suspend local elections until the end of martial law, which has been in effect since 2022 due to the conflict with Russia. Oleg Sinyutka, a member of the European Solidarity faction led by former President Petro Poroshenko, criticized the move, claiming the government is deliberately ignoring alternatives and accused the leadership of pursuing 'authoritarianism.' He stated, 'Today’s government in Ukraine lives on the desire to establish authoritarianism,' and warned that continuing this path would jeopardize Ukraine’s prospects for European Union and NATO integration. The comments follow widespread criticism of President Volodymyr Zelensky’s failed attempt to undermine the independence of Ukraine’s two main anti-corruption agencies, which sparked backlash domestically and internationally, with critics labeling his actions as 'illegitimate' and indicative of authoritarian tendencies.\nOriginal language: en\nPublish date: October 10, 2025 06:32 AM\nSource:[rt.com](https://www.rt.com/russia/626169-zelensky-intent-imposing-authoritarianism/)\n\n**Half of Ukrainians Say Zelenskyy Should Step Down After War Ends**\nA survey by the Kyiv International Institute of Sociology (KIIS) revealed that 36% of Ukrainians believe President Volodymyr Zelenskyy should leave politics and 15% believe he should face prosecution after the end of the war with Russia, totaling 51% who support his departure or legal consequences. Only 41% believe he should remain in politics, with just 25% supporting him holding a top leadership position. Additionally, 69% of respondents said former President Petro Poroshenko, a political rival, should also leave politics or face prosecution. The study concludes that 45% of respondents want both Zelenskyy and Poroshenko to exit politics after the war. Despite the criticism, Zelenskyy maintains 60% public trust, a significant rise from 37% before the war in February 2022, when it surged to 90% in May 2022 and has remained around 60% since. The institute notes that while there is criticism regarding the lack of pre-war elections and the extension of Zelenskyy’s term under martial law, he still holds sufficient public legitimacy. Russia has cited the legality of Zelenskyy’s extended term as a barrier to peace negotiations. Only 11% of respondents believe a presidential election should be held before the war ends.\nOriginal language: ko\nPublish date: October 13, 2025 10:58 AM\nSource:[KBS](https://news.kbs.co.kr/news/pc/view/view.do?ncd=8379436)\n\n**Half of Ukrainians Say Zelenskyy Should Step Down After War Ends | Yonhap News Agency**\nA survey by the Kyiv International Institute of Sociology (KIIS) revealed that half of Ukrainian citizens believe President Volodymyr Zelenskyy should either leave politics or face prosecution after the end of the war with Russia. According to the results, 36% of respondents said Zelenskyy should step down from politics, and 15% said he should be prosecuted. Only 41% believed he should remain in politics, with just 25% supporting his continued leadership in top positions. Additionally, 69% of respondents said former President Petro Poroshenko, a political rival of Zelenskyy, should also leave politics or be prosecuted. The research institute concluded that 45% of respondents want both Zelenskyy and Poroshenko to exit politics after the war. Zelenskyy, who was elected in 2019 and whose term ended in May 2023, has extended his rule under a state of emergency due to the ongoing war and has not held a presidential election. In January 2025, he approved sanctions against Poroshenko, including travel bans and asset freezes. Russia has criticized Zelenskyy’s extended term as a barrier to peace negotiations. However, only 11% of respondents supported holding a presidential election before a ceasefire. Despite this, Zelenskyy’s approval rating remains at 60%, having risen from 37% before the war in February 2022 to 90% in May 2022, and has stabilized around 60% since. The institute stated that, considering public trust and critical attitudes toward a pre-war election, Zelenskyy still maintains necessary legitimacy among the population.\nOriginal language: ko\nPublish date: October 13, 2025 10:27 AM\nSource:[연합뉴스](https://www.yna.co.kr/view/AKR20251013157600082)\n\n**Zelensky: 'It Would Be Madness'—Ukraine's President Doubts Russia Would Use Nuclear Weapons**\nUkrainian President Volodymyr Zelensky stated in an interview with Fox News that he does not believe Russia would use nuclear weapons, calling such an action 'madness' and a 'suicidal decision' that would require a new planet. He emphasized that it does not matter how large a country with nuclear weapons is, as starting a Third World War would be irrational. Zelensky also highlighted that there are 'very painful' consequences for the aggressor, urging international partners—including the United States, Europe, Canada, and Japan—to impose tariffs and sanctions on Russian energy carriers, maritime fleet, and banking system. He stressed that the U.S. should enforce comprehensive sanctions, especially on energy and banking sectors, to prevent Russia from circumventing existing restrictions. This comes amid reports that Russian leader Vladimir Putin announced in September 2025 his readiness to comply with the New START Treaty (SNW-III) after its expiration on February 5, 2026. The Institute for the Study of War (ISW) interprets this move as an attempt by Moscow to pressure the U.S. administration under Donald Trump to initiate arms control negotiations, aiming to foster U.S.-Russia rapprochement and gain concessions on Ukraine. On October 6, 2025, Trump described Putin’s proposal to voluntarily extend strategic arms limitations as 'a good idea.' The New START Treaty, signed in 2010 by Russia and the U.S., limits strategic offensive arms and their delivery systems, and has been extended previously, most recently in 2020.\nOriginal language: ru\nPublish date: October 13, 2025 07:14 AM\nSource:[Новое Время](https://nv.ua/ukraine/events/zelenskiy-ocenil-riski-primeneniya-rossiey-yadernogo-oruzhiya-50552057.html)\n\n**'It would be madness.' Zelenskyy says he doesn't believe Russia would use nuclear weapons**\nPresident of Ukraine Volodymyr Zelenskyy stated in an interview with Fox News that he does not believe Russia would use nuclear weapons, calling such an action 'madness' and a 'crazy decision' that would lead to the destruction of the planet. He emphasized that the idea of starting a Third World War with nuclear weapons is unthinkable. Zelenskyy also urged international partners, including the United States, Europe, Canada, and Japan, to impose tariffs and sanctions on Russian energy resources, maritime fleet, and banking system to prevent Russia from circumventing existing sanctions. He stressed that the U.S. should impose comprehensive sanctions, especially on energy and banking sectors, to cut off Russia’s financial lifelines. The statement comes amid reports that Russian leader Vladimir Putin claimed in September 2025 that Russia is willing to abide by the New START Treaty (SALT-III) after February 5, 2026, when the treaty’s current term expires. The Institute for the Study of War (ISW) interprets this as a strategic move to pressure U.S. President Donald Trump’s administration into initiating arms control talks, aiming to weaken Western unity and gain concessions on Ukraine. On October 6, 2025, Trump described Putin’s proposal as 'a good idea.' The New START Treaty, signed in 2010 by Russia and the U.S., regulates strategic offensive arms, including strategic nuclear weapons and their delivery systems, and has been extended multiple times, most recently in 2020.\nOriginal language: uk\nPublish date: October 13, 2025 06:35 AM\nSource:[Новое Время](https://nv.ua/ukr/ukraine/events/zelenskiy-ociniv-riziki-zastosuvannya-rosiyeyu-yadernoji-zbroji-50552057.html)\n\n**Stalemate on Frontlines and Stalled Negotiations Signal Prolonged War in Ukraine**\nThe war in Ukraine remains at a stalemate on both military and political fronts, with Russia and Ukraine failing to achieve their objectives through military force alone. Efforts by the U.S. to mediate have not yielded results, following the initial momentum after the August 2024 summit between Russian President Vladimir Putin and U.S. President Donald Trump in Alaska. Analysts predict active combat will continue for several more months, as neither side is ready for negotiations. Russian President Putin acknowledged that Russia has captured only 4,900 square kilometers (about 1% of Ukraine’s total area of approximately 603,000 km²) since the start of 2025, a limited gain despite claims of strategic initiative. Meanwhile, increasing U.S. signals suggest potential delivery of Tomahawk cruise missiles to Ukraine, with Trump recently discussing the possibility with Ukrainian President Volodymyr Zelenskyy. Analyst Maxim Yalyi interprets this as Trump distancing himself from a diplomatic settlement, recognizing Ukraine and Europe’s refusal to accept Russian ceasefire terms. Russian expert Konstantin Blokhin confirms a strategic deadlock, predicting the war will become a protracted war of attrition with no clear end in sight. Both sides are resorting to unconventional tactics: Ukraine targets Russian oil refineries to disrupt funding and influence Russian public opinion, while Russia strikes Ukrainian energy infrastructure to plunge cities into darkness. Despite Putin’s stated goal of achieving all military objectives, internal Russian discourse reveals growing doubts about the necessity of enforcing Ukraine’s neutrality or preventing NATO membership. Expert Alexander Kolbin argues that Ukraine’s potential NATO membership no longer poses a significant threat to Russian security, given past Western-armed strikes on Russian territory. Meanwhile, speculation persists over a possible partial mobilization in Russia, though political considerations—especially the upcoming 2026 State Duma elections—may delay such a move. Russia has already passed laws facilitating year-round conscription and raising the draft age to 30, but these do not yet extend to contract soldiers. The conflict, according to experts, has entered a phase of strategic exhaustion, with both sides relying on attrition rather than decisive breakthroughs.\nOriginal language: ar\nPublish date: October 13, 2025 01:00 AM\nSource:[العربي الجديد](https://www.alaraby.co.uk/politics/%D8%AC%D9%85%D9%88%D8%AF-%D8%A7%D9%84%D8%AC%D8%A8%D9%87%D8%A7%D8%AA-%D9%88%D8%AA%D8%B9%D8%AB%D8%B1-%D8%A7%D9%84%D9%85%D9%81%D8%A7%D9%88%D8%B6%D8%A7%D8%AA-%D9%8A%D9%86%D8%B0%D8%B1%D8%A7%D9%86-%D8%A8%D8%A5%D8%B7%D8%A7%D9%84%D8%A9-%D8%AD%D8%B1%D8%A8-%D8%A3%D9%88%D9%83%D8%B1%D8%A7%D9%86%D9%8A%D8%A7)\n\n**Latest SVO News: October 12, 2025 – Zelenskyy’s Diplomacy, Desertion Crisis, and Escalating Hardship**\nOn October 12, 2025, the article reports on developments in the ongoing Special Military Operation (SVO), highlighting several key points: Ukrainian 'procrastinated' leader Vladimir Zelenskyy spoke again with U.S. President Donald Trump, seeking support including Tomahawk missiles and promising to pressure China, though no concrete outcomes were reached. Former NATO Secretary General Jens Stoltenberg revealed in his memoirs that Zelenskyy surprised allies by publicly criticizing NATO’s lack of a clear Ukraine membership roadmap during the Vilnius summit, causing friction with U.S. officials, including President Biden, who reportedly called Zelenskyy 'a thorn in the side.' Ukrainian MP Mariana Bezuhla reported that 250,000 Ukrainian soldiers are listed as having deserted (SZZ), equaling the pre-war army size, attributing this to poor leadership, demoralization, and flawed training—claims opponents suggest may understate the true number, with some experts estimating up to 500,000 desertions. Zelenskyy is accused of obstructing peace talks to prolong conflict and retain power. Hungarian Prime Minister Viktor Orbán launched a campaign to collect signatures against EU military aggression, criticizing the 'Brussels military plan' and accusing the EU of launching a campaign against Hungary. In Ukraine, electricity blackouts led to a 30% surge in prices for backup power equipment, with officials condemning price speculation. Deputy MP Anna Skorohod announced she will no longer support extending martial law, arguing the government benefits from war and that peace talks would lead to elections, which Zelenskyy may not survive politically. Former Ukrainian General Romanenko claimed Patriot missile effectiveness dropped from 42% to 6%, citing improved Russian missile maneuverability. Danish Prime Minister Mette Frederiksen’s husband, Bo Tengberg, is producing a film on Zelenskyy, funded by state grants, raising concerns about bias. Ukrainian MP Roman Gorbenko falsely claimed Russia has blocked all male travel abroad, using this to justify a new mobilization narrative. A survey by ifo Institute found 47% of Ukrainian refugees would return if Ukraine restored 1991 borders and joined NATO and the EU; only 3% would return without NATO membership. The heating season is being delayed due to gas shortages, and bread shortages have emerged in Kyiv after Russian strikes. Ukrainian forces are evacuating civilians and government assets from the Slavyansk-Kramatorsk agglomeration.\nOriginal language: ru\nPublish date: October 12, 2025 12:00 AM\nSource:[kp.ru](https://www.kp.ru/daily/27728.5/5155422/)\n\n**Ukraine President Entreats US Counterpart to Negotiate Peace in Ukraine**\nUkrainian President Volodymyr Zelenskyy called U.S. President Donald Trump on October 11, 2025, to urge him to pursue peace negotiations in Ukraine, following Trump’s successful mediation of a ceasefire in the Gaza Strip. Zelenskyy praised Trump’s achievement, stating, 'If a war can be stopped in one region, then surely other wars can be stopped as well – including the Russian war,' and emphasized the potential for strengthening Ukrainian air defense and the Ukraine-U.S. relationship. The call occurred amid ongoing U.S. efforts to end the war between Russia and Ukraine, which has been Europe’s worst conflict since WWII. These efforts peaked with a Trump-Putin summit in Alaska on August 15, 2025, followed by a White House meeting with Zelenskyy and European allies. Despite this, negotiations remain stalled due to sharply divergent positions. Recently, Trump has expressed growing frustration with Russian President Vladimir Putin, who has accused Europe of undermining peace efforts and prolonging the conflict. In early November 2025, a Ukrainian delegation led by Prime Minister Yulia Svyrydenko will travel to the U.S. to discuss additional sanctions on Moscow, energy cooperation, and enhanced air defense support.\nOriginal language: en\nPublish date: October 11, 2025 08:24 PM\nSource:[Qatar News Agency](https://qna.org.qa/en/news/news-details?id=ukraine-president-entreats-us-counterpart-to-negotiate-peace-in-ukraine&date=11%2F10%2F2025)\n\n**Day 1,326 of the War: Ukraine's Defense, Diplomacy, and Domestic Developments on October 11, 2025**\nOn October 11, 2025, the 1,326th day of the war, Ukrainian President Volodymyr Zelenskyy held a phone call with U.S. President Donald Trump, discussing Russian attacks on Ukraine’s energy infrastructure, potential cooperation on strengthening Ukraine’s air defense, and the possible transfer of Tomahawk missiles. According to Axios, the U.S. is considering this transfer, though no final decision has been confirmed. Ukrainian special operations forces conducted a long-range drone strike on the Bashnafta-UNPZ oil refinery in Ufa, Russia—1,400 km from Ukraine—causing fires at an oil processing unit. The UK delivered hundreds of air defense missiles to Ukraine five months ahead of schedule. Canadian Senator Sten Kutcher stated that lasting peace with Russia is only possible through Ukraine’s victory, citing historical precedent. On the front lines, 108 clashes occurred, with intensified Russian pressure on Pokrovsk and Olexandriya. Ukraine’s air defense intercepted 54 out of 78 drones launched by Russia between October 10 and 11. The Ukrainian military reported destroying three tanks, 13 armored vehicles, and 41 pieces of equipment on the Drobopilsky direction. The 30th Naval Infantry Corps destroyed four artillery systems targeting Kherson. Partisan agents from the 'ATESH' movement disrupted a Russian offensive near Vovchansk. Russian troop and equipment movements toward Berdyansk were observed. In a separate incident, Russian airstrikes killed at least two people and injured five in Kostiantynivka. Two energy workers were killed and three injured in a drone strike on a power company vehicle in Semenivka, Chernihiv Oblast. Russian aircraft dropped 125 bombs and three missiles on border regions of Russia and occupied Ukrainian territories since January 2025. President Zelenskyy signed legislation for medical compensation for soldiers released from captivity, imposed sanctions on Russian arms suppliers, awarded the Order of Saint Olga I degree to UAE’s Rym Al Hashimi, and synchronized Ukraine’s sanctions with Japan’s. The President’s Office and UAE’s minister discussed investments in Ukraine’s energy, infrastructure, and agriculture. Ukraine celebrates the Day of Logistics Specialists. Journalist Viktoriia Roshchina, killed in Russian captivity, was named a recipient of the 'World Press Freedom Hero' award. The government launched a national information system for coordinating evacuation and aid for people from temporarily occupied and frontline areas. Ukraine and the Netherlands signed a memorandum for joint deep-strike drone production in the Netherlands with €110 million in investment under the 'Build with Ukraine' initiative. Ukraine and the UK agreed to create a working group to coordinate projects under the LYRA defense technology partnership at the DFNC3 forum. On October 26, Ukraine will switch to winter time. The Cabinet of Ministers passed measures to simplify business operations, including automated inspections and expanded credit programs. Zakarpattia collected over 21 million UAH in tourism fees in the first nine months of 2025, a 40% increase from 2024. Internationally, Trump announced a 100% increase in U.S. tariffs on Chinese goods starting November 1 in response to China’s export restrictions on rare earth materials. Estonia closed the Saatse Boot border crossing due to increased Russian military activity. Poland reported a tripling of Russian cyberattacks on critical infrastructure this year. French President Emmanuel Macron reappointed Gabriel Attal as Prime Minister after consultations. Italian Prime Minister Giorgia Meloni and Spanish Prime Minister Pedro Sánchez will attend a Gaza-focused international summit in Egypt on October 13. A drone attack on a displacement camp in El Fasher, Sudan, killed at least 60 people, marking one of the deadliest attacks since the RSF siege began 18 months ago. Belarus began a military readiness drill involving multiple units. In Russia, a VAT increase from 20% to 22% and a lowered income threshold will raise prices on e-commerce platforms by 10% to 25%, potentially leading to a 20% reduction in delivery points by 2026. A Russian court extended the pre-trial detention of five members of the 'Third Jankoy Group' of Hizb ut-Tahrir until January 13.\nOriginal language: uk\nPublish date: October 11, 2025 04:40 PM\nSource:[УКРІНФОРМ](https://www.ukrinform.ua/rubric-ato/4046362-bitva-za-ukrainu-den-tisaca-trista-dvadcat-sostij.html)\n\n**'Incredible Achievement' by Trump: Zelensky Says Ukraine War Could End**\nUkrainian President Volodymyr Zelensky stated in a post on social media platform X (formerly Twitter) that his conversation with former U.S. President Donald Trump was 'positive and productive,' praising Trump's 'incredible achievement' in securing a Middle East agreement. Zelensky suggested that if a war can be halted in one region, others—including the war with Russia—can also end. He reported that Trump demonstrated willingness to support Kyiv, and they discussed strengthening Ukraine’s air defense and concrete agreements in progress, with 'solid ideas' on how to enhance security. Zelensky emphasized that true diplomacy from Russia is necessary, which may be achieved 'through force.' He concluded by thanking Trump. A Ukrainian delegation, including Prime Minister Ioulia Svyrydenko, is set to travel to the United States next week to discuss potential sanctions and defense matters. Russia invaded Ukraine on February 24, 2022, citing the need to protect pro-Russian separatists in the east and to 'denazify' Ukraine, which has been independent since 1991 and has increasingly aligned with Europe and the West. Moscow demands Ukraine cede four regions—Donetsk, Lugansk, Kherson, and Zaporíjia—plus Crimea (annexed in 2014) and permanently renounce NATO membership. Ukraine and its allies reject these terms, insisting on a 30-day unconditional ceasefire before peace talks. Russia argues such a ceasefire would allow Ukraine to rearm using Western military aid. On the same day, ABC News reported that U.S. troops supervising the Israel-Hamas ceasefire agreement have arrived in the region. A day earlier, the White House confirmed the deployment of 200 U.S. military personnel from the Central Command (CENTCOM), specialized in transport, planning, logistics, security, and engineering, to work with international partners, private sector representatives, and NGOs.\nOriginal language: pt\nPublish date: October 11, 2025 11:15 AM\nSource:[noticiasaominuto.com.br](https://www.noticiasaominuto.com.br/mundo/2322907/feito-incrivel-de-trump-zelensky-diz-que-guerra-na-ucrania-pode-acabar)\n\n**Zelensky intent on imposing ‘authoritarianism’ – Ukrainian MP**\nOn October 10, 2025, Ukraine’s parliament passed a resolution to suspend local elections until the end of martial law, which has been in effect since 2022 due to the conflict with Russia. Oleg Sinyutka, a member of the European Solidarity faction led by former President Petro Poroshenko, criticized the move, claiming the government is deliberately ignoring alternatives and accused the leadership of pursuing 'authoritarianism.' He stated, 'Today’s government in Ukraine lives on the desire to establish authoritarianism,' and warned that continuing this path would jeopardize Ukraine’s prospects for European Union and NATO integration. The comments follow widespread criticism of President Volodymyr Zelensky’s failed attempt to undermine the independence of Ukraine’s two main anti-corruption agencies, which sparked backlash domestically and internationally, with critics labeling his actions as 'illegitimate' and indicative of authoritarian tendencies.\nOriginal language: en\nPublish date: October 10, 2025 06:32 AM\nSource:[rt.com](https://www.rt.com/russia/626169-zelensky-intent-imposing-authoritarianism/)\n\n**Zelensky Approves Extension of Martial Law and Mobilization**\nUkrainian President Volodymyr Zelensky has signed laws to extend the state of war and mobilization in Ukraine for another 90 days, until November 5 of this year. According to the laws, the state of war will be extended from August 7, 2025, at 5:30 AM, for 90 days, and the mobilization period will also be extended for the same period. These decisions were made due to the ongoing armed aggression of Russia against Ukraine. This is the 16th time the Ukrainian parliament has approved the extension of the state of war and mobilization. Ukraine first introduced a state of war on February 24, 2022, after Russia's full-scale invasion.\nOriginal language: uk\nPublish date: July 25, 2025 10:40 AM\nSource:[Украинская сеть новостей](https://ua.korrespondent.net/ukraine/4802156-zelenskyi-skhvalyv-prodovzhennia-voiennoho-stanu)\n\n**Zelensky Approves Extension of Martial Law and Mobilization in Ukraine**\nUkrainian President Volodymyr Zelensky has signed laws extending the state of emergency and mobilization in Ukraine for another 90 days, until November 5, 2023. According to the Ukrainian parliament's website, the laws were passed on July 25, 2023. Zelensky stated, 'In accordance with the laws, the state of emergency has been extended for 90 days, and the mobilization period has also been extended for the corresponding period.' The decision was made due to Russia's ongoing armed aggression against Ukraine. This is the 16th time the state of emergency and mobilization have been extended. Ukraine first introduced martial law on February 24, 2022, after Russia launched a full-scale invasion.\nOriginal language: ru\nPublish date: July 25, 2025 10:40 AM\nSource:[Корреспондент.net](https://korrespondent.net/ukraine/4802156-zelenskyi-odobryl-prodlenye-voennoho-polozhenyia)\n\n**Zelensky Proposes Extension of Martial Law and General Mobilization**\nUkrainian President Volodymyr Zelensky has proposed a 90-day extension of martial law and general mobilization, which are set to expire on August 7. According to the Parliament's press service, the initiative aims to extend both measures until November 5. This would be the 16th time the measures have been extended since their introduction in February 2022, amidst the ongoing conflict with Russia. Zelensky's move is part of efforts to maintain a strong military presence in the country.\nOriginal language: es\nPublish date: July 14, 2025 01:47 PM\nSource:[新华网](https://spanish.xinhuanet.com/20250714/7b921509bb2e4aa2a483c5c67eae376c/c.html)\n\n**Zelenskyy Seeks to Extend Martial Law in Ukraine**\nUkrainian President Volodymyr Zelenskyy has submitted two draft laws to the Ukrainian parliament to extend martial law and general mobilization for an additional 90 days, until November 5. According to Ukrainian news agency Ukrinform, Zelenskyy proposes to extend martial law and general mobilization from August 7 to November 5. Both drafts are currently under review by the Committee on National Security, Defense, and Intelligence in the Ukrainian parliament. Martial law has been in effect in Ukraine since the start of the Russian military operation on February 24, 2022. 'The situation in the country remains extremely difficult, and we must be prepared for any scenario,' Zelenskyy said, 'We will not let our guard down and will continue to work tirelessly to protect our people and our state.'\nOriginal language: ar\nPublish date: July 14, 2025 12:16 PM\nSource:[اليوم السابع](https://www.youm7.com/story/2025/7/14/%D8%B2%D9%8A%D9%84%D9%8A%D9%86%D8%B3%D9%83%D9%89-%D9%8A%D8%B7%D9%84%D8%A8-%D9%85%D9%86-%D8%A7%D9%84%D8%A8%D8%B1%D9%84%D9%85%D8%A7%D9%86-%D8%AA%D9%85%D8%AF%D9%8A%D8%AF-%D8%A7%D9%84%D8%A3%D8%AD%D9%83%D8%A7%D9%85-%D8%A7%D9%84%D8%B9%D8%B1%D9%81%D9%8A%D8%A9-%D8%AD%D8%AA%D9%89-5-%D9%86%D9%88%D9%81%D9%85%D8%A8%D8%B1/7054878)\n\n**Ukraine's Zelensky Proposes Extension of Martial Law and General Mobilization**\nUkrainian President Volodymyr Zelensky has submitted a bill to the Parliament to extend the martial law and general mobilization by 90 days. According to the Parliament's press service, this proposal would extend these measures until November 5, after their scheduled expiration on August 7. The martial law and general mobilization have been extended 15 times since their introduction in February 2022 in response to the ongoing conflict with Russia. 'This proposal prolongs these two measures until November 5, after their date of expiration on August 7,' said the Parliament's press service.\nOriginal language: fr\nPublish date: July 14, 2025 11:57 AM\nSource:[Les nouvelles à travers la Chine et le monde](http://french.xinhuanet.com/20250714/1a9a3f18dc8d48249874b24c67e2ddb4/c.html)\n\n**Zelensky Seeks to Extend Martial Law and General Mobilization in Ukraine**\nUkrainian President Volodymyr Zelensky has submitted two draft laws to the Ukrainian parliament to extend martial law and general mobilization for an additional 90 days, until November 5. According to Ukrainian news agency Ukrinform, Zelensky proposes to extend martial law and general mobilization from August 7 to November 5. Both drafts are currently under review by the Committee on National Security, Defense and Intelligence in the Ukrainian parliament. Martial law has been in effect in Ukraine since the start of the Russian military operation on February 24, 2022.\nOriginal language: ar\nPublish date: July 14, 2025 10:17 AM\nSource:[Albawaba](https://www.albawabhnews.com/5232174)\n\n**Zelensky Extends Martial Law and General Mobilization for Three More Months**\nUkrainian President Volodymyr Zelensky has referred laws to extend martial law and general mobilization for three more months to parliament. This is the 16th time the parliament has voted to extend these laws, which will now remain in effect until August 6. Due to martial law, Ukraine has not held presidential and parliamentary elections on time. Zelensky's presidential term officially ended on May 20 last year, but he is making every effort to stay in power, including trying to eliminate potential political opponents and delay a peaceful settlement. Martial law and general mobilization were declared in Ukraine on February 24, 2022, and have been extended several times since then. Following issues with military conscription, a law tightening mobilization rules came into effect in Ukraine on May 18, 2024, with mobilization activities often being carried out using violence in recent months.\nOriginal language: ar\nPublish date: July 14, 2025 08:31 AM\nSource:[RT Arabic](https://arabic.rt.com/world/1692393-%D8%B2%D9%8A%D9%84%D9%8A%D9%86%D8%B3%D9%83%D9%8A-%D9%8A%D8%AD%D9%8A%D9%84-%D8%A5%D9%84%D9%89-%D8%A7%D9%84%D8%A8%D8%B1%D9%84%D9%85%D8%A7%D9%86-%D9%82%D9%88%D8%A7%D9%86%D9%8A%D9%86-%D8%AA%D9%85%D8%AF%D9%8A%D8%AF-%D8%A7%D9%84%D8%A3%D8%AD%D9%83%D8%A7%D9%85-%D8%A7%D9%84%D8%B9%D8%B1%D9%81%D9%8A%D8%A9-%D9%88%D8%A7%D9%84%D8%AA%D8%B9%D8%A8%D8%A6%D8%A9-%D8%A7%D9%84%D8%B9%D8%A7%D9%85%D8%A9-%D9%84%D9%85%D8%AF%D8%A9-%D8%AB%D9%84%D8%A7%D8%AB%D8%A9-%D8%A3%D8%B4%D9%87%D8%B1/)\n\n**Zelensky Proposes Extension of Martial Law and Mobilization**\nPresident Volodymyr Zelensky has submitted to the Ukrainian Parliament draft laws to extend the state of war and mobilization for another 90 days, until November 5, 2025. According to 'Glavkom' citing the parliament's website, the current laws on the extension of the state of war and mobilization, signed by the President on April 18, expire on August 6. Voting on the new draft laws in the Ukrainian Parliament will take place this week.\nOriginal language: uk\nPublish date: July 14, 2025 07:36 AM\nSource:[ГЛАВКОМ](https://glavcom.ua/country/politics/zelenskij-vnis-u-radu-zakonoprojekti-pro-prodovzhennja-vojennoho-stanu-ta-mobilizatsiji-1067996.html)\n\n**Zelensky Submits Bill to Extend Martial Law and Mobilization in Ukraine**\nUkrainian President Volodymyr Zelensky has submitted to the Verkhovna Rada (Ukrainian parliament) a bill to extend the martial law and general mobilization for another 90 days, until November 5, 2025. This move aims to prolong the previously introduced emergency measures, which have been in effect since February 24, 2022, when martial law was first declared in Ukraine. According to the data published on the official website of the Ukrainian parliament, the documents are now under consideration.\nOriginal language: ru\nPublish date: July 14, 2025 07:33 AM\nSource:[kp.ru](https://www.kp.ru/online/news/6469618/)\n\n",
    "date": "2025-10-15T01:32:00.200425",
    "summary": "Across all expert perspectives—military strategy, comparative law, regional security analysis, political science, international relations, and post-Soviet studies—there is overwhelming consensus that Ukraine will extend martial law beyond November 5, 2025. The central, recurring reason is the ongoing war with Russia, which poses a persistent existential threat and leaves little political, legal, or security rationale for lifting emergency powers. Every forecaster emphasizes that martial law has been extended 16 consecutive times since February 2022, and there is no indication of a credible ceasefire or peace agreement that would justify returning to peacetime governance. \n\nPolitical incentives also favor extension: the Zelenskyy administration benefits from executive control and suspension of elections, parliamentary and public support for holding elections remains very limited (with only around 11% favoring elections before war’s end), and opposition—either in parliament or society—is not yet substantial enough to force a change. While some experts note that Western partners and some Ukrainian MPs have raised concerns about democratic backsliding or authoritarian drift, these pressures are universally assessed as inadequate to outweigh security imperatives while hostilities persist. The base rate and historical precedent—both in Ukraine and comparable states—strongly support the pattern of extension during active conflict. \n\nAll experts consider scenarios in which martial law is not extended to be highly unlikely, requiring either a sudden negotiated peace or an unexpected political crisis or parliamentary revolt, none of which are foreseen in the near term. Probability estimates are uniformly very high, ranging from 93% to 97%. The shared judgment is that continuation of martial law is the default and almost certain outcome absent a dramatic and currently unforeseen development.",
    "forecasters": [
        "Military Strategy (Doctrine of National Emergency)",
        "Comparative Law (Martial Law Legal Standards)",
        "Regional Security Analysis (Black Sea Regional Security)",
        "Political Science (Democratic Resilience Theory)",
        "Political Science (Civil-Military Relations)",
        "International Relations (Security Dilemma)",
        "International Relations (International Conflict Theory)",
        "Slavic and East European Studies (Post Soviet State Transformation)"
    ]
}