{
    "deliberation_results": {
        "Military Intelligence (Threat Assessment Methodology)": {
            "time_to_resolution": "Approximately 1.5 months (until January 1, 2026)",
            "perspective_relevance": "As a military intelligence (threat assessment) expert, I focus on observable indicators of force posture, escalation ladders, intent versus capability, historical base rates of border conflict fatalities, and the impact of mediation or third-party involvement. My approach weighs the likelihood of major kinetic incidents based on patterns of recent violence, rules of engagement, and state motivations.",
            "status_quo": "Ceasefire agreements are repeatedly being violated, but with restraint shown by both parties; skirmishes and fatal incidents occur, but recent ones have not (yet) crossed the three-fatality threshold since the July 2025 outbreak. Both sides are under external diplomatic pressure to avoid escalation.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent Pattern of Kinetic Incidents",
                    "effect": "Increases probability. Since July, there have been multiple cross-border exchanges, fatal shootings, and landmine explosions. Several incidents have resulted in one or two fatalities, and armed clashes have occurred despite ceasefires."
                },
                {
                    "factor": "Ceasefire Fragility and Suspension",
                    "effect": "Increases probability. The peace agreement is currently suspended by Thailand, and both sides accuse the other of bad faith. The absence of an effective monitoring mission further reduces barriers to escalation."
                },
                {
                    "factor": "External Mediation and Great Power Pressure",
                    "effect": "Decreases probability. Both ASEAN and the U.S. (with Trump personally involved) are actively mediating, and China has a vested interest in regional stability. This increases reputational and economic costs for either side to escalate."
                },
                {
                    "factor": "Historical Base Rate of Fatal Clashes",
                    "effect": "Increases probability. Historically, the border has seen periodic deadly escalations, often clustered; after major clashes, there is typically a period of sporadic violence, sometimes leading to further fatal incidents."
                },
                {
                    "factor": "Domestic Political Incentives",
                    "effect": "Increases probability. Both governments face internal nationalist pressures not to appear weak. With unresolved prisoner and territory issues, miscalculation or rogue units could lead to a deadly escalation."
                },
                {
                    "factor": "Economic and Civilian Disruption",
                    "effect": "Decreases probability. Both governments are suffering significant economic disruption and mass displacement. This creates incentives to avoid further escalation that could worsen the situation domestically."
                },
                {
                    "factor": "Nature of Recent Fatalities",
                    "effect": "Neutral/slightly decreases. Recent deaths have mostly been single-fatality incidents (e.g., one civilian or a few wounded), showing some operational restraint or limited engagement rules. However, the potential for escalation remains if an incident spirals."
                }
            ],
            "no_scenario": "Tensions remain high, with sporadic minor clashes or isolated incidents (e.g., mine explosions, accidental shootings), but both sides exercise enough restraint—especially under international scrutiny—that no single incident results in three or more fatalities before January 1, 2026. Mediation efforts, however imperfect, prevent further spiraling.",
            "yes_scenario": "A local skirmish escalates, such as a patrol confrontation or an artillery exchange, leading to three or more deaths (either soldiers or civilians). This could be triggered by a miscalculation, a mine incident with multiple casualties, or a deliberate show of force. Lack of third-party monitoring and suspended peace mechanisms allow the situation to spiral before being brought under control.",
            "final_reasoning": "The situation is highly volatile: the ceasefire is essentially nonfunctional, both sides are on high alert, and there have been recent exchanges of fire, fatalities, and accusations of treaty violations. The base rate for such conflicts, especially after a recent large-scale clash, makes another deadly incident plausible. However, the fact that recent kinetic incidents (post-July) have largely resulted in low casualties suggests some operational restraint, likely due to international mediation and the economic/political cost of escalation. The window is short (about 6 weeks), which slightly lowers the risk, but the combination of unresolved grievances, lack of effective monitoring, and ongoing tit-for-tat violence keeps the risk well above baseline for peacetime but below certainty. Given all factors, I assess the probability as moderately high but not extreme.",
            "final_probability": 55
        },
        "Diplomatic Affairs (Track Two Diplomacy Practice)": {
            "time_to_resolution": "Approximately 6 weeks (until December 31, 2025)",
            "perspective_relevance": "As an expert in Track Two Diplomacy, my perspective prioritizes the role of unofficial dialogue, back-channel negotiations, and civil society engagement in reducing the likelihood of escalatory conflict between states. I closely analyze the mechanisms for de-escalation, the robustness of peace processes, and the willingness of parties to leverage third-party mediation or informal channels, which are critical in fragile ceasefire situations like the current Thai-Cambodian border crisis.",
            "status_quo": "The status quo is a fragile ceasefire repeatedly breached with low-intensity but deadly incidents, high tension, and suspended formal peace processes. Both sides have shown restraint after prior escalations but have not addressed core grievances, and sporadic violence continues.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent Escalation and Ceasefire Breaches",
                    "effect": "Increases probability. The November 2025 period saw new landmines, a fatal shooting, and artillery exchanges that ended the ceasefire. Both sides are accusing each other of violations and suspending aspects of the peace process. This active, tit-for-tat dynamic increases risk of another deadly clash."
                },
                {
                    "factor": "Third-Party Mediation and Diplomatic Pressure",
                    "effect": "Decreases probability. Persistent interventions by ASEAN, the US, and China have repeatedly pushed the parties back from the brink. High-level diplomatic engagement (calls by Trump, ASEAN mediation, Chinese involvement) creates external incentives to avoid a major incident, especially with international observers and humanitarian concerns."
                },
                {
                    "factor": "Track Two/Informal Dialogue Channels",
                    "effect": "Decreases probability. There is evidence of ongoing communication at multiple levels—formal and informal. Even when official talks stall, unofficial contacts and civil society actors can help prevent escalation by clarifying intentions and diffusing rumors, especially where ambiguity over incidents (e.g., mine origin) could otherwise drive cycles of retaliation."
                },
                {
                    "factor": "Domestic Political Pressures and Nationalism",
                    "effect": "Increases probability. Both Thai and Cambodian leaders face domestic nationalist sentiment and pressure not to appear weak, making compromise more difficult and increasing the risk that a local skirmish could escalate if exploited by political actors."
                },
                {
                    "factor": "Historical Base Rate of Large, Deadly Clashes",
                    "effect": "Decreases probability. While there have been deadly clashes in 2025 and historically (notably the July 2025 conflict), most incidents in recent years have resulted in lower casualties. Sustained, multi-fatality incidents are less common than sporadic small-scale violence."
                },
                {
                    "factor": "Exogenous Stabilizing Factors (International Trade and Regional Priorities)",
                    "effect": "Decreases probability. Both countries are under economic pressure due to border closures and disrupted trade. The Thai king’s visit to China and ongoing US trade talks provide both nations with incentives to avoid a destabilizing incident that could jeopardize broader economic or diplomatic gains."
                }
            ],
            "no_scenario": "Despite continued skirmishes and provocations, fatalities are limited due to international monitoring, rapid de-escalation via hotlines or back-channel communication, and both governments’ desire to avoid further economic pain or diplomatic isolation before ASEAN meetings. Incidents occur but are contained below the three-fatality threshold, with both sides managing domestic outrage through rhetoric rather than escalation.",
            "yes_scenario": "A border incident—such as a mine explosion or accidental crossfire—results in a rapid escalation, with local commanders responding with disproportionate force (artillery or direct assault), causing three or more fatalities. Domestic outrage and miscommunication, combined with weak central control over front-line troops, lead to a deadly clash before diplomats or Track Two actors can intervene.",
            "final_reasoning": "The situation is highly volatile, with the last two weeks seeing both a fatal civilian shooting and a deadly mine incident, plus the suspension of the peace agreement. While the base rate for such multi-fatality clashes is low in any given two-month period, the current context is exceptional: multiple breaches have already occurred, and trust is virtually absent. On the other hand, robust Track One and Track Two diplomatic engagement is ongoing, and both sides have pulled back from the brink after prior escalations (July and now November). The proximity of multiple international actors (US, China, ASEAN) provides additional incentives for restraint. Given the short time window but elevated risk environment, the probability is above base rate but not near certainty. I estimate a 1-in-3 chance of another deadly (3+ fatalities) clash before 2026.",
            "final_probability": 33
        },
        "Crisis Management (Incident Command System)": {
            "time_to_resolution": "Approximately 6 weeks (until January 1, 2026)",
            "perspective_relevance": "As a crisis management and Incident Command System (ICS) expert, my focus is on operational escalation dynamics, command/control structures, and the risk factors that determine whether ceasefires hold or break. I evaluate the likelihood of deadly clashes using indicators such as breakdowns in communication, chain of command discipline, incident reporting, and the effectiveness of multi-layered response and de-escalation mechanisms.",
            "status_quo": "The status quo is a precarious ceasefire, repeatedly violated at a low level, with sporadic incidents causing casualties (including at least one recent fatality), but no major kinetic event resulting in three or more fatalities since the July clashes. Both sides have recently suspended parts of their peace agreements, yet have not escalated to full-scale combat.",
            "perspective_derived_factors": [
                {
                    "factor": "Ceasefire discipline and command control",
                    "effect": "Decreases probability. Both militaries maintain some chain of command control and have refrained from massed, deliberate escalations despite provocations."
                },
                {
                    "factor": "ICS breakdown risk (trigger discipline & incident escalation)",
                    "effect": "Increases probability. Recent incidents (landmine explosions, shootings) show poor tactical discipline and risk of local incidents spiraling, especially given ambiguous rules of engagement."
                },
                {
                    "factor": "International mediation and observer presence",
                    "effect": "Decreases probability. High-level engagement by ASEAN, the U.S., China, and Malaysia has established pressure for restraint, though observer mechanisms remain weak."
                },
                {
                    "factor": "Political constraints and nationalist sentiment",
                    "effect": "Increases probability. Domestic political pressure and nationalist rhetoric on both sides raise the risk of overreaction to provocations, especially following casualties."
                },
                {
                    "factor": "Base rate of recurrence after recent deadly clashes",
                    "effect": "Increases probability. Historically, the region has seen repeated flare-ups after ceasefires, especially when underlying disputes remain unresolved."
                },
                {
                    "factor": "Operational friction and border geography",
                    "effect": "Increases probability. Poorly demarcated borders, minefields, and proximity of forces create persistent risk of incidents escalating to deadly clashes."
                }
            ],
            "no_scenario": "Despite continued low-level incidents (occasional shootings, injuries, isolated fatalities), diplomatic pressure—especially from China, ASEAN, and the U.S.—keeps both militaries from authorizing or tolerating larger-scale attacks. Local commanders exercise enough restraint or are kept on short leashes. Any violence remains below the three-fatality threshold per incident, and both sides avoid a major escalation before January 1, 2026.",
            "yes_scenario": "A border incident (such as a mine explosion killing multiple soldiers, or a firefight prompted by a misinterpreted provocation) results in several deaths in a single event. Political leaders, facing domestic pressure, allow or order a limited retaliatory operation, resulting in a kinetic clash with three or more fatalities. ICS breakdown occurs at the tactical level, and international mediators are unable to contain the escalation before the fatality threshold is met.",
            "final_reasoning": "The region is in a period of high tension, with recent violence and multiple fatal incidents, and the ceasefire is both fragile and frequently violated at a low level. Key risk factors include unresolved disputes, ambiguous borders, and poor trigger discipline. However, international attention and mediation are at a peak, with economic and diplomatic incentives for restraint. The ICS perspective emphasizes that while escalation is possible due to operational friction, the presence of high-level mediation and the catastrophic impact of renewed mass violence make a major clash less likely than a naive reading of the border violence would suggest. The base rate of such deadly incidents in the past several decades is low during periods of international engagement, but not zero—especially in the immediate months after a major flare-up. Given all factors, the risk is meaningfully elevated but not greater than 50%. The probability is increased by recent tactical incidents, but decreased by the strong diplomatic and economic incentives to avoid further escalation.",
            "final_probability": 32
        },
        "Crisis Management (Risk Analysis Procedures)": {
            "time_to_resolution": "Approximately 1.5 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Crisis Management (Risk Analysis Procedures), my assessment emphasizes the identification of triggers for escalation, mechanisms for de-escalation, monitoring of compliance with ceasefires, and the role of external mediators. I evaluate both historical base rates of post-ceasefire recurrence and the structural vulnerability of peace agreements lacking robust monitoring and dispute resolution mechanisms.",
            "status_quo": "The status quo as of mid-November 2025 is a fragile ceasefire between Thailand and Cambodia, recently ruptured by deadly incidents (including shootings and landmine blasts), with both sides blaming each other for violations and suspending parts of the peace agreement. No new clash resulting in three or more fatalities has been reported since the recent November 12–13 incidents (which appear to have resulted in one death), but tensions remain high and military postures are hardened.",
            "perspective_derived_factors": [
                {
                    "factor": "Historical base rate of deadly border clashes post-ceasefire",
                    "effect": "Increases probability: Thai-Cambodian border disputes have a history of recurring violence shortly after ceasefires, often within weeks to months, especially when core issues remain unresolved."
                },
                {
                    "factor": "Fragility of current ceasefire and lack of robust third-party monitoring",
                    "effect": "Increases probability: Both sides have suspended key provisions (e.g., Thailand delayed POW release, Cambodia accused of new mine-laying), and ASEAN/third-party monitors are not fully operational. This increases risk of further escalation."
                },
                {
                    "factor": "Recent deadly incidents just below the question's threshold",
                    "effect": "Increases probability: November 10–12 saw multiple deaths and injuries, with tensions high and military alertness raised. The threshold for a qualifying deadly clash (3+ fatalities) is near, suggesting a high background risk."
                },
                {
                    "factor": "Role of external mediators and international pressure",
                    "effect": "Decreases probability: High-level engagement from the US, China, Malaysia, and ASEAN exerts strong pressure for restraint, especially given the recent diplomatic visits and economic stakes (trade negotiations, regional stability)."
                },
                {
                    "factor": "Mutual economic and political incentives to avoid escalation",
                    "effect": "Decreases probability: Both countries face economic costs from border closures, trade suspensions, and international scrutiny. Elite incentives (e.g., Thailand's China pivot, Cambodia's US/ASEAN relations) favor at least superficial de-escalation."
                },
                {
                    "factor": "Entrenched nationalism and unresolved territorial dispute",
                    "effect": "Increases probability: Domestic nationalist pressures and ambiguous colonial-era boundaries make compromise politically difficult and increase the risk of hardline posturing or accidental escalation."
                },
                {
                    "factor": "Short time window until resolution",
                    "effect": "Decreases probability: With only 1.5 months left, the window for a qualifying incident is limited, even if background risk is elevated."
                }
            ],
            "no_scenario": "Despite ongoing skirmishes, both sides manage to avoid any further deadly incidents above the threshold (i.e., clashes may continue, but with fewer than three deaths at a time, or incidents are contained via rapid de-escalation and diplomatic intervention). ASEAN or major power mediation mechanisms, though imperfect, provide enough of a cooling effect. Nationalist rhetoric is channeled into non-kinetic forms (e.g., protests, diplomatic protests), and border security is increased, but neither side crosses the fatality threshold before January 1, 2026.",
            "yes_scenario": "A border incident (e.g., a firefight, artillery exchange, or mine explosion) results in three or more fatalities before January 1, 2026. This could be either a deliberate show of force, an accident precipitated by tense patrols, a mine incident, or a local commander's overreaction. The incident escalates before higher authorities can intervene, leading to a qualifying fatal clash. International pressure follows, but only after the fatal threshold is crossed.",
            "final_reasoning": "The base rate for post-ceasefire deadly incidents between Thailand and Cambodia is high, with most historical ceasefires followed by at least one serious incident in the ensuing months, especially when the core territorial dispute is unresolved and mechanisms for monitoring are weak. The past two weeks have already seen multiple breaches of the peace agreement, including landmine blasts and shootings resulting in fatalities (but not quite three in a single incident). Both sides are on heightened alert, and border security is increasingly militarized, raising the possibility of accidental or escalatory violence. However, the presence of strong external mediation (US, China, ASEAN), the economic and political costs of renewed conflict, and the short time frame until the question closes all act as dampeners. Given the proximity to the qualifying threshold, the historical volatility of the border, and the demonstrated willingness of both sides to use force, the risk remains significantly elevated—but the international context and strategic interests of both governments provide partial restraint. On balance, the probability of a qualifying deadly clash before January 1, 2026, is high, but not overwhelming, given the short window. I therefore assign a probability of 38%.",
            "final_probability": 38
        },
        "International Relations (Realism)": {
            "time_to_resolution": "Approximately 1.5 months (until Jan 1, 2026)",
            "perspective_relevance": "My perspective as an International Relations Realist is highly relevant. Realism emphasizes the centrality of state interests, power balances, historical animosities, and the limitations of international institutions in constraining state action. In this crisis, the key drivers are unresolved territorial disputes, deep-seated historical grievances, and the calculation of national interest under the shadow of anarchy. Realism also emphasizes the fragility of ceasefires absent credible enforcement and the tendency for conflict to persist when core interests are at stake.",
            "status_quo": "The status quo is a fragile ceasefire punctuated by persistent low-level violence, sporadic deadly incidents, and unresolved territorial disputes. Both sides continue to accuse each other of violations, and international mediation has failed to resolve underlying issues. Ceasefires have repeatedly broken down in the past, but large-scale escalations are rare outside of major triggers.",
            "perspective_derived_factors": [
                {
                    "factor": "Unresolved Territorial Disputes and Historical Grievances",
                    "effect": "Increases probability. The 800km border remains disputed, with flashpoints like Preah Vihear and demarcation issues. Historical animosities and memories of violence fuel nationalist positions and reluctance to compromise."
                },
                {
                    "factor": "Recent Escalation and Ceasefire Violations",
                    "effect": "Increases probability. Landmine incidents, deadly shootings (including recent civilian deaths), and ongoing accusations show the ceasefire is not robust. The November 12 shooting and November 10 landmine blast demonstrate how easily deadly violence can recur."
                },
                {
                    "factor": "Domestic Political Incentives and Nationalism",
                    "effect": "Increases probability. Both governments face strong domestic pressures to appear tough. Cambodia has sought internationalization, while Thailand prefers bilateralism and has suspended peace agreements after perceived provocations. Rising nationalism, especially in the aftermath of casualties, can incentivize military response and escalation."
                },
                {
                    "factor": "Role of International Actors and Mediation",
                    "effect": "Decreases probability, but only modestly. ASEAN, China, the US, and Malaysia are involved in mediation. However, Realism suggests external mediation is only as effective as the interests of the parties allow. Both sides have previously disregarded external pressures when core interests were threatened."
                },
                {
                    "factor": "Military Capabilities and Posture",
                    "effect": "Increases probability. Both countries maintain significant forces at the border, have recently mobilized reinforcements, and withheld prisoners of war. The proximity of forces and lack of trust increases the risk of escalation from small incidents."
                },
                {
                    "factor": "Recent Fatal Clashes and Base Rates",
                    "effect": "Increases probability. Deadly clashes (3+ fatalities) have occurred in July 2025, and multiple incidents since. The base rate for such events in the last two decades is low, but the July–November 2025 period has already seen several deadly exchanges, indicating an elevated risk environment."
                },
                {
                    "factor": "Short Timeframe to Resolution",
                    "effect": "Decreases probability somewhat. The question resolves in about 1.5 months, so while the environment is dangerous, the window for a deadly (>3 deaths) clash is limited."
                },
                {
                    "factor": "Mutual Restraint After Recent Escalations",
                    "effect": "Decreases probability. Both sides, after recent clashes, have shown some efforts to avoid a major escalation, possibly due to economic costs, international mediation, and fear of broader war."
                }
            ],
            "no_scenario": "Both sides, despite provocations and sporadic violence (including injuries and possibly 1–2 deaths), maintain restraint. No single incident causes three or more fatalities. International mediation, economic concerns, and mutual deterrence prevent escalation, and the fragile ceasefire limps forward until 2026. Both governments focus on de-escalation, perhaps due to pressure from ASEAN, China, or the US, and avoid major military operations or massed exchanges of fire.",
            "yes_scenario": "A border incident—such as another mine explosion, ambush, or artillery exchange—results in three or more deaths among military or police forces (or possibly civilians, if directly targeted by military action). Escalation could be triggered by a particularly provocative event (e.g., discovery of new mines, killing of a high-ranking officer, or accidental shelling of a village). Failure of communication, miscalculation, or domestic political pressure causes one side to respond forcefully, leading to a brief but deadly exchange. The event is reported by credible media and confirmed by international observers.",
            "final_reasoning": "The probability of a deadly (>3 fatalities) clash before January 1, 2026, is significantly elevated compared to historical norms. The July–November 2025 period has already seen multiple incidents with 3+ deaths, including military and civilian casualties, and the ceasefire has repeatedly failed. Realist analysis suggests that deep-seated territorial disputes, high levels of mistrust, and domestic political incentives make further violence likely. The presence of powerful mediators (ASEAN, China, US) and some demonstrated restraint after recent escalations offer some hope for stability, but their influence is limited when core state interests are at stake. The short time left before resolution (1.5 months) somewhat limits the window for escalation, but the current environment is highly unstable, with multiple recent incidents that nearly met or exceeded the deadly threshold. Given the demonstrated fragility of the ceasefire, the proximity of heavily armed forces, and the lack of real progress on root issues, I assess the chance of a deadly clash (>3 deaths) as notably higher than a typical border standoff, but not a certainty. A plausible estimate, balancing the acute tensions and the short timeframe, is 38%.",
            "final_probability": 38
        },
        "International Relations (Liberal Institutionalism)": {
            "time_to_resolution": "Approximately 6 weeks (until December 31, 2025)",
            "perspective_relevance": "As an expert in International Relations (Liberal Institutionalism), my analysis emphasizes the constraining and pacifying effects of international institutions, multilateral diplomacy (especially ASEAN, US, and China involvement), and the incentives for cooperation created by economic interdependence and repeated interaction. Liberal Institutionalism provides insight into the likelihood that international actors and agreements can contain escalation, especially in the short time window remaining.",
            "status_quo": "Despite repeated ceasefire violations, limited exchanges of fire, and casualties (including civilian deaths), there have been no confirmed kinetic clashes since July 31, 2025, that resulted in three or more total fatalities between Thai and Cambodian military forces. Escalations have been contained to small-scale or isolated incidents, and both governments publicly reaffirm commitment to peace processes, albeit suspending agreements after provocative incidents.",
            "perspective_derived_factors": [
                {
                    "factor": "Strength and Engagement of International Institutions (ASEAN, US, China mediation)",
                    "effect": "Decreases probability. Active engagement by ASEAN, US, and China has provided diplomatic channels and rapid crisis response, pressuring both sides to avoid major escalations. Repeated communication and third-party monitoring, even if imperfect, create incentives for restraint."
                },
                {
                    "factor": "Fragility of Ceasefire and Recurring Violations",
                    "effect": "Increases probability. The peace agreements have been fragile, with repeated suspensions, accusations of mine-laying, and episodic exchanges of fire. The lack of robust third-party monitoring and deep mutual mistrust increases risk that a skirmish could spiral into a deadlier incident."
                },
                {
                    "factor": "Historical Base Rate of Major Clashes",
                    "effect": "Decreases probability. Serious, multi-fatality clashes between Thai and Cambodian forces have historically been rare, even during periods of tension. The July 2025 events were exceptional in scale over the past decade, suggesting such escalations are unusual."
                },
                {
                    "factor": "Domestic Political Incentives and Nationalism",
                    "effect": "Increases probability. Both governments face domestic pressure to appear strong and not back down, and nationalist sentiment is high. This creates incentives for tough responses to provocations, increasing risk of escalation."
                },
                {
                    "factor": "Economic Interdependence and Civilian Costs",
                    "effect": "Decreases probability. Both economies are suffering from border closures and displacement, incentivizing leadership to avoid a return to large-scale clashes that would further damage trade and civilian welfare."
                },
                {
                    "factor": "Short Time Horizon",
                    "effect": "Decreases probability. With only about six weeks remaining, the window for a deadly clash to occur is limited, and the actors are already under international scrutiny after recent escalations."
                }
            ],
            "no_scenario": "Despite ongoing tensions and minor incidents (e.g., isolated shootings, mine blasts), neither side escalates to a kinetic clash resulting in three or more fatalities before the end of 2025. International mediation efforts (ASEAN, China, US) maintain enough pressure and oversight to prevent further major incidents. Both governments prioritize diplomatic channels and manage domestic pressures without crossing escalation thresholds.",
            "yes_scenario": "A border incident—such as a misinterpreted patrol movement, mine explosion, or accidental exchange of fire—rapidly escalates beyond control, resulting in a firefight or artillery exchange that causes three or more deaths among military or paramilitary personnel before December 31, 2025. Nationalist backlash or a breakdown in communication triggers a response that overtakes the restraint currently imposed by international monitoring and diplomatic engagement.",
            "final_reasoning": "The environment remains highly volatile. The peace agreements are repeatedly violated, and tit-for-tat responses (mine-laying, shootings) have led to fatalities and displacement. However, Liberal Institutionalism highlights the unusual level of third-party engagement (ASEAN, US, China), which is currently exerting consistent pressure for restraint on both sides. Both governments have strong incentives to avoid major clashes due to economic interdependence and the costs of further escalation, which would damage their standing with powerful external partners. The base rate of multi-fatality clashes between Thai and Cambodian forces in recent years is low, with the July 2025 events being an outlier. While there have been deadly incidents in November, they have not (so far) resulted in three or more fatalities in a single clash. The fragility of the ceasefire and the recurring small-scale violence means the risk is not negligible, but the short time window and the high level of international attention reduce the probability of a major deadly incident occurring in the remaining six weeks. Therefore, the likelihood is moderate but below even odds.",
            "final_probability": 28
        },
        "Security Studies (Securitization Theory)": {
            "time_to_resolution": "Approximately 6 weeks (until January 1, 2026)",
            "perspective_relevance": "As an expert in Security Studies with a focus on Securitization Theory, my analysis privileges how issues become constructed as existential threats by elites, the dynamics of audience acceptance, and the interplay of domestic, regional, and international political incentives in (de)escalating conflict. This allows for a nuanced reading of not just material capabilities, but also discursive practices and the social construction of (in)security, especially relevant in a context of contested narratives, third-party mediation, and fragile ceasefires.",
            "status_quo": "The status quo is a fragile ceasefire punctuated by sporadic skirmishes, with both Thailand and Cambodia publicly committed—albeit with mistrust—to de-escalation and international mediation. No new deadly clash causing 3+ fatalities has occurred since November 12, despite multiple incidents and accusations.",
            "perspective_derived_factors": [
                {
                    "factor": "Unresolved Securitized Border Dispute",
                    "effect": "Increases probability. The border issue remains deeply securitized by both states, rooted in historical grievances and nationalist narratives. This creates a persistent potential for escalation in response to perceived provocations or political incentives."
                },
                {
                    "factor": "Recent Breaches and Mutual Accusations",
                    "effect": "Increases probability. Both sides have accused each other of ceasefire violations (landmines, shootings), and the escalation threshold remains low, as evidenced by the November 10-12 incidents. The fragility of the peace is underscored by Thailand suspending the peace declaration."
                },
                {
                    "factor": "Major Power and ASEAN Involvement",
                    "effect": "Decreases probability. The presence and active mediation of the US, China, and ASEAN, along with their interest in regional stability and economic continuity, exert significant pressure on both sides to avoid escalation to the level of deadly military clashes."
                },
                {
                    "factor": "Audience Costs and Nationalist Mobilization",
                    "effect": "Increases probability. Nationalistic sentiment and securitizing rhetoric in both countries create domestic audience costs for perceived weakness, incentivizing leaders to respond to incidents with force, especially if casualties mount."
                },
                {
                    "factor": "Short Time Frame and Base Rate of Deadly Clashes",
                    "effect": "Decreases probability. Although the historical base rate of deadly clashes is non-trivial, such escalations require a confluence of failures and provocations. The window for a new deadly clash (3+ killed) is now under 6 weeks, lowering the likelihood compared to a longer horizon."
                },
                {
                    "factor": "Current Military Posture and Restraint",
                    "effect": "Decreases probability. Despite recent violence, both sides have shown restraint (e.g., Cambodia not retaliating after civilian deaths), and there is continued dialogue and international monitoring."
                }
            ],
            "no_scenario": "Both sides continue to engage in rhetorical and limited kinetic actions (e.g., warning shots, mine incidents, detentions), but refrain from operations likely to cause multiple fatalities, deterred by international pressure and the risk of escalation. ASEAN and great power mediation, plus the approaching end of the year and trade/economic considerations, lead both militaries to exercise restraint despite provocations.",
            "yes_scenario": "A border incident (e.g., new mine blast, miscalculated patrol skirmish, or escalation after a fatality) triggers a rapid kinetic exchange—possibly involving artillery or direct fire—resulting in 3+ deaths among military forces or civilians. Domestic political pressure or a breakdown in communication leads one side to overreact, overwhelming restraint mechanisms and mediation efforts, causing a localized but deadly clash.",
            "final_reasoning": "The situation is highly volatile, with recent incidents (landmine blasts, shootings) demonstrating the fragility of the ceasefire and the persistent risk of miscalculation. Both sides have strong securitizing narratives and domestic incentives to escalate if challenged, with audience costs for leaderships. However, the intense involvement of external actors (US, China, ASEAN), ongoing diplomatic engagement, and mutual recognition of the costs of escalation act as significant constraints. The short window before the question resolves (6 weeks) further lowers the baseline risk, as the threshold for escalation to a 3+ fatality event is high and recent incidents—while serious—have not crossed this line since the July ceasefire. Given the base rate for such deadly incidents and the current deterrence mechanisms, the probability is meaningfully elevated but not extreme.",
            "final_probability": 27
        },
        "Security Studies (Conflict Escalation Model)": {
            "time_to_resolution": "Approximately 6 weeks (until January 1, 2026)",
            "perspective_relevance": "As an expert in Security Studies with a focus on Conflict Escalation Models, I can assess the structural drivers, triggers, and de-escalatory mechanisms relevant to recurring border conflicts. This allows me to weigh the likelihood of renewed deadly violence by considering not only recent tactical incidents but also the deeper institutional, political, and systemic factors that make escalation more or less probable in the short term.",
            "status_quo": "Low-level clashes and provocations occur sporadically, but major deadly incidents remain rare following international mediation and ceasefire arrangements. The status quo would be a tense but largely non-lethal standoff, with occasional injuries or isolated deaths, but not a new clash causing three or more fatalities.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent deadly incidents and ongoing skirmishes",
                    "effect": "Increases probability. The November 2025 period has already seen border shootings, mine explosions, and at least one confirmed death with multiple injuries. Ceasefire violations and mutual accusations of provocation indicate that force is still being used."
                },
                {
                    "factor": "Ceasefire fragility and lack of monitoring",
                    "effect": "Increases probability. The structural weakness of the ceasefire (no robust third-party enforcement, ongoing disputes over ceasefire violations, and refusal to host international monitors) leaves the situation highly vulnerable to escalation from accidents or intentional provocations."
                },
                {
                    "factor": "High-level diplomatic engagement and mediation",
                    "effect": "Decreases probability. The involvement of major powers (US and China), ASEAN mediation, and high-profile summits (e.g., Thai king's visit to China) create strong incentives for both sides to avoid major escalations that could embarrass international stakeholders or lead to sanctions."
                },
                {
                    "factor": "Nationalist political incentives and unresolved grievances",
                    "effect": "Increases probability. Both governments face domestic pressure not to appear weak, and the border remains undefined in many places. Historical grievances, prisoner exchanges, and recent deaths can be used for political mobilization, increasing the risk of deliberate or spontaneous escalation."
                },
                {
                    "factor": "Short time window until resolution",
                    "effect": "Decreases probability. With only six weeks remaining, both sides may seek to avoid further escalation in the near term, especially after recent violence and under international scrutiny."
                },
                {
                    "factor": "Base rate of similar deadly escalations in recent years",
                    "effect": "Slightly increases probability. While deadly border clashes are rare, the current cycle has already produced several such incidents in a short period, indicating a temporarily elevated risk profile."
                }
            ],
            "no_scenario": "Both armies, under intense international pressure and with ASEAN and great power attention, pull back from the brink. Minor incidents (such as sporadic gunfire or mine injuries) continue, but command and control is restored sufficiently to prevent any new incident with three or more deaths. Diplomatic engagement, prisoner exchanges, and ongoing negotiations maintain a tense but non-deadly status quo until at least January 1, 2026.",
            "yes_scenario": "A border incident—perhaps involving a mine, a patrol straying too far, or a misinterpreted provocation—spirals into a firefight or artillery exchange. Local commanders, operating under ambiguous rules of engagement and possibly motivated by retaliation for prior incidents, escalate force, resulting in three or more deaths. Alternatively, a deliberate show of force by one side to demonstrate resolve leads to a deadly skirmish before international actors can intervene.",
            "final_reasoning": "The situation along the Thailand-Cambodia border is currently volatile, with multiple recent deadly incidents and a clear breakdown in trust and ceasefire compliance. The status quo has shifted from relative calm (pre-summer) to a period of repeated deadly clashes (July and November 2025). The absence of robust third-party monitoring, coupled with unresolved territorial grievances and high nationalist rhetoric, increases the risk of escalation. While international mediation, economic pressures, and diplomatic engagement are strong de-escalatory factors, they have not been sufficient to prevent recent violence. The short time window (six weeks) reduces the likelihood of another major deadly clash, but the risk remains well above baseline given the pattern of recent incidents and the apparent inability of either side to fully control their forces on the ground. Given these factors, I estimate the probability of another deadly clash (three or more fatalities) before January 1, 2026, at 35%. This reflects a substantial risk, higher than historical base rates, but still below even odds due to the constraining influence of international mediation and the short time remaining.",
            "final_probability": 35
        },
        "Southeast Asian Studies (ASEAN Regionalism)": {
            "time_to_resolution": "Approximately 6 weeks (from November 19, 2025, to December 31, 2025)",
            "perspective_relevance": "As an expert in Southeast Asian Studies with a focus on ASEAN regionalism, my perspective is highly relevant. I can contextualize the border dispute within historical patterns of Thai-Cambodian relations, ASEAN’s mediation capacity, regional security norms, and the impact of great power involvement (US/China). I bring a nuanced understanding of how nationalism, regional institutions, and unresolved border demarcations interact to affect the risk of renewed deadly violence.",
            "status_quo": "After the deadly clashes in July 2025 and the subsequent ceasefire, the situation remains tense but short of renewed mass violence. There have been sporadic incidents (landmine explosions, shootings), but these have resulted in isolated casualties (1-2 deaths at a time), not a new multi-fatality clash. Border crossings are closed, militaries are on high alert, and international mediation is ongoing.",
            "perspective_derived_factors": [
                {
                    "factor": "Historical Base Rate of Deadly Clashes",
                    "effect": "Increases probability somewhat, as past years have seen periodic escalations (notably 2008-2011 and again in 2025), but most years do not see 3+ fatality border clashes. However, the July 2025 episode was exceptionally deadly, suggesting a temporarily elevated baseline."
                },
                {
                    "factor": "Fragility of Ceasefire and Recent Violations",
                    "effect": "Increases probability. The July ceasefire is not robust: both sides accuse each other of violations, and border skirmishes have continued. Thailand suspended the peace agreement; Cambodia claims restraint but is reinforcing troops. This volatility raises the short-term risk of another deadly incident."
                },
                {
                    "factor": "Great Power Mediation and ASEAN Pressure",
                    "effect": "Decreases probability. The involvement of Malaysia (ASEAN chair), US diplomatic pressure, and China’s mediating role increase incentives for restraint. Both Bangkok and Phnom Penh have shown willingness to de-escalate under external pressure, especially with high-level summits ongoing."
                },
                {
                    "factor": "Domestic Nationalism and Political Incentives",
                    "effect": "Increases probability modestly. Both governments face domestic pressure not to appear weak, especially after casualties and displacement. Nationalist media rhetoric could escalate incidents, particularly if soldiers or civilians are killed."
                },
                {
                    "factor": "Lack of Third-Party Monitoring/Verification",
                    "effect": "Increases probability. Previous ceasefires have broken down due to the absence of robust third-party monitoring; neither side wants foreign observers. This makes it harder to verify and contain incidents before escalation."
                },
                {
                    "factor": "Short Time Horizon Until 2026",
                    "effect": "Decreases probability. There are only about six weeks left for a qualifying incident to occur. Even in tense situations, the window for escalation to a 3+ fatality kinetic clash is limited."
                },
                {
                    "factor": "Recent Pattern of Isolated, Low-Fatality Incidents",
                    "effect": "Decreases probability. Recent incidents have mostly resulted in 1-2 deaths per event, with both sides showing some restraint and preference for protest/diplomatic channels over immediate retaliation."
                }
            ],
            "no_scenario": "Despite continued skirmishes, both sides—under intense ASEAN and great power pressure—avoid any new incident that results in three or more fatalities before January 1, 2026. Incidents (e.g., mine blasts, warning shots) remain at the level of 1-2 casualties, with each government using diplomatic protests and international forums to de-escalate. The status quo—tense, militarized, but below the threshold for a mass-casualty clash—persists through the end of 2025.",
            "yes_scenario": "An incident—likely triggered by a border patrol confrontation, further mine explosions, or accidental escalation—leads to a firefight or artillery exchange resulting in at least three deaths among military or law enforcement personnel. This could occur if nationalist sentiment spikes, command and control breaks down, or if one side misinterprets the other's actions as an attack, leading to a kinetic response before outside mediators can intervene.",
            "final_reasoning": "The base rate for major deadly Thai-Cambodian border clashes is low (every few years, not every few months), but the July 2025 episode and its aftermath have created an unusually volatile situation. The past month has seen a fragile truce, repeated violations, and a cycle of provocation and restraint. However, recent incidents have not reached the 3+ fatality threshold and have been followed by diplomatic engagement, not open escalation. The presence of ASEAN, US, and Chinese mediators—plus high economic and political costs of renewed fighting—create strong incentives for both governments to avoid another major clash, at least in the short window left before 2026. The lack of third-party monitors and the deep-rooted nature of the dispute raise the risk, but the narrow time frame, pattern of isolated casualties, and external diplomatic pressure all point to a lower likelihood of another qualifying deadly clash. I estimate the probability at 23%.",
            "final_probability": 23
        },
        "Southeast Asian Studies (Postcolonial Border Dispute Analysis)": {
            "time_to_resolution": "Approximately 6 weeks (question resolves on January 1, 2026; today is November 19, 2025).",
            "perspective_relevance": "As an expert in Southeast Asian Studies with a specialization in postcolonial border dispute analysis, I bring a deep understanding of the historical, legal, and sociopolitical roots of Thai-Cambodian tensions, the role of external mediation (ASEAN, China, US), and the behavioral patterns of both militaries and governments in the region. This perspective is critical for interpreting the risk of escalation versus restraint in the unique, high-stakes postcolonial context, especially amidst recent intense violence and ongoing provocations.",
            "status_quo": "The status quo is an uneasy, fragile ceasefire repeatedly violated by skirmishes and low-level violence (including recent fatal incidents and military posturing), but so far not escalating to another major deadly clash (three or more fatalities) since the July/August 2025 violence.",
            "perspective_derived_factors": [
                {
                    "factor": "Historical Precedent and Base Rate of Major Border Clashes",
                    "effect": "Increases probability. The Thai-Cambodian border has a history of periodic deadly escalations, especially around unresolved, ambiguous boundaries (notably Preah Vihear and nearby areas). The recent July 2025 violence (over 40 killed) is a sharp reminder of how quickly incidents can spiral."
                },
                {
                    "factor": "Ceasefire Fragility and Mechanisms for Monitoring",
                    "effect": "Increases probability. Ceasefire mechanisms are weak; both sides reject robust international monitoring, and violations (mine-laying, shootings) have occurred repeatedly since the latest truce. Lack of trusted verification or buffer zones leaves room for incidents to escalate."
                },
                {
                    "factor": "Recent Kinetic Activity and Fatalities",
                    "effect": "Increases probability. Since October, there have been new mine incidents, shootings, and at least one civilian fatality attributed to Thai troops (per Cambodian sources) and several injuries. While recent events have not reached the 3+ fatality threshold, the tempo of violence is high and tensions remain acute."
                },
                {
                    "factor": "Nationalism, Domestic Pressures, and Political Incentives",
                    "effect": "Increases probability. Both governments face strong nationalist constituencies, with Thailand's military and Cambodia's leadership using border issues to shore up legitimacy. This incentivizes hardline postures and retaliatory action, especially after perceived violations."
                },
                {
                    "factor": "Great Power Mediation and Diplomatic Pressure",
                    "effect": "Decreases probability. The US, China, and ASEAN have all intervened diplomatically. The presence of high-level actors (Trump, Xi, Anwar Ibrahim) raises the cost of renewed escalation, especially with economic and diplomatic incentives/disincentives attached to restraint."
                },
                {
                    "factor": "Recent De-escalatory Signals and Humanitarian Constraints",
                    "effect": "Slightly decreases probability. Despite harsh rhetoric and incidents, both sides have shown some capacity for restraint (e.g., Cambodia refraining from retaliation after civilian deaths, Thailand engaging in dialogue). Humanitarian crises and international scrutiny add pressure to avoid major clashes."
                },
                {
                    "factor": "Short Time Frame Until Resolution",
                    "effect": "Decreases probability. With only six weeks until the end of 2025, the window for a new major clash is limited, and both sides are currently under heavy international observation."
                }
            ],
            "no_scenario": "Despite ongoing skirmishes, no single incident within the remaining six weeks results in three or more confirmed fatalities. Both sides, under pressure from ASEAN, China, and the US, keep the violence contained to sporadic minor clashes, and political leaderships prioritize regional stability and economic interests. Humanitarian concerns and diplomatic engagement outweigh nationalist escalation, at least in the short window to 2026.",
            "yes_scenario": "A border incident—such as a landmine explosion, cross-border artillery exchange, or retaliatory raid—quickly escalates, resulting in three or more deaths (likely among military personnel, but possibly including civilians). This could be triggered by a miscalculation, deliberate provocation (e.g., further mine-laying or a tit-for-tat reprisal), or breakdown of local command control, compounded by nationalist rhetoric and the lack of robust monitoring mechanisms.",
            "final_reasoning": "The current situation is highly volatile: the ceasefire is repeatedly violated, military postures have hardened, and recent incidents have resulted in fatalities and mass displacement. Historical base rates for this border (especially in periods of heightened tension) suggest that major clashes are not uncommon and can erupt with little warning. However, the short time frame until the end of 2025, intense international mediation, and the economic/diplomatic incentives for restraint all act as moderating forces. While the probability of another major deadly clash is substantially elevated above 'peacetime' baselines, the threshold of three or more fatalities in a single incident is meaningful, and the window for such an escalation is now limited. Weighing the above, I judge there is a significant risk but not a majority likelihood of a qualifying deadly clash before 2026.",
            "final_probability": 38
        }
    },
    "deliberation_probability": [
        55,
        33,
        32,
        38,
        38,
        28,
        27,
        35,
        23,
        38
    ],
    "deliberation_mean_probability": 34.7,
    "deliberation_sd": 8.794569031194447,
    "deliberation_probability_result": 35,
    "group_results": {
        "militaryIntelligenceThreatAssessmentMethodology": {
            "forecaster_to_engage": "International Relations (Realism)",
            "response_type": "critique",
            "response": "You correctly emphasize the enduring structural drivers of conflict—deep-seated territorial disputes, mistrust, and domestic political incentives—which indeed elevate the risk above historical peacetime norms. However, your probability (38%) appears to insufficiently weight the operational pattern since July: after the initial intense clashes, subsequent incidents have consistently resulted in low casualties (1-2 fatalities per event) despite ceasefire failures and mutual provocations. This suggests both sides are exercising a degree of tactical restraint even as strategic grievances persist. From a military intelligence threat assessment perspective, the distinction between ongoing low-level violence and an incident crossing the 3+ fatality threshold is significant—especially in a short window. Furthermore, the presence of high-alert postures and external mediation simultaneously heightens the risk of miscalculation but also increases the likelihood that any escalation will be rapidly contained. While your estimate reflects the elevated context, a sharper differentiation between the base rate of all deadly clashes and those specifically meeting the 3+ fatality criterion in a compressed timeframe could further refine your assessment."
        },
        "diplomaticAffairsTrackTwoDiplomacyPractice": {
            "forecaster_to_engage": "Crisis Management (Incident Command System)",
            "response_type": "defense",
            "response": "Your assessment deserves defense from a Track Two diplomacy perspective because it carefully balances the volatility on the ground with the constraining influence of international engagement and crisis management protocols. You rightly note that while operational friction and unresolved grievances elevate risk, the presence of incident command structures, high-level mediation, and rapid diplomatic communication channels significantly reduce the likelihood of escalation into a mass-casualty event. This mirrors the logic of Track Two efforts, where informal and semi-official dialogue can bridge misunderstandings and create space for de-escalation even when official talks falter. Your probability (32%) is well-calibrated for the short time window and the demonstrated pattern of restraint following recent deadly incidents, capturing the reality that the situation is dangerous but not spiraling toward another large-scale clash."
        },
        "crisisManagementIncidentCommandSystem": {
            "forecaster_to_engage": "Crisis Management (Risk Analysis Procedures)",
            "response_type": "critique",
            "response": "Your analysis correctly highlights the base rate of post-ceasefire deadly incidents and the elevated risk posed by unresolved disputes and recent kinetic events. However, from an Incident Command System perspective, your estimate (38%) may overstate the probability for this short window. The ICS framework emphasizes that after a major incident, both civil and military authorities typically impose stricter command discipline, incident escalation protocols, and crisis communication measures—especially under intense international scrutiny. The recent pattern of restraint (with incidents generally resulting in under-three fatalities) suggests these controls are having a measurable effect. Moreover, the risk of a single incident crossing the three-fatality threshold is nontrivial but must be balanced against the demonstrated ability of both sides to rapidly de-escalate after each provocation—likely a result of these crisis management processes. While the risk remains notably above peacetime baseline, the lack of recent qualifying incidents despite ample provocation supports a slightly lower probability."
        },
        "crisisManagementRiskAnalysisProcedures": {
            "forecaster_to_engage": "Security Studies (Conflict Escalation Model)",
            "response_type": "defense",
            "response": "Your estimate (35%) aligns closely with a rigorous risk analysis perspective, and you effectively distinguish between the elevated background risk due to recent deadly incidents and the moderating effects of international mediation and a short time window. Your reasoning correctly identifies the lack of robust third-party monitoring and the inability of either side to fully control their forces as key escalation drivers—factors that risk analysts also prioritize. At the same time, you appropriately temper the probability below 50% to reflect the strong de-escalatory incentives and the constraining influence of diplomatic engagement. Your analysis is well-calibrated to the evidence: it neither overreacts to recent low-level violence nor underestimates the potential for a sudden spike in casualties. This approach exemplifies solid risk management thinking, balancing both threat vectors and mitigation mechanisms."
        },
        "internationalRelationsRealism": {
            "forecaster_to_engage": "International Relations (Liberal Institutionalism)",
            "response_type": "critique",
            "response": "Your analysis rightly foregrounds the constraining influence of international institutions and economic interdependence, which are indeed important mitigating factors. However, from a Realist perspective, your probability (28%) may overstate the effectiveness of these mechanisms in the specific context of acute, militarized border disputes where core territorial interests are at stake. The repeated failure of peace agreements, ongoing tit-for-tat violence, and the demonstrated willingness of both sides to suffer international censure in defense of perceived sovereignty suggest that institutional and economic incentives are insufficient to reliably prevent escalation—especially when nationalist sentiment is high and domestic political survival is linked to a tough stance. While international attention can dampen the risk of all-out war, it is less effective at preventing sharp, sudden incidents that cross the 3+ fatality threshold, particularly when command and control at the tactical level is tenuous. Thus, your probability may underweight the risk that, in such a volatile and grievance-laden environment, control can be lost and a qualifying deadly clash can occur despite ongoing diplomatic engagement."
        },
        "internationalRelationsLiberalInstitutionalism": {
            "forecaster_to_engage": "Southeast Asian Studies (ASEAN Regionalism)",
            "response_type": "defense",
            "response": "Your estimate (23%) is well-defended from a Liberal Institutionalist viewpoint, as you emphasize the constraining effects of ASEAN, US, and Chinese diplomatic engagement, as well as the high economic and political costs of escalation for both governments. By foregrounding the fact that recent incidents have not crossed the three-fatality threshold and that both sides have consistently returned to negotiation after flare-ups, you accurately reflect the moderating power of regional institutions and external actors—key pillars of the liberal institutionalist framework. Your assessment also recognizes that while the base rate is elevated, the narrow time frame and the pattern of de-escalation after provocations make another major deadly clash less likely, not just less frequent. Overall, your analysis is a strong example of how regionalism and institutional mechanisms genuinely lower the probability of acute escalation, even in a crisis-prone context."
        },
        "securityStudiesSecuritizationTheory": {
            "forecaster_to_engage": "Southeast Asian Studies (Postcolonial Border Dispute Analysis)",
            "response_type": "critique",
            "response": "Your assessment rightly foregrounds the historical volatility of the Thai-Cambodian border and the pattern of significant clashes following periods of heightened tension. However, from a securitization perspective, your probability (38%) may underweight how the current dynamics of threat construction and audience management are working to restrain escalation. Both governments have recently engaged in securitizing moves—publicly constructing the other as a threat—but have also carefully managed the audience's expectations, emphasizing international mediation and the benefits of restraint. The pattern of the past several weeks—repeated provocations but only isolated fatalities—suggests that both elites are deliberately avoiding actions that would force them into a spiral of retaliatory violence leading to multiple deaths in a single incident. The short time window before the new year, combined with intense diplomatic engagement and the reputational risks of renewed mass violence, further reduce the likelihood that securitizing rhetoric will translate into a qualifying deadly clash. While your probability reflects the elevated risk compared to peacetime, a finer-grained reading of the current securitization and de-securitization dynamics might support a slightly lower estimate."
        },
        "securityStudiesConflictEscalationModel": {
            "forecaster_to_engage": "Military Intelligence (Threat Assessment Methodology)",
            "response_type": "defense",
            "response": "Your estimate (55%) stands out as the boldest among the group, and while it is above what I judge warranted, it is defensible from a threat assessment perspective. You rightly stress the breakdown of the ceasefire, the recent pattern of kinetic incidents, and the fact that both sides are essentially operating in a state of armed readiness with ongoing provocations. The operational focus of military intelligence highlights that, while international mediation and diplomatic engagement are present, they have not been sufficient to halt the violence or restore mutual confidence on the ground. Your approach foregrounds the practical reality that force posture and on-the-ground conditions create opportunities for escalation that may outpace political or diplomatic restraint, especially when command-and-control is imperfect. While I lean lower because of the short time window and the demonstrated pattern of keeping fatalities just below threshold, your estimate is well-justified if one views the tactical environment as fundamentally unstable and prone to abrupt surges in violence. Overall, your emphasis on operational risk and the limitations of external mediation at the tactical level is a valuable complement to more institutionally-focused or risk-mitigating frameworks."
        },
        "southeastAsianStudiesAseanRegionalism": {
            "forecaster_to_engage": "Southeast Asian Studies (Postcolonial Border Dispute Analysis)",
            "response_type": "critique",
            "response": "Your analysis correctly highlights the persistent structural risks stemming from ambiguous colonial borders and postcolonial grievances, as well as the recurring pattern of periodic escalations. However, from the perspective of ASEAN regionalism, your probability (38%) may insufficiently account for the demonstrated effects of regional and great power mediation in the past few months. While the base rate of major clashes in periods of heightened tension is non-negligible, the current environment is characterized by intense diplomatic activity, public commitments to restraint from both sides, and high-profile involvement from ASEAN, the US, and China. The recent pattern of incidents—though frequent and sometimes deadly—has not crossed the 3+ fatality threshold since July, and each episode has been followed by de-escalatory rhetoric and action. The short time frame until the end of 2025, combined with the reputational and economic costs of renewed large-scale violence, further reduce the likelihood of a qualifying incident. A more nuanced weighting of these constraining factors could support a slightly lower probability in line with recent empirical trends."
        },
        "southeastAsianStudiesPostcolonialBorderDisputeAnalysis": {
            "forecaster_to_engage": "Security Studies (Securitization Theory)",
            "response_type": "defense",
            "response": "While you suggest that my estimate (38%) may overstate the risk given the current dynamics of threat construction and audience management, I would defend my assessment by emphasizing that securitization processes in the Thai-Cambodian context are inherently unstable and prone to rapid shifts. The pattern of repeated provocations, public framing of existential threats, and the lack of robust third-party monitoring means that even carefully managed rhetorical restraint can quickly unravel—especially if a local commander overreacts or a high-profile incident occurs. The historical record for this border is replete with sudden escalations outpacing elite intentions, particularly when nationalist pressure is high. Furthermore, while both governments have incentives to de-escalate, the ongoing cycle of accusations and tactical-level violence keeps the risk of a qualifying deadly incident meaningfully elevated. Thus, while I appreciate the role of securitization/de-securitization dynamics, the persistent volatility and recent operational history justify a higher probability than a purely discourse-driven analysis might suggest."
        }
    },
    "revision_results": {
        "Military Intelligence (Threat Assessment Methodology)": {
            "my_phase1_final_probability": 55,
            "reasoning_for_revised_probability": "After reviewing other forecasters’ arguments, especially those emphasizing the empirical pattern since July—wherein post-ceasefire violence has produced fatalities but not reached the threshold of three or more deaths per incident—I am persuaded that the operational environment, while volatile, has so far produced restraint at the tactical level. The convergence of most informed estimates around a lower (25–40%) band, and the notable shortfall of recent incidents from the qualifying threshold, suggest my initial probability may have been too high given the short time window. While I maintain that the risk is elevated due to fragile ceasefire structures and ongoing provocations, the evidence points to a slightly lower probability that a single incident will escalate to 3+ deaths before 2026. I am revising my probability downward accordingly.",
            "revised_probability": 40
        },
        "Diplomatic Affairs (Track Two Diplomacy Practice)": {
            "my_phase1_final_probability": 33,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, particularly the critique of the Realist perspective and the defense of the Incident Command System approach, I am persuaded that recent operational patterns—namely, the persistent but low-casualty nature of post-July border incidents—should be given slightly more weight. Both sides are showing restraint at the tactical level despite unresolved strategic grievances. The consistent failure for recent incidents to cross the 3+ fatality threshold, even amid provocations and breakdowns in formal mechanisms, suggests that the threshold for another major deadly clash is meaningfully higher than a simple tally of ceasefire breaches would imply. The short time window until year's end, combined with active international mediation and informal dialogue, further dampens the risk of a qualifying incident. Therefore, I am revising my probability downward by a few points to reflect this more granular operational reality, though I still see a nontrivial risk given the volatility and lack of trust.",
            "revised_probability": 28
        },
        "Crisis Management (Incident Command System)": {
            "my_phase1_final_probability": 32,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, particularly the critiques and defenses regarding the operational patterns since July and the effects of crisis management protocols, my view is reinforced that the probability of another qualifying deadly clash is meaningfully elevated but not greater than 1-in-3. The critiques of higher estimates (e.g., 38%) are persuasive: recent incidents have shown a consistent pattern of restraint, with fatalities generally not exceeding the 3+ threshold, likely due to improved ICS measures and international scrutiny. The time window is also very short, which reduces the overall risk. No new information emerged that would justify changing the probability, so I maintain my original estimate.",
            "revised_probability": 32
        },
        "Crisis Management (Risk Analysis Procedures)": {
            "my_phase1_final_probability": 38,
            "reasoning_for_revised_probability": "Group deliberation reinforced key elements of my initial assessment: the background risk is meaningfully elevated due to recent incidents, fragile ceasefire, and lack of robust monitoring. However, critiques from both the Incident Command System and Military Intelligence perspectives highlighted that, since July, nearly all violent incidents have resulted in fewer than three deaths per event, despite provocations and operational friction. This pattern suggests that, even amid volatility, both sides are exercising measurable tactical restraint, likely amplified by crisis management protocols and international scrutiny. The ICS critique specifically notes that the probability of a 3+ fatality incident should be adjusted downward given repeated non-qualifying incidents and rapid de-escalation responses. The defense of the Conflict Escalation Model also supports a substantial but sub-50% probability, emphasizing real escalation drivers but correctly identifying the short window and international engagement as meaningful constraints. Weighing these arguments, I am persuaded to slightly reduce my estimate. While the risk remains appreciably above peacetime and the threat of escalation is real, the empirical evidence of recent restraint in casualty numbers, combined with strong crisis management and diplomatic incentives, justifies a modest downward adjustment.",
            "revised_probability": 32
        },
        "International Relations (Realism)": {
            "my_phase1_final_probability": 38,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, especially the critiques from Military Intelligence and Incident Command System perspectives, I see persuasive arguments that the operational pattern since the July escalation features a consistent tactical restraint: repeated incidents have not reached the 3+ fatality threshold, despite persistent provocations and low-level violence. Both sides are under strong international scrutiny, and there is evidence of rapid de-escalation after incidents. The short window to resolution further lowers the chance of a qualifying deadly clash. While my original estimate weighted the acute structural drivers of conflict and the fragility of the ceasefire, I now recognize that the threshold for a 3+ fatality event is slightly less likely to be crossed than I initially assessed. Balancing the structural Realist drivers with the demonstrated operational restraint, I revise my probability modestly downward.",
            "revised_probability": 32
        },
        "International Relations (Liberal Institutionalism)": {
            "my_phase1_final_probability": 28,
            "reasoning_for_revised_probability": "Group deliberation reinforced the importance of both operational patterns and institutional constraints. Several forecasters, particularly those with crisis management and ASEAN regionalism expertise, highlighted that although the environment is volatile and the base rate of post-ceasefire incidents is non-negligible, there is a consistent pattern of restraint: recent violent exchanges have not crossed the 3+ fatality threshold, and both sides rapidly return to negotiation after flare-ups. The most persuasive critiques of lower probabilities came from Realist and Risk Analysis perspectives, who emphasized the enduring risks of miscalculation and the limitations of institutional influence in the face of strong nationalist incentives and weak tactical control. However, the Crisis Management (ICS) and ASEAN Regionalism forecasters convincingly argued that the short time window, high international scrutiny, and repeated demonstration of de-escalation protocols materially reduce the risk of a qualifying deadly clash. The consensus clustered in the high 20s to mid-30s, and my own Liberal Institutionalist reading is further supported by the lack of any qualifying incident since July despite numerous opportunities for escalation. As such, I see no compelling reason to raise my probability, and the arguments for a slightly lower probability (23-27%) are solid but do not outweigh the persistent volatility and unresolved grievances. Therefore, I will hold my estimate steady.",
            "revised_probability": 28
        },
        "Security Studies (Securitization Theory)": {
            "my_phase1_final_probability": 27,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I note that most forecasters converge in the 23–38% probability range, with only Military Intelligence adopting a more elevated (55%) outlook based on base rates and the ongoing operational volatility. Critiques and defenses highlight the importance of the distinction between persistent low-level violence and escalation to a qualifying deadly clash (3+ fatalities). The discussion with Southeast Asian Studies (Postcolonial Border Dispute Analysis) reinforces my view that, while historical volatility is significant, current securitization dynamics and audience management are actively constraining leaders from crossing the fatality threshold. The defense of Crisis Management (Incident Command System) and the critique of International Relations (Realism) both reinforce the point that operational restraint and international mediation are currently effective at preventing major escalations. No new information emerged to suggest an upward revision is necessary; if anything, the consensus and reasoning suggest my initial estimate is well-calibrated or could even be nudged slightly lower. However, to avoid overconfidence and recognize the meaningful, if minority, possibility of accidental escalation, I will hold my probability at 27%.",
            "revised_probability": 27
        },
        "Security Studies (Conflict Escalation Model)": {
            "my_phase1_final_probability": 35,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, most forecasters converged around a moderate risk estimate (generally 27–38%), with the notable exception of the Military Intelligence forecaster at 55%. Critiques emphasized the difference between ongoing low-level violence and the likelihood of a qualifying 3+ fatality event, especially in a short time window. Defenses and critiques alike highlighted the constraining effect of high-level mediation and the demonstrated pattern of tactical restraint, even in the face of provocations and ceasefire violations. The operational environment remains volatile, but command discipline and diplomatic pressure have so far kept recent incidents below the threshold. The more extreme estimate (55%) is defensible from a threat assessment angle, but the weight of evidence—including the strong disincentives for major escalation and absence of recent incidents meeting the fatality threshold—supports a probability below 40%. My initial 35% estimate is in line with both base rates and the group’s collective reasoning. I therefore see no compelling reason to revise my forecast.",
            "revised_probability": 35
        },
        "Southeast Asian Studies (ASEAN Regionalism)": {
            "my_phase1_final_probability": 23,
            "reasoning_for_revised_probability": "Reviewing the group deliberation, most forecasters assigned probabilities in the 28-38% range, with only the military intelligence/threat assessment forecaster going significantly higher (55%). The consensus among experts—including those focused on crisis management, diplomatic affairs, and regional studies—is that while the risk is meaningfully elevated given the fragile ceasefire and repeated provocations, the short time window, demonstrated operational restraint, and strong international engagement (ASEAN, US, China) all act as significant dampeners. Critiques of higher estimates emphasized that the recent fatal incidents have not breached the 3+ threshold and that rapid de-escalation protocols are operational. However, some defenses of higher probabilities persuasively highlighted the unpredictability of tactical escalation in such a volatile environment and the possibility that a single miscalculation could quickly cross the qualifying threshold. On balance, these arguments suggest my initial estimate may have slightly underweighted the possibility of an abrupt, qualifying incident, but not by a wide margin. Therefore, I will modestly increase my probability, but keep it below the modal cluster of 28-38%, as my regionalist perspective still gives significant weight to institutional and diplomatic constraints.",
            "revised_probability": 26
        },
        "Southeast Asian Studies (Postcolonial Border Dispute Analysis)": {
            "my_phase1_final_probability": 38,
            "reasoning_for_revised_probability": "After considering the group deliberation, it is clear that most expert forecasts converge in the 27–38% range, with one outlier (Military Intelligence) at 55%. The critiques from both Security Studies (Securitization Theory) and ASEAN Regionalism suggest that the current international and regional diplomatic engagement, combined with the pattern of restraint (incidents not crossing the 3+ fatality threshold), may justify a slight downward adjustment. However, defenses from Crisis Management (Risk Analysis Procedures) and Security Studies (Conflict Escalation Model) underscore that the volatility and operational risks remain high, and the historical pattern for this border during tense periods includes abrupt escalations. Weighing these arguments, I recognize that my original estimate may slightly overstate the probability given the short time window, intense mediation, and the pattern of near-threshold but not qualifying incidents. Nonetheless, I do not see strong justification for a large downward revision, as the situation remains acutely unstable and a single miscalculation could tip the balance. Therefore, I make a modest downward revision.",
            "revised_probability": 34
        }
    },
    "revision_probability": [
        40,
        28,
        32,
        32,
        32,
        28,
        27,
        35,
        26,
        34
    ],
    "revision_mean_probability": 31.4,
    "revision_sd": 4.29987079909256,
    "revision_probability_result": 31,
    "question_details": {
        "id": 38849,
        "title": "Will there be another deadly clash between Thailand and Cambodia, resulting in three or more fatalities, before 2026?",
        "created_at": "2025-08-31T05:08:37.597858Z",
        "open_time": "2025-11-18T10:48:35Z",
        "cp_reveal_time": "2025-11-18T12:18:35Z",
        "spot_scoring_time": "2025-11-18T12:18:35Z",
        "scheduled_resolve_time": "2026-01-01T06:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-11-18T12:18:35Z",
        "actual_close_time": "2025-11-18T12:18:35Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "This question is synced with an identical question on Metaculus. The original question opened on 2025-07-30 21:28:00 and can be found [here](https://www.metaculus.com/questions/39002). This question will resolve to the same value as the synced question. The original question's background info at this time is below. \n\nAfter a brief border conflict killing at least 20 military personnel on both sides, Thailand and Cambodia agreed to a ceasefire on July 28, 2025, which they [reaffirmed](https://apnews.com/article/thailand-cambodia-ceasefire-china-brokered-1970718e765717be6f7e3f69e0c006f3) two days later. Despite the ceasefire, skirmishes continued, including an [incident](https://en.freshnewsasia.com/index.php/en/localnews/62630-2025-07-30-08-31-00.html) in which up to 20 Cambodian troops were captured and possibly two killed on July 30, 2025. According to [Deutsche Welle](https://www.dw.com/en/will-the-cambodia-thailand-ceasefire-hold/a-73448995):\n\n> Matthew Wheeler, a senior analyst for the International Crisis Group in Bangkok, said Monday's truce could take hold — as long as both sides \"recognize their interests are better served by a ceasefire than further fighting.\"\n\n> He said the deal could hit some snags over the details, though, including how exactly to monitor the ceasefire, which has yet to be worked out in full.\n\n> Malaysia, as ASEAN chair, has offered to coordinate a monitoring team. But Wheeler says neither side is keen to host monitors from other countries.\n\n> \"There was a plan to introduce Indonesian observers under ASEAN auspices after fighting in 2011, but it never happened,\" he said. Even so, he added, \"both militaries have in the past demonstrated a capacity to de-escalate after earlier rounds of fighting.\"\n\n`{\"format\":\"metac_closes_in_period\",\"info\":{\"post_id\":39002,\"question_id\":38336}}`",
        "resolution_criteria": "This question resolves as **Yes** if, after July 31, 2025 and before January 1, 2026, there is a deadly clash between the military forces of Thailand and Cambodia, resulting in three or more total fatalities between both sides, according to [credible sources](https://www.metaculus.com/faq/#definitions).",
        "fine_print": "To count, a clash must either be [kinetic](https://en.wikipedia.org/wiki/Kinetic_military_action) (using explosive weaponry) or involve physical violence such as the close-quarters combat that occurred at[ Galwan Valley](https://en.wikipedia.org/wiki/2020%E2%80%932021_China%E2%80%93India_skirmishes#Galwan_Valley_clash) between forces of India and China in June 2020. Non-kinetic or non-physical actions such as a cyberattack would not count, even ones resulting in deaths.\n\nFor the purposes of this question, “military forces” means\n\n* personnel of the Royal Thai Armed Forces\n* personnel of the Royal Cambodian Armed Forces\n* law‑enforcement personnel of either state\n* or any paramilitary or militia group allied with any of the above - for example, Thahan Phran (Thai Rangers).",
        "post_id": 39472,
        "aggregations": {
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Tensions Between Thailand and Cambodia: Thai Military Detects New Landmines on Border**\nTailandia has accused Cambodia of violating the existing peace agreement after detecting new landmines along their shared border, following the injury of two Thai soldiers in a mine explosion the previous week. The Thai government and military presented evidence of the mine placements during a press conference, with government spokesperson Siripong Angskasakulkiat stating that Thailand will pursue bilateral mechanisms with Cambodia first, but reserves the right to escalate to multilateral measures if needed. He emphasized that Thailand will respond appropriately to provocations. Foreign Ministry spokesperson Nikorndej Balankura confirmed that Prime Minister Anutin Charnvirakul will send an official letter to U.S. President Donald Trump to reaffirm Thailand's position on suspending the Joint Declaration due to Cambodia's alleged breach. The letter, stemming from prior phone conversations, focuses solely on border security and excludes commercial issues. Balankura expressed hope that international pressure, particularly from the U.S., would prompt Cambodia to comply with its commitments. Trump has acknowledged Thailand’s concerns but has not publicly commented on the crisis. The peace agreement, signed in the presence of the U.S. president, aimed to end hostilities following violent clashes in July that caused over 40 deaths and displaced approximately 300,000 people. Historical tensions between the two nations date back over a century, with the recent July clashes triggered by Thailand’s accusation that Cambodia placed mines along the border—a claim Cambodia denies categorically. The conflict involved gunfire, bombings, and rocket launches, leading to the withdrawal of ambassadors and the closure of border crossings, allowing only the return of Cambodian migrant workers. The October peace deal included joint demining operations, removal of heavy weaponry, and ASEAN-coordinated international observers. Although Cambodia announced the withdrawal of destructive weapons, regional experts warn that without addressing the underlying territorial dispute, peace remains fragile and provisional.\nOriginal language: es\nPublish date: November 17, 2025 07:10 PM\nSource:[infobae](https://www.infobae.com/america/mundo/2025/11/17/tension-entre-tailandia-y-camboya-el-ejercito-tailandes-detecto-nuevas-minas-terrestres-en-la-frontera/)\n\n**Over 800 Cambodian Families Displaced by Border Incident; Cambodia Condemns Thai Forces' Use of Force**\nOver 800 Cambodian families were displaced due to a border incident on Wednesday, November 12, 2025, in the village of Prey Chan, where one person died and three were seriously injured in a shooting by Thai forces. Authorities and donors are providing essential humanitarian aid to hundreds of residents who fled to the Wat Chan Sy Samaky Ratanaram sanctuary. Although no further armed incidents were reported on November 13 and 14, the alert level remains high in Prey Chan and Chouk Chey, according to Cambodia’s national news agency AKP. Banteay Meanchey provincial governor Oum Reatrey stated that 'the Royal Government will not allow any citizen to be in a vulnerable situation during this difficult moment.' On November 15, State Secretary Sophea Eat informed the diplomatic corps and international organizations about the incident, formally protesting the Thai military's use of force and emphasizing that it disrupted ongoing demarcation efforts agreed upon in October. She referenced a prior landmine incident on November 10 near the Preah Vihear temple—historically contaminated since the 1980s war—as a case requiring investigation but cautioned against letting it hinder peace efforts. Sophea Eat reaffirmed Cambodia’s commitment to the July 28 ceasefire agreement and the October 26 Kuala Lumpur Joint Declaration on peaceful dispute resolution. The Ministry of Foreign Affairs and International Cooperation condemned the shooting as a 'grave violation of Cambodia’s sovereignty and territorial integrity,' a breach of international humanitarian law, and a violation of the UN Charter, ASEAN Charter, and the Southeast Asia Friendship and Cooperation Treaty. The ministry also highlighted Cambodia’s 'maximum moderation' in refraining from retaliation, including after the tragic shooting of civilians, to preserve the fragile truce.\nOriginal language: es\nPublish date: November 17, 2025 05:37 AM\nSource:[prensa-latina.cu](https://www.prensa-latina.cu/2025/11/17/mas-de-800-familias-camboyanas-desplazadas-por-incidente-fronterizo/)\n\n**Thai King’s Historic Visit to China Amid Border Tensions with Cambodia**\nOn November 13, 2025, King Maha Vajiralongkorn of Thailand arrived in Beijing, marking the first official state visit by a Thai monarch to China in decades. The visit was met with high-level Chinese hospitality, including a formal welcome ceremony and structured diplomatic talks, signaling the importance of Sino-Thai relations and being described by observers as a 'milestone' in regional diplomacy. However, on November 12, 2025, just one day before the king's arrival, intense gunfire erupted along the Thai-Cambodian border. Cambodia's Ministry of Defense accused Thai forces of opening fire on civilians, injuring five, and violating a ceasefire agreement. Thailand denied the claim, asserting that Cambodian troops initiated a 10-minute artillery exchange targeting a Thai border base, and stated it had maintained restraint despite being prepared to respond. This clash ended a fragile ceasefire that had lasted less than a month. Cambodian Prime Minister Hun Manet swiftly ordered border troops to full alert and deployed reinforcements, reaffirming his hardline stance established during a similar conflict in July 2025. The underlying cause of the conflict is the longstanding, unresolved border dispute spanning over 800 kilometers, with contested territories, resource competition, and historical grievances. The situation intensified after a Thai soldier was injured on November 10 from a mine, which Thailand blamed on Cambodia’s new mine-laying, while Cambodia claimed it was a legacy mine from past conflicts. This incident led Thailand to suspend implementation of the 'Peace Joint Statement' and halt the release of Cambodian prisoners of war, pushing tensions to a breaking point. While some speculated the conflict was orchestrated to disrupt the Thai king’s visit, this theory lacks credible evidence. The Sino-Thai visit, planned since May 2025, aims to strengthen 'family-like' ties and advance cooperation in trade, security, and military domains—evidenced by a May meeting between Chinese Defense Minister Dong Jun and Thai Armed Forces Commander Songwit, which confirmed joint military exercises and personnel training. The conflict has deep historical roots and is unrelated to Sino-Thai relations. Thailand’s decision to proceed with the visit despite the crisis underscores its commitment to dialogue and signals to Cambodia that peaceful resolution is possible. China, as a neutral mediator, has previously facilitated de-escalation and continues to play a constructive role. The high-level reception of the Thai king conveys a broader diplomatic message: 'dialogue over confrontation.' This atmosphere pressures both Thailand and Cambodia to de-escalate. Prolonged conflict would harm both nations, disrupting cross-border civilian life and economic development. Thailand seeks a stable neighborhood to support its China-focused cooperation, while Cambodia prioritizes its relationship with Beijing. The Chinese diplomatic gesture is thus both a sign of goodwill and a strategic signal. Ultimately, the coexistence of the king’s visit and the border conflict reflects the complexity of international relations. The most rational path forward is for both sides to return to negotiations, leveraging China’s mediation, to resolve disputes peacefully. The gunfire may be fleeting, but the enduring friendship between Thailand and China remains intact, and regional stability depends on mutual restraint and dialogue.\nOriginal language: zh\nPublish date: November 17, 2025 03:15 AM\nSource:[搜狐](https://mil.sohu.com/a/954713674_121997470?scm=10001.279_13-101000-0_922.0-0.0.a2_5X162X1532)\n\n**Great Power Rivalry Sparks Political, Economic, and Social Tensions in Small States: The Case of Thailand and Cambodia**\nOver the past week, Thailand and Cambodia's peace declaration was ruptured by a border mine explosion, prompting urgent mediation by ASEAN and the United States. King Vajiralongkorn of Thailand made a rare visit to Beijing, highlighting the difficult strategic choices facing small nations amid great power competition. The Taiwan issue reignited tensions between China and Japan, underscoring the high sensitivity of security in the Asia-Pacific region. Analysts普遍认为，超级大国之间缺乏互信，中美博弈的结构性矛盾无法因暂时的止损措施而改变, and Southeast Asian nations remain inevitably affected. Recent border clashes between Thailand and Cambodia resulted in injuries to two Thai soldiers, prompting Thailand to suspend implementation of a peace agreement. Cambodia denied the allegations and continued calling for the release of 18 Cambodian prisoners. The conflict erupted after the two countries signed the Kuala Lumpur Joint Declaration under the witness of U.S. President Donald Trump and ASEAN Chair Anwar Ibrahim, committing to resolve border disputes through ASEAN mechanisms. Following the renewed violence, ASEAN Chair Anwar Ibrahim initiated mediation, urging adherence to the agreement. He reported positive feedback from both leaders, who reaffirmed their commitment to peaceful resolution. ASEAN welcomed the removal of heavy weapons and destruction of weapons from border areas and coordinated humanitarian demining efforts. U.S. President Trump also engaged in phone diplomacy, stating he participated in efforts to implement the peace agreement, and claimed the two nations 'would be fine.' Reports indicate Trump reportedly requested that Beijing representatives not attend the signing ceremony, which Thailand reportedly respected. The border conflict, rooted in ambiguous colonial-era boundaries drawn by France, centers on the Preah Vihear Temple, which the International Court of Justice ruled in 1962 and reaffirmed in 2013 belonged to Cambodia—though Thailand continues to contest the decision. The ongoing tensions have led to closed trade ports, economic losses, and civilian displacement. ASEAN's mediation has yielded limited progress. Rising nationalism in both countries exacerbates internal social tensions, with Cambodia favoring international court resolution and Thailand preferring bilateral talks. Thai Foreign Minister Sihasak Phuangketkeow presented a briefing to 59 foreign envoys and four international organizations, asserting that mines were planted after the ceasefire agreement and accusing Cambodia of violating the Ottawa Convention. Thailand presented four demands: 1) acknowledgment of new mine placement; 2) responsibility for damages; 3) bilateral rules negotiation; and 4) access to 13 border zones for demining. Thai media reported that the U.S. suspended tariff talks until the peace agreement is upheld. Prime Minister Anutin reiterated Thailand’s stance on social media, stating that the agreement would not be resumed without compliance. The Thai Foreign Ministry later revealed that Trump informed Anutin that the U.S. would not intervene bilaterally, and that trade negotiations would continue independently of the border dispute. The U.S. continues to impose a 19% baseline tariff on Thai goods. Cambodian Prime Minister Hun Manet thanked Anwar Ibrahim and Trump for their role in promoting peace and reaffirmed Cambodia’s commitment to the spirit of the Kuala Lumpur Declaration. Thai media expressed disappointment over U.S. pressure, with journalist Suthichai Yoon stating that today’s trade is inherently political, with 'security' casting a shadow over every transaction—a hallmark of Trump-era Realpolitik. In contrast to past idealistic strategies emphasizing democracy and human rights, realism now prevails. Coinciding with the 50th anniversary of Thailand-China diplomatic ties, King Vajiralongkorn visited China from November 13–17, 2025, marking the first visit by a reigning Thai monarch to China. The Thai government stated the visit reflects deep friendship and mutual understanding. President Xi Jinping affirmed China’s willingness to strengthen strategic alignment with Thailand, advance major projects like the China-Thailand Railway, expand imports of high-quality Thai agricultural products, and deepen cooperation in emerging sectors such as AI, digital economy, and aerospace. China has been Thailand’s largest trading partner for 12 consecutive years. In the first half of 2025, bilateral trade reached $76.1 billion, up 17% year-on-year. Thai Prime Minister Anutin revealed on Facebook that China will purchase 500,000 tons of Thai rice under a government-to-government agreement, a key outcome of a bilateral meeting at the APEC summit in Busan. Meanwhile, Thailand maintains over 200 years of traditional ties with the U.S., and its Cold War-era status as a key U.S. strategic ally in Asia remains significant. The King’s visit is widely seen as a strategic diplomatic move. Southeast Asian media have closely monitored the sudden escalation of Sino-Japanese tensions over the Taiwan issue. After Japanese Prime Minister Sanae Takaichi stated 'if Taiwan is attacked, Japan will be affected,' China’s Consul General in Osaka, Xue Jian, responded with a 'decapitation theory' and warned Chinese citizens against traveling to Japan. China’s military media reported that the PLA Southern Theater Command conducted bomber patrols over the South China Sea to deter the Philippines’ joint patrols with Australia, New Zealand, and the U.S., accusing Manila of destabilizing regional peace. Beijing urged Manila to cease provocations. The U.S., whose core interests are at stake in Taiwan, has seen Defense Secretary Peter Brian Hegseth reiterate that Washington does not seek conflict but will continue to defend its interests in the region. Hegseth advanced military cooperation with India, Malaysia, and the Philippines during the Kuala Lumpur summit, signaling clear intent toward China. Singapore’s Prime Minister and Finance Minister Lawrence Wong recently warned that rising protectionism, populism, and rapid technological change are exacerbating inequality and internal pressures, fueling political polarization and social fractures—posing a major challenge for nations to prevent. Philippine President Ferdinand Marcos Jr. faces growing domestic pressure. The Philippine religious group INC held large-scale anti-corruption protests in Manila from November 16–18, supported by civil groups nationwide. Amid calls for anti-graft measures and democratic reform, rumors of a military coup by retired generals circulated. Economic growth remains weak, and officials now expect to revise downward the 2025 growth target of 5.5%–6.5%.\nOriginal language: zh\nPublish date: November 16, 2025 10:31 AM\nSource:[RFI](https://www.rfi.fr/cn/%E4%B8%93%E6%A0%8F%E6%A3%80%E7%B4%A2/%E6%9B%BC%E8%B0%B7%E4%B8%93%E6%A0%8F/20251116-%E5%A4%A7%E5%9B%BD%E5%8D%9A%E5%BC%88-%E6%BF%80%E5%8F%91%E5%B0%8F%E5%9B%BD%E6%94%BF%E7%BB%8F%E7%A4%BE%E4%BC%9A%E7%9F%9B%E7%9B%BE)\n\n**Trump calls Thailand, Cambodia after new clashes | Borneo Post Online**\nUS President Donald Trump stated on November 15, 2025, that he called the leaders of Thailand and Cambodia to reinforce the peace deal he co-signed on October 26, 2025, during a visit to Asia. The truce, brokered in Kuala Lumpur, aimed to end five days of intense fighting in the summer of 2025 that resulted in 43 deaths and displaced approximately 300,000 people. Fresh clashes erupted on November 13, 2025, in Banteay Meanchey province along the Cambodia-Thailand border, with Phnom Penh reporting the death of a civilian. Thailand suspended the agreement on November 10, 2025, following an alleged landmine blast. Trump claimed on Air Force One that he had 'stopped a war just today through the use of tariffs, the threat of tariffs,' and expressed confidence that the situation would improve, stating, 'They’re doing great. I think they’re gonna be fine.' The White House confirmed Trump also spoke with Malaysia, which had acted as a mediator. The underlying dispute stems from a century-old border disagreement from French colonial rule, with both nations contesting several boundary temples. The ASEAN Observer Team (AOT) visited the site of the civilian death on November 13, 2025, as documented in a photo released by Agence Kampuchea Press (AKP).\nOriginal language: en\nPublish date: November 15, 2025 07:03 AM\nSource:[theborneopost.com](https://www.theborneopost.com/2025/11/15/trump-calls-thailand-cambodia-after-new-clashes/)\n\n**Tensions Between Thailand and Cambodia: Thai Military Detects New Landmines on Border**\nTailandia has accused Cambodia of violating the existing peace agreement after detecting new landmines along their shared border, following the injury of two Thai soldiers in a mine explosion the previous week. The Thai government and military presented evidence of the mine placements during a press conference, with government spokesperson Siripong Angskasakulkiat stating that Thailand will pursue bilateral mechanisms with Cambodia first, but reserves the right to escalate to multilateral measures if needed. He emphasized that Thailand will respond appropriately to provocations. Foreign Ministry spokesperson Nikorndej Balankura confirmed that Prime Minister Anutin Charnvirakul will send an official letter to U.S. President Donald Trump to reaffirm Thailand's position on suspending the Joint Declaration due to Cambodia's alleged breach. The letter, stemming from prior phone conversations, focuses solely on border security and excludes commercial issues. Balankura expressed hope that international pressure, particularly from the U.S., would prompt Cambodia to comply with its commitments. Trump has acknowledged Thailand’s concerns but has not publicly commented on the crisis. The peace agreement, signed in the presence of the U.S. president, aimed to end hostilities following violent clashes in July that caused over 40 deaths and displaced approximately 300,000 people. Historical tensions between the two nations date back over a century, with the recent July clashes triggered by Thailand’s accusation that Cambodia placed mines along the border—a claim Cambodia denies categorically. The conflict involved gunfire, bombings, and rocket launches, leading to the withdrawal of ambassadors and the closure of border crossings, allowing only the return of Cambodian migrant workers. The October peace deal included joint demining operations, removal of heavy weaponry, and ASEAN-coordinated international observers. Although Cambodia announced the withdrawal of destructive weapons, regional experts warn that without addressing the underlying territorial dispute, peace remains fragile and provisional.\nOriginal language: es\nPublish date: November 17, 2025 07:10 PM\nSource:[infobae](https://www.infobae.com/america/mundo/2025/11/17/tension-entre-tailandia-y-camboya-el-ejercito-tailandes-detecto-nuevas-minas-terrestres-en-la-frontera/)\n\n**Thailand Suspends 'Peace Declaration' with Cambodia After Border Mine Incident**\nThailand has suspended the implementation of the declaration on conflict resolution with Cambodia, according to the Ministry of Foreign Affairs of Thailand. Prime Minister Anutin Charnvirakum sent official letters to U.S. President Donald Trump and Malaysian Prime Minister Anwar Ibrahim, stating that Thailand is pausing the declaration aimed at de-escalating tensions. The move follows a mine explosion in a border region that killed four Thai soldiers, which Thailand attributed to Cambodia. Authorities claimed the mines were placed on areas recently cleared of landmines, accusing Cambodia of a serious violation of the agreement. As a result, Thailand halted the withdrawal of heavy military equipment from the border and postponed the release of Cambodian prisoners of war. The border conflict intensified in May 2025, leading to full-scale fighting, but a ceasefire was agreed upon in July 2025. In October 2025, the declaration on relations was signed in Kuala Lumpur in the presence of U.S. and Malaysian leaders. The Ministry emphasized that Thailand reserves the right to defend its sovereignty, territorial integrity, and national security, with future actions dependent on Cambodia’s conduct.\nOriginal language: ru\nPublish date: November 17, 2025 01:04 PM\nSource:[���.Ru // �������, �����, �������� ���������� ���, ������-������� ���, ��������� �������](https://www.ntv.ru/novosti/2949527/)\n\n**Trump Seeks Credit for Cambodia-Thailand Ceasefire, U.S. Officials Downplay China's Role**\nIn July 2024, a border conflict erupted between Cambodia and Thailand near the disputed Ta Mo Anong Temple, resulting in civilian casualties and mass displacement. The conflict was resolved with a ceasefire agreement signed on August 7, 2024. China played a visible and active role in mediating the conflict, with both Cambodia and Thailand publicly thanking Beijing for its efforts. Chinese Foreign Minister Wang Yi engaged in multiple diplomatic initiatives, including hosting a trilateral informal meeting in Shanghai on July 30, 2024, and organizing a tea talk in Anning, Yunnan, on August 14, 2024, with Cambodian and Thai foreign ministers. Both countries reiterated their commitment to the ceasefire and praised China's constructive role. Despite this, a senior U.S. official claimed on October 24, 2024, that China had 'not played a significant or substantive role' in the peace talks. The U.S. reportedly pressured the organizers of the 47th ASEAN Summit in Malaysia to exclude Chinese officials from the official ceasefire signing ceremony, aiming to center attention on President Donald Trump. Trump sought to leverage the event to promote his image as a 'chief peacemaker' and bolster his bid for the Nobel Peace Prize, which he had openly pursued since returning to office in January 2024. However, the Nobel Peace Prize was awarded on October 10, 2024, to María Corina Machado of Venezuela, and Trump did not receive it.\nOriginal language: zh\nPublish date: November 17, 2025 10:15 AM\nSource:[guancha.cn](https://www.guancha.cn/internation/2025_10_25_794521.shtml?s=sywglbt)\n\n**Over 800 Cambodian Families Displaced by Border Incident**\nOver 800 Cambodian families have been displaced due to a border incident involving a shooting in the village of Prey Chan on Wednesday, November 12, 2025, which resulted in one death and three serious injuries. Authorities and donors are providing essential humanitarian aid to hundreds of residents who fled to the Wat Chan Sy Samaky Ratanaram sanctuary. Although no further armed incidents were reported on November 13 and 14, the alert level remains high in Prey Chan and Chouk Chey, according to Cambodia’s national news agency AKP. Banteay Meanchey provincial governor Oum Reatrey stated that 'the Royal Government will not allow any citizen to be in a vulnerable situation during this difficult moment.' On November 15, State Secretary Sophea Eat informed diplomatic missions and international organization representatives about the border events. She announced Cambodia’s formal protest against the Thai forces’ shooting on November 12, emphasizing that the illegitimate use of force also disrupted ongoing demarcation efforts agreed upon in October. Sophea referenced a prior landmine incident on November 10 near the Preah Vihear temple—historically contaminated since the 1980s war—calling for investigation but cautioning that it should not hinder peace efforts. She reaffirmed Cambodia’s commitment to the July 28 ceasefire agreement and the Kuala Lumpur Joint Declaration on peaceful dispute resolution, signed on October 26 by the prime ministers of Cambodia and Thailand. The Ministry of Foreign Affairs and International Cooperation declared the November 12 shooting a serious violation of Cambodia’s sovereignty and territorial integrity, a breach of international humanitarian law, and a violation of the UN Charter, ASEAN Charter, and the Southeast Asia Friendship and Cooperation Treaty. The statement highlighted Cambodia’s restraint in not retaliating against repeated provocations, including the civilian shooting, to preserve the fragile truce.\nOriginal language: es\nPublish date: November 17, 2025 06:05 AM\nSource:[Prensa latina](https://www.prensa-latina.cu/2025/11/17/mas-de-800-familias-camboyanas-desplazadas-por-incidente-fronterizo/)\n\n**Thai King’s Historic Visit to China Amid Border Tensions with Cambodia**\nOn November 13, 2025, King Maha Vajiralongkorn of Thailand arrived in Beijing, marking the first official state visit by a Thai monarch to China in decades. The visit was met with high-level Chinese hospitality, including a formal welcome ceremony and structured diplomatic talks, signaling the importance of Sino-Thai relations and being described by observers as a 'milestone' in regional diplomacy. However, on November 12, 2025, just one day before the king's arrival, intense gunfire erupted along the Thai-Cambodian border. Cambodia's Ministry of Defense accused Thai forces of opening fire on civilians, injuring five, and violating a ceasefire agreement. Thailand denied the claim, asserting that Cambodian troops initiated a 10-minute artillery exchange targeting a Thai border base, and stated it had maintained restraint despite being prepared to respond. This clash ended a fragile ceasefire that had lasted less than a month. Cambodian Prime Minister Hun Manet swiftly ordered border troops to full alert and deployed reinforcements, reaffirming his hardline stance established during a similar conflict in July 2025. The underlying cause of the conflict is the longstanding, unresolved border dispute spanning over 800 kilometers, with contested territories, resource competition, and historical grievances. The situation intensified after a Thai soldier was injured on November 10 from a mine, which Thailand blamed on Cambodia’s new mine-laying, while Cambodia claimed it was a legacy mine from past conflicts. This incident led Thailand to suspend implementation of the 'Peace Joint Statement' and halt the release of Cambodian prisoners of war, pushing tensions to a breaking point. While some speculated the conflict was orchestrated to disrupt the Thai king’s visit, this theory lacks credible evidence. The Sino-Thai visit, planned since May 2025, aims to strengthen 'family-like' ties and advance cooperation in trade, security, and military domains—evidenced by a May meeting between Chinese Defense Minister Dong Jun and Thai Armed Forces Commander Songwit, which confirmed joint military exercises and personnel training. The conflict has deep historical roots and is unrelated to Sino-Thai relations. Thailand’s decision to proceed with the visit despite the crisis underscores its commitment to dialogue and signals to Cambodia that peaceful resolution is possible. China, as a neutral mediator, has previously facilitated de-escalation and continues to play a constructive role. The high-level reception of the Thai king conveys a broader diplomatic message: 'dialogue over confrontation.' This atmosphere pressures both Thailand and Cambodia to de-escalate. Prolonged conflict would harm both nations, disrupting cross-border civilian life and economic development. Thailand seeks a stable neighborhood to support its China-focused cooperation, while Cambodia prioritizes its relationship with Beijing. The Chinese diplomatic gesture is thus both a sign of goodwill and a strategic signal. Ultimately, the coexistence of the king’s visit and the border conflict reflects the complexity of international relations. The most rational path forward is for both sides to return to negotiations, leveraging China’s mediation, to resolve disputes peacefully. The gunfire may be fleeting, but the enduring friendship between Thailand and China remains intact, and regional stability depends on mutual restraint and dialogue.\nOriginal language: zh\nPublish date: November 17, 2025 03:15 AM\nSource:[搜狐](https://mil.sohu.com/a/954713674_121997470?scm=10001.279_13-101000-0_922.0-0.0.a2_5X162X1532)\n\n**Incoming Asean chair Philippines faces a Thailand-Cambodia 'challenge'**\nThailand announced it was suspending the peace agreement with Cambodia, signed at the 47th Association of Southeast Asian Nations (ASEAN) summit in Kuala Lumpur on October 26, following reports that Cambodia laid new mines along their shared border. This led to injuries of several Thai soldiers, including one who lost a foot. Cambodia denied the allegations, with Prime Minister Hun Manet accusing Thai soldiers of killing a civilian. Despite the escalating tensions, a Thai government spokesman confirmed on Saturday that Bangkok would proceed with talks to finalize a reciprocal trade deal with the United States, stating these negotiations would remain separate from the ongoing border dispute. The incoming ASEAN chair, the Philippines, now faces the challenge of managing this bilateral conflict within the regional framework.\nOriginal language: en\nPublish date: November 17, 2025 02:30 AM\nSource:[South China Morning Post](https://www.scmp.com/week-asia/politics/article/3332959/philippines-takes-asean-helm-thailand-cambodia-dispute-be-significant-challenge)\n\n**Great Power Rivalry Sparks Political, Economic, and Social Tensions in Small States: The Case of Thailand and Cambodia**\nOver the past week, Thailand and Cambodia's peace declaration was ruptured by a border mine explosion, prompting urgent mediation by ASEAN and the United States. King Vajiralongkorn of Thailand made a rare visit to Beijing, highlighting the difficult strategic choices facing small nations amid great power competition. The Taiwan issue reignited tensions between China and Japan, underscoring the high sensitivity of security in the Asia-Pacific region. Analysts普遍认为，超级大国之间缺乏互信，中美博弈的结构性矛盾无法因暂时的止损措施而改变, and Southeast Asian nations remain inevitably affected. Recent border clashes between Thailand and Cambodia resulted in injuries to two Thai soldiers, prompting Thailand to suspend implementation of a peace agreement. Cambodia denied the allegations and continued calling for the release of 18 Cambodian prisoners. The conflict erupted after the two countries signed the Kuala Lumpur Joint Declaration under the witness of U.S. President Donald Trump and ASEAN Chair Anwar Ibrahim, committing to resolve border disputes through ASEAN mechanisms. Following the renewed violence, ASEAN Chair Anwar Ibrahim initiated mediation, urging adherence to the agreement. He reported positive feedback from both leaders, who reaffirmed their commitment to peaceful resolution. ASEAN welcomed the removal of heavy weapons and destruction of weapons from border areas and coordinated humanitarian demining efforts. U.S. President Trump also engaged in phone diplomacy, stating he participated in efforts to implement the peace agreement, and claimed the two nations 'would be fine.' Reports indicate Trump reportedly requested that Beijing representatives not attend the signing ceremony, which Thailand reportedly respected. The border conflict, rooted in ambiguous colonial-era boundaries drawn by France, centers on the Preah Vihear Temple, which the International Court of Justice ruled in 1962 and reaffirmed in 2013 belonged to Cambodia—though Thailand continues to contest the decision. The ongoing tensions have led to closed trade ports, economic losses, and civilian displacement. ASEAN's mediation has yielded limited progress. Rising nationalism in both countries exacerbates internal social tensions, with Cambodia favoring international court resolution and Thailand preferring bilateral talks. Thai Foreign Minister Sihasak Phuangketkeow presented a briefing to 59 foreign envoys and four international organizations, asserting that mines were planted after the ceasefire agreement and accusing Cambodia of violating the Ottawa Convention. Thailand presented four demands: 1) acknowledgment of new mine placement; 2) responsibility for damages; 3) bilateral rules negotiation; and 4) access to 13 border zones for demining. Thai media reported that the U.S. suspended tariff talks until the peace agreement is upheld. Prime Minister Anutin reiterated Thailand’s stance on social media, stating that the agreement would not be resumed without compliance. The Thai Foreign Ministry later revealed that Trump informed Anutin that the U.S. would not intervene bilaterally, and that trade negotiations would continue independently of the border dispute. The U.S. continues to impose a 19% baseline tariff on Thai goods. Cambodian Prime Minister Hun Manet thanked Anwar Ibrahim and Trump for their role in promoting peace and reaffirmed Cambodia’s commitment to the spirit of the Kuala Lumpur Declaration. Thai media expressed disappointment over U.S. pressure, with journalist Suthichai Yoon stating that today’s trade is inherently political, with 'security' casting a shadow over every transaction—a hallmark of Trump-era Realpolitik. In contrast to past idealistic strategies emphasizing democracy and human rights, realism now prevails. Coinciding with the 50th anniversary of Thailand-China diplomatic ties, King Vajiralongkorn visited China from November 13–17, 2025, marking the first visit by a reigning Thai monarch to China. The Thai government stated the visit reflects deep friendship and mutual understanding. President Xi Jinping affirmed China’s willingness to strengthen strategic alignment with Thailand, advance major projects like the China-Thailand Railway, expand imports of high-quality Thai agricultural products, and deepen cooperation in emerging sectors such as AI, digital economy, and aerospace. China has been Thailand’s largest trading partner for 12 consecutive years. In the first half of 2025, bilateral trade reached $76.1 billion, up 17% year-on-year. Thai Prime Minister Anutin revealed on Facebook that China will purchase 500,000 tons of Thai rice under a government-to-government agreement, a key outcome of a bilateral meeting at the APEC summit in Busan. Meanwhile, Thailand maintains over 200 years of traditional ties with the U.S., and its Cold War-era status as a key U.S. strategic ally in Asia remains significant. The King’s visit is widely seen as a strategic diplomatic move. Southeast Asian media have closely monitored the sudden escalation of Sino-Japanese tensions over the Taiwan issue. After Japanese Prime Minister Sanae Takaichi stated 'if Taiwan is attacked, Japan will be affected,' China’s Consul General in Osaka, Xue Jian, responded with a 'decapitation theory' and warned Chinese citizens against traveling to Japan. China’s military media reported that the PLA Southern Theater Command conducted bomber patrols over the South China Sea to deter the Philippines’ joint patrols with Australia, New Zealand, and the U.S., accusing Manila of destabilizing regional peace. Beijing urged Manila to cease provocations. The U.S., whose core interests are at stake in Taiwan, has seen Defense Secretary Peter Brian Hegseth reiterate that Washington does not seek conflict but will continue to defend its interests in the region. Hegseth advanced military cooperation with India, Malaysia, and the Philippines during the Kuala Lumpur summit, signaling clear intent toward China. Singapore’s Prime Minister and Finance Minister Lawrence Wong recently warned that rising protectionism, populism, and rapid technological change are exacerbating inequality and internal pressures, fueling political polarization and social fractures—posing a major challenge for nations to prevent. Philippine President Ferdinand Marcos Jr. faces growing domestic pressure. The Philippine religious group INC held large-scale anti-corruption protests in Manila from November 16–18, supported by civil groups nationwide. Amid calls for anti-graft measures and democratic reform, rumors of a military coup by retired generals circulated. Economic growth remains weak, and officials now expect to revise downward the 2025 growth target of 5.5%–6.5%.\nOriginal language: zh\nPublish date: November 16, 2025 10:31 AM\nSource:[RFI](https://www.rfi.fr/cn/%E4%B8%93%E6%A0%8F%E6%A3%80%E7%B4%A2/%E6%9B%BC%E8%B0%B7%E4%B8%93%E6%A0%8F/20251116-%E5%A4%A7%E5%9B%BD%E5%8D%9A%E5%BC%88-%E6%BF%80%E5%8F%91%E5%B0%8F%E5%9B%BD%E6%94%BF%E7%BB%8F%E7%A4%BE%E4%BC%9A%E7%9F%9B%E7%9B%BE)\n\n**Hun Manet Speaks to Donald Trump Via Phone After Thai Troops Open Fire on Cambodians | CamboJA News**\nOn November 15, 2025, Cambodian Prime Minister Hun Manet spoke by phone with U.S. President Donald Trump following an incident in which Thai troops opened fire on Cambodian civilians. Hun Manet conveyed that Trump emphasized his commitment to 'see lasting peace' between Cambodia and Thailand. Hun Manet also spoke with Malaysian Prime Minister Anwar Ibrahim, with whom he discussed efforts to maintain a peaceful resolution, reaffirming Cambodia’s commitment to using truce-established channels to address border disputes. Malaysia, as the current chair of ASEAN, has played a central role in ceasefire efforts alongside Trump. Hun Manet stated that he will continue to closely monitor the situation to ensure no further armed clashes occur along the Cambodia-Thailand border.\nOriginal language: en\nPublish date: November 15, 2025 12:32 PM\nSource:[cambojanews.com](https://cambojanews.com/hun-manet-speaks-to-donald-trump-via-phone-after-thai-troops-open-fire-on-cambodians/)\n\n**Trump calls Thailand, Cambodia after new clashes | Borneo Post Online**\nUS President Donald Trump stated on November 15, 2025, that he called the leaders of Thailand and Cambodia to reinforce the peace deal he co-signed on October 26, 2025, during a visit to Asia. The truce, brokered in Kuala Lumpur, aimed to end five days of intense fighting in the summer of 2025 that resulted in 43 deaths and displaced approximately 300,000 people. Fresh clashes erupted on November 13, 2025, in Banteay Meanchey province along the Cambodia-Thailand border, with Phnom Penh reporting the death of a civilian. Thailand suspended the agreement on November 10, 2025, following an alleged landmine blast. Trump claimed on Air Force One that he had 'stopped a war just today through the use of tariffs, the threat of tariffs,' and expressed confidence that the situation would improve, stating, 'They’re doing great. I think they’re gonna be fine.' The White House confirmed Trump also spoke with Malaysia, which had acted as a mediator. The underlying dispute stems from a century-old border disagreement from French colonial rule, with both nations contesting several boundary temples. The ASEAN Observer Team (AOT) visited the site of the civilian death on November 13, 2025, as documented in a photo released by Agence Kampuchea Press (AKP).\nOriginal language: en\nPublish date: November 15, 2025 07:03 AM\nSource:[theborneopost.com](https://www.theborneopost.com/2025/11/15/trump-calls-thailand-cambodia-after-new-clashes/)\n\n**Cambodia says Thai troops kill one in fresh border clashes**\nOn November 12, 2025, Cambodia reported that one civilian was killed and three others wounded in renewed border clashes with Thailand, following Bangkok’s pause in implementing a US-backed peace deal. The conflict, which erupted after a landmine blast wounded four Thai soldiers on Monday, saw gunfire exchanged between Thailand’s Sa Kaeo province and Cambodia’s Banteay Meanchey province, lasting about 10 minutes with no Thai casualties. Cambodian Prime Minister Hun Manet condemned the violence as a violation of humanitarian principles and recent peace agreements, sharing images and videos allegedly showing wounded civilians, though AFP could not verify their authenticity. Thai military spokesman Winthai Suvaree claimed Cambodian forces initiated fire into Thai territory, prompting Thai troops to respond with warning shots. Cambodian villagers, including Hul Malis and her husband Thong Kimleang, reported being shot at without provocation, with Malis stating, 'I am so frightened, I am running away now.' The border dispute stems from a century-old disagreement over colonial-era boundaries, with both nations claiming several temples. A truce was established on July 29, 2025, after intervention by former U.S. President Donald Trump, Chinese diplomats, and Malaysian Prime Minister Anwar Ibrahim, who chairs ASEAN. The agreement included withdrawal of heavy weapons and access for ceasefire monitors. However, Thailand has delayed releasing 18 captured Cambodian soldiers—a key condition—undermining the deal’s credibility. Experts note the agreement did not resolve the core territorial dispute.\nOriginal language: en\nPublish date: November 12, 2025 12:24 PM\nSource:[AFP](http://doc.afp.com/83RG79E)\n\n**Thailand says ceasefire with Cambodia brokered by Trump on hold after landmine kills troops**\nThailand has indefinitely paused implementation of a U.S.-brokered ceasefire with Cambodia following a landmine explosion on Monday that injured four Thai soldiers along the border in Sisaket province. The Thai army accused Cambodia of laying new mines in violation of the truce agreement signed last month, though Cambodia denied responsibility, attributing the blast to 'remnants of past conflicts' and urging Thai troops to avoid old minefield areas. Thai Prime Minister Anutin Charnvirakul visited the injured soldiers and the Thai Foreign Ministry spokesperson Nikorndej Balankura stated the incident revealed 'Cambodia's utter lack of sincerity,' demanding an apology, a thorough investigation, and preventive measures. As a result, Thailand will indefinitely postpone the return of 18 Cambodian soldiers held since the July conflict. The ceasefire, initially mediated by Malaysia and finalized during the ASEAN summit in October under pressure from President Trump—who threatened to withhold trade privileges—has been criticized by Matthew Wheeler, Southeast Asia senior analyst at the International Crisis Group, as a deal designed to placate Trump rather than resolve the underlying conflict. Wheeler noted the agreement was predictable to fail due to its transactional nature and Thailand’s strong nationalist sentiment, which hinders conciliatory diplomacy. Despite some progress in removing heavy weapons and land mines, the incident has reignited tensions. Cambodia reaffirmed its commitment to peace and civilian safety.\nOriginal language: en\nPublish date: November 11, 2025 05:22 PM\nSource:[CBS News](https://www.cbsnews.com/news/thailand-cambodia-ceasfire-trump-brokered-paused-after-landmine-kills-troops/)\n\n**Thailand says 'hostilities' remain despite Cambodia peace pact - Asia & Pacific - The Jakarta Post**\nThailand's Royal Thai Army (RTA) stated on November 11, 2025, that 'hostilities still remain' with Cambodia, suspending implementation of a US-backed peace deal brokered by former US President Donald Trump in October 2024. The suspension followed a landmine blast in Sisaket province that wounded four Thai soldiers, which Thailand accused Cambodia of violating the Ottawa Convention banning anti-personnel mines. The peace pact, signed in Kuala Lumpur on October 26 under the chairmanship of Malaysian Prime Minister Anwar Ibrahim, aimed to de-escalate a conflict that peaked in July 2024, resulting in at least 43 deaths and the displacement of approximately 300,000 civilians. Under the agreement, both sides were to withdraw heavy weapons from the border, allow ceasefire monitors access, and Thailand was to return 18 captured Cambodian troops. Cambodia claimed the mine was a relic of past conflicts, expressed regret, and stated the situation remains calm, reaffirming its commitment to the deal. However, Thailand's Prime Minister Anutin Charnvirakul confirmed the delay in releasing the captured troops, a key condition of the pact. Foreign Minister Sihasak Phuangketkeow emphasized that Cambodia must take responsibility by showing regret, participating in the investigation, and preventing future incidents. The Thai-Cambodian truce has held since July 29, but analysts note a comprehensive resolution to the underlying territorial dispute over century-old border temples remains unachieved.\nOriginal language: en\nPublish date: November 11, 2025 07:36 AM\nSource:[The Jakarta Post](https://www.thejakartapost.com/world/2025/11/11/thailand-says-hostilities-remain-despite-cambodia-peace-pact.html)\n\n**Thailand and Cambodia Agree to Ceasefire, but Doubts Remain**\nThailand and Cambodia agreed to an unconditional ceasefire after five days of deadly clashes, but doubts remain about whether the truce will hold. The agreement, reached on July 28, 2025, was met with cautious optimism. The border dispute has left at least 35 soldiers and civilians dead and forced the evacuation of 200,000 people in both countries. Zachary Abuza, a professor at the National War College in Washington, believes that both sides have achieved most of their objectives and that the truce could hold, despite possible sporadic gunfire. However, the Thai military has accused the Cambodian forces of violating the ceasefire in several areas, which the Cambodian Ministry of Defense has denied. Matthew Wheeler, a senior analyst at the International Crisis Group in Bangkok, highlights the lack of clarity on how the ceasefire will be supervised, which could hinder the agreement. Paul Chambers, an analyst at the Yusof Ishak Institute in Singapore, notes that without third-party supervision, it is difficult for any ceasefire agreement to be effectively implemented. The US has threatened to delay trade negotiations with both countries over tariffs unless they agree to end the clashes. According to Wheeler, the US threats have influenced Thailand's stance, which had previously rejected Malaysia's mediation offer.\nOriginal language: es\nPublish date: July 29, 2025 03:08 PM\nSource:[Deutsche Welle](https://www.dw.com/es/se-mantendr%C3%A1-el-alto-el-fuego-entre-camboya-y-tailandia/a-73455958)\n\n**Thailand and Cambodia Engage in Sixth Day of Border Clashes**\nTensions between Thailand and Cambodia continue to escalate, with the two countries engaging in border clashes for the sixth consecutive day, despite an immediate and unconditional ceasefire agreement reached in Malaysia the previous day. According to the Thai army, Cambodia violated the truce on Tuesday, prompting Thailand to respond accordingly. This is the same phrase used on July 24, when both countries' military forces blamed each other for initiating an attack. Cambodian Prime Minister Hun Manet stated on Facebook, 'The front line has calmed down after the ceasefire at midnight.' However, during a meeting in Malaysia with Thailand's interim Prime Minister Phumtham Wechayachai, each side questioned the other's sincerity, as their recent speeches have shown little consistency. The current conflict has resulted in 38 fatalities, dozens of injuries, and the displacement of nearly 300,000 people. The dispute combines unresolved historical issues, as the border was mapped by France in 1907, but still has several undemarcated points, which have led to clashes over the years. The current escalation is one of the bloodiest clashes between the two Southeast Asian neighbors, who have attacked each other this time with fighter jets, artillery, tanks, and infantry. Cambodia has taken the territorial dispute to the International Court of Justice, citing a desire for a peaceful solution based on international law, while Bangkok has advocated for a bilateral agreement. A meeting between the two armies in a disputed border area on May 28 ended in a fight that killed a Cambodian soldier. On July 23, a Thai soldier lost his right leg after stepping on a landmine in a border area in Ubon Ratchathani. International organizations and countries have urged the governments to resolve the issue through dialogue, but it remains to be seen whether the words and actions of both sides will align.\nOriginal language: es\nPublish date: July 29, 2025 05:09 AM\nSource:[Prensa latina](https://www.prensa-latina.cu/2025/07/29/persisten-desacuerdos-discursivos-entre-tailandia-y-camboya/)\n\n**Thailand and Cambodia Agree to Ceasefire, but Clashes Continue**\nDespite a ceasefire agreement reached on Monday, clashes have reportedly occurred at the border between Thailand and Cambodia. A meeting between military leaders of the two countries has been postponed. The ceasefire, which came into effect at midnight local time, has been broken, according to reports. The Thai army accused the Cambodian troops of violating the ceasefire agreement by launching attacks at several locations. In a statement on X, the Thai military said that 'unrest and armed conflict' had occurred in several areas, to which they had responded accordingly. However, the Cambodian Defense Ministry stated that the border remained calm. The two countries' leaders had agreed on a 'immediate and unconditional' ceasefire during a meeting in Malaysia on Monday, following severe clashes that resulted in several deaths. The meeting was attended by representatives from the US and China, with Malaysia hosting the meeting as the current chair of the Association of Southeast Asian Nations (Asean). The planned meeting between military leaders of the two countries was postponed by several hours, with no details on the reason. The conflict between the two neighboring countries has been ongoing for decades. On Thursday, severe clashes broke out along their 800-kilometer-long border, resulting in deaths and injuries on both sides, mainly among civilians. Both sides have accused each other of starting the violence, with the cause of the escalation still unclear. Over 200,000 people were displaced from their homes, but many have since returned to their regions. US President Donald Trump had personally intervened in the escalating conflict, calling for a ceasefire in phone calls with the leaders of both countries. Trump threatened that there would be no trade negotiations regarding his proposed tariffs if fighting continued. He had previously announced that the two countries would be subject to 36% tariffs starting in August. After the meeting in Malaysia, Trump wrote on his Truth Social platform: 'I have just spoken with the acting Prime Minister of Thailand and the Prime Minister of Cambodia. I am pleased to announce that both countries have reached a ceasefire and peace, thanks to my intervention as President of the United States.' He instructed his team to resume trade talks and added, 'I am proud to be the President of Peace!'\nOriginal language: de\nPublish date: July 29, 2025 03:33 AM\nSource:[Der Tagesspiegel](https://www.tagesspiegel.de/internationales/meldungen-uber-verstosse-am-morgen-waffenruhe-zwischen-thailand-und-kambodscha-ist-in-kraft-14098913.html)\n\n**Thailand and Cambodia Agree to Ceasefire After Five Days of Border Clashes**\nThailand and Cambodia have agreed to an 'immediate and unconditional' ceasefire, effective from midnight, ending five days of intense border clashes that killed 35 people and forced the evacuation of nearly 300,000 people. Malaysian Prime Minister Anwar Ibrahim announced the agreement as the president of the Association of Southeast Asian Nations (ASEAN), after a mediating meeting between the prime ministers of Thailand and Cambodia, Phumtham Wechayachai and Hun Manet, respectively. Anwar said, 'An immediate and unconditional ceasefire, effective from 24:00 on July 28 (17:00 GMT). This is a vital first step towards de-escalation and the restoration of peace and security.' The Malaysian leader highlighted that the conversations were positive and concluded with a mutual commitment to restore peace and security in the affected border areas. To consolidate the de-escalation, at least two bilateral meetings are scheduled: a meeting on Tuesday between military leaders from both countries and a second meeting planned for August 4. Hun Manet thanked US President Donald Trump's mediation and China's participation as an observer in the conversations. 'Let our bilateral discussions return to normal in our relationship,' the Cambodian leader expressed. Phumtham Wechayachai, acting as interim prime minister due to Paetongtarn Shinawatra's suspension, thanked the mediation and highlighted the agreement as 'a peaceful resolution to protect sovereignty and human life.' The clashes began on July 24 after weeks of increasing border tensions. Both armies accused each other of initiating the attacks, which involved heavy artillery including F-16 fighter jets and BM-21 rockets. The conflict left a toll of 35 deaths: 22 from the Thai side (14 civilians and 8 soldiers) and 13 from the Cambodian side (8 civilians and 5 military personnel). Additionally, dozens of people were injured and approximately 291,000 displaced, with over 156,000 in Thailand and around 135,000 in Cambodia. The humanitarian crisis generated by the clashes forced the authorities of both countries to establish massive evacuation centers to protect trapped civilians in the conflict zone. UN Secretary-General António Guterres celebrated the ceasefire as 'a positive step' towards a peaceful resolution of the conflict.\nOriginal language: es\nPublish date: July 28, 2025 09:42 PM\nSource:[Noticias SIN](https://noticiassin.com/tailandia-y-camboya-acuerdan-cese-al-fuego-tras-cinco-dias-de-combates-fronterizos-que-dejaron-35-muertos-1895153/)\n\n**Malaysia Facilitates Ceasefire Between Thailand and Cambodia**\nMalaysian Prime Minister Anwar, after the ceasefire talks, announced that the parties had agreed on an 'urgent and unconditional' ceasefire to take effect at midnight local time. According to The Star, Anwar announced that the Thai and Cambodian officials will host the General Border Committee (GBC) meeting on August 4 in Cambodia. Anwar stated that Cambodia, Thailand, and Malaysia will develop a three-party mechanism to implement the ceasefire, saying that it will 'form the foundation of sustainable peace and accountability.' Anwar emphasized the importance of the Kuala Lumpur meeting, stating that it reaffirmed Malaysia, Cambodia, and Thailand's joint commitment to finding a fair and lasting solution to the conflict through international law, peaceful coexistence, and multilateral cooperation. Anwar also announced that Malaysia will consult with ASEAN member countries on 'supporting peace in place.' He highlighted that the ceasefire is a vital first step in reducing tensions and restoring peace and security. Anwar emphasized that Malaysia is ready to coordinate the observation team to ensure the implementation of the ceasefire. The ceasefire talks were attended by officials from the US and China. Thailand and Cambodia have been experiencing a long-standing border dispute, with a recent conflict on May 28, resulting in a short-lived clash. The two countries' armies agreed to resolve the issue peacefully. However, a recent conflict on July 24 resulted in the loss of 32 lives from both sides. US President Trump announced on his Truth Social account that he had spoken with the parties and that they had agreed to work towards a ceasefire and ultimately peace. Despite Trump's announcement, the clashes continued.\nOriginal language: tr\nPublish date: July 28, 2025 11:34 AM\nSource:[Dünya](https://www.dunya.com/dunya/tayland-ve-kambocya-malezya-arabuluculugunda-ateskes-karari-aldi-haberi-787090)\n\n**ASEAN Under Pressure: Malaysia Pushes for Ceasefire as Deadly Thai–Cambodian Border Crisis Deepens**\nOngoing fighting between Thailand and Cambodia has resulted in over 30 deaths and displaced more than 200,000 residents. Malaysia, as ASEAN chair, is promoting an immediate ceasefire and offering mediation. Thailand insists on bilateral talks, while Cambodia has agreed to discuss a ceasefire. The conflict is rooted in territorial disputes and cultural sensitivities. Both countries have accused each other of violating international law and targeting civilians. ASEAN has offered to host talks and broker a ceasefire, but both sides remain entrenched. Analysts warn that without conciliation, the situation could lead to prolonged instability. Regional actors, including China and ASEAN, are urging restraint and dialogue. 'The situation remains volatile, and much now hinges on whether ASEAN-brokered diplomacy can overcome the mutual distrust that has long plagued this disputed border,' said a statement. 'ExpatGo welcomes and encourages comments, input, and divergent opinions, but kindly requests that you use suitable language and refrain from personal attacks or hate speech.'\nOriginal language: en\nPublish date: July 27, 2025 06:21 AM\nSource:[expatgo.com](https://www.expatgo.com/my/2025/07/27/asean-under-pressure-malaysia-pushes-for-ceasefire-as-deadly-thai-cambodian-border-crisis-deepens/)\n\n",
    "date": "2025-11-19T01:10:57.084798",
    "summary": "Across the nine expert perspectives, there is consensus that the situation on the Thailand-Cambodia border is highly volatile, with a fragile ceasefire frequently violated by low-level skirmishes, fatal incidents, and accusations from both sides. All experts note that recent events (landmine explosions, shootings, and intermittent fatalities) reveal the tenuous nature of the peace agreement post-July 2025 deadly clash, but that no incident since then has (yet) resulted in three or more fatalities in a single event.\n\nThe majority of forecasters identify several key factors raising the risk of a deadly clash: recurring and escalating border incidents, the lack of robust third-party monitoring, entrenched historical grievances and nationalism, and weakened or suspended ceasefire mechanisms. In particular, domestic political incentives and ambiguous chain of command are seen as potential triggers for a larger incident.\n\nHowever, all perspectives also emphasize several moderating influences lowering the probability: the strong involvement of external mediators (ASEAN, US, China), diplomatic and economic incentives for restraint, and the short time window remaining before the question resolves (about 6 weeks). Historical base rates indicate these deadly events are unusual in such short periods, though recent cycles of violence have elevated the background risk.\n\nIndividual probability estimates for a qualifying deadly clash (three or more fatalities between military/law enforcement/paramilitary of both countries before January 1, 2026) range from 23% (Southeast Asian Studies, ASEAN regionalism) to 55% (Military Intelligence). Most experts converge in the 27–38% range, with only one (Military Intelligence) going moderately higher, citing heightened volatility and fragile peace mechanisms. Common low-probability scenarios involve continued minor clashes without mass casualties, sustained by international mediation and crisis management. High-probability scenarios involve rapid escalation from an isolated incident (mine explosion, miscalculation, or local commander overreaction) before diplomatic actors can intervene.\n\nIn sum, the expert consensus is that the probability of another deadly clash remains significantly elevated relative to peacetime norms due to current volatility, but the combination of mediation, mutual restraint, international scrutiny, and the limited resolution window means the risk remains well below certainty—generally one-in-four to one-in-three chance, with moderate outliers on both ends.",
    "forecasters": [
        "Military Intelligence (Threat Assessment Methodology)",
        "Diplomatic Affairs (Track Two Diplomacy Practice)",
        "Crisis Management (Incident Command System)",
        "Crisis Management (Risk Analysis Procedures)",
        "International Relations (Realism)",
        "International Relations (Liberal Institutionalism)",
        "Security Studies (Securitization Theory)",
        "Security Studies (Conflict Escalation Model)",
        "Southeast Asian Studies (ASEAN Regionalism)",
        "Southeast Asian Studies (Postcolonial Border Dispute Analysis)"
    ]
}