{
    "deliberation_results": {
        "Shipping and Maritime Operations (Risk Management ISO31000)": {
            "time_to_resolution": "2.5 months (until Dec 31, 2025)",
            "perspective_relevance": "As an expert in Shipping and Maritime Operations (Risk Management ISO31000), my perspective is acutely focused on the operational, safety, and risk appetite factors that govern decisions by major shipping firms like Maersk. I understand how companies assess threat levels, insurance premiums, regulatory compliance, and reputational risk, as well as the effectiveness of naval security operations and the thresholds for resumption of high-risk trade routes. My approach incorporates base rates from historical shipping disruptions due to piracy or conflict, and the practicalities of risk mitigation in volatile maritime environments.",
            "status_quo": "Maersk has not resumed Red Sea shipping as of October 2025, maintaining a suspension that began in January 2024. The Red Sea remains a high-risk environment with intermittent but severe Houthi attacks, and most major carriers continue to reroute around the Cape of Good Hope. Naval escort operations provide only partial mitigation, and attacks continue on vessels, especially those with Israeli real or perceived links.",
            "perspective_derived_factors": [
                {
                    "factor": "Continued Houthi Attacks and Threats",
                    "effect": "Strongly decreases probability. Houthi attacks on commercial vessels have resumed after temporary lulls, with lethal incidents as recently as late September 2025. Their targeting remains unpredictable, and the threat is not limited to Israeli-flagged ships, as they sometimes attack vessels with only tenuous connections. This persistent, credible threat makes risk management unacceptable for major carriers like Maersk."
                },
                {
                    "factor": "Effectiveness and Scope of Naval Protection (Operation ASPIDES, etc.)",
                    "effect": "Slightly increases probability, but only marginally. While EU and US-led naval missions have provided some protection and have extended their mandates, these forces are overstretched and unable to guarantee safety, especially given the range of Houthi missiles and naval drones. Maersk’s risk appetite is unlikely to change unless a much more robust and reliable protection scheme is established."
                },
                {
                    "factor": "Base Rate of Shipping Resumption Post-Conflict",
                    "effect": "Decreases probability. Historical analogs (e.g., Somali piracy) show that shipping companies resume routes only after a sustained period of safety and/or clear, enforced deterrence for attackers. The Red Sea situation remains far more dangerous and less contained than Somali piracy was at its height."
                },
                {
                    "factor": "Political Developments and Potential Ceasefire in Gaza/Regional De-escalation",
                    "effect": "Marginally increases probability. There are ongoing peace talks, and some actors (Trump, EU, Hamas) have expressed tentative support for a peace plan. The Houthis have previously indicated their attacks are conditional on Israeli military action in Gaza. A sustained ceasefire could, in theory, lead the Houthis to pause attacks, but this remains speculative and fragile given the Iranian regional agenda and Houthis’ autonomy."
                },
                {
                    "factor": "Insurance and Commercial Risk Appetite",
                    "effect": "Strongly decreases probability. War risk premiums for the Red Sea remain extremely high, and insurance for crew and cargo is often denied or prohibitively expensive. Maersk, as a publicly traded company with global reputation and fiduciary duties, is less likely to assume these risks absent a clear, durable reduction in threat level."
                },
                {
                    "factor": "Partial Resumption Possibility (Resolution Criteria)",
                    "effect": "Slightly increases probability. The question resolves YES even for a partial or limited official resumption, e.g., a single Maersk vessel transiting the Red Sea as a result of a shift in company policy. This lowers the bar somewhat compared to a full-scale route resumption."
                }
            ],
            "no_scenario": "Maersk maintains its suspension of Red Sea shipping through the end of 2025. Sporadic but severe Houthi attacks continue, insurance remains prohibitively expensive or unavailable, and naval protection is insufficient to guarantee crew safety. Even with limited improvements in diplomatic or military conditions, the company deems the operational risk too high to justify resuming any official transits before January 2026.",
            "yes_scenario": "A breakthrough diplomatic development—such as a robust ceasefire in Gaza or a significant US-Iran deal—leads to a visible, sustained pause in Houthi attacks. Alternatively, a substantial increase in naval protection (e.g., a multinational convoy system with robust rules of engagement) creates a window of perceived safety. Under pressure from shippers/customers and with insurance coverage returning, Maersk resumes at least partial operations in late 2025, even if only for select vessels or under tightly controlled conditions.",
            "final_reasoning": "The base rate for resumption of shipping after sustained maritime attacks is low, with historical analogs suggesting a need for several months of demonstrable safety and/or effective deterrence. The current environment, as of October 2025, is still acutely hostile: the Houthis carried out a major missile attack on a commercial ship just days ago, causing a catastrophic loss and crew evacuation, and there is no evidence of a durable, enforced ceasefire or a significant reduction in risk. While political talks are underway, they have not yet altered operational risk on the ground. Insurance and legal risk remain prohibitive. The only major positive is that the resolution criteria would allow even a partial or symbolic resumption to resolve YES. However, Maersk's public statements and the pattern of attacks indicate a persistent, high threat environment. Given these factors, and weighting the status quo and base rates heavily, I estimate the probability at 12%.",
            "final_probability": 12
        },
        "Shipping and Maritime Operations (International Maritime Law UNCLOS)": {
            "time_to_resolution": "Approximately 2.5 months (until December 31, 2025)",
            "perspective_relevance": "As an expert in Shipping and Maritime Operations with a focus on International Maritime Law (UNCLOS), I bring a deep understanding of how security threats, international legal frameworks, risk management policies, and insurance considerations shape commercial shipping decisions. I also track the interplay between geopolitical events, military/naval responses, and the operational calculus for major carriers like Maersk. My perspective helps clarify the thresholds for resuming operations and the practical/contractual constraints facing shipowners under persistent threats.",
            "status_quo": "Maersk has not resumed Red Sea shipping as of October 2025. The company suspended operations in January 2024 and, per CEO statements, did not expect to resume before well into 2025. No public indication exists that Maersk has restarted even limited transits.",
            "perspective_derived_factors": [
                {
                    "factor": "Continued Houthi Attacks and Threats",
                    "effect": "Decreases probability. Multiple credible reports indicate ongoing and even escalating Houthi attacks on commercial vessels, including recent missile strikes, sinkings, and crew casualties. The attacks specifically target vessels with even tenuous links to Israel, but operational risk for all shipping remains high due to error, misidentification, and overbroad targeting."
                },
                {
                    "factor": "Scope and Effectiveness of International Naval Protection",
                    "effect": "Slightly increases probability, but only marginally. EU Operation ASPIDES and US-led efforts have provided some protection (over 560 vessels), but the coverage is limited, with only 2-3 ships available at a time, leading to long delays and gaps. The persistent successful attacks, even on escorted or monitored ships, show current missions are insufficient to guarantee safety necessary for a risk-averse operator like Maersk."
                },
                {
                    "factor": "Maersk’s Corporate Risk Appetite and Insurance Constraints",
                    "effect": "Strongly decreases probability. As a major publicly traded carrier, Maersk is highly sensitive to crew safety, cargo insurance, and liability risk. Given recent fatal attacks and sunk ships (e.g., Greek and Dutch vessels, July-October 2025), and the continuing classification of the Red Sea as a war risk zone (with insurance either unavailable or prohibitively expensive), Maersk is unlikely to resume without a sustained period of stability."
                },
                {
                    "factor": "Selective Targeting Policy by Houthis",
                    "effect": "Marginally increases probability, but with caveats. Houthis claim to only target ships with links to Israel, but the definition is broad and enforcement erratic. Maersk, as a global carrier, cannot guarantee its ships would not be misidentified or targeted due to cargo, port calls, or charter arrangements. This ambiguity does little to reduce operational risk."
                },
                {
                    "factor": "Geopolitical Developments: Gaza Peace Talks and Potential Ceasefire",
                    "effect": "Slightly increases probability. While there are ongoing peace talks and apparent momentum toward a ceasefire or political solution in Gaza, there’s no evidence yet of a durable settlement or a corresponding halt to Houthi attacks. Recent Houthi statements reaffirm their intent to continue attacks unless the Gaza blockade is lifted and Israeli military operations cease entirely."
                },
                {
                    "factor": "Base Rate of Shipping Resumption after Maritime Security Crises",
                    "effect": "Decreases probability. Historically, after major maritime security threats (e.g., Somali piracy), large carriers resumed operations only after a sustained period (months to years) of incident-free transits and clear demonstration of effective international naval protection, plus improved local governance. The current situation in the Red Sea is far more volatile and politicized."
                }
            ],
            "no_scenario": "Maersk does not resume Red Sea shipping in 2025. Houthi attacks persist at a significant rate (several attacks per month), with occasional fatal or high-profile incidents. International naval operations remain insufficient to guarantee safe passage or reduce insurance premiums. Maersk’s board and insurers maintain their suspension, prioritizing safety and liability avoidance, waiting for several uninterrupted months of calm and/or a political settlement, which does not materialize before year-end.",
            "yes_scenario": "Maersk resumes at least partial Red Sea shipping in 2025, likely late in the year. This could occur if (1) a durable ceasefire or peace agreement is reached in Gaza, leading Houthis to suspend attacks and make a public declaration to that effect; (2) a major international naval surge provides consistent, reliable protection—perhaps with a marked increase in EU or US assets; (3) a significant de-risking event, such as public insurance market re-entry for transits, occurs. Maersk might then announce a test resumption or limited service, which would fulfill the question’s criteria.",
            "final_reasoning": "The news indicates that as of October 2025, the Red Sea remains a highly insecure environment for commercial shipping. Houthi attacks have not only continued but have escalated in lethality and frequency since the summer, with multiple fatal incidents, ship sinkings, and credible threats against vessels with remote Israeli links. International naval operations (EU ASPIDES, US-led coalitions) have expanded but remain insufficient in coverage, with ongoing gaps and a lack of demonstrable deterrence. Maersk, as a risk-averse operator with global reputational and financial exposure, has no public indication of intent to resume, and there is no evidence of a significant reduction in operational risk, insurance normalization, or durable ceasefire. While there is some diplomatic momentum (e.g., peace talks, temporary humanitarian corridors), these have not yet translated into a meaningful improvement in maritime security or a halt to Houthi operations. The base rate for resumption in such a context is low, and the status quo heavily favors continued suspension. Given these factors and with approximately 2.5 months until resolution, the probability that Maersk will resume Red Sea shipping in 2025 is very low.",
            "final_probability": 5
        },
        "Shipping and Maritime Operations (ISPS Code Compliance)": {
            "time_to_resolution": "Approximately 2.5 months (until January 1, 2026).",
            "perspective_relevance": "As an expert in Shipping and Maritime Operations with ISPS Code Compliance expertise, I am well positioned to assess the operational, security, and regulatory risk calculus that major container lines like Maersk employ. This includes corporate risk tolerance, insurance and crew safety, flag-state and port-state controls, international security coordination (e.g., EU/NATO operations), and the impact of persistent asymmetric threats on route resumption decisions.",
            "status_quo": "Maersk has not resumed shipping through the Red Sea as of October 2025, and continues to reroute vessels around the Cape of Good Hope. Major attacks by Houthis on merchant vessels persist, and international naval operations have not suppressed the threat.",
            "perspective_derived_factors": [
                {
                    "factor": "Persistent Houthi threat and recent escalation (including missile attacks and ship sinkings)",
                    "effect": "Decreases probability. The frequency and severity of attacks, including the sinking of ships and casualties, highlight that the Red Sea remains highly insecure for commercial shipping. Maersk, as a leading global carrier, is unlikely to resume operations unless the threat is sharply reduced."
                },
                {
                    "factor": "International naval presence and Operation Aspides extension",
                    "effect": "Slightly increases probability, but only marginally. While over 560 ships have been protected, and the EU operation is extended, coverage remains limited (2-3 ships at a time), and attacks continue despite these efforts. The naval presence is more deterrent than preventive."
                },
                {
                    "factor": "Shift in Houthi targeting criteria to Israeli-linked vessels",
                    "effect": "Slightly increases probability, but only if Maersk can credibly demonstrate no Israeli connection and obtains adequate security guarantees. However, attacks on vessels with tenuous or unclear Israeli links have still occurred, so Maersk's risk calculus remains conservative."
                },
                {
                    "factor": "Insurance, regulatory, and crew welfare considerations",
                    "effect": "Decreases probability. Insurance premiums for Red Sea transit remain extremely high, and some underwriters deny coverage. ISPS Code requirements dictate that shipping companies must avoid routes where credible threats to crew and vessel safety are not mitigated. Maersk, as an industry leader, is particularly risk-averse in this context."
                },
                {
                    "factor": "Ceasefire prospects and Gaza peace negotiations",
                    "effect": "Marginal increase in probability, contingent on a durable ceasefire and clear reduction in hostilities. While there's momentum toward peace, attacks from the Houthis have continued regardless of diplomatic progress."
                },
                {
                    "factor": "Historical base rate for resumption after similar crises",
                    "effect": "Decreases probability. During the Somali piracy crisis, resumption of normal shipping required not just naval patrols but also a sustained, multi-year period of diminished threat. The Houthis, with state-level support from Iran and more advanced weaponry, present a more resilient threat than Somali pirates."
                }
            ],
            "no_scenario": "Despite international diplomatic and military efforts, Houthi attacks continue at a level that makes transiting the Red Sea too risky for Maersk. Insurance remains prohibitively expensive or unavailable, and there is no credible, sustained reduction in the threat environment before the end of 2025. Maersk continues to route around Africa and makes no announcement of Red Sea resumption.",
            "yes_scenario": "A sustained ceasefire is reached in Gaza, leading to a sharp drop in Houthi attacks. International naval operations are significantly reinforced, or a new security guarantee/escort system is established with enough coverage to reassure Maersk's risk management team. Maersk announces partial or pilot resumption of Red Sea routes, possibly with strict criteria (e.g., only vessels with full naval escort, or only non-Israeli-linked cargo/ports). The announcement or credible reports occur before January 1, 2026.",
            "final_reasoning": "The base rate for resumption of shipping after major, persistent asymmetric threats is low in the short term. Recent news shows the Houthis remain both willing and capable of sinking ships, with attacks occurring as recently as October 2025, including on vessels with tenuous/no direct Israeli links. Insurance and crew welfare standards under ISPS Code make it highly unlikely Maersk would resume without a clear, durable reduction in threat. While there is some diplomatic momentum and naval coverage, these measures have not yet yielded a secure environment. The most likely scenario is continued suspension, barring a dramatic and sustained reduction in hostilities or a step-change in international naval coverage. There is a nonzero chance of a partial or pilot resumption if a ceasefire holds and the risk profile drops, but as of now, the evidence weighs heavily against resumption in 2025.",
            "final_probability": 15
        },
        "Security Risk Assessment (Maritime Threat Assessment)": {
            "time_to_resolution": "Approximately 2.5 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in maritime security risk assessment, I specialize in analyzing threats to commercial shipping, the effectiveness of naval escorts, the risk tolerance of major shipping firms, and the interaction between geopolitical and operational risk factors. My expertise allows me to assess how the current threat environment affects Maersk's decision-making regarding resuming Red Sea operations.",
            "status_quo": "As of October 2025, Maersk has not resumed shipping in the Red Sea due to ongoing Houthi attacks and significant security concerns for commercial vessels, especially those with perceived or actual links to Israel. Major shipping lines continue to reroute via the Cape of Good Hope.",
            "perspective_derived_factors": [
                {
                    "factor": "Persistence and Escalation of Houthi Threats",
                    "effect": "Decreases probability. The Houthis have resumed and escalated attacks in Q3/Q4 2025, targeting commercial vessels with missiles, drones, and small boats. Attacks have resulted in sunken ships and crew fatalities, demonstrating ongoing operational risk."
                },
                {
                    "factor": "International Naval Escort Operations",
                    "effect": "Marginally increases probability. EU Operation Aspides and US-led missions have provided some protection but remain overstretched and unable to guarantee safety for all commercial vessels. Naval presence has not deterred significant Houthi attacks."
                },
                {
                    "factor": "Maersk's Corporate Risk Appetite and Public Statements",
                    "effect": "Decreases probability. Maersk leadership has explicitly stated that a resumption is not expected 'until well into 2025,' and there has been no indication of a change in policy. Insurers and crews remain hesitant, with some ships denied coverage."
                },
                {
                    "factor": "Selective Targeting Criteria by Houthis",
                    "effect": "Slightly increases probability. Houthis have stated a focus on Israeli-linked or Israel-bound vessels. In theory, this could allow non-linked companies to resume, but the ambiguity and risk of mistaken identity remain high for large, high-profile firms like Maersk."
                },
                {
                    "factor": "Potential for Ceasefire or Political Breakthrough",
                    "effect": "Marginally increases probability. There is some diplomatic movement (Trump peace plan, indirect talks), but active Houthi attacks and Iran's continued support show no imminent de-escalation."
                },
                {
                    "factor": "Base Rate of Shipping Resumption after Maritime Crisis",
                    "effect": "Decreases probability. Historically, as with Somali piracy, resumption of full-scale commercial shipping typically required months of sustained security improvement, robust international intervention, and a clear reduction in threat activity."
                }
            ],
            "no_scenario": "Houthi attacks continue sporadically or escalate, with further high-profile sinkings, crew casualties, or hostage events. Naval escorts remain insufficient, insurers continue to deny coverage, and Maersk leadership maintains a policy of avoidance due to the unacceptable risk profile. Maersk only considers resumption after January 1, 2026, or when a durable, verified ceasefire and robust security guarantees are in place.",
            "yes_scenario": "A sudden, credible and durable ceasefire is achieved in Gaza, leading to a rapid de-escalation of Houthi attacks and a public statement from the group ending their campaign. International naval forces increase their capability and coverage, and Maersk, possibly under pressure from global trade stakeholders, announces a partial and tightly controlled resumption (e.g., limited, escorted convoys for non-Israel-linked cargo) before year-end 2025.",
            "final_reasoning": "The base rate for rapid resumption of high-risk maritime corridors after a sustained period of severe attacks is low, particularly for companies as risk-averse and high-profile as Maersk. The recent news confirms ongoing, even escalating, Houthi attacks—including fatal and highly publicized incidents—despite the presence of international naval forces. Maersk's own public stance and insurance constraints further reduce the likelihood of a 2025 resumption. While there are diplomatic efforts underway, there is no concrete evidence of a breakthrough that would fundamentally change the threat calculus before the end of 2025. The fine print notes that even a partial, officially announced resumption would resolve Yes, but all available indicators suggest that Maersk will maintain its suspension through the end of the year unless there is a dramatic and rapid improvement in security, which appears increasingly unlikely as of mid-October 2025.",
            "final_probability": 10
        },
        "Security Risk Assessment (Critical Infrastructure Protection Standards)": {
            "time_to_resolution": "Approximately 2.5 months (until December 31, 2025)",
            "perspective_relevance": "As an expert in Security Risk Assessment and Critical Infrastructure Protection Standards, my expertise is highly relevant. Shipping through the Red Sea involves critical infrastructure, high-value assets, and complex risk calculations. Maersk's decision will be driven by threat assessments, insurance rates, regulatory frameworks, and the effectiveness of military protection—areas central to my field.",
            "status_quo": "Maersk suspended Red Sea shipping in early 2024 and, as of October 2025, has not publicly resumed. The current status is that Maersk remains out of the Red Sea, and other major carriers are similarly cautious, with sporadic attacks persisting.",
            "perspective_derived_factors": [
                {
                    "factor": "Persisting Houthi Threat and Attack Capability",
                    "effect": "Decreases probability. The Houthis continue to demonstrate both intent and capability, with recent attacks using advanced weaponry (drones, ballistic/hypersonic missiles) against merchant shipping. Their targeting criteria remain somewhat ambiguous, and attacks have resulted in ship sinkings and casualties as recently as September/October 2025."
                },
                {
                    "factor": "Partial Effectiveness and Limitations of Naval Protection",
                    "effect": "Decreases probability. EU Operation ASPIDES and similar missions have protected hundreds of ships, but coverage is limited (2-3 ships at a time), and gaps remain. Ships not requesting or receiving direct escort remain vulnerable, as evidenced by the recent attack on the MV Minerva Grahat."
                },
                {
                    "factor": "Maersk's Risk Appetite and Corporate Governance",
                    "effect": "Decreases probability. Maersk is a global leader with a low risk tolerance for crew safety, asset loss, and reputational damage. Security Risk Assessment frameworks mandate risk avoidance when credible threats exist, especially after fatal incidents. Insurers are likely to maintain high premiums or deny coverage, further discouraging resumption."
                },
                {
                    "factor": "Political and Geopolitical Dynamics",
                    "effect": "Slightly increases probability. Diplomatic efforts, a US-Houthi ceasefire, and ongoing peace talks (Trump peace plan, Hamas’s acceptance) create a slim window for de-escalation. However, Houthi statements and recent attacks show they retain agency and remain unpredictable."
                },
                {
                    "factor": "Operational and Economic Pressures",
                    "effect": "Increases probability. There is a 60% traffic increase since August 2024, indicating some carriers are resuming or rerouting through the Red Sea. There are strong economic incentives for Maersk to resume, as the Cape route is longer and costlier. However, most resumed traffic is likely from operators willing to accept higher risk or those with stronger military support."
                }
            ],
            "no_scenario": "Maersk continues to assess the risk as unacceptable due to ongoing Houthi attacks on merchant shipping, ineffective or insufficient naval protection, and high insurance costs. Any partial or temporary ceasefires fail to fully deter Houthi aggression, and no substantial, credible change in security posture occurs by year-end. Even if some ships cross, Maersk does not officially alter its company policy to resume Red Sea transit in 2025.",
            "yes_scenario": "A marked reduction in attacks occurs, possibly due to a sustained ceasefire in Gaza, international diplomatic breakthroughs, or a robust military operation that neutralizes Houthi maritime strike capabilities. Maersk, observing a sustained period of safe passage, officially announces a partial or phased resumption of Red Sea shipping in late 2025, or their ships are credibly reported traveling the route under company policy.",
            "final_reasoning": "The base rate for rapid restoration of shipping in high-risk maritime environments is low—historically, companies like Maersk have waited for sustained periods of security before resuming routes after piracy or war (e.g., Somali piracy crisis). The status quo (no resumption) is sticky due to recent deadly attacks (September/October 2025) and the persistence of the Houthi threat, despite partial increases in shipping traffic and some diplomatic progress. Maersk’s risk calculus—driven by credible threat intelligence, insurance, regulatory compliance, and duty-of-care for crews—is heavily weighted against resumption as long as attacks remain plausible. The incentives to resume are strong but are outweighed by ongoing operational risk and the reputational/financial cost of a major incident. The window for a sudden, credible shift in Red Sea security before the end of 2025 is narrowing rapidly. Therefore, while not impossible, the probability of Maersk officially resuming Red Sea shipping in 2025 is low.",
            "final_probability": 18
        },
        "International Relations (Security Dilemma Theory)": {
            "time_to_resolution": "Approximately 2.5 months (resolves on Jan 1, 2026; today is Oct 15, 2025)",
            "perspective_relevance": "As an expert in Security Dilemma Theory, I analyze how actors' defensive measures (military escorts, sanctions, blockades) can be perceived as offensive threats, leading to spirals of escalation and persistent insecurity. In the Red Sea, the interplay between Houthis, Iran, Israel, Western naval forces, and shipping firms like Maersk exemplifies classic security dilemma dynamics. Shipping resumption depends not only on the objective risk but also on perceived intentions, signaling, and the effectiveness of deterrence or reassurance.",
            "status_quo": "Maersk shipping through the Red Sea remains suspended. Attacks by Houthis (often in solidarity with Hamas and/or as proxies for Iran) continue sporadically, targeting vessels tied—sometimes tenuously—to Israel. International naval operations (US, EU) provide some protection, but the risk remains high and Maersk has not resumed Red Sea operations as of mid-October 2025.",
            "perspective_derived_factors": [
                {
                    "factor": "Houthi Attack Persistence and Capabilities",
                    "effect": "Decreases probability. Recent attacks (e.g., Dutch-flagged Minerva Grahat, Oct 2025), the sinking of multiple ships in July, and Houthi statements indicate sustained intent and capability to threaten Red Sea shipping, especially for ships linked to Israel or the West."
                },
                {
                    "factor": "Scope and Targeting of Houthi Attacks",
                    "effect": "Decreases probability. While some reports suggest Houthis have narrowed targets to strictly Israeli-linked vessels, ambiguity remains. Maersk, as a global company, may still be perceived as at-risk, especially if the definition of 'linked' broadens or if Houthis escalate for leverage."
                },
                {
                    "factor": "International Naval Escort Effectiveness",
                    "effect": "Slightly increases probability. EU Operation Aspides and US-led missions have protected hundreds of vessels, but capacity is limited (only 2-3 ships for escort at any time), and attacks have still succeeded. Unless force posture is significantly reinforced, deterrence is insufficient for Maersk to risk resumption."
                },
                {
                    "factor": "Ceasefire and Political Developments in Gaza",
                    "effect": "Neutral to slightly increases probability. Ongoing peace talks (Trump plan, Hamas's acceptance) could provide an off-ramp, but the situation on the ground remains fluid, and the Houthis have explicitly tied attacks to the status of Gaza. Any breakdown or delay in peace will keep risk high."
                },
                {
                    "factor": "Insurance, Liability, and Corporate Risk Appetite",
                    "effect": "Decreases probability. Insurance costs are high, some ships are denied coverage, and Maersk’s corporate risk tolerance is likely lower than smaller or regional firms. Even a partial resumption may be seen as too risky if attacks persist."
                },
                {
                    "factor": "Base Rate of Shipping Resumption After Similar Crises",
                    "effect": "Decreases probability. In piracy crises (e.g., Somali piracy), major lines only resumed normal operations after a sustained drop in successful attacks, credible international intervention, and reliable guarantees. The Red Sea remains more dangerous than post-piracy Aden Gulf."
                },
                {
                    "factor": "Incentives for Escalation—Security Dilemma Dynamics",
                    "effect": "Decreases probability. Both international naval presence and continued attacks can spiral: Houthis see greater foreign intervention as proof of Western threat, justifying further attacks; shipping interests interpret sporadic attacks as a reason not to resume, reinforcing the security dilemma."
                }
            ],
            "no_scenario": "Maersk assesses that the risk from further Houthi attacks—including on vessels only tangentially linked to Israel—is too high. The international naval presence remains insufficient to guarantee security, with periodic successful attacks (such as the Minerva Grahat strike) deterring resumption. Insurance costs and liability concerns persist. Any partial ceasefire in Gaza proves fragile or breaks down, leading to continued or escalated attacks. Maersk maintains suspension throughout 2025.",
            "yes_scenario": "A robust, sustained ceasefire and progress on Gaza peace talks lead the Houthis to announce a cessation of attacks. International naval operations are reinforced, ensuring near-total protection for commercial vessels. Insurance becomes widely available at reasonable rates, and Maersk, perhaps after a trial or partial run (e.g., on non-Israeli-linked routes), announces a resumption of Red Sea shipping before January 1, 2026.",
            "final_reasoning": "The status quo remains highly unfavorable to Maersk resuming Red Sea shipping. Despite some increase in shipping volumes (up 60% since August 2024), these are still far below pre-crisis levels and are likely driven by risk-tolerant firms or those with less exposure. The most recent news describes a successful Houthi missile attack (late September 2025), continued explicit threats, and a demonstrated willingness to attack ships that are not obviously Israeli. International naval escorts are insufficient in number and effectiveness, with the EU itself requesting reinforcements. The security dilemma is deepened by each new attack and each new deployment, making mutual reassurance difficult. While peace talks in Gaza are ongoing, the linkage between attacks and the Gaza situation remains tight, and the timing for any durable settlement is unclear. There is little evidence that Maersk will take the risk, even for a partial resumption, in the absence of a decisive drop in attacks and credible, sustained guarantees. Historically, major lines have only resumed normal operations after a lengthy period of security. Therefore, the probability that Maersk resumes shipping in the Red Sea in 2025 is low.",
            "final_probability": 10
        },
        "International Relations (Maritime Security Studies)": {
            "time_to_resolution": "Approximately 2.5 months (until December 31, 2025)",
            "perspective_relevance": "As an expert in International Relations and Maritime Security Studies, I bring deep familiarity with the complexities of naval operations in conflict zones, the decision-making calculus of major shipping companies under threat, and the interplay of military, political, and economic factors in maritime chokepoints such as the Red Sea. I am attuned to the historical base rates of shipping disruptions and resumptions, as well as the efficacy of naval escort operations and the deterrence calculus of non-state actors like the Houthis in asymmetric conflict environments.",
            "status_quo": "Maersk, one of the largest shipping companies globally, paused shipping through the Red Sea indefinitely in January 2024 due to Houthi attacks. As of October 2025, there is no public evidence that Maersk has resumed Red Sea shipping, and the security situation remains highly unstable, with ongoing missile/drone attacks and merchant vessels being sunk or damaged. International naval operations have failed to suppress the threat, and shipping volumes remain below pre-crisis levels.",
            "perspective_derived_factors": [
                {
                    "factor": "Persistence and Escalation of Houthi Attacks",
                    "effect": "Decreases probability. The Houthis have resumed and intensified attacks, including sinking ships and launching hypersonic missiles at Israel, with recent attacks as of September 30, 2025, indicating the threat environment remains severe. Their targeting criteria include not only Israeli-linked ships but sometimes vessels with tenuous links or none at all, resulting in significant risk for international shipping."
                },
                {
                    "factor": "Effectiveness of International Naval Protection",
                    "effect": "Decreases probability. EU Operation Aspides and US-led efforts have failed to provide comprehensive protection, as evidenced by continued attacks, ships sunk, and the explicit admission by EU officials of insufficient assets and inability to guarantee security. Some companies still avoid the Red Sea due to long wait times for escorts and insurance issues."
                },
                {
                    "factor": "Maersk's Corporate Risk Tolerance and Precedent",
                    "effect": "Decreases probability. Maersk is highly risk-averse, especially after direct attacks on its ships in late 2023/early 2024. Its CEO has publicly stated that resumption is not expected until 'well into 2025,' and the current context has not changed sufficiently to alter this posture. Maersk has historically been among the last to return to high-risk zones."
                },
                {
                    "factor": "Progress in Israel-Hamas Peace Process",
                    "effect": "Neutral to slightly increases probability. There is some progress in peace talks with acceptance of a Trump-brokered plan, but no durable ceasefire or resolution of Gaza's blockade as of October 2025. Houthis have clearly linked their attacks to the Gaza situation, so only a robust, implemented peace could prompt a freeze in attacks."
                },
                {
                    "factor": "Base Rate of Shipping Resumption after Severe Threats",
                    "effect": "Decreases probability. Historically, after piracy crises (e.g., Somali piracy), shipping only resumes after clear, sustained security improvements, not during ongoing attacks. The Red Sea crisis is even more severe given the sophistication and persistence of the threat."
                },
                {
                    "factor": "Partial Resumption Possibility and Resolution Criteria",
                    "effect": "Slightly increases probability. The resolution requires only a partial or announced resumption, not full restoration. Maersk might test the waters with a single convoy or limited run if there is a perceived window of reduced risk, but this is unlikely while attacks continue."
                }
            ],
            "no_scenario": "The Houthis continue or escalate attacks on shipping through the end of 2025, targeting vessels linked (even tenuously) to Israel and/or Western interests. International naval operations remain insufficient to guarantee safety, and insurance rates and risk assessments preclude Maersk from resuming even partial operations. Maersk maintains its pause through at least January 2026, citing ongoing threats and lack of adequate security guarantees.",
            "yes_scenario": "A breakthrough in the Israel-Hamas peace talks leads to a durable ceasefire and a significant reduction in Houthi attacks, either through direct orders from Iran or as part of a regional de-escalation. This, combined with improved naval protection and/or a diplomatic deal, prompts Maersk to announce (or be credibly reported as) resuming limited shipping in late 2025, perhaps on a trial basis or with heavy naval escort.",
            "final_reasoning": "The base rate for shipping resumption in conflict zones is low until there is a sustained reduction in threat, which is absent in the current Red Sea environment. The recent resumption and escalation of Houthi attacks, including the use of advanced weaponry and targeting of non-Israeli vessels, underscores the persistence of the threat. International naval operations have proven inadequate, with explicit statements from EU officials admitting ongoing risks and insufficient resources. Maersk’s past behavior and public statements indicate a highly cautious approach; the company will likely require not just a pause in attacks, but evidence of a durable solution and insurance coverage before resuming operations. The slight increase in shipping volumes since August 2024 reflects some companies’ willingness to risk the route, but not at a scale or with the risk tolerance matching Maersk’s threshold. Partial resumption is possible if there is a significant de-escalation, but the current trend is negative, with peace in Gaza still elusive and the Houthis maintaining their campaign. Given all factors, the probability that Maersk resumes any shipping in the Red Sea in 2025 is low but not zero, as a late-year partial or token resumption cannot be fully excluded.",
            "final_probability": 13
        },
        "Political Science (Conflict Resolution Theory)": {
            "time_to_resolution": "Approximately 2.5 months (resolves January 1, 2026; today is October 15, 2025)",
            "perspective_relevance": "As a political scientist specializing in conflict resolution theory, I analyze the interplay between conflict dynamics, third-party intervention, signaling, and structural incentives. This expertise is relevant because Maersk’s decision hinges on the shifting risk environment driven by the Israel-Gaza-Houthi conflict, international naval operations, and the perceived credibility of both threat and protection mechanisms. Understanding the escalation/de-escalation patterns, the logic of spoiler actors (like the Houthis), and the efficacy of deterrence allows me to assess the likelihood that Maersk would resume shipping, even partially, by the end of 2025.",
            "status_quo": "Maersk has not resumed shipping in the Red Sea. The company suspended operations indefinitely in January 2024, citing unacceptably high risks from Houthi attacks targeting vessels linked, even tenuously, to Israel. As of mid-October 2025, major attacks—including deadly strikes and the use of advanced missiles—continue, and shipping volumes remain below pre-crisis levels. Maersk’s official policy remains non-resumption.",
            "perspective_derived_factors": [
                {
                    "factor": "Intensity and persistence of Houthi attacks",
                    "effect": "Decreases probability. The Houthis have demonstrated both the will and means to continue lethal attacks on commercial shipping, including recent incidents in September and October 2025. The attacks have escalated to the use of advanced hypersonic missiles and have resulted in loss of life, vessel sinkings, and crew kidnappings."
                },
                {
                    "factor": "Scope of Houthi targeting",
                    "effect": "Decreases probability. While the Houthis claim to focus on Israeli-linked ships, in practice, many vessels with indirect or unclear ties have been attacked, and the group's enforcement of its definition is opaque. Maersk, as a global carrier, cannot reliably assure clients or insurers that its ships would not be targeted."
                },
                {
                    "factor": "Effectiveness and scale of international naval protection",
                    "effect": "Modestly increases probability. EU Operation Aspides and US-led operations have increased patrols and direct escorts, reportedly protecting hundreds of ships. However, naval resources are stretched thin, and recent successful Houthi attacks (e.g., MV Minerva Grahat) occurred outside the protection umbrella or in spite of it. The inability to guarantee safety for all commercial traffic, especially for ships not directly requesting escort, limits the reassurance these missions provide to Maersk."
                },
                {
                    "factor": "Conflict resolution trends in Gaza and regional diplomacy",
                    "effect": "Marginally increases probability. The Trump peace plan, Hamas’s partial acceptance, and the opening of some negotiations might, in theory, reduce the Houthis’ motivation to attack. However, news indicates that the Houthis continue to escalate attacks as leverage or in response to perceived Israeli violations. The linkage between Red Sea security and Gaza diplomacy remains strong, and spoilers can act independently of broader peace trends."
                },
                {
                    "factor": "Corporate risk calculus (insurance, liability, reputational risk)",
                    "effect": "Decreases probability. Insurers have denied coverage for Red Sea transits, or imposed prohibitive rates. Maersk faces immense reputational risk if crew are killed or kidnapped. Unless there is a clear, persistent, and public reduction in risk—unobservable at present—corporate governance and duty-of-care will bias strongly toward continued suspension."
                },
                {
                    "factor": "Recent base rates for similar situations",
                    "effect": "Decreases probability. In prior maritime security crises (e.g., Somali piracy 2008-2012), resumption of shipping followed clear, sustained declines in attacks and robust international suppression of the threat. In the current environment, the threat remains persistent and lethal, and the international response is less forceful than in the anti-piracy campaigns."
                },
                {
                    "factor": "Partial resumption / public signaling threshold",
                    "effect": "Modestly increases probability. The question resolves YES even for partial resumption or a clear Maersk policy announcement. If Maersk perceives a marginal but stable reduction in risk—e.g., by limiting Red Sea transits to ships with no discernible Israeli links and under direct escort—a minimal, symbolic resumption could occur. However, both public and insurance scrutiny make even a partial resumption unlikely without an observable risk shift."
                }
            ],
            "no_scenario": "Despite international naval operations and ongoing peace talks for Gaza, Houthi attacks continue at a significant pace, with sporadic high-profile incidents (e.g., ship sinkings, missile strikes) demonstrating that the risk to commercial shipping remains acute. Maersk, citing insurance refusals and inability to guarantee crew safety, maintains its suspension through 2025, and the Red Sea remains a high-risk area for global shipping. Even if some other carriers resume limited operations, Maersk does not alter its official policy.",
            "yes_scenario": "A convergence of factors—such as a durable ceasefire in Gaza, international diplomatic breakthroughs with the Houthis (possibly via Oman or Iran), and a sustained, highly visible drop in attacks (enforced by either deterrence or political agreement)—leads Maersk to announce a limited resumption of Red Sea transit for specific ships under certain conditions (e.g., with naval escort, and with no Israeli-linked cargo). Such an announcement, even if covering only a subset of Maersk traffic, would meet the resolution criteria.",
            "final_reasoning": "The current news environment strongly favors the status quo: Houthi attacks have intensified, not declined, in recent months, with high-profile missile strikes, deadly incidents, and explicit statements that attacks will continue so long as the Gaza blockade and Israeli military activity persist. International naval protection, while significant, has not prevented recent attacks, and remains insufficiently robust to guarantee safety for all commercial vessels. Maersk, as a risk-averse global actor with substantial reputational and liability concerns, is unlikely to resume Red Sea operations—partially or fully—without a sustained, public, and credible reduction in threat. The base rate from analogous crises (e.g., Somali piracy) indicates that resumption only follows after attack rates drop to near zero and the threat is systemically dismantled, which has not occurred here. While the bar for a YES resolution is not high (partial resumption or a policy announcement), the incentives for Maersk to hold the line outweigh the marginal benefits of a symbolic return, especially as violence and unpredictability persist. The possibility of a rapid diplomatic breakthrough or a sudden, lasting drop in attacks before year-end is remote. Therefore, the probability Maersk resumes shipping in the Red Sea in 2025 is very low.",
            "final_probability": 7
        },
        "Political Science (Regime Stability Analysis)": {
            "time_to_resolution": "Approximately 2.5 months (until December 31, 2025)",
            "perspective_relevance": "As an expert in Political Science (Regime Stability Analysis), I focus on the interplay between state and non-state actors, the incentives for violence and de-escalation, and the persistence of status quo in high-stakes maritime chokepoints. I also analyze how international military interventions and local power dynamics affect the risk calculus of major corporations like Maersk, whose risk tolerance is low given the threat to personnel, assets, and insurance liabilities.",
            "status_quo": "Maersk has suspended shipping operations in the Red Sea indefinitely since January 2024 and has not resumed as of October 2025. Attacks by the Houthis continue, and the region remains highly unstable for commercial shipping. If nothing changes, Maersk will not resume shipping in the Red Sea in 2025.",
            "perspective_derived_factors": [
                {
                    "factor": "Houthi Operational Capability and Intent",
                    "effect": "Strongly decreases probability. Recent news confirms renewed and lethal attacks, with Houthis openly claiming responsibility and demonstrating both capability (missile, drone, boat attacks) and intent (explicit threats against ships linked to Israel or those violating their embargo)."
                },
                {
                    "factor": "International Naval Protection/Intervention",
                    "effect": "Slightly increases probability, but with caveats. EU Operation Aspides and U.S. Operation Prosperity Guardian provide some protection, but their resources are stretched thin, and their effectiveness is limited, as evidenced by recent attacks on unescorted ships. The security umbrella is insufficient to restore commercial confidence for high-profile, risk-averse companies like Maersk."
                },
                {
                    "factor": "Political Negotiations and Gaza Ceasefire Dynamics",
                    "effect": "Marginally increases probability. There are ongoing peace talks and some diplomatic momentum (acceptance of Trump peace plan by Hamas and Israel, international calls for a two-state solution), but no concrete, enforceable ceasefire or reduction in Houthi-linked violence has materialized. The Houthis have shown their actions are only loosely tied to the Gaza timeline and are influenced by Iranian strategic interests."
                },
                {
                    "factor": "Maersk Corporate Risk Appetite and Precedent",
                    "effect": "Strongly decreases probability. Maersk has historically resumed Red Sea operations only after a sustained reduction in threat, not following partial or temporary lulls. The company requires clear, credible guarantees of safety, which are absent given the frequency and lethality of attacks."
                },
                {
                    "factor": "Base Rate for Rapid Normalization after Maritime Crises",
                    "effect": "Decreases probability. In prior maritime security crises (e.g., Somali piracy), it took years and robust, coordinated international action to restore shipping confidence. There is little evidence of a sufficiently strong or effective international response at present."
                },
                {
                    "factor": "Partial Resumption/Policy Change Threshold",
                    "effect": "Slightly increases probability. The resolution criteria require only a partial resumption or credible reports of Maersk ships in the Red Sea. If Maersk were to take even a limited, highly protected, or experimental step (e.g., one escorted vessel), this could resolve the question as Yes. However, this would still require risk levels to drop further than currently observed."
                }
            ],
            "no_scenario": "The Houthis continue intermittent but credible attacks on merchant shipping through the end of 2025, especially targeting ships linked to Israel or violating their embargo. Maersk, assessing persistent risk and lacking confidence in naval protection, maintains its suspension of Red Sea routes through December 31, 2025. No official announcement or credible report of Maersk ships returning to the Red Sea is made.",
            "yes_scenario": "A significant, durable ceasefire is achieved in Gaza, and either (a) the Houthis publicly commit to halting attacks on all non-Israeli shipping, or (b) international naval protection is dramatically scaled up and proves effective, with no successful attacks for a sustained period. Maersk, under pressure to restore global supply chains or following improved insurance terms, announces the resumption (even partially or on a trial basis) of Red Sea transits before January 1, 2026.",
            "final_reasoning": "All evidence suggests the Red Sea remains unsafe for commercial shipping, especially for companies like Maersk with high reputational and operational risk aversion. The Houthis have conducted lethal, high-profile attacks as recently as October 2025, and there is no sign of a credible, enforceable ceasefire or major reduction in their operational tempo. International naval protection is present but insufficient to secure the corridor or fully reassure commercial actors. Base rates for post-crisis normalization suggest change is slow unless there is overwhelming, coordinated international action—which is not currently present. While the resolution criteria allow for a partial or limited resumption to count as Yes, Maersk's history and statements indicate such a move would require a significant, sustained drop in risk, which is unlikely within the remaining two and a half months of 2025. The status quo strongly favors a No outcome, and the only plausible Yes scenario would involve a sudden, highly publicized policy shift or an unexpectedly effective international operation—both of which are low probability given current conditions.",
            "final_probability": 10
        },
        "Regional Studies Middle East (Gulf Security Complex)": {
            "time_to_resolution": "2.5 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in the Gulf Security Complex, I bring a deep understanding of the interplay between regional security threats (notably the Houthi maritime campaign), external naval operations (US, EU), the geopolitics of the Red Sea, and the risk calculus of major shipping companies like Maersk. I am attuned to the fine-grained shift in Houthi targeting, the effectiveness and limitations of international naval missions, and the historical base rates of shipping disruptions and resumptions in conflict zones.",
            "status_quo": "Maersk has not resumed Red Sea shipping as of October 2025. The company paused operations in January 2024 due to persistent Houthi threats and has not publicly announced a return, despite some period of reduced attacks. The status quo is continued suspension of Maersk's Red Sea operations.",
            "perspective_derived_factors": [
                {
                    "factor": "Persistence and Capabilities of Houthi Threat",
                    "effect": "Decreases probability. The Houthis have demonstrated the ability to strike vessels with missiles, drones, and naval mines, including recent deadly and damaging attacks (July-October 2025) despite periods of reduced activity. Their targeting remains unpredictable and, while narrowed to Israeli-linked vessels, is sometimes expansive and ambiguous, increasing Maersk's risk perception."
                },
                {
                    "factor": "International Naval Protection Efforts (EU Operation ASPIDES, US-led missions)",
                    "effect": "Slightly increases probability. The presence of naval escorts and air defense frigates has protected hundreds of vessels and may mitigate risk, but coverage is stretched thin and not comprehensive. The missions have not prevented several serious attacks in 2025, and ASPIDES itself admits to being under-resourced."
                },
                {
                    "factor": "Recent Escalation and Resumption of Attacks",
                    "effect": "Decreases probability. After a mid-2025 lull, Houthi attacks have resumed with new intensity, including the sinking of ships, crew deaths, and attacks on vessels not overtly tied to Israel. October 2025 saw fresh missile attacks, even as peace talks proceeded, showing the Houthis' operational resilience and willingness to escalate."
                },
                {
                    "factor": "Progress in Gaza Peace Negotiations and Potential Ceasefire",
                    "effect": "Marginally increases probability. If a robust, durable ceasefire and humanitarian deal are reached and hold, the Houthis have publicly linked their cessation of attacks to an end of the Israeli campaign and blockade. However, implementation is slow, and the Houthis have shown flexibility in their justifications for continued attacks."
                },
                {
                    "factor": "Maersk's Historical Risk Tolerance and Public Statements",
                    "effect": "Decreases probability. Maersk’s CEO has stated explicitly that shipping will not resume until well into 2025 or beyond, and the company has taken a conservative approach in high-risk zones historically. Even partial resumption would require a clear, sustained reduction in threat and/or robust assurances from naval escorts."
                },
                {
                    "factor": "Base Rate of Shipping Resumptions after Similar Security Crises",
                    "effect": "Decreases probability. In comparable cases (Somali piracy, earlier Red Sea crises), major shipping lines have typically resumed only after sustained security improvements, robust international naval guarantees, and/or political settlements; these factors are currently only partially present."
                },
                {
                    "factor": "Partial Resumption/Policy Change Threshold",
                    "effect": "Increases probability. Resolution criteria allow for partial resumption or policy changes (not just full-scale regular traffic). Maersk could, in theory, announce a conditional or limited Red Sea return, perhaps for specific routes under heavy escort, even amid ongoing risk."
                }
            ],
            "no_scenario": "Despite ongoing diplomatic efforts and some periods of reduced attacks, the Houthi campaign continues into late 2025, with sporadic but high-profile missile, drone, and naval attacks. Maersk, seeing insufficient reduction in risk and inadequate guarantees from naval forces, maintains its suspension of Red Sea operations. No public announcement of resumption or policy change is made before 2026.",
            "yes_scenario": "A breakthrough in Gaza ceasefire and Israeli-Hamas negotiations leads to a significant, sustained reduction in Houthi attacks, possibly with a public declaration from the group to halt targeting of merchant shipping. International naval forces bolster their presence and coverage. Maersk, noting a sharp drop in incidents and perhaps under pressure from clients and insurers, announces a limited or trial resumption of Red Sea transits before year-end, possibly for select vessels under escort.",
            "final_reasoning": "While shipping volumes have increased since their nadir, the latest news (October 2025) offers compelling evidence that the Red Sea remains highly insecure: the Houthis have resumed and escalated attacks, including high-profile strikes on merchant vessels and missiles aimed at Israel. The international naval presence, though extended, is acknowledged as insufficient for full risk mitigation. Maersk has historically taken a conservative approach, and its CEO’s statements point to a reluctance to return without a clear, durable reduction in threat. There is a narrow window for partial or trial resumption, especially if the Gaza peace process yields a meaningful ceasefire and the Houthis follow through on their (often conditional) pledges to halt attacks. However, as of mid-October 2025, the operational risk remains high, and the base rate for rapid resumption after such persistent, lethal security threats is low. Given all factors, while not impossible, a resumption in 2025 appears unlikely.",
            "final_probability": 20
        }
    },
    "deliberation_probability": [
        12,
        5,
        15,
        10,
        18,
        10,
        13,
        7,
        10,
        20
    ],
    "deliberation_mean_probability": 12.0,
    "deliberation_sd": 4.666666666666667,
    "deliberation_probability_result": 12,
    "group_results": {
        "shippingAndMaritimeOperationsRiskManagementIso31000": {
            "forecaster_to_engage": "Regional Studies Middle East (Gulf Security Complex)",
            "response_type": "critique",
            "response": "While your analysis rightly notes the slight uptick in Red Sea shipping volumes and the slim possibility of a partial/trial resumption if diplomatic breakthroughs occur, I find your probability (20%) overstates the plausibility of a Maersk return in 2025. From a risk management and operational perspective, the current baseline for resumption among major, highly risk-averse lines like Maersk is set not by incremental improvements in shipping traffic, but by an unambiguous, sustained reduction in lethal threat—something not supported by the recent, high-profile Houthi attacks. The mere presence of more ships, likely from smaller or more risk-tolerant operators, does not meaningfully lower Maersk's risk threshold, particularly given their exposure to insurance, legal, and reputational risks. Furthermore, the window for a dramatic and sustained improvement in the security environment before year's end is now extremely short. While your Yes scenario is not impossible, base rates and the persistent operational reality suggest that a lower probability is warranted."
        },
        "shippingAndMaritimeOperationsInternationalMaritimeLawUnclos": {
            "forecaster_to_engage": "Shipping and Maritime Operations (ISPS Code Compliance)",
            "response_type": "defense",
            "response": "I concur with your emphasis on the ISPS Code and its practical impact on Maersk's operational decision-making. Your reasoning correctly highlights that compliance-driven standards for crew welfare and ship security raise the bar for any resumption of service in the Red Sea. The continued frequency and lethality of Houthi attacks, including on vessels without direct Israeli links, makes it exceedingly difficult for a responsible operator to meet ISPS obligations or secure insurance. This creates a legal and reputational risk profile that is simply incompatible with any hasty return. Your acknowledgment of a nonzero chance for a pilot or partial resumption is prudent given the resolution criteria, but your overall assessment—anchored in regulatory and safety realities—appropriately supports a low probability."
        },
        "shippingAndMaritimeOperationsIspsCodeCompliance": {
            "forecaster_to_engage": "Security Risk Assessment (Critical Infrastructure Protection Standards)",
            "response_type": "defense",
            "response": "Your analysis is particularly strong in highlighting the importance of historical analogs, such as the Somali piracy crisis, and in emphasizing that Maersk's calculus is shaped by risk intelligence, insurance, regulatory compliance, and duty-of-care. You correctly note that even as diplomatic and naval efforts incrementally improve, the stickiness of the status quo is reinforced by recent severe attacks and the lack of a systemic reduction in threat. The operational reality—where even a single incident could be catastrophic for Maersk—means that incentives to resume are outweighed by ongoing risk. Your slightly higher probability (18%) leaves room for a late, symbolic or partial resumption if the situation changes, which is realistic given the resolution criteria. Overall, your reasoning is well-aligned with the current threat environment and industry best practice."
        },
        "securityRiskAssessmentMaritimeThreatAssessment": {
            "forecaster_to_engage": "International Relations (Security Dilemma Theory)",
            "response_type": "defense",
            "response": "Your analysis is well-founded in recognizing how the persistence and escalation of attacks reinforce risk aversion among major shipping lines like Maersk. You correctly note that each new Houthi attack and each under-resourced deployment by international naval forces exacerbates mutual insecurity, making a rapid reversal of risk perceptions unlikely. The linkage you highlight between ongoing violence in Gaza and the Houthis' operational tempo is critical: so long as that connection persists, the risk calculus for Maersk remains unchanged. Your assessment also properly weights the historically slow pace of normalization in post-crisis maritime corridors, and your probability (10%) reflects both the status quo bias and the limited time for any decisive change. This approach is well-aligned with the operational realities and my own threat assessment perspective."
        },
        "securityRiskAssessmentCriticalInfrastructureProtectionStandards": {
            "forecaster_to_engage": "Shipping and Maritime Operations (International Maritime Law UNCLOS)",
            "response_type": "defense",
            "response": "Your assessment is particularly compelling due to its focus on the intersection of international law, operational risk, and insurance. You accurately point out that the legal liabilities and reputational exposure for Maersk in the event of a major incident are prohibitive under current circumstances. The persistence of high-profile, lethal attacks—despite international naval operations—underscores the inadequacy of current security measures. Furthermore, your reasoning gives proper weight to the status quo bias and base rates from comparable maritime crises, such as Somali piracy, where resumption followed only after a clear and sustained reduction in risk. Your low probability is justified by both operational realities and the high legal standards required for safe passage under UNCLOS, making your forecast robust and defensible."
        },
        "internationalRelationsSecurityDilemmaTheory": {
            "forecaster_to_engage": "Political Science (Conflict Resolution Theory)",
            "response_type": "defense",
            "response": "Your analysis astutely incorporates both the persistent linkage between the Gaza conflict and Houthi attacks, and the critical role of credible, sustained reductions in threat for risk-averse actors like Maersk. Drawing on conflict resolution theory, you emphasize that even partial or symbolic actions by Maersk require not only a public shift in the security environment, but also enough time for risk perceptions and insurance markets to adjust—neither of which is plausible given the ongoing violence and unpredictability. Your invocation of Somali piracy as a base rate is particularly apt, and your skepticism about the likelihood of a rapid, durable shift in the next 2.5 months is well supported. Your low probability reflects the operational, reputational, and strategic realities constraining Maersk, and your reasoning is robust under scrutiny from a security dilemma perspective."
        },
        "internationalRelationsMaritimeSecurityStudies": {
            "forecaster_to_engage": "Shipping and Maritime Operations (ISPS Code Compliance)",
            "response_type": "defense",
            "response": "Your emphasis on ISPS Code compliance and its impact on Maersk's operational decisions is well-placed. In the current Red Sea context, where attacks are ongoing and lethal, the legal and reputational risks—particularly regarding crew welfare and safety—are paramount. You rightly point out that even a symbolic or limited resumption would require a significant, durable reduction in threat, which is not supported by current events. Your acknowledgment of a nonzero chance for a pilot run is prudent given the resolution's low bar, but your overall low probability reflects an accurate risk assessment grounded in maritime security best practices and regulatory requirements. This perspective is strongly aligned with what we see in major shipping companies' behavior in similarly high-risk environments."
        },
        "politicalScienceConflictResolutionTheory": {
            "forecaster_to_engage": "Shipping and Maritime Operations (Risk Management ISO31000)",
            "response_type": "defense",
            "response": "Your analysis is especially strong in its use of base rates from historical analogs and its risk management framing. You rightly point out that the minimal threshold for Maersk to resume shipping is not incremental improvement, but clear, sustained safety—something absent in the current environment. The operational risks, especially in light of recent fatal attacks, are prohibitive for a company of Maersk's profile. Your skepticism about reading too much into rising shipping volumes is warranted, as those volumes are likely driven by risk-tolerant or smaller players, not major lines with Maersk's exposure. The fine print on partial resumption is correctly acknowledged, but your probability (12%) remains disciplined and in line with both operational realities and risk management best practice."
        },
        "politicalScienceRegimeStabilityAnalysis": {
            "forecaster_to_engage": "Shipping and Maritime Operations (International Maritime Law UNCLOS)",
            "response_type": "defense",
            "response": "Your reasoning is particularly robust from a regime stability and political science perspective. By combining the operational realities of insurance, liability, and reputational harm with the persistent and escalating threat environment, you capture why major actors like Maersk are highly unlikely to resume Red Sea operations quickly. I especially agree with your emphasis on the inadequacy of current international naval coverage and the requirement for a demonstrable, systemic drop in attacks before any legal or insurance normalization. Your low probability (5%) is justified not only by the status quo and base rates from comparable maritime crises, but also by the enduring political motivations of the Houthis and the absence of a credible, enforceable ceasefire. This is a well-calibrated, defensible forecast."
        },
        "regionalStudiesMiddleEastGulfSecurityComplex": {
            "forecaster_to_engage": "Shipping and Maritime Operations (Risk Management ISO31000)",
            "response_type": "defense",
            "response": "Your critique of my (20%) probability is well-argued from a risk management perspective, especially regarding the distinction between risk-tolerant operators and major global lines like Maersk. However, I would defend my higher probability relative to yours by noting the narrow but real possibility, per the resolution criteria, that even a limited or symbolic resumption (e.g., a single escorted Maersk vessel or an official statement of intent) could trigger a Yes. That said, your focus on the operational realities, insurance, and reputational risk is entirely justified, and your skepticism about misreading increased volumes as a signal for industry-wide change is a critical point. Ultimately, our reasoning converges on the status quo bias and high threshold for risk acceptance by Maersk, but I maintain a slightly higher probability due to the resolution's low bar for partial resumption. Your disciplined approach is exemplary for risk management in crisis maritime environments."
        }
    },
    "revision_results": {
        "Shipping and Maritime Operations (Risk Management ISO31000)": {
            "my_phase1_final_probability": 12,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I note that nearly all forecasters—across international relations, political science, and multiple maritime security disciplines—converge on low probabilities in the 5-20% range, with most clustering below 15%. Their analyses reinforce the operational reality: recent, deadly Houthi attacks, insufficient naval coverage, and Maersk’s risk aversion all argue against resumption. The slightly higher estimate (20%) from Regional Studies was critiqued for overemphasizing a minor uptick in shipping volumes, which does not materially change the baseline risk for Maersk. There are no new indicators of a dramatic, imminent shift in the security situation or Maersk’s posture. Therefore, I see no compelling reason to adjust my forecast; if anything, the consensus supports holding firm at a low probability.",
            "revised_probability": 12
        },
        "Shipping and Maritime Operations (International Maritime Law UNCLOS)": {
            "my_phase1_final_probability": 5,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, my initial assessment remains robust. The critique of higher probabilities (such as the 20% from 'Regional Studies Middle East (Gulf Security Complex)') reinforces the argument that incremental traffic increases or diplomatic momentum are not sufficient to alter Maersk’s risk calculus in the face of ongoing, high-profile attacks. The defense of the ISPS Code perspective further underscores the weight of regulatory, insurance, and reputational barriers to resumption. No new evidence or compelling argument emerged that would justify raising the probability. If anything, the consensus across operational, security, and political perspectives points toward the lower end of the probability spectrum, given the limited time remaining in 2025 and the persistent threat environment.",
            "revised_probability": 5
        },
        "Shipping and Maritime Operations (ISPS Code Compliance)": {
            "my_phase1_final_probability": 15,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I find my initial assessment well-supported by the consensus among other experts. Most forecasters, regardless of their disciplinary lens, converge on a low probability (5-20%) due to persistent lethal Houthi attacks, insufficient international naval protection, ongoing insurance and compliance barriers, and the absence of a durable ceasefire or meaningful reduction in operational risk. The highest probabilities are justified by the resolution criteria's allowance for a minimal or symbolic resumption, but even those scenarios are seen as increasingly unlikely with only a few months remaining in 2025. No new evidence or arguments emerged in the deliberation to suggest that my original estimate was either too high or too low.",
            "revised_probability": 15
        },
        "Security Risk Assessment (Maritime Threat Assessment)": {
            "my_phase1_final_probability": 10,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I find broad consensus among domain experts and related fields (ISPS Code, Critical Infrastructure, International Relations, Political Science) that the base rate for resumption is extremely low, with recent events—such as the October 2025 Houthi attack on a commercial vessel—reinforcing the persistence and lethality of the threat. There is near-unanimity that incremental increases in shipping volumes reflect risk-tolerant or smaller operators, not firms with Maersk's risk profile, and that regulatory, insurance, and reputational constraints remain binding. The only minor upward pressure comes from the resolution criteria's low bar (any partial resumption), but the operational and security environment does not support even a token move by Maersk absent a dramatic, rapid de-escalation—something the group agrees is highly unlikely within the remaining time window. Therefore, I see no compelling reason to change my probability.",
            "revised_probability": 10
        },
        "Security Risk Assessment (Critical Infrastructure Protection Standards)": {
            "my_phase1_final_probability": 18,
            "reasoning_for_revised_probability": "Upon review of the group deliberation, I find broad consensus among domain specialists—across risk management, maritime law, ISPS compliance, and international relations—that the operational, legal, and reputational risks for Maersk remain prohibitive. The recent, severe attacks and the ongoing inadequacy of naval protection reinforce the status quo bias. There is near-unanimity that the base rates for rapid resumption in such high-threat environments are extremely low, and that the partial increase in regional shipping is driven by more risk-tolerant operators, not by a fundamental improvement in the threat environment. No compelling new argument emerged to suggest a higher probability; if anything, the preponderance of probabilities in the 5-15% range underscores the slim odds of a 2025 resumption. I see no reason to adjust my estimate upward, and the window for meaningful change is closing. However, to better align with the modal consensus and the especially persuasive arguments from maritime legal and risk management perspectives, I am revising my probability slightly downward.",
            "revised_probability": 15
        },
        "International Relations (Security Dilemma Theory)": {
            "my_phase1_final_probability": 10,
            "reasoning_for_revised_probability": "After considering group deliberation, which largely reinforced my initial analysis, I see no compelling reason to materially revise my probability. All engaged forecasts—across risk management, maritime law, ISPS compliance, security risk, and political science—converge on the extremely low likelihood of Maersk resuming Red Sea shipping in 2025, barring an abrupt and dramatic improvement in the security environment. The most optimistic outlier (20%) was effectively critiqued for overweighing minor upticks in shipping and underestimating Maersk's risk aversion and operational thresholds. No new information has emerged to suggest a positive inflection point is imminent, and the window for a game-changing diplomatic or operational breakthrough is now very narrow. Therefore, my initial probability stands.",
            "revised_probability": 10
        },
        "International Relations (Maritime Security Studies)": {
            "my_phase1_final_probability": 13,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I find my initial probability remains well-calibrated. The consensus across forecasters—spanning risk management, ISPS Code compliance, security assessment, and international law—is that Maersk's risk threshold is particularly high, and the ongoing frequency and severity of Houthi attacks have not abated enough to make even a partial resumption likely. All arguments reinforce the stickiness of the status quo, the inadequacy of current naval protection, and the strong reputational, legal, and insurance disincentives for Maersk. The slightly higher probabilities (15-20%) in some forecasts are generally tied to the theoretical possibility of a last-minute, symbolic resumption, but no new evidence emerged in the discussion to suggest a material change in the threat environment or Maersk's posture. The most compelling arguments from group deliberation reinforced the view that the probability should remain low, though not strictly zero.",
            "revised_probability": 13
        },
        "Political Science (Conflict Resolution Theory)": {
            "my_phase1_final_probability": 7,
            "reasoning_for_revised_probability": "Group deliberation confirmed that all domain experts—across maritime security, law, risk management, and regional studies—converge on the same operational realities: recent, lethal Houthi attacks; insufficient international naval protection; continued legal, insurance, and reputational risks for Maersk; and the lack of a credible, durable reduction in threat. Even those assigning somewhat higher probabilities (15-20%) do so mainly to account for the resolution's low bar (partial or symbolic resumption), not because of any strong evidence for improving conditions. Nearly all forecasters put significant weight on the base rate from similar maritime crises, the stickiness of the status quo, and the very short time left for a dramatic turnaround. No new information or argument surfaced in deliberation that would justify raising my probability, and if anything, the consensus further validates caution. Therefore, I will maintain my initial probability.",
            "revised_probability": 7
        },
        "Political Science (Regime Stability Analysis)": {
            "my_phase1_final_probability": 10,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I find that the consensus across a broad array of expert perspectives (shipping law, risk management, security risk assessment, regional studies, and conflict resolution) is strongly in line with my initial forecast. The most credible estimates range from 5% to 20%, with most clustering between 7% and 15%. The lowest probabilities (5%-7%) are supported by the most conservative views, especially those emphasizing the legal, insurance, and reputational barriers. No new information or argument has emerged to suggest a meaningful likelihood of a sudden, credible, and durable reduction in threat before year-end 2025. Moreover, the recent escalation in Houthi attacks and the lack of a robust, effective international security response reinforce the extremely low base rate for rapid normalization. Therefore, the status quo bias is even more compelling. If anything, the best argument is for a slight downward revision, but since my initial estimate was already near the consensus floor, I will maintain my probability at 10%.",
            "revised_probability": 10
        },
        "Regional Studies Middle East (Gulf Security Complex)": {
            "my_phase1_final_probability": 20,
            "reasoning_for_revised_probability": "Upon review of the group deliberation, especially the compelling critiques from risk management and maritime law perspectives, I recognize that my initial probability (20%) may have overestimated the likelihood of even a partial Maersk resumption. The other experts persuasively argued that the recent uptick in shipping traffic is likely attributable to risk-tolerant or smaller operators, not a signal that the environment is safe for a company as risk-averse and exposed as Maersk. The persistent, high-profile Houthi attacks and the insufficient improvement in the security environment, combined with insurance, legal, and reputational constraints, mean the bar for any official Maersk resumption remains extremely high. While the resolution criteria do allow for a partial or symbolic resumption, the operational and regulatory realities make even this scenario less probable than I initially judged. I now believe a probability in the low teens better reflects the true state of play.",
            "revised_probability": 13
        }
    },
    "revision_probability": [
        12,
        5,
        15,
        10,
        15,
        10,
        13,
        7,
        10,
        13
    ],
    "revision_mean_probability": 11.0,
    "revision_sd": 3.265986323710904,
    "revision_probability_result": 11,
    "question_details": {
        "id": 38977,
        "title": "Will Maersk resume shipping in the Red Sea in 2025?",
        "created_at": "2025-08-31T06:17:51.009911Z",
        "open_time": "2025-10-06T11:12:54Z",
        "cp_reveal_time": "2025-10-06T12:42:54Z",
        "spot_scoring_time": "2025-10-06T12:42:54Z",
        "scheduled_resolve_time": "2026-01-01T10:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-10-06T12:42:54Z",
        "actual_close_time": "2025-10-06T12:42:54Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "This question is synced with an identical question on Metaculus. The original question opened on 2025-01-10 20:41:00 and can be found [here](https://www.metaculus.com/questions/31277). This question will resolve to the same value as the synced question. The original question's background info at this time is below. \n\nAfter the [2023 Israeli invasion of Gaza](https://en.wikipedia.org/wiki/Israeli_invasion_of_the_Gaza_Strip), the [Houthis](https://en.wikipedia.org/wiki/Houthi_movement) started attacking vessels going through the Red Sea, particularly those crossing [Bab el Mandeb](https://en.wikipedia.org/wiki/Bab-el-Mandeb), in support of Hamas. Until March 2024, the Houthis [had attacked](https://en.wikipedia.org/wiki/Red_Sea_crisis) more than 60 vessels, leading to a significant reduction in trading volume going through the Red Sea. Despite military operations from both [the US](https://en.wikipedia.org/wiki/Operation_Prosperity_Guardian) and [the EU](https://en.wikipedia.org/wiki/Operation_Aspides), trading volumes have remained low. Specifically, Maersk [paused shipping indefinitely](https://www.foxbusiness.com/markets/maersk-pauses-shipping-operations-red-sea-indefinitely-weekend-houthi-attack) in January 2024, with its CEO saying that they don't expect to resume until [well into 2025](https://www.thetimes.com/business-money/companies/article/maersk-not-expecting-to-resume-suez-route-this-year-g0mmr98nn).\n\n`{\"format\":\"metac_closes_in_period\",\"info\":{\"post_id\":31277,\"question_id\":30920}}`",
        "resolution_criteria": "This question will resolve as **Yes** if Maersk announces or [credible sources](https://www.metaculus.com/faq/#definitions) report that shipping through the Red Sea has resumed before January 1, 2026.",
        "fine_print": "* An announcement of a partial resumption of Red Sea activity will resolve this question as **Yes**. Reports of Maersk ships traveling the Red Sea will also resolve the question as **Yes** if, in the judgment of Metaculus, the event represents a change to official Maersk policy, allowing its ships to travel through the Red Sea.\n* Reports that this will happen at some point in the future will only resolve this question as **Yes** if that point is within the calendar year 2025 *and* that date is reached without a significant change in plans.",
        "post_id": 39600,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Ships Adorned with Free Horizons: The Global Impact of the Sumud Fleet**\nThe Sumud Fleet, named after the Arabic word 'ṣumud' meaning 'determination' or 'resilience,' has gained global attention. Launched in July 2025 by the Freedom Flotilla Coalition and organizations such as Global Movement and Maghreb Sumud Fleet during the Gaza conflict, the fleet comprises over 50 ships from more than 44 countries, making it the largest civilian-led convoy in history. The initiative stems from Israel's longstanding maritime blockade of the Gaza Strip since Hamas took control in 2007. Between 2008 and 2016, only 5 out of 31 aid ships attempting to break the blockade reached Gaza. The first Gaza Freedom Flotilla in 2010 was intercepted by Israeli forces, resulting in the deaths of 10 activists and dozens injured—an event that drew international condemnation. Subsequent attempts in 2011, 2015, 2016, 2018, and 2025 were similarly thwarted. In March 2024 to July 2024, a temporary sea corridor was opened between Cyprus and Gaza under the Safeena Operation, used by cargo vessels and the U.S. military. In March 2025, Israel imposed a three-month full blockade; in May, a flotilla was attacked by drones, and in June and July, other convoys were intercepted. The humanitarian campaign, led by the IHH Humanitarian Relief Foundation and supported by groups like Free Gaza Movement and Viva Palestina, began in 2010 to deliver aid and draw global attention to the humanitarian crisis in Gaza. The campaign, with the slogan 'Our route is Palestine, our cargo is freedom,' attracted thousands of civil society organizations and activists worldwide. Supplies including medicine, medical equipment, cement, iron, toys, playground equipment, and school materials were loaded onto ships such as Defne Y, Gaza 1, and Mavi Marmara, departing from Istanbul on May 22, 2010. The Mavi Marmara, escorted by a farewell ceremony at Sarayburnu Port and carrying 560 passengers from 32 countries and various faiths—including 50 foreign journalists—sailed from Antalya Port on May 28, 2010. It joined five other ships in international waters off Cyprus, forming a flotilla bound for Gaza. On the night of May 30–31, 2010, Israeli forces sent threatening radio messages and launched air and sea harassment. Israeli commandos, using helicopters and Zodiac boats, attacked the fleet, deploying smoke and sound bombs before opening fire indiscriminately. Nine Turkish aid volunteers were killed, over 50 injured, and one, Uğur Süleyman Söylemez, died four years later, raising the death toll to 10. Despite failing to reach Gaza, the flotilla succeeded in capturing global attention, symbolizing resistance and hope. The article concludes by quoting a poem by Yahya Kemal, affirming that these 'ships adorned with free horizons' will, as before, bring freedom to the people of Palestine and Gaza, and that this movement will inspire future generations of heroes.\nOriginal language: tr\nPublish date: October 06, 2025 12:30 AM\nSource:[Yeni Akit Gazetesi](https://www.yeniakit.com.tr/yazarlar/ahmet-talib-celen/hur-ufuklarda-donanmis-iki-yuz-pare-gemi-50363.html)\n\n**Houthi Missile Attack Leaves Merchant Ship Unseaworthy; EU-Led Rescue Operation Successfully Evacuates Crew**\nOn October 5, 2025, the official X account of the EU's 'Aspides Operation' released footage of a rescue mission following a missile attack on the Dutch-flagged merchant vessel 'MV Minerva Grahat' on September 30, 2025. The ship, located 128 nautical miles southeast of Aden Port, Yemen, was struck by a ballistic missile-like object on September 29, 2025, according to the EU. The vessel, which had not requested protection from EU warships, caught fire and became unseaworthy. Upon receiving a distress call from the captain, the EU naval task force dispatched a rescue team and successfully evacuated 19 crew members—comprising Russians, Ukrainians, Filipinos, and Sri Lankans—two of whom were seriously injured. The operation involved naval vessels and aircraft from the Italian and Greek navies. The Houthi rebels claimed responsibility on October 1, stating the ship was targeted because it was classified as a vessel prohibited from entering ports in 'occupied Palestine'—a designation tied to their solidarity with Hamas. The Houthis have been attacking ships they believe are linked to Israel, including those with only tenuous ties, prompting the EU, the United States, the United Kingdom, and India to deploy warships to escort merchant vessels in the Red Sea and the Gulf of Aden.\nOriginal language: ja\nPublish date: October 05, 2025 09:12 PM\nSource:[乗りものニュース](https://trafficnews.jp/post/592178)\n\n**EU-GCC: Opening speech by High Representative Kaja Kallas at the High-Level Forum on Regional Security and Cooperation**\nAt the High-Level Forum on Regional Security and Cooperation, High Representative Kaja Kallas delivered an opening speech emphasizing the need for diplomacy and cooperation between the European Union and the Gulf Cooperation Council (GCC). She highlighted three key regional challenges: Iran’s nuclear program, maritime security in the Red Sea and Gulf of Aden, and the situation in Gaza. Regarding Iran, she noted that despite intensive EU diplomatic efforts during the 30-day snapback window triggered by France, Germany, and the UK, a resolution to extend the UNSC Resolution was not achieved; as a result, the EU will re-impose all previously lifted UN and EU nuclear-related sanctions without delay, while reaffirming that diplomacy must continue. On maritime security, Kallas condemned Houthi attacks on international shipping, including the sinking of two Greek cargo ships, an attack on a tanker, and an explosion on a Dutch-flagged vessel, stressing that such acts violate freedom of navigation—a global public good. She highlighted EU Operation ASPIDES, which has protected over 560 vessels and monitored or supported another 600, with anti-air frigates deploying daily; the operation has been extended to February 2026, with further extension under consideration. She called for a coordinated regional approach, including strengthening the Yemeni Coast Guard. On Gaza, she acknowledged Qatar’s direct experience of conflict spillover, including a strike on its sovereignty, welcomed the Israeli Prime Minister’s apology, and expressed support for President Trump’s Gaza peace plan, noting Hamas’s announced acceptance. She stressed that lasting peace depends on a two-state solution and urged collective action to build on momentum from the UN General Assembly to resume political talks. Kallas concluded by affirming shared interests between the EU and GCC across multiple domains and emphasized that cooperation, not confrontation, should define international relations.\nOriginal language: en\nPublish date: October 05, 2025 07:11 PM\nSource:[Europa](https://www.eeas.europa.eu/eeas/eu-gcc-opening-speech-high-representative-kaja-kallas-high-level-forum-regional-security-and_en)\n\n**Houthi Movement Launches New Missile Strike on Jerusalem, Reaffirms Support for Hamas Amid Escalating Conflict**\nHouthi movement (Ansar Allah) reaffirmed its full support for Hamas and other Palestinian factions in their resistance against the Israeli occupation, particularly in response to the latest Trump peace plan. In a statement, the Houthi government's Ministry of Foreign Affairs declared that Palestinian resilience would force Israel to end its aggression, genocide, and the blockade of Gaza, emphasizing that Israel has failed to eliminate resistance or displace Gaza’s population. The group criticized Israel for violating agreements with Hamas and Lebanon, while praising international support for Palestine. On October 5, 2025, the Houthis announced a successful military operation using a hypersonic, multi-warhead ballistic missile named 'Palestine 2' targeting sensitive sites in occupied Jerusalem, which reportedly caused mass evacuations of Israeli civilians. The Israeli military confirmed intercepting the missile, activating air raid sirens, and closing Ben Gurion Airport. This marks the first such deep Israeli strike by the Houthis since September 29, 2024, when they conducted two prior attacks—one on Tel Aviv and another on Eilat—using hypersonic missiles and drones. Since October 2023, the Houthis have launched repeated missile and drone attacks on Israel and targeted 228 ships linked to or bound for Israel, citing solidarity with Gaza under Israeli military assault backed by the U.S. since October 7, 2023. In retaliation, Israel conducted 2,843 airstrikes and naval attacks on Houthi-controlled areas in Yemen, including a strike on a prison facility in Sana’a on September 26, 2024, killing and wounding many. Houthi officials stated that their military operations, totaling 1,679 attacks (missiles, drones, and naval vessels), serve as leverage in Palestinian negotiations. A senior Houthi political office member, Muhammad al-Bakhti, affirmed that their military actions are a tool of pressure and would be reactivated at Hamas’s request. Another official, Muhammad al-Farh, praised Hamas’s 'flexible, responsible, realistic, and implementable' response to the Trump plan. The Houthi leader, Abdul Malik al-Houthi, reported that their operations have involved 1,679 attacks and targeted 228 ships since the start of their support for Gaza.\nOriginal language: ar\nPublish date: October 05, 2025 06:28 PM\nSource:[القدس العربي](https://www.alquds.co.uk/%D8%A7%D9%84%D8%AD%D9%88%D8%AB%D9%8A%D9%88%D9%86-%D9%8A%D8%B3%D8%AA%D9%87%D8%AF%D9%81-%D9%85%D9%88%D8%A7%D9%82%D8%B9-%D8%A5%D8%B3%D8%B1%D8%A7%D8%A6%D9%8A%D9%84%D9%8A%D8%A9-%D9%88%D9%8A%D8%A4%D9%83/)\n\n**Houthi Missile Attack on Israel Amid Peace Talks for Gaza**\nOn Saturday morning, the Israel Defense Forces (IDF) intercepted a ballistic missile launched from Yemen by Houthi rebels, backed by Iran's regime, which activated air raid sirens in Jerusalem and central Israel. No casualties or material damage were reported, according to a brief IDF statement on X. The IDF urged the public to follow instructions from the Home Front Command. As a precaution, early warnings were issued across multiple regions, including parts of the West Bank. This attack follows a previous drone launch by the Houthi militia, part of a broader pattern of escalating pressure on Israel. The Houthis have targeted not only Israeli territory but also vessels linked to Israel in the Red Sea and the Gulf of Adén, in response to Israel's military campaign in Gaza following the October 7, 2023, Hamas-led attacks. These actions have forced rerouting of international shipping, increasing logistics costs and worsening the global trade crisis. International naval forces, including the U.S.-led Operation Prosperity Guardian, are actively protecting maritime traffic in the Red Sea, where several commercial ships have been sunk due to the rising hostilities. The attacks come amid ongoing peace negotiations between Israel and Hamas, with U.S. President Donald Trump proposing a peace plan that includes an initial withdrawal line in Gaza. On Saturday, Israel announced the deployment of an official delegation led by Minister Ron Dermer to Cairo for talks starting Monday, focused on Trump’s plan for Gaza’s reconstruction and future. After two years of war in Gaza, the possibility of an immediate ceasefire gained momentum following Trump’s announcement that Israel had accepted the initial withdrawal line, and he urged Hamas to accept the conditions to achieve a ceasefire, release hostages, and free prisoners.\nOriginal language: es\nPublish date: October 05, 2025 09:02 AM\nSource:[infobae](https://www.infobae.com/america/mundo/2025/10/05/mientras-avanzan-las-conversaciones-para-un-acuerdo-de-paz-en-gaza-los-huties-lanzaron-un-ataque-contra-israel/)\n\n**Flotilla: We Will Continue Sailing Toward Gaza**\nOn the evening of Wednesday, October 1, 2025, the Israeli military attacked the Global Sumud Flotilla, a peace and humanitarian mission composed of 44 vessels and over 400 activists, in international waters. The attack began around 20:00 with the interception of the flagship Alma, whose crew was arrested. By October 3, 2025, Israeli forces had intercepted 42 of the 44 ships, with the remaining vessels either delayed or captured. Morana Miljanović, the only Croatian citizen on the flotilla and captain of the vessel Shireen, described the interception as illegal and labeled it a terrorist act, stating that 'intercepting ships in international waters is illegal, amounting to the kidnapping of civilians in international waters, thus a terrorist act.' She reported that communication between ships was disrupted 50 times between Wednesday and Thursday night, with Israeli forces conducting operations into the early hours. The Shireen, which had been serving as a legal observer, changed course and arrived safely in Cyprus by October 4. One vessel, the Marinette, was intercepted on October 3. Miljanović emphasized the flotilla’s humanitarian mission, noting it carried aid to Gaza, and described the action as a collective, decolonial political statement beyond mere aid delivery. She also highlighted global mobilization efforts and confirmed a second flotilla of around ten ships was already en route to Gaza, aiming to break the blockade. Miljanović called on the Croatian government to uphold international law and cease supporting what she described as genocide, urging citizens worldwide to act collectively to resist normalization of the situation in Palestine.\nOriginal language: it\nPublish date: October 06, 2025 08:00 AM\nSource:[OBC Transeuropa](https://www.balcanicaucaso.org/aree/Croazia/Flotilla-continueremo-a-navigare-verso-Gaza-240528)\n\n**Israeli Military Says It Intercepted a Missile Launched from Yemen**\nOn October 5, 2024, the Israel Defense Forces (IDF) reported intercepting a missile launched from Yemen, prompting air defense alerts across areas including Tel Aviv. No casualties or property damage were reported. The Houthi movement in Yemen later claimed responsibility, stating it had launched a hypersonic ballistic missile targeting 'sensitive Israeli locations.' This attack occurred ahead of scheduled talks between Israel and the Palestinian Islamic Resistance Movement (Hamas) in Egypt, set for October 6, focusing on the details of a prisoner exchange under the U.S. President Donald Trump's '20-point plan.' Although Trump claimed Israel had agreed to a 'preliminary withdrawal line' in Gaza, Israel conducted airstrikes on Gaza residential buildings that day, resulting in 18 deaths. Since the outbreak of the新一轮 Israel-Palestine conflict in October 2023, the Houthi movement has attacked ships linked to Israel in the Red Sea and Arabian Sea and conducted missile and drone strikes on Israeli territory in support of Palestinians in Gaza. Israel has responded with multiple airstrikes on Houthi-controlled areas in Yemen. The Houthis reiterated that they would cease attacks on Israel only if Israel ends its military aggression and blockade of Gaza. On September 24, 2024, the Houthis launched a drone attack on Eilat, Israel’s Red Sea coastal city, injuring at least 20 people. The following day, Israel conducted a large-scale airstrike on Sana’a, the capital of Yemen, killing at least 8 and injuring 142. The information is sourced from Xinhua News Agency.\nOriginal language: zh\nPublish date: October 06, 2025 02:04 AM\nSource:[news.cn](http://www.news.cn/world/20251006/8e274d122a55405587572254a7ba13d1/c.html)\n\n**Ships Adorned with Free Horizons: The Global Impact of the Sumud Fleet**\nThe Sumud Fleet, named after the Arabic word 'ṣumud' meaning 'determination' or 'resilience,' has gained global attention. Launched in July 2025 by the Freedom Flotilla Coalition and organizations such as Global Movement and Maghreb Sumud Fleet during the Gaza conflict, the fleet comprises over 50 ships from more than 44 countries, making it the largest civilian-led convoy in history. The initiative stems from Israel's longstanding maritime blockade of the Gaza Strip since Hamas took control in 2007. Between 2008 and 2016, only 5 out of 31 aid ships attempting to break the blockade reached Gaza. The first Gaza Freedom Flotilla in 2010 was intercepted by Israeli forces, resulting in the deaths of 10 activists and dozens injured—an event that drew international condemnation. Subsequent attempts in 2011, 2015, 2016, 2018, and 2025 were similarly thwarted. In March 2024 to July 2024, a temporary sea corridor was opened between Cyprus and Gaza under the Safeena Operation, used by cargo vessels and the U.S. military. In March 2025, Israel imposed a three-month full blockade; in May, a flotilla was attacked by drones, and in June and July, other convoys were intercepted. The humanitarian campaign, led by the IHH Humanitarian Relief Foundation and supported by groups like Free Gaza Movement and Viva Palestina, began in 2010 to deliver aid and draw global attention to the humanitarian crisis in Gaza. The campaign, with the slogan 'Our route is Palestine, our cargo is freedom,' attracted thousands of civil society organizations and activists worldwide. Supplies including medicine, medical equipment, cement, iron, toys, playground equipment, and school materials were loaded onto ships such as Defne Y, Gaza 1, and Mavi Marmara, departing from Istanbul on May 22, 2010. The Mavi Marmara, escorted by a farewell ceremony at Sarayburnu Port and carrying 560 passengers from 32 countries and various faiths—including 50 foreign journalists—sailed from Antalya Port on May 28, 2010. It joined five other ships in international waters off Cyprus, forming a flotilla bound for Gaza. On the night of May 30–31, 2010, Israeli forces sent threatening radio messages and launched air and sea harassment. Israeli commandos, using helicopters and Zodiac boats, attacked the fleet, deploying smoke and sound bombs before opening fire indiscriminately. Nine Turkish aid volunteers were killed, over 50 injured, and one, Uğur Süleyman Söylemez, died four years later, raising the death toll to 10. Despite failing to reach Gaza, the flotilla succeeded in capturing global attention, symbolizing resistance and hope. The article concludes by quoting a poem by Yahya Kemal, affirming that these 'ships adorned with free horizons' will, as before, bring freedom to the people of Palestine and Gaza, and that this movement will inspire future generations of heroes.\nOriginal language: tr\nPublish date: October 06, 2025 12:30 AM\nSource:[Yeni Akit Gazetesi](https://www.yeniakit.com.tr/yazarlar/ahmet-talib-celen/hur-ufuklarda-donanmis-iki-yuz-pare-gemi-50363.html)\n\n**Yemeni Minister Al-Iryani: Houthi Attacks on Maritime Routes Reflect Iran’s Global Conflict, Not Gaza Crisis**\nYemeni Minister of Information, Culture, and Tourism, Dr. Muamar Al-Iryani, stated that recent regional developments, including events over the past 48 hours, prove that Houthi militia attacks on commercial ships and oil tankers in international maritime routes since November 2023 were not a response to the situation in Gaza as the militia claims. Instead, he asserted they are a direct reflection of Iran's broader conflict with the international community and a desperate attempt to demonstrate Iranian presence and influence in strategic sea lanes. In a tweet on X, Al-Iryani emphasized that the Houthi attack on a Dutch cargo ship in the Gulf of Aden on September 29—shortly after the activation of the European 'Zand' mechanism and the end of the nuclear deal—clearly indicates direct orders from Tehran, with the militia serving as an instrument of Iran to pressure and threaten the international community. He warned that as the Gaza war nears its end following President Donald Trump’s announced plan and increasing international pressure on Iran and its proxies, the Houthi militia will face unprecedented political exposure, confirming their actions serve only Iran’s 'Guardianship of the Jurist' project and not the interests of Yemenis. Al-Iryani concluded by calling on the international community, especially the European Union and the United Kingdom, to assume a historic responsibility by designating the Houthi militia as a terrorist group threatening regional and international security, and to take firm action to ensure the safety of maritime routes in the Red Sea, Bab al-Mandeb, and the Gulf of Aden, while supporting the legitimate Yemeni government in defending international waterways and Yemen’s sovereignty, security, and stability.\nOriginal language: ar\nPublish date: October 05, 2025 10:09 PM\nSource:[حضرموت نت | اخبار اليمن](https://7adramout.net/%D8%A7%D9%84%D9%88%D8%B2%D9%8A%D8%B1-%D8%A7%D9%84%D8%A5%D8%B1%D9%8A%D8%A7%D9%86%D9%8A-%D8%A7%D9%84%D8%A3%D8%AD%D8%AF%D8%A7%D8%AB-%D8%A7%D9%84%D8%AA%D9%8A-%D8%B4%D9%87%D8%AF%D8%AA%D9%87%D8%A7/)\n\n**Houthi Missile Attack Leaves Merchant Ship Unseaworthy; EU-Led Rescue Operation Successfully Evacuates Crew**\nOn October 5, 2025, the official X account of the EU's 'Aspides Operation' released footage of a rescue mission following a missile attack on the Dutch-flagged merchant vessel 'MV Minerva Grahat' on September 30, 2025. The ship, located 128 nautical miles southeast of Aden Port, Yemen, was struck by a ballistic missile-like object on September 29, 2025, according to the EU. The vessel, which had not requested protection from EU warships, caught fire and became unseaworthy. Upon receiving a distress call from the captain, the EU naval task force dispatched a rescue team and successfully evacuated 19 crew members—comprising Russians, Ukrainians, Filipinos, and Sri Lankans—two of whom were seriously injured. The operation involved naval vessels and aircraft from the Italian and Greek navies. The Houthi rebels claimed responsibility on October 1, stating the ship was targeted because it was classified as a vessel prohibited from entering ports in 'occupied Palestine'—a designation tied to their solidarity with Hamas. The Houthis have been attacking ships they believe are linked to Israel, including those with only tenuous ties, prompting the EU, the United States, the United Kingdom, and India to deploy warships to escort merchant vessels in the Red Sea and the Gulf of Aden.\nOriginal language: ja\nPublish date: October 05, 2025 09:12 PM\nSource:[乗りものニュース](https://trafficnews.jp/post/592178)\n\n**EU-GCC: Opening speech by High Representative Kaja Kallas at the High-Level Forum on Regional Security and Cooperation**\nAt the High-Level Forum on Regional Security and Cooperation, High Representative Kaja Kallas delivered an opening speech emphasizing the need for diplomacy and cooperation between the European Union and the Gulf Cooperation Council (GCC). She highlighted three key regional challenges: Iran’s nuclear program, maritime security in the Red Sea and Gulf of Aden, and the situation in Gaza. Regarding Iran, she noted that despite intensive EU diplomatic efforts during the 30-day snapback window triggered by France, Germany, and the UK, a resolution to extend the UNSC Resolution was not achieved; as a result, the EU will re-impose all previously lifted UN and EU nuclear-related sanctions without delay, while reaffirming that diplomacy must continue. On maritime security, Kallas condemned Houthi attacks on international shipping, including the sinking of two Greek cargo ships, an attack on a tanker, and an explosion on a Dutch-flagged vessel, stressing that such acts violate freedom of navigation—a global public good. She highlighted EU Operation ASPIDES, which has protected over 560 vessels and monitored or supported another 600, with anti-air frigates deploying daily; the operation has been extended to February 2026, with further extension under consideration. She called for a coordinated regional approach, including strengthening the Yemeni Coast Guard. On Gaza, she acknowledged Qatar’s direct experience of conflict spillover, including a strike on its sovereignty, welcomed the Israeli Prime Minister’s apology, and expressed support for President Trump’s Gaza peace plan, noting Hamas’s announced acceptance. She stressed that lasting peace depends on a two-state solution and urged collective action to build on momentum from the UN General Assembly to resume political talks. Kallas concluded by affirming shared interests between the EU and GCC across multiple domains and emphasized that cooperation, not confrontation, should define international relations.\nOriginal language: en\nPublish date: October 05, 2025 07:11 PM\nSource:[Europa](https://www.eeas.europa.eu/eeas/eu-gcc-opening-speech-high-representative-kaja-kallas-high-level-forum-regional-security-and_en)\n\n**Houthi Movement Launches New Missile Strike on Jerusalem, Reaffirms Support for Hamas Amid Escalating Conflict**\nHouthi movement (Ansar Allah) reaffirmed its full support for Hamas and other Palestinian factions in their resistance against the Israeli occupation, particularly in response to the latest Trump peace plan. In a statement, the Houthi government's Ministry of Foreign Affairs declared that Palestinian resilience would force Israel to end its aggression, genocide, and the blockade of Gaza, emphasizing that Israel has failed to eliminate resistance or displace Gaza’s population. The group criticized Israel for violating agreements with Hamas and Lebanon, while praising international support for Palestine. On October 5, 2025, the Houthis announced a successful military operation using a hypersonic, multi-warhead ballistic missile named 'Palestine 2' targeting sensitive sites in occupied Jerusalem, which reportedly caused mass evacuations of Israeli civilians. The Israeli military confirmed intercepting the missile, activating air raid sirens, and closing Ben Gurion Airport. This marks the first such deep Israeli strike by the Houthis since September 29, 2024, when they conducted two prior attacks—one on Tel Aviv and another on Eilat—using hypersonic missiles and drones. Since October 2023, the Houthis have launched repeated missile and drone attacks on Israel and targeted 228 ships linked to or bound for Israel, citing solidarity with Gaza under Israeli military assault backed by the U.S. since October 7, 2023. In retaliation, Israel conducted 2,843 airstrikes and naval attacks on Houthi-controlled areas in Yemen, including a strike on a prison facility in Sana’a on September 26, 2024, killing and wounding many. Houthi officials stated that their military operations, totaling 1,679 attacks (missiles, drones, and naval vessels), serve as leverage in Palestinian negotiations. A senior Houthi political office member, Muhammad al-Bakhti, affirmed that their military actions are a tool of pressure and would be reactivated at Hamas’s request. Another official, Muhammad al-Farh, praised Hamas’s 'flexible, responsible, realistic, and implementable' response to the Trump plan. The Houthi leader, Abdul Malik al-Houthi, reported that their operations have involved 1,679 attacks and targeted 228 ships since the start of their support for Gaza.\nOriginal language: ar\nPublish date: October 05, 2025 06:28 PM\nSource:[القدس العربي](https://www.alquds.co.uk/%D8%A7%D9%84%D8%AD%D9%88%D8%AB%D9%8A%D9%88%D9%86-%D9%8A%D8%B3%D8%AA%D9%87%D8%AF%D9%81-%D9%85%D9%88%D8%A7%D9%82%D8%B9-%D8%A5%D8%B3%D8%B1%D8%A7%D8%A6%D9%8A%D9%84%D9%8A%D8%A9-%D9%88%D9%8A%D8%A4%D9%83/)\n\n**Israel Intercepts Houthi Ballistic Missile Launched from Yemen**\nIsrael's Defense Forces (FDI) reported intercepting a ballistic missile launched from Yemen by Houthi rebels, triggering air raid sirens in Jerusalem and other central regions of Israel. No damage or casualties have been reported to date. The FDI stated they identified the missile launch from Yemen toward Israeli territory and that defense systems were working to intercept the threat, urging the public to follow instructions from the Home Front Command. As a preventive measure, the Israeli military issued an early warning that activated air defense sirens across multiple areas, including Jerusalem and southern Cisjordania. Houthi military spokesperson Yahya Sari confirmed the launch of a hypersonic, multi-warhead ballistic missile named 'Palestina 2' targeting 'sensitive objectives in the occupied Jerusalem area,' claiming the operation succeeded and caused 'millions of Zionist usurpers' to flee to shelters. Sari emphasized that attacks would continue until Israel ends its aggression against Gaza and lifts the blockade. This marks the 91st Houthi ballistic missile attack on Israel since March 18, 2024, when Israel resumed its military offensive in the Gaza Strip. The attacks have intensified since the outbreak of the current war between Israel and Hamas, following a temporary ceasefire agreement reached in January 2025. Prior to the truce, the Houthis had launched over 40 ballistic missiles and more than 100 drones and cruise missiles in support of Hamas. The FDI has maintained active defense responses to these cross-border attacks. This incident underscores the expanding scope and complexity of the conflict, now involving multiple actors and fronts beyond Israel and Palestinian territories. The Yemeni insurgents began launching drones and missiles at Israeli targets and vessels linked to Israel in the Red Sea and Gulf of Aden in response to Israel's military campaign in Gaza, which began after the October 7, 2023, attacks by Hamas and other Palestinian militias.\nOriginal language: es\nPublish date: October 05, 2025 12:58 PM\nSource:[LA TERCERA](https://www.latercera.com/mundo/noticia/israel-intercepta-un-misil-huti-procedente-de-yemen/)\n\n**Houthi Missile Attack on Israel Amid Peace Talks for Gaza**\nOn Saturday morning, the Israel Defense Forces (IDF) intercepted a ballistic missile launched from Yemen by Houthi rebels, backed by Iran's regime, which activated air raid sirens in Jerusalem and central Israel. No casualties or material damage were reported, according to a brief IDF statement on X. The IDF urged the public to follow instructions from the Home Front Command. As a precaution, early warnings were issued across multiple regions, including parts of the West Bank. This attack follows a previous drone launch by the Houthi militia, part of a broader pattern of escalating pressure on Israel. The Houthis have targeted not only Israeli territory but also vessels linked to Israel in the Red Sea and the Gulf of Adén, in response to Israel's military campaign in Gaza following the October 7, 2023, Hamas-led attacks. These actions have forced rerouting of international shipping, increasing logistics costs and worsening the global trade crisis. International naval forces, including the U.S.-led Operation Prosperity Guardian, are actively protecting maritime traffic in the Red Sea, where several commercial ships have been sunk due to the rising hostilities. The attacks come amid ongoing peace negotiations between Israel and Hamas, with U.S. President Donald Trump proposing a peace plan that includes an initial withdrawal line in Gaza. On Saturday, Israel announced the deployment of an official delegation led by Minister Ron Dermer to Cairo for talks starting Monday, focused on Trump’s plan for Gaza’s reconstruction and future. After two years of war in Gaza, the possibility of an immediate ceasefire gained momentum following Trump’s announcement that Israel had accepted the initial withdrawal line, and he urged Hamas to accept the conditions to achieve a ceasefire, release hostages, and free prisoners.\nOriginal language: es\nPublish date: October 05, 2025 09:02 AM\nSource:[infobae](https://www.infobae.com/america/mundo/2025/10/05/mientras-avanzan-las-conversaciones-para-un-acuerdo-de-paz-en-gaza-los-huties-lanzaron-un-ataque-contra-israel/)\n\n**Israel Intercepts Houthi Ballistic Missile from Yemen Amid Escalating Regional Tensions**\nOn October 5, 2025, Israel's Defense Forces (FDI) reported intercepting a ballistic missile launched from Yemen by Houthi rebels, prompting air raid sirens in Jerusalem and other central regions of Israel. No damage or casualties have been reported to date. The FDI confirmed the missile was detected en route to Israeli territory and that defense systems were actively engaged. The Israeli military issued a preemptive alert, activating sirens across multiple regions, including Jerusalem and southern Cisjordania. This incident marks the 91st such missile launch by the Houthis since March 18, 2025, coinciding with the resumption of Israel’s military offensive in the Gaza Strip. The Houthis have previously launched over 40 ballistic missiles and more than 100 drones and cruise missiles in support of Hamas since the outbreak of the war, which began after the October 7, 2023 attacks by Hamas and allied Palestinian militias. The FDI has maintained active defense against these cross-border attacks. The incident underscores the expanding scope of the conflict beyond Israel and Palestine, involving multiple actors and fronts. In parallel, Israel confirmed it will send an official delegation led by Minister Ron Dermer to Cairo for talks on Monday, focused on the U.S. President Donald Trump’s proposed plan for Gaza’s reconstruction and future. The attack follows a prior drone launch by the Yemeni rebels on Wednesday, part of an escalating campaign targeting Israel and vessels in the Red Sea and Gulf of Aden.\nOriginal language: es\nPublish date: October 05, 2025 04:50 AM\nSource:[europa press](https://www.europapress.es/internacional/noticia-israel-intercepta-misil-huti-procedente-yemen-saltar-alarmas-jerusalen-centro-pais-20251005065034.html)\n\n**Houthi attacks and Red Sea shipping crisis**\nThe Red Sea is a 1200‑mile narrow strip that connects the Gulf of Aden to the Arabian Sea via the Bab‑el‑Mandeb Strait. It covers an area of 174,000 square miles, is 190 miles wide and 9,974 feet deep, and is a key maritime trade route carrying 30 % of oil and 40 % of other goods. In 2023, about 22 % of global trade passed through the Suez Canal, which generated $9.4 billion—2.3 % of the country’s GDP in 2022‑23. Houthi attacks have disrupted shipping, with more than 100 drone and missile strikes on merchant vessels from 35 countries, prompting the U.S. to deploy a multinational naval task force. A December 2023 UN‑brokered deal aimed to lift sanctions and reduce attacks, but the Houthis continued to target vessels, especially those linked to Israel, as a protest against the Gaza conflict. The attacks have caused a 9‑10 % global trade disruption, reduced Red Sea traffic to 60 % (from 90 % in 2023 to 36 % in August 2024), and pushed 586 container vessels to reroute in February 2024. Panama Canal transits fell from an average of 36 to 22 per day, with a forecast of 18, and car‑carrying ships dropped by half in 2023 versus 2022. Energy prices rose 5‑10 % during peak attacks, and fuel use increased 30‑40 %, raising carbon emissions and threatening International Maritime Organization environmental regulations. The crisis has intensified geopolitical tensions, with U.S.‑UK naval coalitions, China’s muted response, and Gulf states diverting oil exports, while Russia and Iran reportedly support the Houthis. The article states, 'It is a mark of protest against Israel that is carrying out a genocide in Gaza', highlighting the political framing of the attacks.\nOriginal language: en\nPublish date: September 25, 2025 02:54 PM\nSource:[The Express Tribune](https://tribune.com.pk/story/2568946/houthi-attacks-and-red-sea-shipping-crisis)\n\n**Houthis attack two ships in Red Sea for violating their Israel-related embargo**\nThe article reports that on August 21, 2025, the Houthi movement in Yemen carried out two attacks on vessels in the northern Red Sea that were said to have violated a ban on operations with Israeli ports.  According to a video address by Houthi leader Abdel Malik al‑Houthi, 'This week, we have conducted two operations in the northern Red Sea, attacking two vessels for violating the embargo.'  The ban was imposed by the rebel Ansar Allah movement after the escalation of the Gaza conflict in 2023, when the Houthis warned Israel that they would shell its territory and block ships linked to the Jewish state from passing through the Red Sea and the Bab el‑Mandeb Strait until Israel halted its military operation against Hamas.  The attacks stopped after a ceasefire in the Palestinian enclave in mid‑January, but resumed when the ceasefire was breached in early March, with the Houthis also targeting Israeli facilities such as Ben Gurion Airport.  On July 28, Houthi military spokesman Yahya Saree announced that the movement would intensify operations against Israel, planning strikes on vessels belonging to all companies working with Israeli ports within the range of their weapons.\nOriginal language: en\nPublish date: August 21, 2025 03:52 PM\nSource:[TASS](https://tass.com/world/2005795)\n\n**Houthi Organization Threatens to Attack Israeli-Linked Ships**\nThe Houthi organization, also known as the 'Young Movement', has threatened to attack all ships that have dealings with Israel, in an effort to increase pressure on Israel to lift its restrictions on the Gaza Strip. The Gaza Strip is currently experiencing a severe famine and a humanitarian crisis, causing international concern. Yahya Saree, a spokesperson for the Houthi organization, stated in a televised interview, 'All ships that become targets will be attacked wherever our armed forces can reach them.' He added, 'As long as the invasion of Gaza stops and the blockade is lifted, all our military actions will immediately stop.' The Houthi organization has been attacking Israeli and Red Sea ships since the conflict between Israel and Hamas, which controls Gaza, began in October 2023. Prior to the attacks, over $2 trillion in global maritime trade passed through the Yemeni coast each year, with most ships passing through the Suez Canal and traveling between Europe and Asia. However, since the Houthi attacks began, maritime trade in the area has decreased by approximately 70%. Despite a decrease in attacks in 2025, maritime trade remains low. Israel has been blockading Gaza since March 2, leading to a severe famine in the area. In response to international criticism, Israel has increased its humanitarian aid to Gaza. This Sunday, the Israeli military temporarily suspended some military actions to allow a UN rescue convoy to pass through, and for the first time since March, restored electricity to a Gaza water desalination plant. The Houthi organization has previously attacked ships with ties to Israel, and this month, they sank two cargo ships, killing three crew members and detaining 11 others, the first deadly attack on commercial ships since November last year. Israel has also carried out several airstrikes on Houthi targets in Yemen in retaliation.\nOriginal language: zh\nPublish date: July 27, 2025 11:48 PM\nSource:[UDN](https://udn.com/news/story/6809/8900499)\n\n**The Red Sea: A Strategic Region Open to Further Escalation**\nThe Red Sea has seen a significant escalation in naval attacks by the Houthis since late 2023, using drones, precision missiles, and naval mines. These attacks have resulted in the sinking of commercial ships and the withdrawal of major shipping companies from the Bab-el-Mandeb Strait, posing a real threat to global maritime security. In response, Europe launched 'Operation Aspides' in February 2024, led by France, to protect shipping lines in the Red Sea. However, the operation was characterized by a lack of capabilities and an evident failure to cover the extended route from Aden Gulf to the Suez Canal. As time passed, the mission's failure to deter the Houthis became apparent, particularly after they sank the 'TUTOR' and 'RUBYMAR' ships on June 12, 2024, marking a turning point in the maritime conflict. Meanwhile, the US announced the formation of a new maritime alliance, 'Guardian of Prosperity,' in December 2023, involving over 20 countries, to protect shipping in the Red Sea and Aden Gulf. However, this alliance focused on defensive protection without attacking Houthi sources of threat and did not achieve significant successes, making it more of a monitoring umbrella than an active alliance. In this context, former US President Donald Trump entered the scene, exploiting the escalating maritime threats in the Red Sea as part of his electoral agenda. In a June 2024 speech, Trump stated that if he were in office, he would respond strongly to the Houthis and use the maritime crisis as a bargaining chip against China in the tariff dispute, particularly since the closure of the Red Sea hinders Chinese goods' access to Europe through the Suez Canal (Bloomberg, June 2024). As the major powers continue to assert their presence in the Red Sea, Iran continues to bolster the Houthis with military and technological support. In May 2024, the National Resistance Forces, led by Brigadier General Tareq Mohammed Abdullah Saleh, announced the seizure of a shipment of advanced weapons en route to the Houthis through the Hodeidah coast, including military communication equipment and drone guidance systems. This operation highlights the ongoing Houthi threat, supported by Iran, through active maritime smuggling routes (Military Media, May 2024). Considering past experiences, the comparison between the current situation and the Somali piracy crisis in the Aden Gulf between 2008 and 2013 reveals a painful paradox. Back then, international coordinated operations like 'Operation Atlanta' and NATO operations successfully weakened Somali pirates through direct interventions, aerial surveillance, and rapid response. Today, despite the Houthis having greater capabilities and external support, the international response appears weaker and less effective (UN Security Council, 2013). As a result, companies like Maersk and MSC have announced shifting their routes from the Red Sea to the Cape of Good Hope, a longer and more costly route. This has led to a 30% increase in shipping costs, affecting fuel and commodity prices worldwide (Lloyd's List, June 2024). In this scenario, the Red Sea remains a strategic region open to further escalation unless a strong maritime alliance is reformed, one that goes beyond monitoring and aims to impose clear rules of engagement and dismantle Houthi attack platforms on Yemeni shores. In a short period, the Houthis sank two commercial ships, Magic Size and Internity Sea, and some crew members were killed, despite the US ceasefire on Houthi militias through Oman's mediation. The recent seizure of a shipment of advanced weapons by the National Resistance Forces, led by Brigadier General Tareq Saleh, highlights the presence of promising Yemeni ground capabilities, but they require international political, military, and intelligence support to face a threat that exceeds Yemen and the region, extending to global maritime security and the continued Iranian Revolutionary Guard Corps' policy of sending large quantities of advanced weapons and military equipment to the Houthi group, classified as a foreign terrorist organization by the United States and many other countries.\nOriginal language: ar\nPublish date: July 22, 2025 02:46 PM\nSource:[حضرموت نت | اخبار اليمن](https://7adramout.net/%D8%A7%D8%AE%D8%A8%D8%A7%D8%B1-%D8%A7%D9%84%D9%8A%D9%85%D9%86-%D8%A7%D9%84%D8%A8%D8%AD%D8%B1-%D8%A7%D9%84%D8%A3%D8%AD%D9%85%D8%B1-%D9%81%D9%8A-%D8%AE%D8%B6%D9%85-%D8%A7%D9%84%D8%AA%D8%B9%D8%B1%D9%81/)\n\n**Houthi Insurgents Attack Cargo Ship in Red Sea, Leaving 4 Dead and 11 Missing**\nA cargo ship, the Eternity C, has sunk in the Red Sea after being attacked by Houthi insurgents from Yemen. According to the European Union's Operation Áspides, four people are presumed dead and 11 are still missing. Ten people were rescued, including eight Filipino crew members, one Greek crew member, and one member of the ship's security team. The Houthi rebels have claimed to have taken some of the crew members, with the US Embassy in Yemen stating that they have been 'kidnapped'. This is the deadliest attack on a ship by the Houthi rebels, who have been targeting vessels in the critical maritime trade route, where over $1 billion in cargo passes through each year. The rebels claim to be attacking ships to support the Palestinians in the Gaza Strip during the war between Israel and Hamas. 'It is recommended that all nearby ships remain vigilant', said the EU mission. The Houthi rebels have previously held crew members hostage, including those from the Galaxy Leader, which was seized in November 2023 and released in January 2024. Since November 2023, the Houthi rebels have attacked over 100 ships with missiles and drones, before halting their attacks during a brief ceasefire in the Gaza war. They have since become the target of a US-led bombing campaign, before a reported ceasefire was declared by US President Donald Trump.\nOriginal language: es\nPublish date: July 11, 2025 03:54 PM\nSource:[Chicago Tribune](https://www.chicagotribune.com/2025/07/11/habra-4-muertos-y-11-desaparecidos-tras-hundimiento-de-2do-barco-en-el-mar-rojo-por-parte-de-hutes/)\n\n**Houthis Resume Attacks on Commercial Ships in Red Sea**\nThe Houthi rebels in Yemen have resumed their attacks on commercial ships in the Red Sea, targeting two vessels in the past few days. This marks the first attacks on merchant ships in 2025, after a six-month hiatus. The Houthis, who are close to Iran, have targeted over 100 cargo ships off the coast of Yemen since the start of the war between Israel and Hamas in Gaza 21 months ago. They claim to be acting in solidarity with the Palestinians. Houthi leader Abdel Malek al-Houthi said that the new attacks were a 'confirmation' of their decision to target Israeli-linked ships 'as long as the aggression and siege of Gaza continue'. However, the resumption of these attacks sends several messages in the current context, according to analysts. 'Why now?' they ask. The Houthis say they want to maintain pressure on Israel, at a time when indirect negotiations are underway between Israel and Hamas. 'Negotiate with your heads held high, we are with you (...) until the siege is lifted and the aggression stops', said Houthi political leader Mahdi al-Mashat to the Palestinians. This escalation comes two weeks after the 12-day war between Israel and Iran, in which the US also participated. The Houthis, who are part of the 'axis of resistance' against Israel led by Tehran, did not intervene in this conflict. However, the recent attacks are 'a reminder from the Guardians of the Revolution (Iran's ideological army) via their most important ally, that what has not been done (during the war with Israel) can, in case of repetition, be activated, at Bab al-Mandeb, Ormuz and Suez', three vital navigation routes for global trade, says Maged al-Madhaji, president of the Strategic Studies Center in Sanaa. 'What are the Houthis trying to prove?' they ask. The latest attacks were particularly violent, carried out using several boats equipped with rockets, as well as naval drones and missiles, according to maritime security agencies. Videos published by the Houthis showed their naval forces exploding and sinking the ships. With the weakening of other allies of Tehran within its 'axis of resistance' - the Hezbollah in Lebanon and the Hamas in Gaza - the Houthis want to show their 'regional and international strength', says Farea al-Muslimi, researcher at Chatham House. While the missiles fired regularly by the group on Israel have a limited impact, the disruption of traffic in the Red Sea, through which 12% of global trade passes, is 'a very effective way of bleeding the West', adds he. The Houthis are also trying to show that they have not been affected by the US bombings, which ended in May. These bombings have severely affected some of their military capabilities, but 'they still have a large stock and have quickly rebuilt their communication network', estimates M. Muslimi. According to Noam Raydan, of the Washington Institute for Near East Policy, the Houthis have also taken advantage of the significant decrease in international military presence in the area. 'They now seem to have more room to harm navigation freedom', she says. 'What are the consequences?' they ask. The Houthis' attacks have already forced many shipowners to avoid the Red Sea, taking a longer and more expensive route. According to Noam Raydan, the transit through the Bab al-Mandeb strait has decreased by over 50% compared to 2023. 'After the recent attacks, ships belonging to companies whose other vessels dock in Israeli ports will have to either reconsider their route or seek military escort, especially from the European mission Aspides deployed in the area', but that 'mission has very few naval units in the region', warns the researcher. By threatening navigation freedom, the Houthis risk facing a resumption of US bombings, as well as new attacks from Israel. On Thursday, Israeli Foreign Minister Gideon Saar called the Houthis a 'threat to international peace, security, and economy'. 'Not confronting them will only worsen the problem', he said.\nOriginal language: fr\nPublish date: July 11, 2025 12:42 PM\nSource:[AFP](https://afp.com/)\n\n**Houthi Militants Attack Commercial Ship in Red Sea, Leaving Crew Missing**\nHouthi militants in Yemen continued to attack a commercial ship in the Red Sea, hours after launching an assault on the vessel that left the crew missing, the latest sign that the group is increasing its threat to merchant shipping. 'The ship has suffered significant damage and has lost all propulsion,' said the UK Maritime Trade Operations (UKMTO) on Tuesday. 'The ship is surrounded by small boats and is under continuous attack.' The UKMTO warned ships to avoid the area after the incident, which occurred just weeks after the Israeli military conflict with Iran and the ongoing Israeli invasion of Gaza. The Red Sea is a crucial route for ships traveling between Asia and Europe via the Suez Canal in Egypt. According to the UKMTO, the attacks continued around 8:00 a.m. GMT, about 14 hours after the first incident was reported, which involved rocket-propelled grenades and the approach of several boats. Two people on board the Eternity C were injured and two others were missing, according to the ship's owner, Cosmoship. Jakob Larsen, director of security at BIMCO, the world's largest direct membership commercial shipping organization, said, 'These incidents highlight the Houthi's disregard for human life, as they continue to exploit sailors as pawns in their strategic conflicts.' The Eternity C was transporting cereals to Somalia for the World Food Programme and was attacked after completing its journey. The incident occurred about 51 nautical miles west of Hodeida, Yemen, and came after the Houthi militants claimed responsibility for a previous attack on a ship in the same area. The Houthi militants began attacking commercial ships in late 2023, claiming it was their response to the Israeli war in Gaza. Their actions led to the merchant fleet largely avoiding the area - and, by extension, the Suez Canal - and Stem Shipping suspended navigation through the route after the Houthi militants attacked the Sounion, a Greek oil tanker, in August last year, said Michael Bodouroglou, the company's CEO. The return of the attacks, especially given their severity, could once again deter more owners and crews from crossing the region and increase freight rates and insurance costs for transporters. 'I've personally heard of cases of ships being denied coverage,' said Corey Ranslem, CEO of Dryad Global, a maritime intelligence company. The United Arab Emirates said the Safeen Prism, operated by AD Ports Group, responded to a distress call from Magic Seas and rescued the 22 people on board.\nOriginal language: es\nPublish date: July 08, 2025 04:24 PM\nSource:[El Financiero](https://www.elfinanciero.com.mx/mundo/2025/07/08/huties-de-yemen-atacan-barco-comercial-en-el-mar-rojo-buque-sufrio-danos-importantes-dice-reino-unido/)\n\n**Houthi Rebels Attack Greek-Managed Cargo Ship in Red Sea**\nA Greek-managed cargo ship, the Eternity C, was attacked by Houthi rebels in the Red Sea, leaving two crew members injured and two missing. The incident occurred 50 nautical miles southwest of the port of Hodeida, Yemen, and is the second attack on merchant vessels in the Red Sea since November 2024, according to the EU's Operation Aspides. The ship, which was carrying a 21-person Filipino and Russian crew, as well as armed guards, was hit by drones and rocket-propelled grenades fired from fast boats. The bridge was damaged, communication systems were disrupted, and the crew was ordered to abandon ship, although the lifeboats had been destroyed during the attack. The ship, which was carrying no cargo and suffered significant structural damage, was left listing and adrift. Yahya Sarea, the Houthi military spokesperson, confirmed that the attack was a response to alleged violations of the blockade of 'occupied Palestinian ports,' referring to Israel. He stated that Houthi forces will continue to attack vessels associated with Israeli interests navigating the region, as long as the war in the Gaza Strip continues. Since the start of the conflict in Gaza in October 2023, the Houthis, backed by Iran, have intensified their attacks in the Red Sea against ships associated with Israel and have also attacked US and UK targets in retaliation for the bombings carried out by these countries in Yemen. The violence in one of the main international maritime routes is a concern for the impact on navigation and global trade security in the region. Since November 2024, the Red Sea maritime corridor has seen a growing number of attacks directed against merchant vessels, especially those linked to Greek, Israeli, and Western companies, according to UKMTO and the EU's Operation Aspides. The Houthi rebels have employed a wide range of tactics and armament, including explosive drones, ballistic and cruise missiles, as well as unmanned and fast boats, which has raised the risk for navigation and made it difficult to protect commercial ships in the area. Only in the first months of 2025, European and maritime authorities have counted more than 20 similar armed incidents, resulting in severe damage or sinkings of several grain and oil tankers.\nOriginal language: es\nPublish date: July 08, 2025 03:43 PM\nSource:[infobae](https://www.infobae.com/america/mundo/2025/07/08/un-barco-quedo-a-la-deriva-en-el-mar-rojo-tras-un-ataque-de-rebeldes-huties-hay-dos-marineros-heridos-y-dos-desaparecidos/)\n\n**Houthi Group Claims Responsibility for Sinking of Cargo Ship 'Magic Size' in Red Sea**\nThe Houthi group, backed by Iran, announced on Monday that a cargo ship, 'Magic Size', which they attacked with rockets and speedboats on Sunday, has sunk in the Red Sea. This is the first attack by the group on maritime shipping routes since the start of the current year. The Greek shipping company, Steam Shipping, which operates the ship, told Reuters that it has not been able to confirm the sinking of the ship from independent sources. The Houthis claimed responsibility for the attack and said they allowed the 19-member crew to leave the ship. Steam Shipping said that a commercial ship rescued all crew members and they are expected to arrive in Djibouti later on Monday. The ship was carrying iron and fertilizer from China to Turkey. The attack ended six months of calm in the Red Sea, one of the world's most used shipping routes, where Houthi attacks from late 2023 to late 2024 disrupted shipping between Europe and Asia through the Suez Canal. The Houthis have launched over 100 attacks on ships in the Red Sea, Gulf of Aden, and Bab-el-Mandeb Strait, which connects them, saying they were in solidarity with Palestinians after the war in Gaza in 2023. However, these attacks stopped this year, with the last ones recorded in December. Israeli attacks The Houthi military spokesperson, Yahya Saree, said in a statement broadcast on television that the ship was targeted on Sunday after naval forces issued warnings that were ignored by the ship's crew. He added that the ship was targeted using two speedboats, five rockets, and three drones. The British Maritime Trade Operations and the security firm 'Amber' said in two reports that eight small boats attacked the ship initially with gunfire and rocket fire, before a security team on board the ship returned fire. 'Amber' said in a separate warning that the ship was later attacked by four speedboats and rockets, and added: 'Two of the naval units collided with the ship, causing damage to its cargo.' The British Maritime Trade Operations said the attack led to a fire on the ship. Meanwhile, the Israeli army announced on Monday that it had bombed three Houthi-controlled ports. There was no indication that the Israeli attacks were related to the maritime attack. During their attacks, the group sank two ships, seized another, and killed at least four sailors, disrupting global shipping and forcing companies to change their routes, which prompted the United States to intensify its attacks on the group last year. In June, tensions escalated in the region following a 12-day war between Israel and Iran, which was joined by Washington with airstrikes on Iranian nuclear sites. President Donald Trump had announced a halt to US attacks on the Houthis, saying the group had agreed to stop disrupting critical shipping routes in the Middle East.\nOriginal language: ar\nPublish date: July 07, 2025 01:15 PM\nSource:[قناة العربية](https://www.alarabiya.net/aswaq/economy/2025/07/07/%D8%AC%D9%85%D8%A7%D8%B9%D8%A9-%D8%A7%D9%84%D8%AD%D9%88%D8%AB%D9%8A-%D8%AA%D8%A4%D9%83%D8%AF-%D8%A7%D8%B3%D8%AA%D9%87%D8%AF%D8%A7%D9%81-%D8%B3%D9%81%D9%8A%D9%86%D8%A9-%D8%A7%D9%84%D8%A8%D8%B6%D8%A7%D8%A6%D8%B9-%D9%85%D8%A7%D8%AC%D9%8A%D9%83-%D8%B3%D9%8A%D8%B2-%D9%81%D9%8A-%D8%A7%D9%84%D8%A8%D8%AD%D8%B1-%D8%A7%D9%84%D8%A7%D8%AD%D9%85%D8%B1)\n\n**Shipping in the Red Sea Increases by 60% Since August 2024**\nThe number of commercial ships passing through the Bab-el-Mandeb Strait has increased by 60% since August 2024, according to Admiral Vasilios Gribaris, citing the decrease in missile and drone attacks by the Houthis and the signing of a ceasefire agreement between the US and the armed group. However, Gribaris noted that shipping activity, which had dropped to 20-23 ships per day in August last year, is still below the previous average of 72-75 ships per day before the Houthis launched their attacks in the Red Sea in November 2023 in support of Palestinians during the Israeli war in Gaza. The mission to protect shipping in this strategic waterway, which connects the Mediterranean Sea to the Asian Gulf through the Suez Canal, was established and extended in February to include tracking illegal arms shipments and monitoring ships carrying Russian oil subject to sanctions. Gribaris explained that the last attack on a commercial ship occurred in November 2024, and that the Houthis have narrowed their targets, confirming that their attacks are limited to Israeli ships or those related to Israel or docked in Israeli ports. He added, 'If the ship does not meet these criteria... there is a high probability – exceeding 99% – that it will not be a target for the Houthis.' However, Gribaris emphasized that he cannot provide a guarantee against commercial ships being attacked. He pointed out that some companies have hesitated to use this route due to the shortage of ships assigned to the mission, which may lead to delays of up to a week for ships that require escort. He explained that the mission operates with two to three ships at the same time and has requested that the EU provide it with ten ships to enhance its ability to provide protection. The mission has provided direct protection to 476 ships, shot down 18 drones, destroyed two remotely controlled boats used in attacks, and intercepted four ballistic missiles.\nOriginal language: ar\nPublish date: June 05, 2025 08:44 PM\nSource:[hapijournal.com](https://hapijournal.com/2025/06/05/%d8%a3%d8%b3%d8%a8%d9%8a%d8%af%d8%b3-%d8%a7%d9%84%d9%85%d9%84%d8%a7%d8%ad%d8%a9-%d9%81%d9%8a-%d8%a7%d9%84%d8%a8%d8%ad%d8%b1-%d8%a7%d9%84%d8%a3%d8%ad%d9%85%d8%b1-%d8%aa%d8%b1%d8%aa%d9%81%d8%b9-60/)\n\n",
    "date": "2025-10-15T01:30:10.497318",
    "summary": "Across all expert perspectives, the consensus is that the probability of Maersk resuming shipping in the Red Sea during 2025 is low. All experts emphasized the persistence and recent escalation of Houthi attacks on commercial shipping, including incidents with casualties and the sinking of vessels, as the most significant factor reducing the likelihood of resumption. While international naval operations (EU Operation ASPIDES, US-led missions) have provided some protection, their coverage remains stretched thin, and several attacks have succeeded despite this presence. Experts noted that Maersk, as a major, risk-averse carrier with significant reputational and financial exposure, has consistently demonstrated a conservative approach—requiring both a sustained reduction in threat and improvements in insurance coverage before considering resumption. Most historical analogies (e.g., Somali piracy) suggest that companies only return after months of incident-free transits and clear, durable improvements in security, which have not materialized in the Red Sea as of mid-October 2025. Diplomatic efforts and Gaza ceasefire talks may marginally increase the probability, but have not yet resulted in a meaningful reduction in attacks. The question's resolution threshold—triggered even by partial or publicly announced resumption—slightly increases the estimated probability, but experts remain skeptical that Maersk will take this risk without substantial change. Estimates for the probability of a 2025 resumption clustered overwhelmingly in the low teens (range: 5% to 20%), with nearly all analysts highlighting the high 'stickiness' of the current status quo and the short window left before the end of the year. The dominant scenario remains continued suspension, barring an unforeseen and rapid diplomatic or military breakthrough.",
    "forecasters": [
        "Shipping and Maritime Operations (Risk Management ISO31000)",
        "Shipping and Maritime Operations (International Maritime Law UNCLOS)",
        "Shipping and Maritime Operations (ISPS Code Compliance)",
        "Security Risk Assessment (Maritime Threat Assessment)",
        "Security Risk Assessment (Critical Infrastructure Protection Standards)",
        "International Relations (Security Dilemma Theory)",
        "International Relations (Maritime Security Studies)",
        "Political Science (Conflict Resolution Theory)",
        "Political Science (Regime Stability Analysis)",
        "Regional Studies Middle East (Gulf Security Complex)"
    ]
}