{
    "deliberation_results": {
        "Election Polling (Survey Methodology Standards)": {
            "time_to_resolution": "Approximately 3 months (question closes at the end of 2025, forecast date is 2025-09-22)",
            "perspective_relevance": "As an expert in Election Polling and Survey Methodology Standards, I am well positioned to analyze the reliability and sensitivity of youth voting intention figures in Spain. I can critically evaluate the trends, assess the volatility of youth opinion, and understand the survey designs—particularly with respect to direct intention questions, sample biases, and question framing—which are especially important when dealing with small and highly dynamic demographic subgroups such as 18–24 year olds.",
            "status_quo": "The most recent reputable 40dB polling places Vox's direct voting intention among 18–24 year olds at 27%—its highest yet. Over the past year, youth support for Vox has increased sharply but remains generally at or just below this level.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent polling trend",
                    "effect": "Slightly increases probability; Vox youth support has been on the rise with 27% as the latest (max) reading, indicating some momentum and a plausible path to exceed 27%."
                },
                {
                    "factor": "Volatility in youth opinion and engagement",
                    "effect": "Increases probability variance; Youth intentions are more volatile and susceptible to social, viral, and protest-driven swings. Vox's digital and meme campaigns can cause short-term surges above previous peaks, but downturns are also possible."
                },
                {
                    "factor": "Survey methodology limitations (sample size, noise, panel design)",
                    "effect": "Increases uncertainty; Small sample sizes for 18–24 year olds make small changes look larger. A single outlier result could tip over 27%, even if underlying support is just shy."
                },
                {
                    "factor": "Societal and historical base rates",
                    "effect": "Decreases probability; Historically, in Spain and similar European countries, youth 'peaks' for far-right parties tend to plateau near, but rarely substantially exceed, their first ceiling, unless a major catalyzing event occurs."
                },
                {
                    "factor": "Comparison with other countries’ right-populist youth trends",
                    "effect": "Slightly increases probability; AfD, RN, etc., have recently posted youth highs, and there are correlating pan-European drivers, suggesting a ceiling-break is plausible, though not yet structurally embedded."
                },
                {
                    "factor": "Upcoming electoral events or policy shocks",
                    "effect": "Uncertain; No scheduled national elections before year-end. Unless a major event occurs (e.g. immigration crisis, viral scandal, or economic downturn) the trend may plateau."
                },
                {
                    "factor": "High youth abstention",
                    "effect": "Decreases effective volatility; While abstention affects actual turnout, for intention surveys it means the base is volatile and more prone to swings—but also that any surge can quickly dissipate or self-cancel in sample noise."
                },
                {
                    "factor": "Gender split in youth vote",
                    "effect": "Slightly decreases probability; Young men drive the Vox surge, but young women remain less likely. Sampling artifacts or a surge in young women's right alignment would be needed for a robust leap above 27%."
                }
            ],
            "no_scenario": "The 40dB December poll shows Vox at 26% or below among 18–24s. The trend plateaus, perhaps due to pushback against the far-right message, viral counter-campaigns, or the natural ceiling effect found in other European countries. Sampling volatility, gender splits, or a lack of major triggering events keep the youth segment from breaking out above 27% before year’s end.",
            "yes_scenario": "A viral topic—immigration, security, or a spike in anti-woke sentiment—erupting sooner than year-end draws an extra cohort of young men (and/or some women) to Vox in a poll in November or December, even if very transitory. A single 40dB poll—perhaps with a slightly unrepresentative internet-savvy or activist sample—finds 28–29% support for Vox among 18–24 year olds, breaking the previous ceiling and resolving the question yes.",
            "final_reasoning": "The most recent and reliable data (40dB) places Vox’s youth intention at 27%. Polling shows a clear, but possibly plateauing, trend of growing far-right preference among young Spaniards, matching patterns seen elsewhere in Europe. However, survey volatility (given feasible sample sizes for 18–24s), and the tendency for new peaks to be followed by retracement, argues for caution. The lack of a major catalyzing event makes a substantial breakthrough somewhat less likely. However, given the proximity of the latest peak to the threshold, the possibility of a further viral spike, and the demonstrable but not unlimited structural drivers behind youth populism (especially among young men), I estimate that the chance the next (final) 2025 40dB poll records Vox youth intention strictly above 27% is moderately likely. The question’s structure means a single slightly above-27% poll suffices—a scenario entirely plausible considering volatility and recent trajectory. Therefore, I assign a probability moderately above the base rate, but not highly extreme.",
            "final_probability": 43
        },
        "Election Polling (Sampling Error Analysis)": {
            "time_to_resolution": "Approximately 3 months until the end of December 2025; potentially less, if the last relevant 40dB survey is published before October 1, 2025 (in which case the question would be void, but baseline is resolution through December 2025).",
            "perspective_relevance": "As an expert in election polling and sampling error analysis, I can critically assess the reliability, margins of error, and temporal comparability of polls (especially 40dB surveys) on youth voting intentions, parse the nuances of polling methods, and contextualize apparent trends with rigorous attention to base rates and underlying volatility typical in youth subgroups. Youth samples are typically small in nationally representative polling, leading to high variance and greater susceptibility to shifts or random noise.",
            "status_quo": "According to the most recent 40dB survey published in El País, Vox has exactly 27% direct voting intention among the 18-24 demographic—a historic high for Vox, but not over the threshold. Most other referenced poll numbers for Vox among youth are in the low-to-mid-20s or based on older data. No recent 40dB poll shows Vox above 27% among young people.",
            "perspective_derived_factors": [
                {
                    "factor": "Sampling Error and Volatility in Youth Subsamples",
                    "effect": "Increases both upside and downside risk: small N in youth samples causes wider margins of error (potentially 4-8 points), so point estimates for youth can fluctuate. This means 27% is not far from the threshold in practical terms, but transient spikes above that value are possible without real long-term shifts."
                },
                {
                    "factor": "Base Rates and Comparative Trends",
                    "effect": "Decreases probability: Historically, party support levels do not change rapidly in the absence of major external shocks. While the trend for Vox among youth is up, jumps above 27% are rare, and similar parties in comparable European contexts seldom exceed ~30% among the youth segment."
                },
                {
                    "factor": "Direction and Momentum of Recent Polls",
                    "effect": "Slightly increases probability: There is consistent reporting of Vox gaining support among young people, with repeated references to them leading in the 18-24 group (ex: 21%, 24%, now 27%). Polls and qualitative data suggest the trend is upward, albeit with possible plateauing as it reaches the late 20s."
                },
                {
                    "factor": "Salience of Youth Issues and Anti-Establishment Sentiment",
                    "effect": "Slightly increases probability: Discontent over jobs, housing, and alienation from traditional parties has fueled both left- and right-wing populist appeal among youth in Europe. In Spain, this seems to benefit Vox the most among young men. Signals suggest further marginal growth is possible if these drivers intensify."
                },
                {
                    "factor": "Structural Factors (Turnout, Abstention, Gender Split)",
                    "effect": "Decreases probability: Youth abstention remains high (45%+ in 18-24s), so declared intention may not translate into actual support, and gender splits (young men favoring Vox, young women less so) cap further growth unless the party increases its appeal to women."
                }
            ],
            "no_scenario": "Vox polling among 18-24s peaks at 27% and plateaus or fluctuates below this threshold due to high volatility, with no major external shocks or viral campaign breakthroughs. The next 40dB survey (or latest published before year's end) records 27% or less in the direct voting intention crosstab for the relevant youth group, following regression to the mean or due to sampling noise. Efforts to further increase youth support stall as abstention, left-right gender gap, and saturation among politically engaged youth limit further gains.",
            "yes_scenario": "A further surge in right-wing populist energy, perhaps triggered by a high-profile national event (immigration, economic, or political scandal), pushes Vox above 27% in the next 40dB survey among 18-24s. Alternatively, a random polling fluctuation due to small sample size causes the next published figure to come in above the threshold—regardless of any durable trend. Social media virality, real or perceived left-wing overreach, or external cues from similar European parties (AfD, RN) carry Vox over the bar.",
            "final_reasoning": "The baseline is 27% (status quo), with a recent sharp upward trend but not yet above threshold. The youth polling subsample's small size and volatility mean that a small shift, real or noise, could produce a >27% figure, but the enduring base rate for this kind of sharp move, absent external disruptions, is modest. The upward momentum, international context, and youth disaffection give a plausible path to a spike, but high abstention and gender splits are structural headwinds. Notably, while consistent 1-2 point oscillations are quite plausible given sampling error, true underlying support might not yet be sufficient for a stable reading above 27% without a new driver. The possibility of a random polling spike must be discounted neither fully nor assumed likely. On balance, the chance that any published 40dB survey by end-2025 will show Vox >27% in youth direct voting intention exceeds an even-odds coin flip, but only modestly—given the position on the cusp, volatility, and polling error.",
            "final_probability": 62
        },
        "Political Consulting (Voter Segmentation Strategies)": {
            "time_to_resolution": "Approx. 3 months until end of 2025 (question closes Dec 31, 2025 or upon last 40dB survey of 2025, whichever is earlier).",
            "perspective_relevance": "As an expert in voter segmentation strategies, my expertise allows me to analyze the micro-demographic drivers (such as age, gender, region, and subcultural affinity) behind party preference. I am also attuned to how far-right parties' messaging, digital targeting, and media virality interact with negative partisanship, socioeconomic pessimism, and realignment patterns among young voters. I bring a granular, empirically-founded perspective to shifts in youth electoral intention and turnout.",
            "status_quo": "In the latest available 40dB poll referenced (September 2025), Vox stands at 27% voting intention among youths aged 18-24—a historic high and the leading party in the age segment. Historically, spikes like this tend to plateau with minor fluctuations barring external shocks.",
            "perspective_derived_factors": [
                {
                    "factor": "Base Rate/Stability of Voting Intention in Youth Segments",
                    "effect": "Decreases probability. Youth voting intention is highly volatile, but sustained increases above the current peak are rare barring a major political event. Typically, once a party hits a historic high, subsequent polls see some regression to the mean."
                },
                {
                    "factor": "Rightward Ideological Realignment Among Young Men",
                    "effect": "Increases probability. The share of young men (18-24) identifying as right-wing sharply increased from 8% in 2015 to 34% in 2025, per CIS; most of this segment favors Vox, suggesting the realignment is durable and could nudge intention over 27% if further acceleration occurs."
                },
                {
                    "factor": "Large Youth Abstention and Survey Nonresponse",
                    "effect": "Decreases probability. Abstention remains the dominant 'party' for youths—45% of 18-24s abstained in the last national election. This can cause both volatility and overrepresentation of mobilized right-wing activists in poll samples, creating upward statistical noise in favor of Vox that may not be sustainable."
                },
                {
                    "factor": "Vox's Digital/Influencer Campaign Targeting",
                    "effect": "Increases probability. Vox is recognized for leveraging TikTok, memes, and issue-targeted messaging on housing/employment/insecurity—yielding strong engagement and rapid viral reach among ‘apolitical’ or anti-establishment youth."
                },
                {
                    "factor": "Competing Far-Right/Populist Offers (e.g., Alianza Catalana, 'Alvise')",
                    "effect": "Decreases probability. The presence of other radical right options and regionalist parties (especially in Catalonia and Basque Country) could siphon away a few percentage points from Vox in the youth cohort even as the broader rightist mood grows."
                },
                {
                    "factor": "Short-Term Political Events (Scandal, International Context, Policy Shocks)",
                    "effect": "Ambiguous effect. Scandals, new migration crises, or international right-wing surges (e.g., AfD, RN) could produce one last-minute spike or backlash, but durability of the effect is not predictable."
                },
                {
                    "factor": "Gender Divide in Youth Voting",
                    "effect": "Decreases probability. Vox is extraordinarily strong among young men but relatively weak among young women, who have not shifted right to the same extent. If the male-to-female voter ratio or engagement differs in late 2025 samples, the aggregate could undershoot 27%."
                }
            ],
            "no_scenario": "Vox's youth support peaks at 27% in autumn 2025 but then stagnates or slightly falls as competing right-populist or regionalist options surge (Alvise, Alianza Catalana), or as left/progressive campaigns reinforce anti-far-right engagement among young women. A gaffe, overexposure, or strategic blunder by Vox, or the emboldening of mainstream parties on youth-relevant policies, also nudge their intention back to 25-26% in the final poll. Small-sample volatility and normalization also contribute.",
            "yes_scenario": "Vox continues to dominate digital spaces and viralizes an autumn campaign or international event (e.g., migration, security, housing crisis) that intensifies youth alienation and anti-establishment sentiment. Rightward ideological realignment among young men continues, turnout intention among left-wing youths stagnates or declines, and competing parties fail to sufficiently differentiate themselves. The last 40dB poll records Vox hitting 28-30% in direct youth voting intention, driven by momentum, viral resonance, and cross-national trends favoring the far-right.",
            "final_reasoning": "The base rate and status quo both point to regression-or-slight-decline being more probable after a historic high; peaks in youth intention for new parties are rarely sustained for long, and volatility is heightened by low turnout and sample sizes. However, structural factors—the deep rightward realignment among young men, social-media-based mobilization, economic pessimism, and left/center fragmentation—are historically unparalleled, and cross-national evidence from AfD and RN in Germany/France reinforce the plausibility of a further increase. The gender gap and new far-right competition introduce friction, but unless a specific shock or blunder occurs, there is no dominant evidence of imminent reversal. The aggregate probability thus is moderately tilted toward a downturn (status quo bias), but the risk of a further upward surge—amplified by sample volatility—cannot be discounted. Given all factors, a careful, status-quo-weighted estimate is in the 35-40% range for surpassing 27%. I select 38%: more likely than not Vox will remain at or below 27%, but with real risk of an overshoot driven by momentum and polling artifacts.",
            "final_probability": 38
        },
        "Public Opinion Analysis (Trend Projection Techniques)": {
            "time_to_resolution": "Approximately 3 months until the end of 2025 (Question expected to resolve based on latest 40dB poll published by the close of December 31, 2025).",
            "perspective_relevance": "As an expert in Public Opinion Analysis (Trend Projection Techniques), my approach emphasizes interpreting direct survey data, identifying trajectory patterns, and weighting recency, volatility, and base rates while controlling for turnout and social desirability biases. Youth voting intention is prone to rapid swings and is further complicated by low turnout, but time-series analysis and cohort-specific tracking make it possible to project plausible trajectories with higher accuracy.",
            "status_quo": "According to the most recent 40dB voting intention poll, Vox holds 27% among the 18-24 demographic, its all-time high. The status quo is that Vox is at, but not above, the 27% threshold in direct voting intention among youth as measured by 40dB.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent Accelerated Growth Among Youth",
                    "effect": "Increases probability. Vox has moved from sub-20% to the 21-27% range in just months, buoyed by rightward ideological drift noted in several polls and qualitative analyses. Momentum usually slows but does not always halt immediately."
                },
                {
                    "factor": "European and Domestic Rightward Youth Shift",
                    "effect": "Increases probability. Similar tendencies in France, Germany, and Hungary as cited in comparative news, indicate a region-wide realignment making further upward motion for Vox plausible."
                },
                {
                    "factor": "High Abstention Rate Among Youth",
                    "effect": "Decreases probability. While intention among likely voters may remain high, aggregate voting intention poll numbers for youth may inflate due to over-sampling politically engaged or non-representative youth cohorts; as abstention remains the 'most popular party' among young people, this puts a ceiling on further gains."
                },
                {
                    "factor": "Gender Divide",
                    "effect": "Decreases probability. Data shows the shift to Vox is much stronger among young men than women, with young women remaining to the left, potentially limiting the total potential growth in the general 18-24 bracket."
                },
                {
                    "factor": "Image Saturation and Backlash Effects",
                    "effect": "Slightly decreases probability. Rapid increases may incite counter-mobilization or public controversy, especially if negative news or backlash emerges as Vox reaches dominance among youth."
                },
                {
                    "factor": "Competition from Other Rightwing or Anti-Establishment Parties",
                    "effect": "Decreases probability. Alianza Catalana and other emergent far-right parties are capturing parts of the youth electorate, leading to potential vote-share fragmentation."
                },
                {
                    "factor": "Sampling and Survey Volatility",
                    "effect": "Increases probability of fluctuations both above and below 27%. Youth voting intention is volatile and susceptible to single-event spikes, particularly as this is the age group with highest impulsivity in survey response."
                }
            ],
            "no_scenario": "Vox's youth support remains at or below 27% in the final 2025 40dB poll (e.g., staying flat or dipping due to right-wing vote fragmentation, successful countermessaging by left/progressive parties, or negative exposure/backlash). Gender asymmetry in Vox's appeal keeps the overall average from breaking upward, and increased abstention or political apathy among youth caps further growth.",
            "yes_scenario": "Vox leverages continued digital virality, capitalizes on new right-wing narratives, or a polarizing national incident causes another bump in support, pushing the reported direct voting intention among youth above 27% in at least one 40dB poll before the end of 2025. Survey volatility nudges results above the previous record (even if the underlying support does not fundamentally change), or further defection from PP/other right-affiliated youth to Vox occurs.",
            "final_reasoning": "Vox's direct voting intention among young people has reached 27%—a historic high—driven by recent surges in right-leaning self-identification (from 8% to 34% in a decade) and broader European trends. While the momentum is strong and the underlying ideological realignment continues, base rates in party support suggest ceiling effects often emerge after rapid increases, especially within a single year. The high abstention among youth, noted gender split (young men driving the rightward swing), and increasing competition from other right-wing parties may curb further growth, but the volatility of youth preferences and currently favorable trends mean that a breach above 27% in a single poll is plausible. Given these competing factors, and the fact that the status quo is precisely at the threshold, the best-fit projection is a moderately elevated probability: higher than a coin flip due to momentum and volatility, but not extreme given countervailing demographic and political headwinds.",
            "final_probability": 62
        },
        "Political Science (Party System Theory)": {
            "time_to_resolution": "Approximately 3 months (until end of December 2025).",
            "perspective_relevance": "As an expert in Political Science with a specialization in Party System Theory, my analysis emphasizes structural factors behind youth alignment with right-wing populist parties, the wider comparative European trends, party messaging/cleavage strategies, generational realignment, and the political economy of youth dissatisfaction. This lens foregrounds base rates of rapid youth shifts as rare, the stickiness of party identification, and the importance of abstention rates among the young. It allows nuanced interpretation of whether Vox will sustain or grow dramatically from its already unprecedented youth support.",
            "status_quo": "Vox currently polls at or just under 27% voting intention among 18-24 year-olds (per recent 40dB polls cited in El País and other sources). Traditionally, Vox had much lower youth support, but this is now its strongest demographic bracket. In the absence of new shocks or dynamics, the most likely outcome is stasis or gradual minor increase/decrease—i.e., support remains at or below 27%.",
            "perspective_derived_factors": [
                {
                    "factor": "European Far-Right Youth Surge",
                    "effect": "Increases probability. Cross-national trends show far-right parties gaining among youth in France (RN), Germany (AfD), and elsewhere, suggesting an environment conducive to similar movements in Spain."
                },
                {
                    "factor": "Structural Youth Disaffection and Economic Grievance",
                    "effect": "Increases probability. With high youth unemployment, precarity, and housing insecurity, disillusionment with traditional parties creates a fertile ground for Vox’s anti-establishment and radical messaging."
                },
                {
                    "factor": "Vox’s Digital Strategy and Memetic Engagement",
                    "effect": "Increases probability. Vox has effectively targeted youth via social media (TikTok, Instagram), leveraging viral content and 'rebellious' branding—shown to boost right-populist youth appeal elsewhere."
                },
                {
                    "factor": "Abstention and Turnout Rates Among Youth",
                    "effect": "Decreases probability. Spanish youth are the most abstention-prone segment (over 40% non-voters in 18-24 bracket). The pool of 'potential' Vox youth support is limited by persistent disengagement, capping maximum direct voting intention."
                },
                {
                    "factor": "Gender Divide among Young Voters",
                    "effect": "Decreases probability. Vox skews heavily male among youth; aggregate support could be capped by persistent gender divergence, with young women leaning away from far-right parties."
                },
                {
                    "factor": "Party System Fragmentation and Competing Right/Ultra-Right Parties",
                    "effect": "Decreases probability. In regions like Catalonia, parties like Alianza Catalana and local context may siphon some potential Vox youth support, limiting further growth."
                },
                {
                    "factor": "Status Quo/Regression to Mean",
                    "effect": "Decreases probability. Historically, very rapid surges tend to encounter ceilings and even small reversals in volatile youth segments, especially if counter-messaging intensifies or events dampen the far right’s appeal."
                }
            ],
            "no_scenario": "The next 40dB poll before the end of 2025 shows Vox at 27% or below among 18-24s (e.g., 25-27%). Youth abstention remains high, Vox’s momentum stagnates as other concerns (e.g., housing, environment) gain salience, or as left/centrist parties adapt some rhetoric to recapture youth. The male-female gap persists or widens, preventing a general surge. Anti-immigrant focus hits diminishing returns among the young, and parties like Alianza Catalana erode Vox’s niche in some regions.",
            "yes_scenario": "Vox, riding continued disaffection with the left, youth economic frustration, and well-executed viral campaigns, maintains upward momentum. A new national or European crisis (e.g. migration, security) flares up, giving fresh impetus to Vox’s agenda. Their digital outreach and anti-establishment messaging resonates further, and youth abstention falls or previously undecided right-leaning youth break for Vox, pushing it over 27% in the key poll.",
            "final_reasoning": "While Vox’s rise among Spanish youth is notable, historical base rates indicate further dramatic surges above established record highs within a 3-month time window are uncommon. The 27% figure is already at or near a local maximum, with the party’s growth largely fueled by economic alienation, effective digital messaging, and dissatisfaction with status quo parties—dynamics mirrored in much of Europe. However, countervailing factors are strong: very high youth abstention rates restrict the pool from which further growth would be realized (especially in direct voting intention figures). The party’s support is disproportionately male, creating a gender ceiling. Competing ultra-right forces, especially regionally, may fragment the protest vote, and initial novelty/virality effects may plateau. The party system theory expectation is that new, rapid shifts rarely push through such round-number ceilings absent dramatic new events. Nevertheless, if reporting error margins in polling are considered, Vox is close—so a moderate probability is warranted, but low likelihood for a sustained, clean break above 27% in the relevant poll before year’s end.",
            "final_probability": 27
        },
        "Political Science (Vote Choice Models)": {
            "time_to_resolution": "Approximately 3 months until the end of 2025 (Question resolves with the final 40dB youth voting intention survey published by December 31, 2025. If last survey is before October 1, 2025, question is void, but I'll assume the survey will be published in Q4).",
            "perspective_relevance": "As an expert in Political Science (Vote Choice Models), I approach this question by analyzing the determinants of youth voting intention, including sociodemographic trends, partisan realignment, issue salience, media effects, cohort and period effects, and cross-national comparators. I can contextualize the current figures in historical perspective and model the structural and contingency factors that could drive late-2025 change.",
            "status_quo": "The direct voting intention for Vox among 18-24 year olds in the latest referenced 40dB surveys is at/near 27%. Recent polls cite ranges from 21% to 27%. The most recent widely-cited figure is 27%, which marks Vox's all-time recorded high among the youth cohort. The status quo is Vox at 27%. If nothing changes, the next poll is likely to be at or just below this figure.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent Trend in Youth Support for Vox",
                    "effect": "Increases probability. The last 18 months show sharp and unprecedented gains for Vox in the 18-24 cohort, reflecting a generational shift rightwards and growing male youth identification with far-right politics."
                },
                {
                    "factor": "Surge Fatigue and Ceiling Effects",
                    "effect": "Decreases probability. Once a party reaches a peak figure, further gains often plateau. 27% is unusually high for a far-right party in a Western European democracy among youth, suggesting natural limits absent a catalyzing shock."
                },
                {
                    "factor": "Issue Salience – Economic and Immigration Concerns",
                    "effect": "Increases probability. Youth dissatisfaction with jobs, housing, and especially immigration—as reflected in high salience in 2025—feeds into Vox's strongest messaging tropes, maintaining tailwinds."
                },
                {
                    "factor": "Abstention and Youth Electoral Volatility",
                    "effect": "Decreases probability. High abstention among 18-24s (as high as 45%) and general volatility mean large swings in intention are as likely down as up, depending on turnout expectations and poll parameters."
                },
                {
                    "factor": "Gender Split Among Youth",
                    "effect": "Decreases probability. While young men strongly support Vox, young women do not; if polling samples are weighted or young women's turnout rises, overall figure could stagnate or even decline."
                },
                {
                    "factor": "Momentum Effects and Mimetic Dynamics (Europe-wide youth rightward shift)",
                    "effect": "Increases probability. Comparable youth surges for the far right have occurred in Germany, France, and Hungary, providing plausible base rate for further growth."
                },
                {
                    "factor": "Competing Right Parties (Aliança Catalana, PP Recovery)",
                    "effect": "Decreases probability. If new right-wing alternatives or a revived PP start appealing to conservative youth, Vox’s ceiling is constrained."
                },
                {
                    "factor": "Media and Social Media Ecosystem",
                    "effect": "Increases probability. Vox’s mastery of virality among youth via TikTok, Instagram, and meme culture likely sustains above-trend performance."
                }
            ],
            "no_scenario": "Vox maintains its high level of support among youth, but abstention remains strong, and as the year ends, issue salience shifts (e.g., PSOE or Sumar’s attention to youth employment, or mainstream parties co-opt anti-immigration narrative). The gender gap persists or even widens, with young women mobilizing against Vox. The last 2025 40dB survey posts a figure at or just below 27% (e.g., 25-26.9% direct intention), reflecting a peak plateau or minor recall. Alternatively, if far-right alternatives (e.g., Aliança Catalana) split the vote or polling methods adjust weights, the number falls.",
            "yes_scenario": "A combination of further mainstream party corruption, economic crisis (housing, inflation), dramatic migrant events, or a major viral campaign pushes Vox’s youth support just above the current record: the final 2025 40dB youth barometer gives Vox 28%+ among 18-24s. This is supported by continuing European youth rightward momentum and successful mobilization of the most disaffected non-voting youth into the political process. Alternatively, social media virality intensifies, and even more young men gravitate towards Vox, breaking the ceiling.",
            "final_reasoning": "The status quo is Vox at 27%, already at a historic extreme. Political science vote choice models emphasize the stability of vote intention baselines, especially close to demographic or ideological peaks, alongside momentum inertia. The recent surge in right-identifying youth and effective Vox digital strategy are countered by strong abstention, gender cleavage, and diminishing returns at high support levels. Base rates suggest it is uncommon for a far-right populist party to maintain surge momentum past a high ceiling in Western democracies without major exogenous shocks. However, Spain (like parts of Europe 2023-25) may be in the midst of an anomalous period; cascading anti-mainstream sentiment, economic grievances, and digital virality can push boundaries. The scenario for Yes requires either a major late-2025 negative shock to the mainstream, or an intensification of the viral/demographic dynamics already present; plausible, but not the default. Status quo bias and ceiling effects caution against a further rise, but the exceptional trend cannot be ignored. Overall, I see roughly a 1-in-3 chance the next poll edges above 27%, most likely only marginally (e.g., 27.5-29%), absent further structural shocks.",
            "final_probability": 33
        },
        "Sociology (Youth Political Socialization)": {
            "time_to_resolution": "Approximately 3 months (until December 31, 2025, less than 100 days from September 22, 2025)",
            "perspective_relevance": "As an expert in Sociology with a focus on Youth Political Socialization, I bring a structural, data-driven understanding of how youth attitudes, peer effects, digital communication, and political engagement evolve. I integrate historical base rates of youth radicalization, sociopolitical polarization, abstention tendencies, and the mechanisms by which parties like Vox mobilize (or fail to mobilize) emergent youth cohorts. I analyze not only trends in reported preferences but also deeper behavioral and structural youth factors (turnout, gender cleavage, digital activism vs. voting, etc.) that impact polling and realignment dynamics.",
            "status_quo": "Recent 40dB polls (Feb 2025; and echoed in Sep 2025 reporting) place Vox youth voting intention at 27% for the 18-24 group—its historic high. The latest barometers and data show the number fluctuates in the low-to-mid 20s, with some confirming 21.4% (El Periódico), but the critical 27% threshold has already been touched, indicating an upswing but not an unequivocal breakout. Barring changes, the status quo is Vox stabilizing in the 21–27% range through 2025.",
            "perspective_derived_factors": [
                {
                    "factor": "Youth Abstentionism",
                    "effect": "Decreases the probability. Youth in Spain traditionally have the lowest electoral participation (only ~55% turnout in last national election), so reported intentions do not fully translate into votes, and even less into structural attitudinal change—expect some soft bias in high intention/hard to hard support."
                },
                {
                    "factor": "Gender Cleavage",
                    "effect": "Decreases the probability. Men under 24 are significantly likelier than women to support Vox (sometimes by double digits). Rising feminist engagement among young women (as cited in news) counterbalances young men’s radicalization, limiting aggregate ceiling."
                },
                {
                    "factor": "Economic/Precarity-Driven Populism",
                    "effect": "Increases the probability. High youth unemployment and housing precarity drive youth toward populist, anti-establishment options; currently, Vox channels this anti-system impulse on the right, as left-populist momentum wanes nationally."
                },
                {
                    "factor": "Digital/Algorithmic Political Socialization",
                    "effect": "Increases the probability. Vox excels in viral short-form social media, tapping into TikTok and Instagram youth cultures, and weaponizing digital networks—a key accelerator for right-populist youth mobilization, especially among disaffected or less-politically-socialized cohorts."
                },
                {
                    "factor": "Base Rate of Rightward Youth Shift",
                    "effect": "Increases the probability. Both Spanish and broader European data show a historic realignment: the under-25s are no longer more left-wing than older cohorts. The right–far-right axis is the primary beneficiary among men and some regional working classes."
                },
                {
                    "factor": "Fragmentation/Competition on the Far-Right",
                    "effect": "Decreases the probability. In Catalonia and other regions, ultra-right offers (e.g., Aliança Catalana) compete with Vox, splitting the vote ceiling. Some populist votes may also be dissipated by new anti-establishment efforts (e.g., Alvise), limiting Vox’s single-party ceiling."
                },
                {
                    "factor": "Movement Fatigue/Backlash Potential",
                    "effect": "Decreases the probability. As the far-right becomes the new 'establishment' among youth, backlash or fatigue may set in, as seen in Hungary or Germany, where alternative anti-system parties attract youth away from the traditional far-right after peaks of mobilization."
                }
            ],
            "no_scenario": "Vox’s youth voting intention plateaus or dips due to over-saturation, fragmentation, or a late surge in anti-Vox mobilization (perhaps among young women, or boosted by left-of-center youth engagement on climate/feminist/anti-xenophobia lines), or a marginal rightward shift is absorbed by competition (e.g., Aliança Catalana, Alvise, or other regional/issue-specific parties). Abstention rises or stabilizes, so declared intentions do not crystallize above 27% in the end-of-year 40dB survey.",
            "yes_scenario": "Vox capitalizes on youth economic frustration, pushes its digital strategy even harder, and benefits from either a domestic or European migration/security crisis that amplifies far-right themes. The left remains divided, unable to mobilize youth with a new positive agenda, and the gender gap narrows slightly as Vox tailors some youth-culture messages to women or exploits fatigue with progressive discourses. The 40dB end-of-year survey captures this surge in direct intention, topping 27% among 18–24-year-olds.",
            "final_reasoning": "Vox is at an inflection point with Spanish youth. The status quo is historically high (21–27%) and, as per polls, Vox has already touched the 27% mark in the key age group, but not decisively surpassed it. The international context and comparative cases (Le Pen, AfD) show right-populist youth realignment accelerating, but also reveal eventual ceilings due to abstention, gender gap, and movement fatigue. The most recent data, including CIS, El País/40dB, and regional barometers, show a consistent leading position—especially among men—but not strong evidence of a surging trend beyond the current plateau; some reports cite a stabilization in the low/mid 20s, and very high abstention looms. Crucially, regional vote fragmentation and continued low youth turnout diminish the impact of headline figures. On balance, considering the tendency of the world and of Spanish youth politics to change slowly and the base rate of polls not persistently above 27% (rather, oscillating around this ceiling), the 'No' scenario is modestly favored; the chance of a surge is non-negligible, but the bulk of probabilities lie just below the threshold.",
            "final_probability": 38
        },
        "Sociology (Generational Theory)": {
            "time_to_resolution": "Approximately 3 months until end of 2025 (question resolves on publication of the last 40dB youth voting intention poll in 2025)",
            "perspective_relevance": "As a sociologist specializing in generational theory, my expertise illuminates how cohort effects shape political attitudes and voting preferences. I bring an understanding of the underlying socioeconomic drivers, social identity dynamics, intergenerational value shifts, and the distinct media consumption and mobilization patterns of Gen Z in Spain. This background is essential for interpreting the polling data and sociopolitical commentary on Vox's appeal to the youth, as well as understanding turnout and movement potential among these cohorts.",
            "status_quo": "Most recent available 40dB polls place Vox's direct voting intention among 18-24-year-olds at 27% (February 2025, as per question description and links), i.e., right at the question threshold. Other recent reported statistics in the news range from 21.4% to about 27% among youth. The trend has been upward in 2025, but large further jumps are rare in such short periods. The status quo outcome, if nothing changes, is Vox at or just below the 27% mark in the next 40dB youth poll—so close but not surpassing.",
            "perspective_derived_factors": [
                {
                    "factor": "Long-term generational value shift toward the right",
                    "effect": "Increases probability. Multiple sources confirm a steady shift rightward among Spanish youth, with right-wing self-identification among 18-24s rising from 8% (2015) to 34% (2025), the center shrinking, and a substantial male/female ideological gap emerging. This persistent trend drives up the base rate for far-right youth support."
                },
                {
                    "factor": "Vox's mastery of digital/social media with youth",
                    "effect": "Increases probability. Multiple articles detail Vox's highly sophisticated, viral digital outreach via TikTok/Instagram, meme culture, and microtargeted content, exploiting social media as a space less dominated by leftist narratives or traditional gatekeepers. This may accelerate gains among online-active youth relative to older, TV-focused generations."
                },
                {
                    "factor": "Youth economic precarity and disenchantment",
                    "effect": "Increases probability. Youth unemployment, lack of affordable housing, and perceived lack of future prospects have historically driven anti-system voting among young people. Disenchantment with mainstream parties can convert soft support or apathy into experimental, even radical, voting (boosting populist/far-right scores)."
                },
                {
                    "factor": "Gender polarization among youth",
                    "effect": "Limits probability. The male half of Gen Z is skewing strongly toward Vox, while young women remain significantly more left-leaning and skeptical of far-right politics. This gender divide may cap Vox's ceiling if male support saturates but female opposition hardens."
                },
                {
                    "factor": "Rising youth abstention and turnout volatility",
                    "effect": "Decreases probability. The leading 'party' among 18-24-year-olds is abstention (per sociologists and turnout data: 45% of 18-24s did not vote in 2023; only 56.4% of 18-29s voted). High abstention rates dampen the effect of volatile youth support in headline polls, and those most likely to abstain are less ideologically engaged, possibly causing top-line support to plateau."
                },
                {
                    "factor": "Poll volatility, ceiling effects, and base rates",
                    "effect": "Decreases probability. While recent polls report Vox at 21-27% among youth, jumps above 27% in such a short span are historically rare. Past surges among youth for far-right parties in similar European contexts often 'stall' near 25-28% without further transformative shocks. Bolder jumps would require unique triggers in the coming quarter."
                },
                {
                    "factor": "Competition from similar parties and left-populist alternatives",
                    "effect": "Decreases probability. In some regions (e.g., Catalonia), Alianza Catalana and other hard-right or identity-based parties draw on the same pool, while left-populist alternatives attract some disillusioned youth. Vox's ceiling is limited by these overlapping constituencies."
                },
                {
                    "factor": "Media backlash and youth counter-mobilization",
                    "effect": "Marginal decrease. As Vox becomes more prominent, it could trigger counter-mobilization among youth subsets (especially women and minorities) or provoke media scrutiny that cools further growth."
                }
            ],
            "no_scenario": "Vox's youth support remains near but does not surpass 27%. High male support is offset by continued female skepticism; rising abstention after the initial surge means the net effect is a plateau. Social/economic conditions stay the same or improve slightly, dulling the sense of crisis. The 40dB poll at year's end shows Vox at 25-27% among youth, matching or slightly down from their 2025 peak.",
            "yes_scenario": "Vox's digital campaign finds new viral successes; mainstream parties (PP, PSOE) fail at youth outreach or commit public blunders. There is a new high-salience controversy (e.g., linked to immigration, crime, or identity) mobilizing disaffected youth, particularly young men. Abstention drops modestly or the increase in intentionality outpaces disenchantment. The next 40dB youth poll records Vox at 28% or higher among 18-24s.",
            "final_reasoning": "The base rate for a youth cohort voting shift of this size (>27% for a far-right party within a year, with the previous max at 27%) is low: electoral opinion often shows inertia or only gradual movement absent dramatic shocks. Sociology of generations suggests long-term drift rightward, but sudden surges above a psychological threshold are rare without additional triggers. The ceiling effect and gender split are real barriers. Vox's mastery of digital media, alignment with economic precarity, and the international trend for right-populist youth surges are serious tailwinds, but the news does not indicate any specific transformative event upcoming before resolution. Abstention and competing parties may suppress headline gains. Status quo outcome is just below or at the threshold. Probability of YES (Vox >27%): moderately low but not trivial.",
            "final_probability": 30
        },
        "Iberian Studies (Contemporary Spanish Politics)": {
            "time_to_resolution": "just over 3 months, as the last possible poll would be in late December 2025 (if published); today is late September 2025",
            "perspective_relevance": "As an expert in Iberian Studies and Spanish contemporary politics, I have specialized knowledge of the ideological trends among Spanish youth, the mechanisms by which right-populist parties gain traction, micro-dynamics of Spanish polling, and the historical and social factors shaping the electorate. I also have expertise regarding how demographic blocks fragment, how abstention weighs on polling outcomes, and can reliably interpret sociological and poll data in the Spanish context, especially with an eye to realignment and generational change.",
            "status_quo": "The most recent 40dB. polls place Vox at or just below 27% direct voting intention among 18-24s—27% (February 2025, as cited), with most other data in the 21%-24% range. The party’s support among youth is very high compared to other demographics, but there is not yet a consistent, clear break past the 27% threshold.",
            "perspective_derived_factors": [
                {
                    "factor": "Structural Rightward Drift Among Youth",
                    "effect": "Increases probability. There is an unprecedented rightward ideological drift among 18-24s since 2018, with right identification up from 8% to 34%, and Vox now outpolling PP and all left parties among young men. This drift structurally supports Vox's high youth vote."
                },
                {
                    "factor": "Polling Volatility and Youth Abstention",
                    "effect": "Decreases probability. Actual voting intention fluctuates greatly for youth and abstention remains the dominant 'choice' for this cohort. Repeated reminders in CIS/40dB surveys show abstention above any single party, and large swings are possible if left mobilizes or majority remains apathetic."
                },
                {
                    "factor": "Issue Ownership: Housing, Immigration, Politics",
                    "effect": "Slightly increases probability. Youth cares most about issues where Vox is perceived as offering clarity (housing, law-and-order, anti-elite politics, anti-immigration). The social media virality of these themes benefits Vox more than legacy parties."
                },
                {
                    "factor": "Comparative European Trend",
                    "effect": "Increases probability. As seen in France (Le Pen/RN), Germany (AfD), and Hungary, youth electoral movement towards far-right parties is widespread, suggesting that Spanish youth are unlikely to be an outlier."
                },
                {
                    "factor": "Gender Divide Within Youth",
                    "effect": "Neutral. Young men are disproportionately moving to the right and especially towards Vox, but young women are moving left or abstaining, potentially capping Vox's ceiling in this demographic."
                },
                {
                    "factor": "Viral Digital/Influencer Strategy",
                    "effect": "Moderately increases probability. Vox’s digital messaging is uniquely adapted for youth attention (meme culture, short videos, alliances with international influencers) and they have meaningfully closed the communication gap compared to PSOE/PP among youth."
                },
                {
                    "factor": "Base Rate/Status Quo Bias",
                    "effect": "Decreases probability (slightly). Inertia matters: trends are strong but even for fast-growing parties, the leap above a high barrier like 27% within a single year is historically rare in stable democracies."
                },
                {
                    "factor": "Recent Scandal and Political Context",
                    "effect": "Slightly increases probability. With the PP stagnating, corruption scandals impacting left and centre-right, and general voter frustration, protest dynamics may send additional marginal gains to Vox among the disaffected youth, as per recent polling."
                },
                {
                    "factor": "Risk of Left/Mobilization or Blowback",
                    "effect": "Decreases probability (slightly). A highly visible Vox surge might mobilize anti-far-right youth (especially women/feminist-leaning) or trigger bandwagoning against them if the left were to change communication tactics or if a major event (e.g., violent incident, major error by Vox leadership) occurred."
                }
            ],
            "no_scenario": "Vox consolidates its position as first among youth, holding or moving just below the 27% mark (i.e., 25-26% in direct voting intention), with abstention remaining high and/or the left (Sumar, Podemos, PSOE) mobilizing enough female or moderate youth to prevent further growth. Social media virality plateaus, or a backlash among youth (or a galvanizing left event) weighs just enough to stall the trend. The next 40dB poll due before year-end shows Vox at or below 27%.",
            "yes_scenario": "Vox capitalizes on further PP decline and youth dissatisfaction, uses viral tactics to peel away even more voters from mainstream right and protest-minded left, pushes direct youth voting intention above 27%—potentially benefiting from a minor exogenous shock (a left-leaning scandal, migration event, new anti-left meme, or polling artifact). Gender gap persists but is offset by outsize gains among young men and further left abstention. The last 2025 40dB survey captures this surge with, e.g., 28-30% among 18-24s.",
            "final_reasoning": "The balance of evidence shows that Vox enjoys structural, cyclical, and tactical advantages in competing for the direct voting intention of Spanish youth in 2025. The rightward shift is deep, rapid, and reinforced by international contagion and social media strategy. In the February 2025 poll, Vox already hit the 27% threshold; subsequent reports (21-24%) suggest a very high but volatile ceiling. With about three months to go and a general political environment favoring further anti-mainstream sentiment, a move past 27% is plausible—though not certain because abstention remains dominant, the gender gap caps growth, and external events could prompt a last-minute surge for the left or a backlash. Still, the status quo (Vox just below 27%) is fragile, and even a small positive shock or sampling dynamic could send Vox over the line. While there are significant uncertainties from turnout volatility, the accumulated trend, the party’s unique youth outreach, and the comparative European context makes it likelier than not that Vox will briefly surpass the specified threshold in a published 40dB poll for 2025.",
            "final_probability": 66
        }
    },
    "deliberation_probability": [
        43,
        62,
        38,
        62,
        27,
        33,
        38,
        30,
        66
    ],
    "deliberation_mean_probability": 44.333333333333336,
    "deliberation_sd": 15.041608956491324,
    "deliberation_probability_result": 44,
    "group_results": {
        "electionPollingSurveyMethodologyStandards": {
            "forecaster_to_engage": "Election Polling (Sampling Error Analysis)",
            "response_type": "critique",
            "response": "While your analysis correctly highlights that volatility and sampling error in youth polling increase the chance that a single 40dB poll could swing above 27%, your implied probability (62%) overemphasizes the likelihood that survey noise alone will produce a 'Yes' resolution. As a methodologist, I caution that reputable firms like 40dB implement weighting, multi-wave adjustments, and nonresponse correction to prevent repeated overstatement of volatile results, especially after recent publicity for youth rightward surges. Furthermore, panel fatigue and post-stratification can dampen the impact of transient viral or meme-driven surges, making it less likely that purely stochastic error, absent a real underlying increase, will generate a headline-raising new maximum. Given the historic stickiness of polling plateaus and the ceiling effect already being approached, I view 62% as too high—sampling error is a critical element, but must be balanced with the structural inertia and survey correction mechanisms in modern Spanish polling."
        },
        "electionPollingSamplingErrorAnalysis": {
            "forecaster_to_engage": "Public Opinion Analysis (Trend Projection Techniques)",
            "response_type": "defense",
            "response": "Your forecast recognizes both the moderate ceiling effect—common in youth intention polling on far-right parties in Europe—and the unique volatility inherent to small youth sub-samples. I want to defend your 62% probability, which aligns closely with my quantitative assessment. From a sampling error perspective, while most movements near the plateau are dampened by post-stratification, the current status quo (27%) puts even a small stochastic nudge, or a short-lived external momentum (e.g., a viral campaign), within reach of a >27% reading. The recent trajectory and structural volatility mean the upside risk cannot be discounted, and the question's resolution requires only one figure above 27%, not a sustained trend. Thus, rather than being overly influenced by inertia, your estimate properly weights the large tails of youth polling distributions in Spain at this moment, especially given the sharp focus media and parties have directed toward this demographic."
        },
        "politicalConsultingVoterSegmentationStrategies": {
            "forecaster_to_engage": "Political Science (Party System Theory)",
            "response_type": "critique",
            "response": "Your forecast applies the classic party system theory logic—that new record highs are rarely breached quickly without exogenous shocks—and this does fit most stable Western democracies. However, from a voter segmentation standpoint, the threshold at 27% is not an 'entrenched' psychological barrier but rather an artifact of current cross-sectional measurement. The current Spanish youth political landscape is defined by fluidity, hyper-personalized online targeting, and accelerating polarization, all of which can shift intention figures abruptly—especially in underpolled, digital-native subpopulations. Moreover, structural base rates are recalibrating in real time given European comparators (e.g., AfD with youth in Germany), and Spanish polling history suggests sporadic, outsized swings in direct intent for 'breakout' parties. Thus, your probability (27%) likely underestimates both the volatility and the potential for even minor external events or endogenous digital surges to nudge Vox over the threshold in the final survey period."
        },
        "publicOpinionAnalysisTrendProjectionTechniques": {
            "forecaster_to_engage": "Sociology (Youth Political Socialization)",
            "response_type": "defense",
            "response": "Your reasoning correctly grounds itself in both base rates and the structural inertia of youth voting intention, especially after sharp surges. From a public opinion trend analysis perspective, I support your emphasis on plateauing after rapid periods of growth, which is a recurrent feature in multi-year youth sentiment time series across Europe. You rightfully give weight to abstention and gender gaps as brakes on further escalation. While volatility could still push Vox modestly above the previous high by chance, the absence of explicit new momentum drivers or game-changing exogenous events makes this a low-likelihood single-tail event. Your probability (38%) acknowledges real upside risk but is constrained by the typically sticky nature of such surges and the ceiling being approached—a reasonable calibration given the field’s cyclical and reciprocal pattern recognition."
        },
        "politicalSciencePartySystemTheory": {
            "forecaster_to_engage": "Iberian Studies (Contemporary Spanish Politics)",
            "response_type": "critique",
            "response": "While you make a strong case for the structural and contextual forces behind Vox’s support among Spanish youth—drawing in comparative trends, digital mobilization, and the anti-mainstream turn—I believe your probability (66%) overstates the likelihood of a new surge above 27% in direct youth intention by year’s end. From a party system theory perspective, even in periods of rapid realignment, there are strong status quo and ceiling effects, particularly once a historical high is already reached; rallies and minor shocks can produce volatility, but party ID, especially under conditions of high abstention and persistent gender gaps, changes more sluggishly. Moreover, with the survey using direct intention (rather than more volatile preference or favorability metrics) and the likelihood of regression to the mean in the absence of a clear exogenous trigger, the probability of crossing this salient barrier in such a short time window is structurally constrained. While a spike is certainly plausible, the default should be more conservative—your estimate could benefit from weighting baseline reversion and the hard-to-breach nature of direct intention thresholds more heavily."
        },
        "politicalScienceVoteChoiceModels": {
            "forecaster_to_engage": "Sociology (Generational Theory)",
            "response_type": "defense",
            "response": "You correctly draw attention to the long-term inertia inherent to generational political realignment and the difficulties of breaching new psychological or empirical record highs without a strong catalyzing event. As political science vote choice modeling also emphasizes, ceiling effects and cohort stabilization are often underestimated in fast-moving news environments. Your consideration of abstention, gender gap, and the absence of transformative shocks as factors capping further rapid gains aligns well with historical European party evolution. While a small tail probability must be acknowledged, your moderately low (but nonzero) probability for a Yes outcome is a disciplined application of base rate and period effect logic that tempers overreaction to short-term spikes."
        },
        "sociologyYouthPoliticalSocialization": {
            "forecaster_to_engage": "Election Polling (Survey Methodology Standards)",
            "response_type": "defense",
            "response": "Your forecast cogently emphasizes the moderating effect of modern survey methodology on volatile sub-sample results. From a youth political socialization perspective, I concur that recent publicity and concern around youth rightward movement means responsible pollsters like 40dB are especially vigilant for overstatements due to noise, selection bias, or digital campaign surges. The combination of multi-wave smoothing and post-stratification likely both reduces the chance that a stochastic uptick is published and ensures that any published breach of 27% would more likely reflect a real underlying shift. Additionally, status quo psychological effects and youth disengagement further reinforce inertia at high plateaux. Thus, your decision to assign a probability below 50% is more realistic and robust than estimates that overweight sample noise or ignore modern panel controls. This careful methodology likely explains why the high watermark for Vox youth intention has been touched but not consistently exceeded, supporting your tempered forecast."
        },
        "sociologyGenerationalTheory": {
            "forecaster_to_engage": "Public Opinion Analysis (Trend Projection Techniques)",
            "response_type": "defense",
            "response": "Your projection captures a crucial sociological reality: youth political shifts, even in highly volatile eras, are usually followed by a period of stabilization or retrenchment, as new norms are negotiated and ceilings encountered. Generational theory reminds us that though the youth cohort is drifting rightward and digital media amplifies spikes, there is a lag between attitudinal shifts and their reflection in durable, repeatedly measured outcomes—especially amid high abstention and gender splits. Your recognition that the proximity to the threshold elevates risk, but does not assure a breakout, synchronizes with generational patterns where each new high in support for populist parties is heavily contested and prone to oscillation rather than straight-line continuation. The 62% probability is reasonable provided attention is given to volatility, but your description of ceiling effects and absence of transformative drivers is especially well-justified. The nuanced constraint placed on runaway projections is a strength here, not a limitation."
        },
        "iberianStudiesContemporarySpanishPolitics": {
            "forecaster_to_engage": "Election Polling (Sampling Error Analysis)",
            "response_type": "critique",
            "response": "While your reasoning appropriately recognizes the genuine effect sample volatility can have near a threshold, I think your 62% estimate underweights the influence of persistent and systematic factors in Spanish youth politics. You suggest that even minor stochastic variation or polling artifacts could tip Vox over 27% direct intention, but the institutional safeguards against misleading surges—such as robust weighting for age, region, and turnout likelihood—dampen the effect of sample noise, especially in 40dB's professionally calibrated surveys. Moreover, the trend in Spanish youth intention polling over the past year shows sharp upward movement but also rapid regression to the mean after spikes, especially as issue salience and digital campaigns cycle. Given the absence of a recent or anticipated external shock to fundamentally animate new voters, and the plateaued status in recent data, relying on volatility to generate a new high seems optimistic. While volatility increases tail risks, the base rate for crossing a round-number psychological ceiling so close to EOY is just not this high. A more conservative stance (perhaps 40-50%) would better fit the structural and survey methodological context."
        }
    },
    "revision_results": {
        "Election Polling (Survey Methodology Standards)": {
            "my_phase1_final_probability": 43,
            "reasoning_for_revised_probability": "After reviewing group forecasts, especially the discussion with the Sampling Error Analysis forecaster, I am reinforced in my belief that volatility and chance alone are not enough to justify an extreme risk estimate. Their higher probability (62%) was critiqued as overly reliant on the odds that survey noise alone would suffice to push Vox over 27%, neglecting methodological controls in reputable Spanish polling that mitigate chance outliers. Further, reflections from other domains (Political Consulting, Sociology, Party System Theory) converge around the idea that momentum may be real but faces strong structural and psychological ceilings. My own original probability (43%) properly accounts for the narrow window for movement, the status quo's stickiness, and the pollsters' methodological robustness. However, the consensus from the group also suggests the risk of a sampling artifact spike is slightly greater than my original estimate implied—if only due to the heightened volatility of youth subsamples and the generally unpredictable late-year media/campaign environment. Thus, I moderately revise up, while still remaining below the 50% mark, to reflect this slightly elevated risk.",
            "revised_probability": 47
        },
        "Election Polling (Sampling Error Analysis)": {
            "my_phase1_final_probability": 62,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, particularly the critique from the Survey Methodology Standards forecaster, I recognize a key methodological point: reputable pollsters like 40dB conduct post-stratification, apply weighting, and use techniques to avoid overstating volatility from random noise—especially after a demographic has garnered high media attention. This reduces the probability that a purely stochastic movement above 27% will be published absent a real, durable change in underlying sentiment. While youth volatility remains higher than average, the presence of such adjustments suggests my original estimate put too much weight on the potential for 'lucky' sampling error without enough evidence of plausible new positive drivers. There is still upward risk from momentum and international context, but with the current plateau and likely methodological dampening, a modest downward revision is warranted. I now judge the probability that a final 2025 40dB poll shows Vox >27% in youth intention as moderately above 50% but less than initially stated.",
            "revised_probability": 54
        },
        "Political Consulting (Voter Segmentation Strategies)": {
            "my_phase1_final_probability": 38,
            "reasoning_for_revised_probability": "After reviewing other forecasters, I have greater appreciation for two salient factors: (1) Sampling volatility in small youth subsamples combined with the nature of the resolution (a single poll above 27% suffices) increases the risk of a 'Yes' outcome more than structural inertia alone would suggest. Forecasters specializing in sampling error and trend projection consistently put more weight on the distribution's tails, arguing that even without a true surge in underlying support, a transient, media-driven or stochastic polling spike is plausible given the heightened focus on youth intention and the digital campaign environment. (2) Conversely, arguments from methodological and party theory perspectives remind that modern survey design and panel correction may dampen short-term volatility somewhat, and there is broad expert consensus against assigning highly elevated probabilities. On balance, the upside risks are not so overwhelming as to make a 'Yes' more likely than not, but they do justify a moderate upward revision. I am persuaded to nudge my probability upwards, though still on the 'No' side.",
            "revised_probability": 45
        },
        "Public Opinion Analysis (Trend Projection Techniques)": {
            "my_phase1_final_probability": 62,
            "reasoning_for_revised_probability": "After group deliberation, I have had the opportunity to review more cautious, base-rate-oriented perspectives (such as from Sociology, Party System Theory, and Vote Choice Models), which consistently emphasize the plateau or ceiling dynamic that historically follows rapid surges in youth support for emergent parties. Critiques correctly highlight that sampling error and volatility, while real, are somewhat mitigated in reputable surveys through weighting and repeated waves. On the other hand, defenses of my original estimate point out the high volatility and very low threshold for a 'Yes' (any single poll above 27%). My earlier probability may have somewhat overweighted the recent positive momentum and survey volatility, and underweighted institutional survey dampening and base-rate inertia. These insights indicate a slightly lower, but still above-even-odds, probability is warranted—acknowledging both real upside risk and likely friction. Therefore, I am revising my estimate slightly downward to 55%.",
            "revised_probability": 55
        },
        "Political Science (Party System Theory)": {
            "my_phase1_final_probability": 27,
            "reasoning_for_revised_probability": "The group deliberation reinforced some of my core assumptions (status-quo bias, ceiling effect, structural headwinds), but also made clear that several credible experts—including those in survey methodology, public opinion, and sampling error analysis—see higher upside risk due to polling volatility and the proximity of current youth intention to the 27% threshold. Critiques of my initial view (from voter segmentation and Iberian studies expertise) reasonably challenged the extent to which structural inertia should dominate my probability, highlighting real-time recalibration and the possibility of abrupt digital surges moving numbers in underpolled youth cohorts. However, I remain cautious about overestimating the probability: even the bullish forecasters stress volatility, not a systematic new trend, and direct intention is less likely to sharply spike without a catalyzing event. Several concurring analyses (from sociology and trend projection) echo the plateau and high ceiling effect, advising caution against a high forecast. Balancing these perspectives, I now see a modestly elevated risk above my initial estimate but remain below coin-flip odds. I raise my probability to 35%, reflecting both the real possibility of a polling overshoot in a volatile, close-call environment and the substantial countervailing inertia.",
            "revised_probability": 35
        },
        "Political Science (Vote Choice Models)": {
            "my_phase1_final_probability": 33,
            "reasoning_for_revised_probability": "The group deliberation introduced a notable spread, with estimates as low as 27% and as high as 66%. The most relevant arguments came from Election Polling (Survey Methodology Standards), Political Consulting, and Sociology (Generational Theory). The methodological critiques reinforced my initial caution: while sampling error and volatility can easily result in a one-off >27% figure, professional polling practices, post-stratification, and reported plateauing of youth support decrease the odds of such an event substantially. Arguments for a higher probability (62%+) hinge too strongly on volatility and underweight status quo/ceiling effects, as seen both in historical youth rightward surges and in direct voting intention polls' inertia just under thresholds. I take seriously the defense of a moderately low but non-trivial risk for a spike, as even a small nudge can breach the line, but base rates, survey methodology adjustments, and clear gender/abstention ceilings point to a slightly less than one-in-three chance. Therefore, I reaffirm my original estimate. No revision: the most balanced assessment remains at 33%.",
            "revised_probability": 33
        },
        "Sociology (Youth Political Socialization)": {
            "my_phase1_final_probability": 38,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, there are grounds for a slight revision downward. While there are credible arguments (notably from sampling error analysis and trend projection) that volatility or a random uptick could breach the 27% threshold, the consensus among more base-rate and structure-oriented fields (party system theory, generational sociology, survey methodology standards) is that inertia, survey weighting, and abstention effects create a meaningful ceiling at the current high. Critiques of higher probabilistic scenarios underscore that a single published poll not only has to register a >27% result but do so in a responsible, weighted sample—limiting the chances of a transient or noisy spike. My own expertise in youth political socialization also notes the stabilizing effects of both gender polarization and movement fatigue. The original logic of lingering a bit below even odds is thus reinforced and, if anything, a slight downward revision is warranted for conservatism given poll methodology and trend plateauing.",
            "revised_probability": 33
        },
        "Sociology (Generational Theory)": {
            "my_phase1_final_probability": 30,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, my original analysis emphasizing generational inertia, the ceiling effect, and the absence of a clear exogenous driver still stands. Most forecasters, including those using survey methodology, voter segmentation, and political science models, also argue for strong status quo bias, base rate stickiness, and the constraining effects of turnout, gender divides, and polling inertia at just below or at 27%. A few, notably in Public Opinion Analysis, attach a higher probability (62%) to the volatility tail, citing the non-trivial odds that a single polling error could briefly push Vox above the threshold. However, defenses of more conservative estimates (around 30-40%) stress the robustness of modern Spanish survey techniques against outlier publishing, the generational context, and lack of a current transformative event. The balance of evidence reinforces, rather than weakens, my initial view: while volatility and digital surges can result in a marginal spike, the most likely scenario remains at or just under the threshold. Thus, I see no compelling grounds for substantial revision at this time.",
            "revised_probability": 30
        },
        "Iberian Studies (Contemporary Spanish Politics)": {
            "my_phase1_final_probability": 66,
            "reasoning_for_revised_probability": "In Phase 1, I leaned toward a moderately strong probability (66%) that Vox would surpass the 27% direct voting intention among Spanish youth, relying on the confluence of structural rightward drift, digital mobilization, recent polling at or near the threshold, and comparative European dynamics. However, input from the group, especially the arguments from 'Election Polling (Survey Methodology Standards)', 'Political Science (Party System Theory)', and 'Election Polling (Sampling Error Analysis)', highlighted the methodological sophistication of 40dB and the tendency for direct intention plateaus to persist once reached. The critique emphasizes that while volatility and sampling error raise upside chances, robust panel controls, post-stratification, and heightened polling discipline after recent surges dampen the risk of a mere random spike. Party system effects, entrenched abstention, and the rigidity inherent at such thresholds (against a background absence of a clear new positive shock for Vox) further increase the weight on status quo or reversion-to-the-mean outcomes. Synthesizing these points, it is clear I underweighted the structural inertia and poll moderation relative to upward risk. While I still see upside risk—Vox briefly topping 27% is entirely plausible—the chance is more balanced with downside regression than I initially assessed.",
            "revised_probability": 52
        }
    },
    "revision_probability": [
        47,
        54,
        45,
        55,
        35,
        33,
        33,
        30,
        52
    ],
    "revision_mean_probability": 42.666666666666664,
    "revision_sd": 9.98749217771909,
    "revision_probability_result": 43,
    "question_details": {
        "id": 38765,
        "title": "Will Vox surpass the 27% voting intention among young people in Spain by the end of 2025?",
        "created_at": "2025-08-31T05:07:40.748062Z",
        "open_time": "2025-09-21T16:23:23Z",
        "cp_reveal_time": "2025-09-21T17:53:23Z",
        "spot_scoring_time": "2025-09-21T17:53:23Z",
        "scheduled_resolve_time": "2025-12-31T22:59:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-09-21T17:53:23Z",
        "actual_close_time": "2025-09-21T17:53:23Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "This question is synced with an identical question on Metaculus. The original question opened on 2025-02-27 13:30:00 and can be found [here](https://www.metaculus.com/questions/35263). This question will resolve to the same value as the synced question. The original question's background info at this time is below. \n\nVox is a political party founded in 2013 in Spain, classified by political scientists and media outlets as a far-right or right-wing populist party. In recent years, its support among young voters has attracted significant attention. According to [ <u>recent 40dB polls</u> ](https://ep00.epimg.net/infografias/encuestas40db/2025/02-barometro/2025_02_barometro_voto.pdf) published by El País, Vox receives 27% support among voters aged 18-24, its highest percentage across all age groups. This is notably higher than its support among older demographics, which ranges from 10-19%.\n\n This pattern of increased youth support for far-right parties [ <u>is not unique to Spain</u> ](https://elpais.com/internacional/2024-06-15/el-voto-de-los-jovenes-a-la-extrema-derecha-crece-en-los-cinco-mayores-paises-de-la-ue.html), as Marine Le Pen's RN in France and AfD in Germany have also seen an increase in youth support in recent years.\n\n`{\"format\":\"metac_closes_in_period\",\"info\":{\"post_id\":35263,\"question_id\":34747}}`",
        "resolution_criteria": "The question will be answered as **Yes** if, according to the latest 2025 survey conducted by the company 40dB., the direct voting intention for Vox among young people aged 18 to 24 is greater than 27%. It will be answered as **No** if it is 27% or less.",
        "fine_print": "• The relevant survey will probably be published by [ <u>El País</u> ](https://elpais.com/noticias/barometro-el-pais/).\n\n • Voting intention refers specifically to the 18-24 age group and to direct voting intention data, as presented in the 40dB survey. You can consult [ <u>this example</u> ](https://ep00.epimg.net/infografias/encuestas40db/2025/02-barometro/2025_02_barometro_voto.pdf). If that range is not available, another nearby range will be used to represent the youth vote.\n\n • If the last 2025 40dB survey is published before October 1, 2025, this question will be **void**.",
        "post_id": 39388,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Rafael López, sociologist: 'The far‑right excels at swapping truth for virality'**\nThe program \"laSexta Xplica\" examined the rise of the far‑right in Spain. It highlighted that Vox voters cite immigration (47 %) and government/parties (47 %) as main concerns, while left‑wing voters point to housing, employment quality and political conduct. Sociologist Rafael López, who appeared on the show, explained that the situation is complex, noting that \"the first party for young people is abstention, not Vox\" and that the far‑right simplifies the problem. He warned that the far‑right \"works very well by swapping veracity for virality\" and that its goal is not only to radicalise some voters but also to demobilise large working‑class segments. López added that the movement seeks to disconnect people from the past and undermine critical thinking in schools. The program’s discussion was framed by these quotes: 'Para empezar tenemos que decir que la situación es compleja', 'La extrema derecha trabaja muy bien el cambiar la veracidad por la viralidad', and 'Cuando ves que los jóvenes son el único sector de la población que no ha recuperado cierto poder adquisitivo'.\nOriginal language: es\nPublish date: September 21, 2025 11:58 AM\nSource:[Mundo Deportivo](https://www.mundodeportivo.com/actualidad/20250921/1002536161/rafael-lopez-sociologo-extrema-derecha-trabaja-cambiar-veracidad-vitalidad-importante-conocer-verdad-inundar-zona-cree-sensacion-verdad-expt-dct.html)\n\n**Youth Drive a 'Revolution' on Social Media but Vote the Least**\nThe article reports that in the 2023 general elections in the country, the electoral roll counted 4,782,940 voters, of whom 31% (1,489,501) were aged 18‑29, 57% were aged 30‑64, and 12% were 65 or older.  The 18‑29 age group had the lowest turnout, with only 56.4% voting; 839,926 of the 1,489,501 eligible young voters cast ballots.  In comparison, turnout was 68% among 30‑64 year olds and 58.2% among those 65 and older.  The age group with the highest participation was 60‑64 year olds (73%).  The article notes that 45% of voters aged 18‑24 did not vote and 41% of those aged 25‑29 abstained.  It also highlights a gradual increase in youth turnout over the past decade: 54.98% in 2023, 52.22% in 2021 municipal elections, 47.64% in 2018 general elections, and 45.97% in 2015 municipal elections.  Despite the law of automatic registration and the removal of ‘blank lists’, the youth remain the most apathetic segment at the polls, even though they are very active on social media.  The article quotes that \"Los jóvenes encabezan las cifras de abstencionismo al no acudir a sufragar y dar pie a que se impulsen leyes de 'muerte civil' a no votantes.\"\nOriginal language: es\nPublish date: September 21, 2025 04:54 AM\nSource:[ABC Digital](https://www.abc.com.py/politica/2025/09/21/jovenes-arman-una-revolucion-en-redes-pero-son-los-que-menos-votan/)\n\n**Vox Surpasses PP**\nAccording to all polls, the Partido Popular (PP) is stagnating in vote intention while Vox continues to grow, the article states. The author expresses a preference for the \"nazi, racist, negationist, machista, inhumana, codiciosa y parasitaria\" right over the \"derechita cobarde\" that Santiago Abascal claims, arguing that Vox is the original and PP the copy. The piece claims Vox is not a splinter of PP but its \"célula madre\", and that the citizen prefers the original over the copy. It also notes that Vox could surpass PP in upcoming elections, stating \"Quedan un par de años para las elecciones y no es descartable una mayoría de PP y Vox, pero no como la habíamos imaginado, sino con otra correlación de fuerzas.\"\nOriginal language: es\nPublish date: September 21, 2025 04:12 AM\nSource:[Público.es](https://www.publico.es/opinion/columnas/vox-sorpassa-pp.html)\n\n**Hungary’s Youth Voice Anger Against Viktor Orban’s Party**\nThe article reports that in Hungary, youth are expressing anger through festivals and concerts, criticizing Viktor Orban’s 16‑year rule. 24‑year‑old student Armin says 'Tout est de plus en plus cher, il y a une énorme inflation…', and that the government is pro‑Russian and hostile to LGBT+ people.  The pop singer Majka satirises the regime in her hit ‘Bindjistan’, with the refrain ‘Je survis à tout, car les lois sont écrites pour moi’.  At a concert in Szeged, the chant ‘Salaud de Fidesz !’ was repeated by hundreds of young attendees.  Political scientist Matyas Bodi notes that while far‑right parties like Le Pen, the AfD and Vox are popular among young people in other European countries, Orban’s Fidesz is in power and presents itself as anti‑establishment.  A September 2025 survey by the Institut Median found 37 % of voters would choose the opposition Tisza party, 30 % would choose Fidesz, and among voters under 30 only 15 % would vote for Fidesz while 56 % would vote for Tisza.  Youth such as stylist Kata are actively supporting Tisza, saying ‘C’est notre dernière chance…’ and describing the current regime as ‘toxique’.  The article warns that without a radical change by 2026, Hungary could become ‘une sorte de Biélorussie’.\nOriginal language: fr\nPublish date: September 20, 2025 01:57 PM\nSource:[rts.ch](https://www.rts.ch/info/monde/2025/article/hongrie-la-jeunesse-crie-sa-colere-contre-le-parti-d-orban-dans-les-festivals-28999760.html)\n\n**Young People Are No Longer More Left‑Wing Than Their Parents**\nSpain’s government is moving forward with a proposal to lower the minimum voting age from 18 to 16, following a similar change in the United Kingdom aimed at boosting democratic participation.  The article draws on a series of CIS barometers from 1986 to 2025 to chart how 18‑to‑24‑year‑olds’ self‑perceived ideology has shifted.  In 2015, 8 % of this age group identified as right‑wing, rising sharply to 34 % in 2025, while left‑wing identification fell from 40 % to 31 %.  The centre, defined as those rating their ideology between 4 and 6, has contracted across all ages, with the youngest cohort moving toward right‑leaning options.  Catalonia mirrors the national trend; the 18‑24 bracket moved from the lowest to the second‑highest average ideological score.  Electoral intentions reflect these shifts: Vox is the most supported party among 18‑24‑year‑olds, with 21.4 % direct voting intention, and in Catalonia a three‑way tie between PSC, ERC and Vox at roughly 13 % each.  Gender differences are evident—young men are more right‑leaning and show less interest in feminism, whereas young women lean left and express greater feminist engagement.  A European study cited in the piece notes that men aged 16‑29 vote more for the far‑right, a trend that has widened in recent years and could significantly impact European societies.  The article presents these findings in a data‑driven, neutral tone, highlighting the evolving political landscape among Spain’s youth.\nOriginal language: es\nPublish date: September 20, 2025 06:01 AM\nSource:[El Periódico](https://www.elperiodico.com/es/sociedad/20250920/jovenes-son-izquierdas-padres-121712229)\n\n**Rafael López, sociologist: 'The far‑right excels at swapping truth for virality'**\nThe program \"laSexta Xplica\" examined the rise of the far‑right in Spain. It highlighted that Vox voters cite immigration (47 %) and government/parties (47 %) as main concerns, while left‑wing voters point to housing, employment quality and political conduct. Sociologist Rafael López, who appeared on the show, explained that the situation is complex, noting that \"the first party for young people is abstention, not Vox\" and that the far‑right simplifies the problem. He warned that the far‑right \"works very well by swapping veracity for virality\" and that its goal is not only to radicalise some voters but also to demobilise large working‑class segments. López added that the movement seeks to disconnect people from the past and undermine critical thinking in schools. The program’s discussion was framed by these quotes: 'Para empezar tenemos que decir que la situación es compleja', 'La extrema derecha trabaja muy bien el cambiar la veracidad por la viralidad', and 'Cuando ves que los jóvenes son el único sector de la población que no ha recuperado cierto poder adquisitivo'.\nOriginal language: es\nPublish date: September 21, 2025 11:58 AM\nSource:[Mundo Deportivo](https://www.mundodeportivo.com/actualidad/20250921/1002536161/rafael-lopez-sociologo-extrema-derecha-trabaja-cambiar-veracidad-vitalidad-importante-conocer-verdad-inundar-zona-cree-sensacion-verdad-expt-dct.html)\n\n**PSC Falls and Junts, ERC, Alianza Compete for Second Place According to La Vanguardia**\nA poll conducted by Ipsos from 11‑17 September and published by La Vanguardia shows a highly fragmented Catalan political landscape. The PSC remains the most voted party but would lose six seats, dropping from 42 to 36. Junts would suffer a larger fall, losing 14 seats and falling from 35 to 21. Alianza Catalana would surge, gaining 17 seats (from 2 to 19) with 11.9% of the vote, while Vox would increase its representation from 11 to 16 seats with 12.1% of the vote, surpassing the PP. ERC would obtain 14.7% of the vote and 21 seats; Comuns would get 4.9% and 5 seats. The poll indicates that the PSC could win the election with 25.1% of the vote but would be unable to form a majority with ERC and Comuns. The article warns that the rise of far‑right forces threatens an ungovernable Catalonia if current trends continue. Key issues for voters are politics (18%), housing (18%) and immigration (16%). Immigration support for Alianza and Vox has quadrupled, rising from 4% to 16% in one year. Fifty percent of respondents believe Catalonia is on the wrong path, while only 26% think it is going well. Interviews quoted in the article include Barcelona mayor Jaume Collboni, who said 'Los presupuestos del 2026 y 2027 congelarán impuestos a familias y pymes', and Junts secretary Jordi Turull, who declared 'el seguidismo de Illa con respecto a Madrid empobrece a Catalunya'. A separate housing survey cited in the paper found that 79% of Spanish respondents demand a housing pact, with 79% calling for the unlocking of the land‑use law to build more apartments.\nOriginal language: es\nPublish date: September 21, 2025 07:06 AM\nSource:[ElNacional.cat](https://www.elnacional.cat/es/politica/portadas-psc-retrocede-junts-erc-alianca-se-disputan-segunda-posicion-segun-va_1488023_102.html)\n\n**AfD Leads New Opinion Polls, Surpassing the CDU**\nThe right‑wing populist party 'البديل من أجل ألمانيا' (AfD) topped a new opinion poll conducted by the Insa Institute on behalf of the German newspaper 'بيلد', with 26% support—an increase of one percentage point from the previous week and the highest share ever recorded by Insa. The Christian Democratic Union (CDU) coalition remained steady at 25%. A separate poll by the YouGov Institute also showed AfD surpassing the CDU for the first time. Other parties performed as follows: the Social Democratic Party (SPD) received 15% support, up one point; the Greens (الخضر) fell to 11%, matching the Left (اليسار); the Saarland Alliance (تحالف سارا فاجنكنشت) garnered 4%; and the Free Democratic Party (الديمقراطي الحر) obtained 3%, both below the 5% threshold for parliamentary entry. The survey covered 1,200 eligible voters in Germany between 15 and 19 September 2025.\nOriginal language: ar\nPublish date: September 21, 2025 05:32 AM\nSource:[جريدة الشروق](https://www.shorouknews.com/news/view.aspx?cdate=21092025&id=9f05cd56-d718-4bca-bb65-b6214d2bcb63)\n\n**Youth Drive a 'Revolution' on Social Media but Vote the Least**\nThe article reports that in the 2023 general elections in the country, the electoral roll counted 4,782,940 voters, of whom 31% (1,489,501) were aged 18‑29, 57% were aged 30‑64, and 12% were 65 or older.  The 18‑29 age group had the lowest turnout, with only 56.4% voting; 839,926 of the 1,489,501 eligible young voters cast ballots.  In comparison, turnout was 68% among 30‑64 year olds and 58.2% among those 65 and older.  The age group with the highest participation was 60‑64 year olds (73%).  The article notes that 45% of voters aged 18‑24 did not vote and 41% of those aged 25‑29 abstained.  It also highlights a gradual increase in youth turnout over the past decade: 54.98% in 2023, 52.22% in 2021 municipal elections, 47.64% in 2018 general elections, and 45.97% in 2015 municipal elections.  Despite the law of automatic registration and the removal of ‘blank lists’, the youth remain the most apathetic segment at the polls, even though they are very active on social media.  The article quotes that \"Los jóvenes encabezan las cifras de abstencionismo al no acudir a sufragar y dar pie a que se impulsen leyes de 'muerte civil' a no votantes.\"\nOriginal language: es\nPublish date: September 21, 2025 04:54 AM\nSource:[ABC Digital](https://www.abc.com.py/politica/2025/09/21/jovenes-arman-una-revolucion-en-redes-pero-son-los-que-menos-votan/)\n\n**Vox Surpasses PP**\nAccording to all polls, the Partido Popular (PP) is stagnating in vote intention while Vox continues to grow, the article states. The author expresses a preference for the \"nazi, racist, negationist, machista, inhumana, codiciosa y parasitaria\" right over the \"derechita cobarde\" that Santiago Abascal claims, arguing that Vox is the original and PP the copy. The piece claims Vox is not a splinter of PP but its \"célula madre\", and that the citizen prefers the original over the copy. It also notes that Vox could surpass PP in upcoming elections, stating \"Quedan un par de años para las elecciones y no es descartable una mayoría de PP y Vox, pero no como la habíamos imaginado, sino con otra correlación de fuerzas.\"\nOriginal language: es\nPublish date: September 21, 2025 04:12 AM\nSource:[Público.es](https://www.publico.es/opinion/columnas/vox-sorpassa-pp.html)\n\n**Alert in Spanish Right Over Populism Expanding from the US After Kirk's Murder**\nEl Periódico reports that the FAES campus in Madrid highlighted the rise of right‑wing populism in Spain, focusing on Vox leader Santiago Abascal. The article notes that Vox is approaching 20 % of the vote and could double its seats to more than 60 in the next election. It describes how Abascal, a former PP youth leader, has become a key figure in the Spanish right and is now aligned with international populist leaders such as Donald Trump, Marine Le Pen, Giorgia Meloni, Viktor Orbán, and Javier Milei. The piece also recounts how former Spanish prime minister José María Aznar and Galician PP leader Alberto Núñez Feijóo criticized Pedro Sánchez, while Feijóo’s migration policy remains a priority. The article cites the murder of American conservative activist Charlie Kirk as a shock that has intensified the alarm in the European right. It quotes Aznar saying that 'the United States is expanding populism' and that Europe faces a 'catastrophe' that fuels right‑wing parties. The article concludes that Vox is now the most powerful right‑wing force in Spain, with 20 % of the vote and more than 60 seats, while the PP lags behind.\nOriginal language: es\nPublish date: September 21, 2025 04:00 AM\nSource:[El Periódico](https://www.elperiodico.com/es/politica/20250921/alerta-derecha-espanola-populismo-expande-121773934)\n\n**Hungary’s Youth Voice Anger Against Viktor Orban’s Party**\nThe article reports that in Hungary, youth are expressing anger through festivals and concerts, criticizing Viktor Orban’s 16‑year rule. 24‑year‑old student Armin says 'Tout est de plus en plus cher, il y a une énorme inflation…', and that the government is pro‑Russian and hostile to LGBT+ people.  The pop singer Majka satirises the regime in her hit ‘Bindjistan’, with the refrain ‘Je survis à tout, car les lois sont écrites pour moi’.  At a concert in Szeged, the chant ‘Salaud de Fidesz !’ was repeated by hundreds of young attendees.  Political scientist Matyas Bodi notes that while far‑right parties like Le Pen, the AfD and Vox are popular among young people in other European countries, Orban’s Fidesz is in power and presents itself as anti‑establishment.  A September 2025 survey by the Institut Median found 37 % of voters would choose the opposition Tisza party, 30 % would choose Fidesz, and among voters under 30 only 15 % would vote for Fidesz while 56 % would vote for Tisza.  Youth such as stylist Kata are actively supporting Tisza, saying ‘C’est notre dernière chance…’ and describing the current regime as ‘toxique’.  The article warns that without a radical change by 2026, Hungary could become ‘une sorte de Biélorussie’.\nOriginal language: fr\nPublish date: September 20, 2025 01:57 PM\nSource:[rts.ch](https://www.rts.ch/info/monde/2025/article/hongrie-la-jeunesse-crie-sa-colere-contre-le-parti-d-orban-dans-les-festivals-28999760.html)\n\n**Young People Are No Longer More Left‑Wing Than Their Parents**\nSpain’s government is moving forward with a proposal to lower the minimum voting age from 18 to 16, following a similar change in the United Kingdom aimed at boosting democratic participation.  The article draws on a series of CIS barometers from 1986 to 2025 to chart how 18‑to‑24‑year‑olds’ self‑perceived ideology has shifted.  In 2015, 8 % of this age group identified as right‑wing, rising sharply to 34 % in 2025, while left‑wing identification fell from 40 % to 31 %.  The centre, defined as those rating their ideology between 4 and 6, has contracted across all ages, with the youngest cohort moving toward right‑leaning options.  Catalonia mirrors the national trend; the 18‑24 bracket moved from the lowest to the second‑highest average ideological score.  Electoral intentions reflect these shifts: Vox is the most supported party among 18‑24‑year‑olds, with 21.4 % direct voting intention, and in Catalonia a three‑way tie between PSC, ERC and Vox at roughly 13 % each.  Gender differences are evident—young men are more right‑leaning and show less interest in feminism, whereas young women lean left and express greater feminist engagement.  A European study cited in the piece notes that men aged 16‑29 vote more for the far‑right, a trend that has widened in recent years and could significantly impact European societies.  The article presents these findings in a data‑driven, neutral tone, highlighting the evolving political landscape among Spain’s youth.\nOriginal language: es\nPublish date: September 20, 2025 06:01 AM\nSource:[El Periódico](https://www.elperiodico.com/es/sociedad/20250920/jovenes-son-izquierdas-padres-121712229)\n\n**Poll: 91% of French Support Banning Rioters from Demonstrations**\nA CSA poll conducted for Europe 1, CNews and the Journal du Dimanche found that 91 % of French respondents support banning \"casseurs\" (rioters) from demonstrations, 8 % oppose the idea and 1 % remain undecided. The support is high across demographic groups: 89 % of men and 92 % of women are in favour; CSP+ 90 %, CSP‑ 91 % and inactive 90 % also show strong backing. Age‑group data reveal that, except for the 25‑34 bracket (80 %), all other age ranges are above 90 % in favour, with 18‑24, 50‑64 and 65 + at 93 % each and 35‑49 at 90 %. Politically, the majority of left‑wing voters (81 %) favour the ban, while the far‑right parties show even higher support: Renaissance 97 %, LR 93 % and RN 96 %. Within left factions, the Socialist Party is at 89 %, LFI 72 % and the Greens 71 %. The article cites a recent incident on 18 September, when 309 people were detained and 134 were placed in custody during protests. The piece presents the poll data factually without editorial commentary, making the reporting voice objective and the provocative level low.\nOriginal language: fr\nPublish date: September 20, 2025 04:07 AM\nSource:[Europe 1](https://www.europe1.fr/societe/sondage-91-des-francais-pensent-quil-faut-interdire-aux-casseurs-de-participer-aux-manifestations-773316)\n\n**Why Women Over 60 Don’t Vote for Vox: 'When I See Men Talking About Traditional Values, My Hair Rises'**\nThe article reports that women aged 60 and older are the strongest demographic opposition to the rise of the far‑right party Vox in Spain. According to recent surveys by CIS and 40db for Cadena SER and El País, the voting intention for Vox among women 60+ is only 8.3%. The article notes that Vox’s support drops sharply after age 44 and continues to decline with increasing age. It features quotes from prominent women: director Isabel Coixet says, 'Tengo 65 años, y he visto muchas cosas… Cuando veo a estos señores de ultraderecha hablando de valores tradicionales se me ponen los pelos de punta… Me da la risa', and former university rector Josefina Gómez Mendoza says, 'Yo nací en los años 40, los más duros de la dictadura… Si en los años y las elecciones que me quedan se me ocurre votar a la extrema derecha es que habría perdido la cabeza'. The piece concludes that this demographic is largely lost for the far‑right, contrasting with countries like France where the party’s message is more feminist.\nOriginal language: es\nPublish date: September 18, 2025 07:09 PM\nSource:[Cadena SER](https://cadenaser.com/nacional/2025/09/18/por-que-las-mujeres-mayores-de-60-anos-no-votan-a-vox-cuando-veo-a-senores-hablando-de-valores-tradicionales-se-me-ponen-los-pelos-de-punta-cadena-ser/)\n\n**Spanish Voters Condemn Uncontrolled Immigration, Debt Forgiveness, and Slightly Support Sanctions on Israel**\nA DYM poll released for 20 Minutos shows the Partido Popular (PP) at 35.2 % of the vote, translating to 150–154 seats, comfortably ahead of the Spanish Socialist Workers’ Party (PSOE) at 26.9 % (109–113 seats). The poll indicates that the PP’s majority‑right coalition remains stable and that the party’s prospects of governing without Vox are not currently threatened. The survey also highlights Spanish public opinion on several policy issues, including a strong condemnation of uncontrolled immigration, support for debt forgiveness, and only modest backing for sanctions against Israel. These findings suggest that while the PP dominates the current political landscape, its stance on key international and economic matters continues to shape voter preferences.\nOriginal language: es\nPublish date: September 18, 2025 04:54 PM\nSource:[elliberal.cat](https://www.elliberal.cat/2025/09/18/los-espanoles-condenan-la-inmigracion-descontrolada-la-condonacion-de-deuda-y-apoyan-muy-levemente-las-sanciones-a-israel/)\n\n**Vox Captures Youth: Tradition, Rebellion, and Social Media Make the Difference**\nThe article reports that Vox has become the preferred political option among Spanish youth, surpassing PSOE and PP in direct voting intention for voters under 35. According to the latest 40dB barometer, Vox has a 17.4% national vote estimate, but its real strength lies in the 18‑34 age group where it is the second‑largest force and, in some segments, close to the top. The piece attributes Vox’s appeal to a blend of traditional values, anti‑progressive rhetoric, and a highly targeted digital strategy that uses short videos, memes, and viral content on TikTok, Instagram and YouTube. It notes that Vox’s messaging focuses on employment, affordable housing and public safety—issues that resonate with young people facing precarious jobs and high rents. The article quotes the party’s slogan: 'Con VOX, España tendrá un futuro próspero y asegurado', and highlights the party’s use of international far‑right figures to reinforce a sense of global solidarity. The data cited include the 17.4% national estimate, the rise of Vox in the 18‑34 segment, and the loss of five points by PSOE among 18‑24 year‑olds in a year. The tone is largely factual, presenting statistics and party statements, though it frames Vox’s rise as a challenge to the ‘old politics’ and portrays the party in a positive light for its youth‑oriented strategy.\nOriginal language: es\nPublish date: September 15, 2025 10:09 PM\nSource:[Periodista digital](https://www.periodistadigital.com/politica/20250916/vox-conquista-juventud-tradicion-rebeldia-redes-sociales-marcan-diferencia-noticia-689405132457/)\n\n**Who Are the Catalan Ultras?**\nThe article examines the electoral base of the two right‑wing parties that have recently risen in Catalonia—Vox and Aliança Catalana—by analysing demographic and polling data. It notes that Vox’s support is strongest among young men aged 18‑34, where the party’s intention to vote reaches 15%, and even higher, 17%, among those aged 18‑24, outpacing the CUP, PSC and ERC by five percentage points. In the same age group, the ultra‑nationalist party led by Silvia Orriols records more than 11% intention, compared with an average of about 5% for all parties. The article cites that in 2024, roughly one in ten former Junts voters and one in fifteen former PP voters would now back Aliança, a shift that could push Orriols’ party over 250,000 ballots. It also highlights that Vox’s share of the vote among men under 35 is the highest among all parties, and that immigration is a key driver of ultra‑right voting, with many voters prioritising anti‑immigration concerns over their Catalan or Spanish identity. The piece uses phrases such as 'extrema derecha xenófoba' and discusses how the generational shift in Catalonia may favour authoritarian‑leaning offers. The analysis is data‑driven but carries a political slant, focusing on the rise of right‑wing forces.\nOriginal language: es\nPublish date: September 14, 2025 04:12 AM\nSource:[LaVanguardia](https://www.lavanguardia.com/politica/20250914/11010584/quienes-son-ultras-catalanes.html)\n\n**Vox Celebrates Festival Without Milei, Riding Rising Poll Numbers**\nVox is celebrating its annual political festival in Madrid this weekend, even though Argentine libertarian leader Javier Milei will not attend because he has cancelled his trip amid a political crisis at home. The party’s popularity has surged: recent polls show Vox exceeding 17 % of the vote and potentially reaching 20 % in future surveys, a level that could make it a decisive force in the next Spanish legislature. The article notes that more than one million former Partido Popular (PP) voters have switched to Vox in the last year, and that Vox is the most preferred party among 18‑ to 24‑year‑olds, surpassing Podemos in that age group. It also highlights that Vox’s support is strongest among younger voters, while older voters (65 +) still favor the PP. In presidential preference polls, Vox’s leader Santiago Abascal leads Pedro Sánchez among 18‑ to 30‑year‑olds and outpaces Alberto Núñez Feijóo among 18‑ to 40‑year‑olds, but Feijóo remains ahead of Abascal among those over 65. The article cites the latest CIS barometer, which reports that the majority of 18‑ to 45‑year‑olds answer ‘none’ when asked who they prefer as president. It also discusses how the PP is attempting to copy Vox’s messaging, while the PSOE is portrayed as a ‘refuge party’ for left‑wing voters. The piece points out that Vox’s social‑media presence on Tik‑Tok and Instagram is the strongest among young people, and that the party’s alliances with Viktor Orbán and Marine Le Pen are seen as strategic. Finally, the article explains that Milei’s absence is due to his loss in the Buenos Aires provincial elections, where he was defeated by a margin of more than thirteen points, and that his sister Karina is embroiled in a corruption scandal. The overall tone is analytical but carries a clear political bias in favor of Vox’s rise.\nOriginal language: es\nPublish date: September 13, 2025 04:28 AM\nSource:[LaVanguardia](https://www.lavanguardia.com/politica/20250913/11055890/vox-milei.html)\n\n**European Youth Shift Toward Left and Right Populism Amid Traditional Party Disillusionment**\nEuropean youth in France, Germany and Spain are increasingly turning to left‑ and right‑wing populist parties because traditional parties have failed to address their economic and social concerns.  In France, Marine Le Pen and Jean‑Luc Mélenchon have gained traction among young voters who face precarious jobs and unaffordable housing, as illustrated by Lucie, a secondary‑school teacher in Tours, who says, 'A mi edad, mis padres ya tenían casa. Yo apenas puedo ahorrar'.  In Germany, 27 % of voters aged 18‑24 supported Die Linke and 22 % backed the far‑right AfD, reflecting a sentiment that 'La política es hecha por viejos y para viejos, no para jóvenes', according to Alexandria, a university student in Munich.  Spain’s youth unemployment exceeds 26 %, and only 15 % of people under 30 live independently, a situation highlighted by sociologist Jorge Galindo who warned that the country’s ‘burbuja inmobiliaria’ leaves young people traumatized.  These statistics and quotes show a growing disillusionment with mainstream politics and a shift toward populist alternatives that promise immediate solutions and a return to a perceived ‘old world’ order.\nOriginal language: es\nPublish date: September 11, 2025 11:37 AM\nSource:[El Financiero](https://www.elfinanciero.com.mx/mundo/2025/09/11/jovenes-europeos-voltean-hacia-el-populismo-de-izquierda-y-derecha-ante-la-falta-de-respuestas-de-politicos-tradicionales/)\n\n**Vox Achieves Best Result Since General Elections, Leaving the People's Party in Worst Position**\nA recent online poll of 2,000 respondents conducted between 29 August and 1 September shows that the far‑right party Vox has achieved its best performance since the last general election, reaching 17.4 % of the vote – a gain of about two percentage points from the 23‑J poll.  The People's Party (PP) has fallen to 32.2 %, a decline of 2.6 percentage points from the July survey and 2.4 points below its 2023 election result.  Vox’s rise has come at the expense of the PP, which now loses 4.5 % of its electorate to Vox, up from 13.2 % in the previous poll.  The Socialists (PSOE) have slipped to 28.6 %, a drop of 7 percentage points, while the new party Sumar has gained 6.6 % and Podemos 3.4 %.  The survey also reports that Vox retains 86.7 % of its voters, the PP 71.2 %, and the PSOE 64.2 %.  The article notes that the PP’s decline is linked to the political backlash over the handling of forest fires in Castilla‑La Mancha, Galicia and Extremadura, all governed by the PP, and that the PSOE’s recent scandal involving former secretary of organization Santos Cerdán has helped it recover some support.  In terms of age and gender, Vox is strongest among men (22.3 %) and the 18‑24 age group (20.9 %), while the PSOE leads among women (21.5 %) and the 25‑34 age bracket (15.2 %).  The poll’s findings suggest that the right‑wing bloc (PP + Vox) now holds 48.1 % of the estimated vote, 10.4 percentage points ahead of the left‑wing bloc (PSOE + Sumar + Podemos).  The article quotes the poll’s methodology and highlights that Vox’s performance is the highest since the 2023 general election, where it had 13.2 % of the vote.\nOriginal language: es\nPublish date: September 09, 2025 06:05 AM\nSource:[Diario EL PAIS Uruguay](https://www.elpais.com.uy/mundo/espana/vox-alcanza-su-mejor-resultado-desde-las-elecciones-generales-y-deja-al-partido-popular-en-su-peor-registro)\n\n**Vox's Rise Pushes PP to Its Worst Result Since General Elections**\nAccording to the 40dB poll for Cadena SER and El País, if elections were held today, the far‑right Vox would receive 17.4% of the vote, its best result in the survey’s history. The PP remains the largest party but has slipped to 30.7% from 33.3% in July, a 2.6‑point drop. The PSOE sits at 27.7%, down from 29.8% after the Cerdán corruption scandal, while Sumar rises to 6.6% from 6.2% and Podemos falls to 3.4% from 3.8%. Vox’s gain of 2.2 points is the largest swing, and the poll shows that 17.7% of voters who chose PP in 2023 would now back Vox, compared with only 13% in the previous survey. Regionally, Vox leads in Andalucía (20.5%) and Valencia (20.7%), while the PSOE is strongest in Castilla y León (21.5%) and Galicia (22.4%). \"El barómetro de 40dB. para la Cadena SER y 'El País' revela que si hoy se celebrasen elecciones, la ultraderecha obtendría un 17,4% de los votos\".\nOriginal language: es\nPublish date: September 08, 2025 05:28 AM\nSource:[Cadena SER](https://cadenaser.com/nacional/2025/09/08/el-ascenso-de-vox-coloca-al-pp-en-su-peor-resultado-desde-las-elecciones-generales-cadena-ser/)\n\n**The 16‑Year‑Old Vote Favors EH Bildu and Vox | El Diario Vasco**\nEl Diario Vasco reports that lowering the voting age to 16 in the Basque Country would add roughly 40,000 new voters, a figure that experts say would largely benefit EH Bildu and Vox.  According to the CIS, in the last Basque elections EH Bildu would capture nearly 30 % of voters under 24, compared with 26 % for the PNV.  Nationally, recent 40db polls place Vox as the leading force among young voters, with the PP attracting older voters and the PSOE leading the progressive young vote.  María Silvestre notes that the Basque electorate would see EH Bildu as the most benefited party, the PSE‑EE a slight boost, and the PNV hurt.  Ainara Villaño adds that the demographic imbalance (37 % of voters aged 45‑64, <13 % under 29) would be partially corrected.  The experts conclude that the right age of 16 is cognitively sufficient for political decisions, citing UNICEF evidence and examples from Germany, Brazil, Austria, Argentina, Belgium, Scotland, Wales and Malta.  They stress that the debate should focus on civic participation rather than maturity.  \"el derecho a voto no tiene que ver con nuestras capacidades sino con el ejercicio pleno de la ciudadanía,\" says Martínez.  \"El derecho a voto no debería moverse por tanto en términos de madurez intelectual sino de invitación a la participación cívica,\" adds Silvestre.\nOriginal language: es\nPublish date: August 23, 2025 10:01 PM\nSource:[El Diario Vasco](https://www.diariovasco.com/politica/voto-jovenes-decanta-bildu-vox-20250824131023-nt.html)\n\n**The Lost Generation of Democracy: Spain's Rise of the Far-Right**\nSpain is joining the list of countries where young people are fueling the rise of the far-right and authoritarian ultraderecha. A decade ago, one in three young people expressed their intention to vote for the left, while only one in four thought they would vote for the right. However, in recent surveys, the correlation has been reversed: four in ten young people between 18 and 24 years old support the right (and two-thirds of them support the ultraderecha), while only two in ten choose left-wing options. This age group now accounts for over three million voters out of a total of 37 million. The most significant aspect of this ideological shift is the rapid and unprecedented growth of the ultraderecha among young people. In the CIS survey of May, the conservative space was divided equally between the Partido Popular (20%) and the ultraderecha of Vox and Alvise (22%) among those under 24. A similar correlation occurred in the 25-34 age group (a contingent that accounts for another five million voters). However, this pattern is maintained, intensified, in the CIS survey of July: the ultraderecha has a 13-point lead over the PP in the 18-24 age group, and more than six points in the next age group (25-34 years). The mutation of the ideological youth in Spain has no precedents. With the country just out of the dictatorship, young people leaned clearly to the left (and their location on the ideological scale reflected this, as they now sit one point to the right). Even in the early 90s, the percentage of young people under 35 who supported the PSOE or more left-wing forces doubled or even tripled the rate of adhesions to the right. The data from last May provides clues about the causes of this change. If the declared voting intention is segregated by sex, the result is very eloquent: among men aged 18-24, Vox outperforms the PP by almost eleven points (and seven in the 25-34 age group). However, among young women, it is the Partido Popular that outperforms the ultras: by 12 points in the 18-24 age group, and seven in the 25-34 age group. In short, the ultraderechization of young men has something of an egoistic rebellion against the advance of gender parity. Nevertheless, Spain is not an exceptional case. Other Western countries are experiencing a sustained rise in extreme right-wing parties with the decisive support of new generations. The recent Polish presidential elections are a good example: the ultra-candidate clearly won among those under 40 (and with a greater advantage among men). And something similar occurred in the German legislative elections, although here the young people radicalized towards the two extremes (AfD, to the right, and Die Linke, to the left). Of course, there are exceptions. In the Canadian legislative elections, the Liberal Party (center-left) won over the Conservative Party (close to Trump) thanks to the vote of those under 35 (and especially women). In contrast, the age group between 35 and 54 leaned towards the conservatives. However, unlike what happens not only on the other side of the Atlantic, in the Spanish case, the low level of education still does not play decisively in favor of the ultraderecha, which is residual among those who barely went to school (46% of them vote for the PSOE). And although Vox is also marginal among the working class, it is starting to have presence among the poorest.\nOriginal language: es\nPublish date: July 13, 2025 04:04 AM\nSource:[LaVanguardia](https://www.lavanguardia.com/politica/20250713/10808553/generacion-perdida-democracia.html)\n\n**VOX's Quest for a Broad Appeal: Can the Party Win Over Older Voters?**\nVOX, a far-right party in Spain, is gaining popularity among young people, but it still needs to win over older voters to be a determining force in the next election. According to the author, VOX needs to pass the 40-deputy threshold to be significant. To achieve this, the party needs to refine its message, avoid being too confrontational, and present a more optimistic and attractive image. The author notes that a third of Spaniards between 18 and 24 years old are disenchanted with politics and plan to abstain from voting, while another third intend to support VOX. The party's leader, Santiago Abascal, has expressed pride in VOX's growth among young people, but the author argues that the party should also focus on winning over older voters, who make up a significant portion of the population. As Spain faces a demographic winter, with over a third of the population over 65, VOX needs to appeal to a broader range of voters to be a major player in the next election. 'It is ilusionante that te respalden en masa los chavales, pero viendo los datos y pensando en lo que se avecina, si yo fuera Abascal estaría a estas horas estrujando el cerebro para afinar el mensaje y lograr que los viejos también apoyen a VOX', the author writes, quoting themselves. 'It is essential that the party's message is not just appealing to young people, but also to older voters, who are a crucial part of the population', they add.\nOriginal language: es\nPublish date: July 09, 2025 01:00 PM\nSource:[Periodista digital](https://www.periodistadigital.com/politica/opinion/columnistas/20250709/alfonso-rojo-chavales-espanoles-pasan-regimen-sanchista-sintonizan-dia-vox-video-689405109902/)\n\n",
    "date": "2025-09-22T01:16:04.616818",
    "summary": "Experts assessing whether Vox will surpass 27% voting intention among Spanish youth (18-24) by the end of 2025 largely agree on the key dynamics: Vox recently hit 27%—a historic high—according to 40dB polls. Major drivers for a potential further rise include a strong rightward shift among young men, youth economic discontent, Vox’s agile digital/social media outreach, and a European trend of rising far-right youth support. However, limiting factors are also substantial: very high youth abstention rates, a persistent gender gap (young women remain much less supportive), the potential for polling volatility or sampling noise, ceiling effects after sharp surges, and possible fragmentation from other far-right or protest parties. Several experts highlight that fleeting spikes over the threshold could occur due to social or political shocks, survey error, or viral moments, but also note that sustained further growth is historically rare without major new events. Final probabilities from the panel range from 27% to 66% for a Yes outcome, with most forecasts clustering between 30% and 43%, but two outliers at 62% and 66% citing momentum, volatility, and international context. The modal view is that a Yes outcome is plausible—especially given volatility and the minimal gap to the threshold—but not more likely than not, with the base case favoring either stasis at 27% or a modest regression below it in late 2025 polling unless a significant shock occurs.",
    "forecasters": [
        "Election Polling (Survey Methodology Standards)",
        "Election Polling (Sampling Error Analysis)",
        "Political Consulting (Voter Segmentation Strategies)",
        "Public Opinion Analysis (Trend Projection Techniques)",
        "Political Science (Party System Theory)",
        "Political Science (Vote Choice Models)",
        "Sociology (Youth Political Socialization)",
        "Sociology (Generational Theory)",
        "Iberian Studies (Contemporary Spanish Politics)"
    ]
}