{
    "deliberation_results": {
        "Nonprofit Administration (IRSForm990StaffingStandards)": {
            "time_to_resolution": "Approximately 3 months, as the question concerns staff count at the end of 2025 and today's date is September 26, 2025.",
            "perspective_relevance": "As an expert in Nonprofit Administration with a focus on IRS Form 990 staffing standards, I bring domain knowledge about how nonprofit organizations, particularly small think tanks like Forethought Foundation, report and structure their staffing. I am familiar with FTE calculations, reporting incentives, operational norms, and sector-specific employment patterns, including the influence of grants, programmatic cycles, and regulatory requirements on headcount.",
            "status_quo": "Historically, Forethought Foundation has operated with a very lean staff model—1 to 2 FTEs, with heavy reliance on contractors, fellows, or part-time roles. Unless there is significant programmatic expansion or a change in funding, the organization is likely to remain at or below two FTEs.",
            "perspective_derived_factors": [
                {
                    "factor": "Base Rate for Small Nonprofit Think Tanks",
                    "effect": "Decreases probability. Most organizations of this size and mission maintain small, stable FTE counts due to budgetary constraints and project-based work."
                },
                {
                    "factor": "IRS Form 990 Reporting Norms and Incentives",
                    "effect": "Decreases probability slightly. There is generally little incentive for such orgs to increase FTEs, as contractors/part-timers offer flexibility and limit overhead."
                },
                {
                    "factor": "Recent Hiring Actions/Public Statements",
                    "effect": "Neutral to slightly increases probability. The 2021 hiring post suggests some openness to expansion, but there is little evidence of major staff growth since."
                },
                {
                    "factor": "Effective Altruism/Global Priorities Funding Landscape",
                    "effect": "Slightly increases probability. If a large new grant was received or major new programs launched, headcount could increase, but there is no public evidence of this."
                },
                {
                    "factor": "Resolution Criteria Strictness (Excludes Volunteers, 35hr/week definition)",
                    "effect": "Decreases probability. Even if there are multiple contributors, most will not meet the FTE threshold."
                },
                {
                    "factor": "Risk of Organizational Wind-down or Dormancy",
                    "effect": "Decreases probability. If the org has wound down, FTEs could drop to zero, but there is no public sign of abandonment."
                }
            ],
            "no_scenario": "Forethought Foundation continues its lean operational model, employing 1-2 core staff (perhaps an Executive Director and one admin/researcher), with additional work handled by contractors, part-time fellows, or volunteers. No major new funded initiatives launch in 2025, and no new IRS Form 990 or public statements indicate a staff increase. At year-end, reports (or best estimates) show <=2 FTEs.",
            "yes_scenario": "Forethought Foundation receives a significant new grant or launches a major new program in late 2024 or 2025, necessitating the hiring of one or more additional full-time staff (e.g., program managers, researchers, or admin). By end of 2025, IRS filings, staff listings, or direct confirmation show >2 FTEs (e.g., 3+ full-time staff or equivalent part-time staff summing to >2 FTEs).",
            "final_reasoning": "The balance of evidence, both from IRS Form 990 base rates for organizations of this profile and the lack of public signals about major expansion, strongly favors the status quo: <=2 FTEs. The effective altruism/longtermist space has seen some volatility and funding challenges, reducing the likelihood of sudden growth. The resolution criteria are strict—contractors/part-timers would not count unless their aggregate hours exceed the 35/wk FTE threshold. There is no sign of organizational wind-down, so a zero FTE outcome is unlikely. Absent clear evidence of expansion, the most likely outcome is that Forethought Foundation will have two or fewer FTEs at the end of 2025. I estimate a 15% chance of a 'Yes' outcome (i.e., >2 FTEs), and an 85% chance of a 'No' outcome, with my probability slightly above zero to account for the possibility of a late-year grant or unannounced hiring.",
            "final_probability": 15
        },
        "Nonprofit Administration (CharityNavigatorEvaluationCriteria)": {
            "time_to_resolution": "Approximately 3 months left until the end of 2025.",
            "perspective_relevance": "As an expert in Nonprofit Administration and Charity Navigator Evaluation Criteria, my analysis focuses on nonprofit organizational size, staffing patterns, reporting standards, and public documentation practices. These factors are crucial in evaluating both the likelihood of accurate staff reporting and the operational trajectories of organizations like the Forethought Foundation.",
            "status_quo": "The Forethought Foundation has historically had a small team, often 1-2 FTE staff, with much of its work supported by part-time, contract, or academic-affiliated personnel. Without significant organizational change, the status quo would be at or just below 2 FTE employees.",
            "perspective_derived_factors": [
                {
                    "factor": "Nonprofit Staffing Trends",
                    "effect": "Nonprofits in the think tank and academic research space—especially those associated with Effective Altruism—tend to operate with lean core teams and rely on contracted researchers, fellows, or academic partners. This decreases the likelihood of exceeding 2 FTE."
                },
                {
                    "factor": "Funding and Growth",
                    "effect": "Growth in staffing typically follows a significant increase in unrestricted funding or a major new program launch. Publicly available data and recent hiring records do not indicate a major expansion at Forethought Foundation, making >2 FTE unlikely unless new funding or initiatives were announced."
                },
                {
                    "factor": "Reporting and Transparency Norms",
                    "effect": "Charity Navigator criteria and best practices recommend accurate, up-to-date reporting of staffing and finances. The Effective Altruism community emphasizes transparency, so if >2 FTE occurred, it would likely be reported. However, recent updates from the Foundation do not show such growth."
                },
                {
                    "factor": "Sector-wide Labor Market Trends",
                    "effect": "Recent labor market news shows increased demand for flexible and hybrid work, but also some tightening in certain sectors. This makes rapid, permanent FTE expansion less likely unless mission-critical. No evidence suggests Forethought Foundation is bucking this trend."
                },
                {
                    "factor": "Project Continuity and Abandonment Risk",
                    "effect": "If the organization were to scale back or become dormant, staff would decrease or remain stable, not increase. No signals suggest abandonment, but also none indicating a shift toward rapid growth."
                }
            ],
            "no_scenario": "The Foundation maintains its current operating model, with 1-2 FTE staff, augmented by contractors or academic affiliates. No major new program or funding influx occurs in 2025, and no public hiring announcements for additional full-time staff are made. The year ends with staffing at or below the threshold.",
            "yes_scenario": "The Foundation receives a large grant or launches a new research program, necessitating the hiring of multiple new full-time employees. This is accompanied by public job postings and/or updated organizational disclosures showing 3+ FTE by the end of 2025.",
            "final_reasoning": "Given the absence of news or reporting suggesting a significant expansion, combined with sector norms and base rates for small, research-focused nonprofits, the probability that the Forethought Foundation will have more than two full-time equivalent employees by the end of 2025 is low. The organization is part of a community that values transparency, so any significant growth would likely be visible in public updates or job postings, which have not appeared. The status quo—lean staffing, reliance on contractors or academic partners, and limited evidence of growth—remains the most likely scenario. The possibility of sudden expansion is not zero (e.g., due to surprise funding), but there are no signals of this as of late September 2025.",
            "final_probability": 18
        },
        "Human Resources (WorkforcePlanningBestPractices)": {
            "time_to_resolution": "Approximately 3 months (question will resolve by the end of 2025, today is September 26, 2025).",
            "perspective_relevance": "As a Human Resources (Workforce Planning Best Practices) expert, I bring insight into nonprofit/think tank staffing models, growth trajectories, hiring constraints, and typical full-time equivalent (FTE) utilization for small mission-driven organizations. Understanding drivers of headcount changes, funding cycles, and retention in the nonprofit/academic sector is critical to this question.",
            "status_quo": "Forethought Foundation has typically operated with a very lean staff, historically at or below 2 full-time equivalents. If nothing changed, they would likely continue to employ two or fewer FTEs through 2025.",
            "perspective_derived_factors": [
                {
                    "factor": "Historical Staffing and Growth Patterns for Small Academic/Think Tank Nonprofits",
                    "effect": "Decreases probability. Small, specialized think tanks like Forethought tend to grow staff slowly, if at all, and often rely on contractors, fellows, or part-time affiliates instead of rapidly growing their core FTEs."
                },
                {
                    "factor": "Funding Availability and Donor Trends in Effective Altruism (EA)/Longtermist Circles",
                    "effect": "Slightly increases probability. If the EA movement or Forethought Foundation received a notable influx of funding or large restricted grants needing dedicated staff, there could be pressure to increase hiring, but recent funding constraints across the EA landscape may limit headcount expansion."
                },
                {
                    "factor": "Organizational Strategy and Project Lifecycle",
                    "effect": "Decreases probability. Think tanks often staff up temporarily for major projects and then revert to lean staffing; unless a major new initiative was announced in 2025, the default is to remain lean."
                },
                {
                    "factor": "Alternative Staffing Models (Contractors, Affiliates, Interns, Part-Time)",
                    "effect": "Decreases probability. Best practices for small orgs often mean using non-FTE labor for flexibility and cost control, especially for research roles."
                },
                {
                    "factor": "Public Transparency and Reporting Norms",
                    "effect": "Neutral. The criteria require public or best-estimate FTE counts, so unless there is an explicit announcement or clear evidence of >2 FTEs, ambiguity defaults to the negative."
                }
            ],
            "no_scenario": "Forethought Foundation continues its typical operations with 1-2 core staff (likely including William MacAskill and a program manager), relying on external collaborators, fellows, or part-timers for additional capacity. No major new projects or funding windfalls are announced, and no public reporting shows >2 FTEs. Organization maintains a lean structure, in line with historical precedent and sector norms.",
            "yes_scenario": "In 2025, Forethought Foundation announces a significant new project or receives a large restricted grant that requires expanded operations. To meet deliverables, the foundation hires additional full-time staff (e.g., researchers, operations, communications), pushing the FTE count above 2, and this is reflected in public reports or corroborated by credible sources.",
            "final_reasoning": "Base rates for small, specialized think tanks—especially in the EA/longtermist space—strongly favor maintaining a very lean staff, often below three FTEs. Forethought Foundation’s public profile, past hiring, and sector norms suggest a strong preference for flexibility and cost control via contractors, part-timers, and affiliates. There is no evidence in the news or public record of a recent major funding influx or a programmatic expansion requiring more core full-time staff. The resolution criteria are clear: only core 35h/week FTEs count (not volunteers or part-time/contractors). Given the strong status quo bias, historic staffing patterns, and absence of signals indicating growth, the probability that Forethought will have more than two FTEs in 2025 remains low—though not zero, due to the possibility of organizational surprise or a late-year funding windfall. I assign a 17% probability to a positive resolution.",
            "final_probability": 17
        },
        "Organizational Sociology (ResourceDependenceTheory)": {
            "time_to_resolution": "Approximately 3 months (end of 2025).",
            "perspective_relevance": "As an expert in Organizational Sociology with a focus on Resource Dependence Theory, I analyze how small think tanks like Forethought Foundation adapt their staffing in response to resource constraints, environmental uncertainty, strategic priorities, and inter-organizational dependencies. This lens is particularly relevant for understanding hiring and retention at mission-driven, grant-dependent nonprofits where resource flows, legitimacy, and external stakeholder expectations directly shape organizational structure.",
            "status_quo": "Forethought Foundation has historically operated with a lean staff (1-2 FTEs), relying on academic partnerships, contractors, volunteers, and potentially part-time staff. If nothing changes, the organization is likely to remain small and under the threshold of more than two FTEs.",
            "perspective_derived_factors": [
                {
                    "factor": "Resource Availability (Grants & Donations)",
                    "effect": "Increased financial resources (e.g., a large new grant or donor) could prompt the Foundation to hire more full-time staff and exceed two FTEs. Conversely, stagnant or shrinking funding incentivizes maintaining a skeleton staff."
                },
                {
                    "factor": "Strategic Prioritization / Program Expansion",
                    "effect": "If the Foundation pursues new research projects, launches new initiatives, or expands operations, this may necessitate hiring additional full-time employees, increasing the probability. If it sticks to a narrow research focus, it likely maintains minimal staff."
                },
                {
                    "factor": "Institutional Isomorphism & Signaling",
                    "effect": "Smaller think tanks often mimic the structures of peer organizations to signal legitimacy to funders and collaborators. A trend toward larger staffing among comparable organizations could exert upward pressure, but the Effective Altruism/Longtermist space typically favors lean organizations."
                },
                {
                    "factor": "Reliance on Contractors/Academics",
                    "effect": "If the Foundation continues to rely heavily on external academics, fellows, or research contractors, the need for core FTEs stays low, decreasing the probability."
                },
                {
                    "factor": "Project Abandonment or Dormancy",
                    "effect": "If the Foundation becomes inactive or is abandoned, probability drops to zero, but there is no sign of this happening as of September 2025."
                }
            ],
            "no_scenario": "The Foundation remains focused on core research activities, continues to rely on part-time staff, academic affiliates, and contractors, and does not receive a major new grant or mandate. The organization maintains its status quo structure (1-2 FTEs), possibly due to deliberate cost minimization, strategic caution, or lack of resource-driven pressure to expand.",
            "yes_scenario": "The Foundation secures a major new grant or donor, launches a new research initiative, or faces increased demands from stakeholders. This leads to the hiring of additional full-time staff (e.g., to manage operations, research, and outreach), pushing FTE count above two. Alternatively, a deliberate strategic decision is made to professionalize operations and build organizational capacity.",
            "final_reasoning": "Base rates for small, grant-dependent think tanks in the Effective Altruism/Longtermist space suggest persistent lean staffing. There is no public report of a major grant, expansion, or external pressure to scale up. The organization's incentives (resource dependence, niche focus, operational model) all point toward continued minimalism. No evidence of abandonment or dormancy is present. Given these factors, and weighting the status quo heavily, the likelihood of exceeding two FTEs by the end of 2025 is low but not negligible—there remains a modest chance of expansion if an unpublicized grant or strategic pivot occurs. Given the lack of direct evidence for such a change, I assign a probability near but not at the lower extreme.",
            "final_probability": 20
        },
        "Organizational Sociology (InstitutionalIsomorphism)": {
            "time_to_resolution": "Approximately 3 months (until end of 2025)",
            "perspective_relevance": "As an expert in Organizational Sociology, specifically Institutional Isomorphism, my perspective is relevant because the Forethought Foundation operates in an environment where peer organizations, funding landscapes, and academic norms exert mimetic, normative, and coercive pressures. Understanding how similar think tanks and academic nonprofits adapt to external expectations, resource constraints, and legitimacy challenges can help forecast organizational staffing decisions. Isomorphic tendencies suggest that small, mission-driven organizations often conform over time to the structures and staffing patterns of their reference group unless disrupted by external shocks.",
            "status_quo": "The Forethought Foundation has historically operated with a very small staff, typically fewer than three full-time equivalent employees, leveraging contractors, affiliates, and volunteers. If nothing changes, it is likely to maintain this lean structure through 2025.",
            "perspective_derived_factors": [
                {
                    "factor": "Mimetic Isomorphism",
                    "effect": "Increases probability slightly if peer organizations in the Effective Altruism and academic think tank space are expanding staff due to greater funding or programmatic demands. Decreases if the trend is toward leaner, more agile operations amid funding uncertainty."
                },
                {
                    "factor": "Resource Dependency",
                    "effect": "Decreases probability if the foundation's funding (especially post-FTX disruption in EA philanthropy) is flat or declining, as small organizations often avoid increasing fixed costs. Increases only if a major new grant or revenue stream is secured."
                },
                {
                    "factor": "Legitimacy and Professionalization Pressures",
                    "effect": "Increases probability modestly if academic partners, donors, or regulatory actors expect a more professionalized or robust organization, which could push the Foundation to formalize part-time roles into FTEs."
                },
                {
                    "factor": "Mission-Driven Flexibility",
                    "effect": "Decreases probability, as organizations in this space often prefer flexibility, using contractors, part-timers, and academic affiliates instead of hiring FTEs to minimize overhead and adapt to uncertain funding."
                },
                {
                    "factor": "Recent Trends in Small Nonprofit Staffing",
                    "effect": "Decreases probability: The post-pandemic trend among small nonprofits and think tanks has been to avoid growing headcount, relying more on remote, flexible, or project-based staff. There is no evidence of a sectoral shift toward growing FTEs outside of well-funded large organizations."
                },
                {
                    "factor": "Project Abandonment or Dormancy",
                    "effect": "Strongly decreases probability if the Foundation has wound down activities, as there would be no need for FTEs. However, available information suggests the Foundation is still active."
                }
            ],
            "no_scenario": "The Foundation maintains its current staffing model, using a small core team (e.g., William MacAskill and one or two operations/program staff), with the rest of its work handled by contractors, academic affiliates, and volunteers. No significant new funding is received, and the organization continues to prioritize flexibility and low overhead, in line with sector norms and post-FTX caution. Alternatively, the Foundation goes dormant or is absorbed into a larger entity, resulting in fewer or no FTEs.",
            "yes_scenario": "The Foundation receives a large, multi-year grant or expands its programming (e.g., launching new research projects, events, or educational programs), prompting the formalization of multiple part-time or contract roles into FTEs, or the hiring of new staff to handle increased operational complexity and accountability requirements. Mimetic and legitimacy pressures from peer organizations lead to a decision to professionalize and grow the team, resulting in more than two FTEs on payroll by the end of 2025.",
            "final_reasoning": "The base rate for small, academically-oriented think tanks in niche philanthropic spaces (such as Effective Altruism) expanding beyond two full-time equivalent employees is low, especially given post-pandemic caution and the fallout from the FTX crisis that hit the EA funding ecosystem. The status quo is sticky: most similar organizations maintain a small core staff and resist increasing fixed costs unless compelled by significant new funding or programmatic shifts. There is no public evidence of the Forethought Foundation announcing substantial new initiatives or major new funding in 2025, nor is there evidence of sector-wide expansion among peer organizations. Isomorphic and legitimacy pressures remain modest in this context, and prevailing sectoral trends favor flexibility over headcount growth. While a Yes scenario is possible if a large grant or mandate arises, the absence of such signals means the most likely outcome is a continuation of the lean staffing model. The probability of having more than two FTEs is therefore low, but not zero: some uncertainty remains due to the potential for unforeseen funding or strategic shifts.",
            "final_probability": 18
        },
        "Nonprofit Management (LifeCycleModelNonprofits)": {
            "time_to_resolution": "Approximately 3 months (until December 31, 2025; forecast date is September 26, 2025)",
            "perspective_relevance": "As an expert in Nonprofit Management utilizing the LifeCycle Model, I bring insight into the typical scaling trajectories, hiring patterns, and resourcing strategies of mission-driven, grant-funded organizations—especially small think tanks. This perspective emphasizes the tendency for nonprofits to maintain lean staffing, rely on contractors or academic affiliates, and only incrementally increase headcount in response to predictable, multi-year funding and programmatic expansion.",
            "status_quo": "The Forethought Foundation has historically operated with a core team of 1-2 full-time staff, supplemented by academic affiliates, contractors, and project-based support. There is no public evidence indicating a recent significant scaling-up of operations or hiring.",
            "perspective_derived_factors": [
                {
                    "factor": "Nonprofit Scaling Patterns",
                    "effect": "Decreases probability: Small research-focused nonprofits typically remain lean for years, relying on a core team and extending capacity via contractors, affiliates, or part-timers. Major hiring usually follows a major grant or new program launch, rarely occurring suddenly or without public notice."
                },
                {
                    "factor": "Funding Environment",
                    "effect": "Decreases probability: The Effective Altruism funding ecosystem has become more selective post-FTX, and there is little public evidence of new, substantial grants to Forethought Foundation that would necessitate growing beyond two FTEs."
                },
                {
                    "factor": "Leadership Focus and Academic Affiliation",
                    "effect": "Decreases probability: William MacAskill and other leaders remain active in academia and other projects. Leadership bandwidth and the organization's close ties to university infrastructure (e.g., Oxford) make it likely to keep the core staff small and utilize institutional support rather than direct hires."
                },
                {
                    "factor": "Transparency and Reporting Norms",
                    "effect": "Neutral to slightly decreases probability: While Forethought is transparent about its work, the lack of recent announcements about new staff or hiring rounds suggests stability rather than growth."
                },
                {
                    "factor": "Base Rate for Similar Nonprofits",
                    "effect": "Decreases probability: Most comparable think tanks in the EA and global priorities research space (e.g., Global Priorities Institute, Center for Global Development) maintain small full-time staff unless they're managing grants, fellowships, or large operational programs, which Forethought does not appear to do."
                }
            ],
            "no_scenario": "By the end of 2025, Forethought Foundation continues its current activities with 1-2 core FTEs. It may use part-time research assistants, academic affiliates, or contractors, but does not hire additional full-time staff. No major new grants or programs are launched that would justify expanding the permanent team. Organizational outputs continue as before, and public reports or filings confirm staff size at 2 FTE or fewer.",
            "yes_scenario": "The Foundation receives a significant new grant or launches a major new initiative in fall 2025, prompting the hiring of one or more additional full-time staff. Alternatively, it absorbs another project, or shifts its operational model to direct program delivery, requiring more FTEs. Public announcements, staff directories, or reports by the end of 2025 document three or more FTEs.",
            "final_reasoning": "Given the status quo, base rates, and lack of recent evidence of significant organizational expansion, it is highly likely that the Forethought Foundation will have two or fewer full-time equivalent employees at the end of 2025. The LifeCycle Model for Nonprofits suggests that small, mission-focused think tanks rarely increase headcount unless driven by major, visible programmatic or funding changes, for which there is no public indication. The broader funding environment is cautious, and leadership appears to be maintaining a stable, lean model. While it is possible that late-year developments could shift this, the probability is low given the reporting requirements and typical hiring lead times.",
            "final_probability": 12
        },
        "Nonprofit Management (SocialEnterpriseTheory)": {
            "time_to_resolution": "Approximately 3 months (until December 31, 2025)",
            "perspective_relevance": "As an expert in Nonprofit Management and Social Enterprise Theory, I bring insight into nonprofit staffing norms, funding models, organizational life cycles, and HR practices. My perspective is relevant because small nonprofit think tanks like the Forethought Foundation often operate with lean staffing, heavy reliance on contractors or part-time staff, and are highly sensitive to funding and leadership dynamics. Understanding these patterns is key to evaluating the likelihood of surpassing two FTEs.",
            "status_quo": "The Forethought Foundation has operated with a very small full-time staff, often 1-2 FTEs, since its inception. Nonprofits of this type and size rarely grow staff rapidly unless funding, mission, or operations scale up. The status quo is therefore 1-2 FTEs; no change would leave them below the threshold.",
            "perspective_derived_factors": [
                {
                    "factor": "Organizational growth trajectory and funding model",
                    "effect": "Decreases probability. The Forethought Foundation has been relatively stable, with no recent evidence of large grants, major new program launches, or public hiring drives. Absent a major new funding influx, expansion above two FTEs is unlikely."
                },
                {
                    "factor": "Sector base rates for similar think tanks",
                    "effect": "Decreases probability. Most academic-oriented nonprofit think tanks in the Effective Altruism and global priorities space operate with 1-2 core staff, supplementing with fellows, contractors, or academic collaborators."
                },
                {
                    "factor": "Recent hiring activity and organizational transparency",
                    "effect": "Neutral to slightly decreases probability. The most recent public hiring round (mid-2021) did not indicate a shift towards larger in-house teams. No public reports or news suggest subsequent expansion."
                },
                {
                    "factor": "Potential for mission drift or sudden scaling",
                    "effect": "Slightly increases probability. If a strategic decision were made to rapidly scale research output, events, or policy influence, staffing could expand, but there is no public indication of such a pivot."
                },
                {
                    "factor": "Risk of abandonment or contraction",
                    "effect": "Decreases probability. While abandonment would resolve the question negatively, there is little evidence that the Foundation has wound down; continued outputs and leadership presence suggest organizational continuity, not growth or collapse."
                }
            ],
            "no_scenario": "The Foundation continues as it has for the past several years: maintaining 1-2 FTE staff (e.g., William MacAskill as Director and possibly one operations/research staffer), with additional work contracted out or handled by academic affiliates. No major new funding, projects, or organizational changes occur before the end of 2025.",
            "yes_scenario": "The Foundation receives a significant new grant or launches a major new initiative in late 2025, prompting the hiring of additional full-time staff (e.g., operations, research, events, or communications roles), bringing the total above two FTEs by year's end. Alternatively, a merger or formal partnership leads to a staff increase.",
            "final_reasoning": "Base rates for small, academic-focused nonprofits in the Effective Altruism space strongly favor lean staffing. There is no news or public evidence of recent or imminent expansion at the Forethought Foundation. The status quo is stable at or below 2 FTEs, and the absence of hiring announcements, new programs, or major grants further supports this. While sudden growth is possible, it would require a clear catalyst not currently in evidence. Given these factors, the probability that the Forethought Foundation will have more than two full-time equivalent employees in 2025 is low but not zero.",
            "final_probability": 15
        },
        "Labor Economics (TheoryOfLaborDemand)": {
            "time_to_resolution": "Approximately 3 months (until the end of 2025)",
            "perspective_relevance": "As a labor economist specializing in the theory of labor demand, I can analyze the incentives, constraints, and strategic decisions facing a small non-profit think tank like the Forethought Foundation. This includes understanding the determinants of the demand for full-time labor (budget, productivity, marginal value of staff, funding volatility), substitution between labor types (FTEs, part-time, contractors), and the broader labor market's influence on hiring and retention.",
            "status_quo": "Historically, the Forethought Foundation has operated with a small team, frequently just 1-2 FTEs, supplemented by part-time staff, contractors, and academic collaborators. If nothing changes, the organization would likely remain at or below two FTEs, given past patterns and the tendency of similar think tanks to stay lean.",
            "perspective_derived_factors": [
                {
                    "factor": "Funding Levels and Stability",
                    "effect": "Increases probability if recent grants or donations support staff expansion; decreases if funding is flat or declining."
                },
                {
                    "factor": "Labor Substitution and Outsourcing",
                    "effect": "Decreases probability, as small think tanks often use contractors, fellows, or part-timers to avoid fixed salary commitments, especially in volatile funding environments."
                },
                {
                    "factor": "Strategic Priorities and Organizational Growth",
                    "effect": "Increases probability if the Foundation has expanded its project scope, launched new initiatives, or signaled growth ambitions requiring more core staff."
                },
                {
                    "factor": "Labor Market Conditions for Non-profit/Academic Talent",
                    "effect": "Slightly decreases probability: High competition for talent and rising wages could make hiring full-time staff more costly, incentivizing alternative arrangements."
                },
                {
                    "factor": "Abandonment Risk",
                    "effect": "Decreases probability if there are signs of reduced activity or project wind-down; increases if the organization is actively publishing and hiring."
                }
            ],
            "no_scenario": "The Foundation maintains its status quo operations, relying on a core of 1-2 FTEs (e.g., MacAskill and an administrator), with additional work performed by part-time researchers, fellows, or external collaborators. No new major projects launch that require additional staff, or funding remains stable but not expansive. Alternatively, the Foundation could be winding down or deprioritized relative to other MacAskill/EAs projects.",
            "yes_scenario": "The Foundation secures a significant new grant or donation, or launches a new initiative (e.g., a major research program or conference series) that requires additional in-house management, leading to the hiring of a third (or more) FTE. Organizational updates reflect increased staff, and directories or disclosures list more than two FTEs working at least 35 hours/week.",
            "final_reasoning": "The default for small, philosophy-driven think tanks is to operate with minimal full-time staff, especially if their work can be conducted by academics, part-time collaborators, or contractors. Current labor market reports show increasing costs and strong demand for flexible work, making full-time hiring less attractive. No news or evidence suggests the Forethought Foundation has expanded significantly or shifted strategy to require more core staff. Unless there is a major, public inflection in funding or scope, the base rate for organizations of this type and size exceeding two FTEs is low. However, given the possibility of an unannounced grant or new initiative, the probability is not zero, but should reflect the strong pull of the status quo and labor demand theory.",
            "final_probability": 20
        },
        "Labor Economics (ScaleEconomiesTheory)": {
            "time_to_resolution": "Approximately 3 months (question resolves at end of 2025; today is 2025-09-26).",
            "perspective_relevance": "As a labor economist specializing in Scale Economies Theory, I focus on how organizations manage human capital as they grow and achieve economies (or diseconomies) of scale. For a small but ambitious think tank like Forethought Foundation, staffing decisions are a key indicator of operational scale and direction, especially in the context of philanthropic funding, academic hiring models, and the general labor market for nonprofits. My expertise allows me to analyze the likelihood of expansion or contraction based on these structural factors.",
            "status_quo": "As of the last public reports, the Forethought Foundation had 1-2 FTEs (primarily William MacAskill and possibly a research assistant or operations manager), with work supplemented by contractors or affiliated academics. Most small research-focused nonprofits in the effective altruism or global priorities research space have minimal full-time staff.",
            "perspective_derived_factors": [
                {
                    "factor": "Funding stability and growth",
                    "effect": "Increases probability if new grants or sustained donations have been secured for 2025, but the organization’s history and sector norms suggest a modest budget and slow staff growth. The absence of major new funding rounds or public announcements in 2025 is a negative sign."
                },
                {
                    "factor": "Scale economies and the nature of academic think tanks",
                    "effect": "Decreases probability. Small think tanks often rely on a lean core team due to diminishing returns to scale in research quality, and difficulty justifying multiple FTEs unless running large, multi-year projects. Contractors, visiting fellows, or part-time affiliates are more common than full-time hires."
                },
                {
                    "factor": "Recent hiring activity and public communications",
                    "effect": "Neutral to slightly negative. No evidence of significant hiring pushes or organizational expansion in 2025. The last hiring push (2021-2022) did not result in a rapid scaling up, and current sector news (including academic labor disputes and hybrid/remote work debates) does not indicate a talent war or expansion pressure in this niche."
                },
                {
                    "factor": "Sectoral and macro labor market context",
                    "effect": "Slightly negative. The nonprofit research sector globally is facing competition for talent from tech and AI companies, but this mostly affects organizations with growth ambitions or substantial funding (e.g., OpenAI, Meta), not small foundations. Broader trends toward hybrid work and operational caution in uncertain funding environments further inhibit rapid staff expansion."
                },
                {
                    "factor": "Project abandonment/organizational dissolution risk",
                    "effect": "Decreases probability, but there is no clear evidence that Forethought has been abandoned. However, if it were, the outcome would be a clear 'No' by definition."
                }
            ],
            "no_scenario": "The Forethought Foundation continues to operate as a small, intellectually-driven organization with William MacAskill and possibly one operations/research staffer, using part-time contractors or academic affiliates as needed. No new public hiring is announced, no major funding windfall occurs, and the organization maintains a nimble structure for flexibility, consistent with sector norms. Alternatively, the Foundation is abandoned or becomes moribund, with no active full-time employees.",
            "yes_scenario": "The Foundation receives a significant new grant or funding commitment in late 2025 (e.g., from Open Philanthropy or a major donor), or decides to launch a new initiative requiring additional FTEs (such as a research program, large event series, or significant expansion in public engagement). At least three full-time staff are listed on the website, social media, or in official reporting, and work 35+ hours per week.",
            "final_reasoning": "Base rates for small, research-focused effective altruism nonprofits are highly stable: most maintain 1-2 FTEs for years unless a clear growth mandate or funding influx occurs. There is no public evidence of such a shift for Forethought Foundation in 2025. Recent hiring, funding, or programmatic announcements are absent; sector-wide trends suggest caution, not expansion, for small research charities. The probability of organizational abandonment is non-trivial but not dominant. Given the definition of FTE (excluding volunteers and requiring 35+ hours/week), and the lack of evidence for significant scaling up, the status quo (no expansion beyond 2 FTEs) is strongly favored. The risk of a 'No' due to abandonment is balanced by a small chance of a late-year grant or initiative. Therefore, the probability that Forethought Foundation will have more than two full-time equivalent employees in 2025 is low, but not zero.",
            "final_probability": 15
        }
    },
    "deliberation_probability": [
        15,
        18,
        17,
        20,
        18,
        12,
        15,
        20,
        15
    ],
    "deliberation_mean_probability": 16.666666666666668,
    "deliberation_sd": 2.6457513110645907,
    "deliberation_probability_result": 17,
    "group_results": {
        "nonprofitAdministrationIrsform990staffingstandards": {
            "forecaster_to_engage": "Nonprofit Management (LifeCycleModelNonprofits)",
            "response_type": "defense",
            "response": "The Nonprofit Management (LifeCycleModelNonprofits) forecast is particularly strong in highlighting the inertia that characterizes staffing changes for small mission-focused think tanks. By referencing the LifeCycle Model, this forecaster appropriately contextualizes Forethought Foundation's likely position in the 'steady state' or 'stability' phase, where expansion is rare without clear, externally-driven catalysts. Their reasoning is strengthened by the observation that hiring lead times and reporting requirements make sudden, late-year FTE increases improbable—since any such hiring would likely have surfaced in public channels or sector news by now. Their lower probability (12%) is well justified, and their argument that funding environments and leadership signals point to caution further reinforces the unlikelihood of exceeding two FTEs. This perspective aligns closely with sector norms and is consistent with observed staffing stasis across peer organizations."
        },
        "nonprofitAdministrationCharitynavigatorevaluationcriteria": {
            "forecaster_to_engage": "Organizational Sociology (InstitutionalIsomorphism)",
            "response_type": "critique",
            "response": "While the Institutional Isomorphism perspective correctly notes the tendency for peer organizations to mimic each other's staffing conservatism—especially post-FTX and in the effective altruism space—it may underweight the role of transparency and public reporting in this particular case. Unlike some sectors, effective altruism–aligned nonprofits face unusually strong community expectations for open disclosure of funding and staffing. As such, any expansion would likely show up quickly in job postings, newsletters, or grant announcements. This means that the absence of such signals is more diagnostic than in other nonprofit subfields, making the probability of exceeding two FTEs arguably even lower than suggested here. In summary, while isomorphic pressures are real, the high transparency norm in this subfield should be given more weight in reducing the likelihood of undetected or late-year staffing expansion."
        },
        "humanResourcesWorkforceplanningbestpractices": {
            "forecaster_to_engage": "Labor Economics (TheoryOfLaborDemand)",
            "response_type": "defense",
            "response": "The Labor Economics (TheoryOfLaborDemand) forecaster provides a robust and well-grounded rationale for a low probability outcome, which aligns with the realities of contemporary nonprofit workforce planning. Their emphasis on the attractiveness of flexible work arrangements, especially in organizations with academic or research missions, is particularly salient. The point that no public evidence exists for a strategic or funding inflection is critical: in the absence of labor demand shocks (e.g., a major grant or new mandated program), the default is that hiring remains flat. This is highly consistent with sector best practices, where scaling FTEs is a high-bar decision due to ongoing fixed costs and uncertain future funding. Their slightly higher probability (20%) prudently accounts for the possibility of late or unpublicized developments, but overall, their argument for status quo persistence is compelling and well-defended."
        },
        "organizationalSociologyResourcedependencetheory": {
            "forecaster_to_engage": "Nonprofit Administration (CharityNavigatorEvaluationCriteria)",
            "response_type": "defense",
            "response": "The Charity Navigator–aligned forecast rightly emphasizes both the sectoral base rates and the transparency norms that characterize the Effective Altruism research nonprofit space. Their argument that any major staff expansion would almost certainly be visible through public-facing channels—such as job postings, annual reports, or updates to donors and community platforms—is a crucial point that supports a low probability of undisclosed late-year growth. This perspective adds an important layer to traditional nonprofit analysis by recognizing that transparency and external scrutiny are unusually strong in this ecosystem. As a result, the absence of such signals as of late September 2025 is even more diagnostic here than for many other nonprofits, justifying a probability on the lower end of the spectrum. This approach complements resource dependence logic and reinforces the status quo bias with community-specific evidence."
        },
        "organizationalSociologyInstitutionalisomorphism": {
            "forecaster_to_engage": "Labor Economics (ScaleEconomiesTheory)",
            "response_type": "defense",
            "response": "The Labor Economics (ScaleEconomiesTheory) forecaster offers a strong analysis that echoes and complements the institutional isomorphism perspective, particularly regarding the stickiness of staffing levels in small research nonprofits. Their emphasis on the absence of public signals—such as hiring announcements or new funding—reinforces the status quo expectation. Importantly, they explicitly address the risk of both organizational abandonment and surprise expansion, showing balanced reasoning. The note that the definition of FTE is strict (excluding volunteers and requiring 35+ hours/week) is critical, as it makes sudden expansion less likely unless a major, public shift occurs. This systemic view of economies of scale, and the barriers to upscaling without clear external catalysts, aligns well with observed sector patterns and the pressures shaping nonprofit staffing. Their probability estimate is well-justified given these factors."
        },
        "nonprofitManagementLifecyclemodelnonprofits": {
            "forecaster_to_engage": "Nonprofit Management (SocialEnterpriseTheory)",
            "response_type": "critique",
            "response": "While the SocialEnterpriseTheory perspective correctly identifies the tendency for small, academic-oriented nonprofits in the Effective Altruism sector to remain lean and avoid staff expansion without clear catalysts, it could more explicitly address the granularity of FTE calculation in this context. Specifically, it's important to stress that many research nonprofits, including Forethought Foundation, often leverage academic affiliates or project-based contractors whose hours rarely sum to additional FTEs under the 35-hour rule. Moreover, the SocialEnterpriseTheory approach might more strongly emphasize how the current funding and reputational environment post-FTX further discourages the kind of risk-taking or growth pivots that could drive a sudden staffing increase. By sharpening focus on these operational and environmental constraints, the argument for a low probability outcome becomes even stronger and more nuanced."
        },
        "nonprofitManagementSocialenterprisetheory": {
            "forecaster_to_engage": "Organizational Sociology (ResourceDependenceTheory)",
            "response_type": "critique",
            "response": "While the Resource Dependence Theory perspective correctly highlights the organization's reliance on external funding and the incentives toward lean staffing, it could more thoroughly differentiate between resource dependence and proactive transparency norms in this subfield. In the Effective Altruism/Longtermism nonprofit ecosystem, not only are organizations constrained by external resource flows, but they also face unique pressures to publicly disclose any significant staffing or programmatic changes. This means the absence of public signals is doubly informative: it's both a result of limited resources and a function of the sector's expectation of transparency. The forecast could be improved by weighing this transparency norm more heavily, which would justify an even lower probability of undisclosed or late-year staff expansion, and by clarifying that resource dependence here is tightly coupled to community scrutiny and reputational risk, making stealthy or last-minute increases in FTEs highly improbable."
        },
        "laborEconomicsTheoryoflabordemand": {
            "forecaster_to_engage": "Human Resources (WorkforcePlanningBestPractices)",
            "response_type": "critique",
            "response": "While the WorkforcePlanningBestPractices perspective accurately highlights the role of flexible staffing and the cost-consciousness typical among small think tanks, it could further emphasize the specific mechanisms by which labor demand is tempered in this environment. In particular, the theory of labor demand suggests that marginal increases in workload at organizations like Forethought Foundation are often absorbed by increasing the hours or project scope of existing part-timers and contractors, rather than triggering the threshold for a new FTE hire. This nuance is especially pertinent given the strict 35-hour FTE requirement in the resolution criteria. Additionally, the forecast could more explicitly address how the shape of the organization's output (e.g., academic papers, policy reports) allows for highly elastic labor inputs, making the leap to >2 FTEs even less likely absent a step-change in funding or mission. Integrating these labor economics insights would make the low probability estimate even more robust."
        },
        "laborEconomicsScaleeconomiestheory": {
            "forecaster_to_engage": "Nonprofit Administration (IRSForm990StaffingStandards)",
            "response_type": "defense",
            "response": "The IRS Form 990 Staffing Standards perspective offers a valuable, data-driven approach grounded in regulatory reporting requirements and base rates for small nonprofits. By tying the probability to the observable patterns in staffing disclosures on Form 990s, this forecast draws on a uniquely objective dataset and highlights that small research-focused nonprofits almost never exceed 2 FTEs without a major, well-publicized inflection. The argument that the absence of new Form 990–visible hires or other public signals is highly diagnostic is especially compelling in the Forethought Foundation's case, given their sector's transparency norms. This method also appropriately discounts the likelihood of part-timers or contractors aggregating to an additional FTE, considering the strict resolution criteria. Overall, the IRS Form 990 approach provides a strong empirical anchor to the consensus for a low-probability outcome."
        }
    },
    "revision_results": {
        "Nonprofit Administration (IRSForm990StaffingStandards)": {
            "my_phase1_final_probability": 15,
            "reasoning_for_revised_probability": "Reviewing the group deliberation, all forecasters converge on a low probability for a 'Yes' outcome, with probabilities tightly clustered between 12% and 20%. Notably, the Nonprofit Management (LifeCycleModelNonprofits) perspective provides additional weight to the difficulty of late-year staff expansion, and the lack of public signals or hiring cycles further reduces the plausibility of a sudden FTE increase before year-end. No new information has surfaced that would increase the likelihood of exceeding two FTEs. Given the further reinforcement of the status quo bias, and the explicit points raised about nonprofit hiring timelines and transparency, I now judge my initial 15% as slightly high and will revise downward to 13%.",
            "revised_probability": 13
        },
        "Nonprofit Administration (CharityNavigatorEvaluationCriteria)": {
            "my_phase1_final_probability": 18,
            "reasoning_for_revised_probability": "Upon review of the group deliberation, especially the strong arguments from the LifeCycleModelNonprofits and the critique of the InstitutionalIsomorphism perspective, my confidence in the low probability of exceeding two FTEs is reinforced. The sector's transparency norms and the lack of any public signals of hiring or new funding make late-year expansion highly unlikely. The additional emphasis on hiring lead times and reporting requirements strengthens the view that even last-minute changes would likely have surfaced publicly by now. Therefore, the probability should be slightly reduced to reflect the even stronger consensus and diagnostic value of the absence of expansion signals.",
            "revised_probability": 15
        },
        "Human Resources (WorkforcePlanningBestPractices)": {
            "my_phase1_final_probability": 17,
            "reasoning_for_revised_probability": "The group deliberation strongly reinforced my initial reasoning. Other forecasters—drawing on IRS Form 990 data, Charity Navigator norms, nonprofit lifecycle theory, and labor economics—converge on a low base rate for small think tanks expanding beyond two FTEs absent major public signals. Critiques and defenses emphasized that the effective altruism/longtermist sector's high transparency standards make unpublicized or late-year expansion even less likely. No new arguments or evidence emerged to suggest a higher probability, and if anything, the group consensus and additional sector transparency considerations might warrant a modest downward adjustment. However, to avoid overconfidence and allow for very low-probability surprises (such as a last-minute grant or strategic pivot), I will revise my probability downward but not to the absolute minimum. I am lowering my estimate to 13%.",
            "revised_probability": 13
        },
        "Organizational Sociology (ResourceDependenceTheory)": {
            "my_phase1_final_probability": 20,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, especially the Charity Navigator and LifeCycle Model perspectives, I am persuaded that the combination of sector-specific transparency norms and the lack of any public signal of staff expansion make the probability of an undetected late-year hiring surge even lower than I initially assessed. The strong expectation for public disclosure in the Effective Altruism research nonprofit space reduces the likelihood of a surprise increase in FTEs. The LifeCycle Model’s emphasis on organizational inertia and the improbability of sudden end-of-year growth, combined with Charity Navigator’s argument that transparency is unusually strong in this subfield, both support a lower probability. While the risk of an unpublicized funding surge is not zero, it is even less plausible in this ecosystem. Therefore, I am revising my probability downward.",
            "revised_probability": 15
        },
        "Organizational Sociology (InstitutionalIsomorphism)": {
            "my_phase1_final_probability": 18,
            "reasoning_for_revised_probability": "Group deliberation highlighted and reinforced several key points supporting a lower probability: (1) Transparency and reporting norms in the EA/longtermist nonprofit sector make it very unlikely that significant hiring would go undetected this late in the year; (2) Base rates for small, academic think tanks remain firmly in favor of lean staffing, and multiple perspectives (IRS Form 990 standards, Charity Navigator criteria, LifeCycle Model) converge on the status quo; (3) There is a notable absence of public signals—job postings, grant announcements, or program expansions—that would justify an increase in FTEs. The institutional isomorphism lens remains valuable, but the arguments for even stronger status quo inertia and public visibility are compelling. Therefore, a modest downward revision is warranted to reflect the greater diagnosticity of 'no news' in this specific organizational niche.",
            "revised_probability": 14
        },
        "Nonprofit Management (LifeCycleModelNonprofits)": {
            "my_phase1_final_probability": 12,
            "reasoning_for_revised_probability": "Group deliberation consistently reinforced the strong status quo bias and the diagnostic power of the absence of public hiring or funding announcements, especially given the high transparency norms in the Effective Altruism nonprofit space. The critiques and defenses highlighted that base rates, sectoral transparency, and strict FTE definitions all point toward a very low probability of exceeding two FTEs by the end of 2025. The only substantive reason for any adjustment would be to harmonize with the narrow range of probabilities (12-20%) across expert perspectives, but there is no new argument or evidence that would justify moving the estimate meaningfully up or down. My original probability already reflected the lower bound of this consensus and was justified by nonprofit lifecycle theory and operational inertia.",
            "revised_probability": 12
        },
        "Nonprofit Management (SocialEnterpriseTheory)": {
            "my_phase1_final_probability": 15,
            "reasoning_for_revised_probability": "My initial forecast (15%) is reinforced by the group deliberation, which shows remarkable consensus across multiple expert perspectives—ranging from nonprofit management and administration to labor economics and organizational sociology. Nearly all forecasters independently emphasize the strong sectoral base rates for lean staffing, the heightened transparency norms in the Effective Altruism research nonprofit space, and the lack of public evidence for expansion. Critiques during deliberation—especially those highlighting the diagnostic value of transparency and the low likelihood of late-year, unpublicized hiring—suggest the probability should, if anything, be even lower. However, some forecasters prudently account for the small chance of a surprise grant or initiative, keeping the probability nonzero. Given the strict FTE definition, the late date in the year, and the convergence of sectoral, operational, and reputational constraints, I am revising my probability downward to 12%, aligning with the more cautious estimates and the strengthened argument that sudden, undetected staff expansion is highly unlikely.",
            "revised_probability": 12
        },
        "Labor Economics (TheoryOfLaborDemand)": {
            "my_phase1_final_probability": 20,
            "reasoning_for_revised_probability": "After reviewing the other forecasters' arguments and group deliberation, I find strong consensus across multiple analytic approaches (IRS Form 990 base rates, sector transparency norms, LifeCycle and Social Enterprise models, and resource dependence) that the probability of Forethought Foundation exceeding two FTEs in 2025 is very low. Several forecasters emphasized that the Effective Altruism nonprofit sector is unusually transparent, so any hiring above this threshold would almost certainly have surfaced in public reporting or job postings by late September. The strict FTE definition further reduces the chance that additional labor will count toward this metric. The only plausible Yes scenario remains a sudden, late-year funding windfall or program that has been kept confidential until now, which is highly unlikely given sector norms. This reaffirms my base rate–driven, labor demand–focused skepticism regarding headcount expansion. In light of the strong and well-justified consensus on a low probability, I am revising my forecast downward to more closely reflect the lower end of the range, now that uncertainty regarding stealth expansion or unpublicized grants seems even less plausible.",
            "revised_probability": 15
        },
        "Labor Economics (ScaleEconomiesTheory)": {
            "my_phase1_final_probability": 15,
            "reasoning_for_revised_probability": "Group deliberation reinforced my initial assessment that the probability of the Forethought Foundation having more than two full-time equivalent employees in 2025 is low. Multiple experts, drawing from nonprofit administration, human resources, and organizational sociology, independently converged on similar probabilities (12-20%), citing sector base rates, transparency norms, and the absence of any signals of expansion. Critiques and defenses specifically highlighted the diagnostic strength of transparency in this subfield and the strictness of the FTE definition, further reducing the plausibility of a late or undisclosed surge in staffing. No new evidence or compelling argument emerged to justify increasing the probability, and if anything, the emphasis on public reporting and sectoral inertia could support a minor downward revision. However, since my initial estimate already closely aligns with the consensus and is on the lower end, I will maintain my forecast at 15%.",
            "revised_probability": 15
        }
    },
    "revision_probability": [
        13,
        15,
        13,
        15,
        14,
        12,
        12,
        15,
        15
    ],
    "revision_mean_probability": 13.777777777777779,
    "revision_sd": 1.3017082793177759,
    "revision_probability_result": 14,
    "question_details": {
        "id": 38963,
        "title": "Will the Forethought Foundation have more than two full-time equivalent employees in 2025?",
        "created_at": "2025-08-31T06:17:43.652036Z",
        "open_time": "2025-09-25T15:39:01Z",
        "cp_reveal_time": "2025-09-25T17:09:01Z",
        "spot_scoring_time": "2025-09-25T17:09:01Z",
        "scheduled_resolve_time": "2025-12-30T23:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-09-25T17:09:01Z",
        "actual_close_time": "2025-09-25T17:09:01Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "This question is synced with an identical question on Metaculus. The original question opened on 2021-07-01 22:00:00 and can be found [here](https://www.metaculus.com/questions/7101). This question will resolve to the same value as the synced question. The original question's background info at this time is below. \n\nThe [Forethought Foundation for Global Priorities Research](https://www.forethought.org/about-us) is a recently launched think tank led by William MacAskill, which \"aims to promote academic work that addresses the question of how to use our scarce resources to improve the world by as much as possible\". It has recently been [hiring](https://forum.effectivealtruism.org/posts/ndEZwLXN8ynLdRkxR/the-forethought-foundation-is-hiring)\n\n`{\"format\":\"metac_closes_in_period\",\"info\":{\"post_id\":7101,\"question_id\":7101}}`",
        "resolution_criteria": "For the purposes of this question, a full-time equivalent is defined as working 35 hours per week, without including volunteers. Question will be resolved negatively if the project has clearly been abandoned, otherwise, reports by the organization together with best estimates by Metaculus moderators will be used",
        "fine_print": "",
        "post_id": 39586,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Zurich Debates 35‑Hour Work Week – Legal Questions Arise**\nThe Zurich city council debate over a 35‑hour work week for public employees has stalled after the finance director Daniel Leupi refused to extend the deadline. The motion, introduced by David Garcia Nuñez (AL) and Anna Graff (SP), seeks to reduce working hours to 35 per week while keeping full pay, targeting staff in the VBZ, police and care sectors. Leupi cited high costs and the risk that reduced hours could leave up to 1,500 specialists short. A legal opinion concluded that a pilot would constitute a 'massive Eingriff in das städtische Recht und insbesondere sein Lohnsystem' and that a statutory framework would be needed to comply with Article 8 of the Swiss Constitution. The motioners accused the council of a delay tactic and demanded the matter be referred to a commission. The council rejected the extension request, leaving Leupi to answer the commission. The debate echoes a 2023 pilot in hospitals where 70 assistant doctors worked 42 hours instead of 46. 45 % of Swiss workers reported that resources and burdens in their work life are just balancing, according to recent surveys. The motioners’ pilot would involve staff in shift work, such as those in the VBZ, police or care sector. Leupi warned that a reduction could result in a shortage of up to 1,500 specialists. The legal opinion noted that the city, as an employer, must treat all employees equally and that a pilot would be a 'massive Eingriff in das städtische Recht und insbesondere sein Lohnsystem'. The motioners’ request for a commission was rejected, and the council will now face questions from commission members.\nOriginal language: de\nPublish date: September 25, 2025 03:15 AM\nSource:[Neue Zürcher Zeitung](https://www.nzz.ch/zuerich/35-stunden-woche-fuer-staedtische-angestellte-zuercher-stadtrat-fuerchtet-juristische-probleme-al-wittert-eine-verzoegerungstaktik-ld.1903802)\n\n**/C O R R E C T I O N -- Insight Global/**\nInsight Global released its 2025 Employee Sentiment Report, revealing that only 35% of the 905 U.S. workers surveyed feel engaged at work and the same percentage feel essential in their roles. The survey, conducted by Atomik Research, found that 4 in 5 workers would stay longer in a role with better onboarding, 22% had left a job within the first 90 days—often due to poor training—and workers are 8 times more likely to feel engaged in a strong workplace culture. Respondents also reported that it takes 6–7 months to feel settled in their role. Brindy Pickett, Vice President of Consultant Engagement at Insight Global, said, 'A defined culture is not a nice‑to‑have. We've found it's a foundational driver of engagement, retention, and performance. If you're intentional about the culture you want, it breeds success.' The report recommends role‑specific onboarding, intentional culture‑building, and connecting daily work to a larger purpose to improve engagement and retention.\nOriginal language: en\nPublish date: September 24, 2025 04:45 PM\nSource:[Advanced Financial Network](https://uk.advfn.com/stock-market/share-news/C-O-R-R-E-C-T-I-O-N-Insight-Global/96879583)\n\n**Mediator assigned as college full-time support staff strike closes in on two weeks**\nOntario full‑time support staff at 24 colleges have been on strike since September 11, 2025 after failing to reach a new contract with the College Employer Council (CEC). A ministry‑appointed mediator has been assigned to help negotiate a settlement. Dayna Smockum, Director of Communications for the Ministry of Colleges, Universities, Research Excellence and Security, said the mediator is ready to support a fair resolution and that the goal is to put students first: 'We remain hopeful that all parties reach a fair deal that puts students first.' OPSEU Local 421 President Tim Prewer said picket lines allow only one vehicle at a time and that the college has not yet met with members; he also highlighted safety concerns and requested a meeting on the line: 'Members would like to be able to have multiple vehicles safely line up off of Wallbridge‑Loyalist Road and further along the college roadway.' CEC CEO Graham Lloyd said the council has offered more than $145 million in wage, benefit and job‑security improvements and is willing to meet in mediation on September 26, 2025, hoping to end the strike: 'Colleges have consistently bargained in good faith and have put forward more than $145 million in improved wages, benefits, and job security, and advised OPSEU of issues it cannot accept.' The strike is expected to close in about two weeks.\nOriginal language: en\nPublish date: September 24, 2025 02:26 PM\nSource:[91x.fm](https://91x.fm/2025/09/24/mediator-assigned-as-college-full-time-support-staff-strike-closes-in-on-two-weeks/)\n\n**Thousands of office workers face having to obey 72-hour rule in UK - Birmingham Live**\nA recent analysis of job postings on Indeed shows that 85% of UK hybrid roles now require employees to work at least two days a week in the office, up from 77% in 2024 and 66% in 2023. 56% of postings expect two office days, 25% require three days, and only 4% specify four days. 15% allow a single office day, down from 22% in 2024, 34% in 2023, and 35% in 2022.  Jack Kennedy, a senior economist at Indeed, said, 'What we're seeing is employers using the softer labour market to push for more face‑to‑face time, whether that's to encourage collaboration, rebuild office culture, or simply because they feel they can.'  A March study of 3,000 UK remote workers found that 67% felt disconnected from colleagues and 49% said this disconnection negatively affected their job perception.  A similar survey by Indeed reported that 45% of US remote workers missed in‑person meetings and 46% missed informal office conversations.\nOriginal language: en\nPublish date: September 24, 2025 06:00 AM\nSource:[Birmingham Mail](https://www.birminghammail.co.uk/news/cost-of-living/thousands-office-workers-face-having-32538009)\n\n**Zurich Debates 35‑Hour Work Week – Legal Questions Arise**\nThe Zurich city council debate over a 35‑hour work week for public employees has stalled after the finance director Daniel Leupi refused to extend the deadline. The motion, introduced by David Garcia Nuñez (AL) and Anna Graff (SP), seeks to reduce working hours to 35 per week while keeping full pay, targeting staff in the VBZ, police and care sectors. Leupi cited high costs and the risk that reduced hours could leave up to 1,500 specialists short. A legal opinion concluded that a pilot would constitute a 'massive Eingriff in das städtische Recht und insbesondere sein Lohnsystem' and that a statutory framework would be needed to comply with Article 8 of the Swiss Constitution. The motioners accused the council of a delay tactic and demanded the matter be referred to a commission. The council rejected the extension request, leaving Leupi to answer the commission. The debate echoes a 2023 pilot in hospitals where 70 assistant doctors worked 42 hours instead of 46. 45 % of Swiss workers reported that resources and burdens in their work life are just balancing, according to recent surveys. The motioners’ pilot would involve staff in shift work, such as those in the VBZ, police or care sector. Leupi warned that a reduction could result in a shortage of up to 1,500 specialists. The legal opinion noted that the city, as an employer, must treat all employees equally and that a pilot would be a 'massive Eingriff in das städtische Recht und insbesondere sein Lohnsystem'. The motioners’ request for a commission was rejected, and the council will now face questions from commission members.\nOriginal language: de\nPublish date: September 25, 2025 03:15 AM\nSource:[Neue Zürcher Zeitung](https://www.nzz.ch/zuerich/35-stunden-woche-fuer-staedtische-angestellte-zuercher-stadtrat-fuerchtet-juristische-probleme-al-wittert-eine-verzoegerungstaktik-ld.1903802)\n\n**/C O R R E C T I O N -- Insight Global/**\nInsight Global released its 2025 Employee Sentiment Report, revealing that only 35% of the 905 U.S. workers surveyed feel engaged at work and the same percentage feel essential in their roles. The survey, conducted by Atomik Research, found that 4 in 5 workers would stay longer in a role with better onboarding, 22% had left a job within the first 90 days—often due to poor training—and workers are 8 times more likely to feel engaged in a strong workplace culture. Respondents also reported that it takes 6–7 months to feel settled in their role. Brindy Pickett, Vice President of Consultant Engagement at Insight Global, said, 'A defined culture is not a nice‑to‑have. We've found it's a foundational driver of engagement, retention, and performance. If you're intentional about the culture you want, it breeds success.' The report recommends role‑specific onboarding, intentional culture‑building, and connecting daily work to a larger purpose to improve engagement and retention.\nOriginal language: en\nPublish date: September 24, 2025 04:45 PM\nSource:[Advanced Financial Network](https://uk.advfn.com/stock-market/share-news/C-O-R-R-E-C-T-I-O-N-Insight-Global/96879583)\n\n**Mediator assigned as college full-time support staff strike closes in on two weeks**\nOntario full‑time support staff at 24 colleges have been on strike since September 11, 2025 after failing to reach a new contract with the College Employer Council (CEC). A ministry‑appointed mediator has been assigned to help negotiate a settlement. Dayna Smockum, Director of Communications for the Ministry of Colleges, Universities, Research Excellence and Security, said the mediator is ready to support a fair resolution and that the goal is to put students first: 'We remain hopeful that all parties reach a fair deal that puts students first.' OPSEU Local 421 President Tim Prewer said picket lines allow only one vehicle at a time and that the college has not yet met with members; he also highlighted safety concerns and requested a meeting on the line: 'Members would like to be able to have multiple vehicles safely line up off of Wallbridge‑Loyalist Road and further along the college roadway.' CEC CEO Graham Lloyd said the council has offered more than $145 million in wage, benefit and job‑security improvements and is willing to meet in mediation on September 26, 2025, hoping to end the strike: 'Colleges have consistently bargained in good faith and have put forward more than $145 million in improved wages, benefits, and job security, and advised OPSEU of issues it cannot accept.' The strike is expected to close in about two weeks.\nOriginal language: en\nPublish date: September 24, 2025 02:26 PM\nSource:[91x.fm](https://91x.fm/2025/09/24/mediator-assigned-as-college-full-time-support-staff-strike-closes-in-on-two-weeks/)\n\n**Council to vote today on motion to rescind Ottawa's return-to-office mandate**\nOn September 24 2025, Ottawa City Council will vote on a motion to rescind the city’s return‑to‑office mandate that requires municipal employees to work five days a week in the office. City Manager Wendy Stephanson announced on August 26 that the mandate would take effect on Jan. 1, stating that a five‑day office standard would strengthen organizational culture and build public trust. Councillor Jeff Leiper will introduce a motion arguing that no evidence shows reduced productivity or taxpayer value under the current hybrid arrangement, and that a five‑day standard would not significantly improve either. The motion would direct the city manager to rescind the mandate and continue to accommodate hybrid work. Horizon Ottawa and several unions—including the Civic Institute of Professional Personnel, the Amalgamated Transit Union, the Canadian Association of Professional Employees and the Public Service Alliance of Canada—will rally outside City Hall to support Leiper’s motion. Tom Ledgley, Coordinator of Horizon Ottawa, said, 'Remote work technology and practices are well‑developed and effective,' and that studies show productivity remains strong when people work from home. Ottawa employs about 17,100 full‑time equivalent positions, with roughly 85 % of staff onsite each day. Stephanson clarified that alternative work arrangements will remain available, and that a regular on‑site presence is 'critical to help strengthen relationships, reinforce team norms, support formal systems and processes, facilitate ongoing knowledge transfer, support mentorship and succession planning, protect the integrity of our corporate memory, build confidence in the city's ability to deliver service excellence, and ultimately strengthen public trust.' The motion comes amid Ontario’s mandate that all members of the Ontario Public Service be in the office four days a week from November, and federal core public service employees must be in the office at least three days a week.\nOriginal language: en\nPublish date: September 24, 2025 12:29 PM\nSource:[Pulse24.com                        ](https://www.cp24.com/news/canada/2025/09/24/council-to-vote-today-on-motion-to-rescind-ottawas-return-to-office-mandate/)\n\n**985 Management Trainees Work 12‑Hour Shifts Daily – Wuling Responds to Recruitment Controversy**\nIn September 2025, a report from the \"Next‑Generation Vehicle Research Institute\" column revealed that Shanghai‑General‑Wuling (SGW) had recruited roughly 800 graduates from 985 and 211 universities as management trainees (管培生).  The trainees reported that, contrary to the 9‑to‑5, five‑day schedule advertised during campus recruitment, they were required to work from 8 a.m. to 8 p.m., six to seven days a week, for a continuous six‑month period before being assigned to a permanent role.  The company’s official statement acknowledged a 6‑month front‑line training period and claimed that a dual‑person rotation system had been introduced to reduce daily hours, but the trainees said the rotation had not yet been implemented.  The column quoted several trainees: ‘I was told the training would be 9‑5 for five days, but after two weeks of hard work I’ve been on the line for a month with no rotation or transfer notice.’  Experts warned that such prolonged, high‑intensity work could compromise product quality and lead to talent loss.  The article also highlighted SGW’s financial pressure: in the first half of 2025 SGW reported revenue of 404.82 billion yuan and a net profit of 5.76 billion yuan, yielding a net margin of only 1.42 %.  Over the past five years, SGW’s revenue has fluctuated while its profit margin has remained low, prompting the parent group to pursue a \"cost‑cutting and efficiency‑boosting\" strategy.  The column noted that the company’s heavy reliance on high‑intensity training for new graduates may backfire by damaging employee morale, product quality, and the firm’s reputation.\nOriginal language: zh\nPublish date: September 24, 2025 10:40 AM\nSource:[驱动之家](https://news.mydrivers.com/1/1076/1076695.htm)\n\n**The Great Flexpectation: 86% of UK workers demand flexible hours as four-day week and work-to-rule go mainstream, Owl Labs report reveals**\nThe Owl Labs State of Hybrid Work Report, released on 24 September 2025, surveyed 2,000 full‑time UK employees and found that 86 % demand flexible hours, with 93 % willing to leave a job that no longer allows remote or hybrid work. 41 % of workers attend the office three days a week, 27 % four days, and only 15 % would prefer full‑time office work. 51 % schedule personal appointments during work hours, and 35 % practice clock‑blocking to protect their time. 44 % have already engaged in work‑to‑rule, 35 % have clock‑blocked, and 44 % participate in coffee‑badging. 73 % view a four‑day week as an important benefit, and 45 % would give up 10 % or more of their salary for it. 79 % consider meetings after 4:30 pm too late, while 80 % of managers reject them. 68 % believe employers should provide more flexibility for those who need it most, such as working parents. 84 % overall say the ability to work in a range of locations is key to job satisfaction. 75 % of employers actively encourage AI adoption, and 87 % of employees already use AI at work.  ‘Our data demonstrates that hybrid working is no longer just about when and where we work. Rather, the rise in trends like coffee badging and work‑to‑rule demonstrates that UK employees are also looking for true fluidity in how they work,’ said Frank Weishaupt, CEO of Owl Labs. The report highlights that technology—especially AI tools, IT support and upgraded meeting room equipment—has become a top priority for organisations seeking to support flexible work arrangements.\nOriginal language: en\nPublish date: September 24, 2025 07:06 AM\nSource:[FinanzNachrichten.de](https://www.finanznachrichten.de/nachrichten-2025-09/66518288-the-great-flexpectation-86-of-uk-workers-demand-flexible-hours-as-four-day-week-and-work-to-rule-go-mainstream-owl-labs-report-reveals-004.htm)\n\n**Thousands of office workers face having to obey 72-hour rule in UK - Birmingham Live**\nA recent analysis of job postings on Indeed shows that 85% of UK hybrid roles now require employees to work at least two days a week in the office, up from 77% in 2024 and 66% in 2023. 56% of postings expect two office days, 25% require three days, and only 4% specify four days. 15% allow a single office day, down from 22% in 2024, 34% in 2023, and 35% in 2022.  Jack Kennedy, a senior economist at Indeed, said, 'What we're seeing is employers using the softer labour market to push for more face‑to‑face time, whether that's to encourage collaboration, rebuild office culture, or simply because they feel they can.'  A March study of 3,000 UK remote workers found that 67% felt disconnected from colleagues and 49% said this disconnection negatively affected their job perception.  A similar survey by Indeed reported that 45% of US remote workers missed in‑person meetings and 46% missed informal office conversations.\nOriginal language: en\nPublish date: September 24, 2025 06:00 AM\nSource:[Birmingham Mail](https://www.birminghammail.co.uk/news/cost-of-living/thousands-office-workers-face-having-32538009)\n\n**UK white-collar recruits expected in office more as hybrid working balance shifts**\nThe Guardian article reports that UK white‑collar job adverts now demand more in‑office days than during the post‑pandemic period. 85 % of hybrid roles posted on Indeed require at least two days a week in the office, up from 77 % in 2024 and 66 % in 2023. 56 % of postings expect two office days, 25 % require three, and only 4 % specify four days. 15 % allow a single office day, down from 22 % in 2024 and 34 % in 2023.  Accounting roles average 2.4 office days, HR and IT 2.3, software developers 2.3 (an increase of 0.6 days since 2023), while architecture and social science roles average 1.6 days.  Regional variation shows the north‑east England requiring 2.7 days, Wales and south‑west England 2.3, London and Scotland 2.2.  Amazon now mandates a full five‑day office schedule.  In response, some employers offer a casual office dress code, which is 10 × higher as of July 2025 than before 2020, yet remains only 3.3 % of UK postings.  Jack Kennedy, a senior economist at Indeed, said: 'What we're seeing is employers using the softer labour market to push for more face‑to‑face time, whether that's to encourage collaboration, rebuild office culture, or simply because they feel they can. But workers continue to prize flexibility, and many will think carefully before accepting roles that don't offer it.'\nOriginal language: en\nPublish date: September 24, 2025 05:00 AM\nSource:[The Guardian](https://www.theguardian.com/money/2025/sep/24/uk-jobs-back-to-office-hybrid-working)\n\n**SAIC‑GM‑Wuling Autumn Recruitment Sparks Controversy as 985 Management Trainees Complain of 12‑Hour Shifts: Feeling Deceived**\nSAIC‑GM‑Wuling’s 2025 management‑training cohort, comprising about 800 graduates from 985 and 211 universities, reported that the company’s recruitment promises were not met. The company advertised a '955' work system (9 am–5 pm, five days a week) and a 1‑to‑3‑month on‑the‑job training period. Instead, trainees were sent to the Liuzhou plant’s assembly line where they work from 8 am to 8 pm, six to seven days a week, for 12 hours per day. One trainee said, '每天从早8点干到晚8点，一周工作六至七天，已经在产线待了一个月，没听到任何轮岗、调离的消息。' The company replied that the training period had been adjusted to six months and that shift rotation would reduce daily hours, but trainees claim the adjustment was only announced after they had begun work. Several trainees have resigned or are preparing for graduate school, and a few have reported injuries. Parents have expressed dissatisfaction, saying the company’s approach 'does not care about employees' and is not humane. Experts note that tasks such as screw tightening and body polishing require skilled workers and that long, high‑intensity shifts can lead to errors and safety risks.\nOriginal language: zh\nPublish date: September 24, 2025 02:07 AM\nSource:[驱动之家](https://news.mydrivers.com/1/1076/1076530.htm)\n\n**Address Discrimination (Especially Given RTO), and Other Actions for Allies**\nReturn‑to‑office (RTO) mandates are rising, with Microsoft announcing that beginning February 2026 many employees will be required to work from the office at least three days a week. The newsletter cites research by Laura Doering, PhD and András Tilcsik, PhD that shows women in hybrid roles experience higher rates of bias, exclusion and discrimination, especially younger women or those in male‑dominant teams. The author urges allies to confront discrimination rather than 'pushing women into remote roles as a way of trying to get around the issue.' Hady Méndez’s book *Calladita No More* is highlighted, with her quote: 'I find that when I partner with people that think differently, we end up with an even greater outcome. It is like the idea that 1 + 1 – 3.' The newsletter discusses the 'Let Them' theory controversy, noting Cassie Phillips’ 2022 poem and Mel Robbins’ 2023 book, and encourages proper attribution. A Facebook post by '30AF' is quoted: 'PSA for employers in 2025: Don’t Mind the Gap. Seriously. It doesn’t matter. If the job candidate has background experience that qualifies them for the role and their interview ticks the boxes of who you want in this position, the fact that they didn’t work for 8 months 5 years ago is equal parts irrelevant and none of ur business.' The author recommends inclusive hiring practices, citing an EEO statement that explicitly mentions ‘length of time spent unemployed.’ Ben Swanson shares an ally action: sending interview questions in advance and copying them into the chat for candidates with auditory processing challenges. The newsletter ends with a call to action for readers to share their ally steps.\nOriginal language: en\nPublish date: September 19, 2025 01:13 PM\nSource:[Code Like A Girl](https://code.likeagirl.io/address-discrimination-especially-given-rto-and-other-actions-for-allies-3f01a9ac0fe6)\n\n**PERSOL Global Workforce and Shareful Co‑host Seminar on 9/26**\nPERSOL Global Workforce Co., Ltd. and Shareful Co., Ltd. announced a joint seminar scheduled for Friday, September 26 2025, to address the acute labor shortage in Japan’s food‑service sector. The seminar, titled \"New Norms in a Recruitment‑Hard Era: Hybrid Human‑Resource Strategy Using Skima‑Baito and Foreign Talent to Resolve Staffing Shortages in Restaurants,\" will be held online via Zoom from 14:00 to 15:00 and is free for pre‑registered participants. The target audience is HR and recruitment professionals who are concerned about future staffing shortages, current hiring difficulties, or overall recruitment challenges.\n\nBackground: According to a 2023 study by the Persol Research Institute and Chuo University, Japan’s labor demand in 2030 is projected at 70.73 million workers, while supply is expected to be only 64.29 million, creating a shortfall of 6.44 million workers. The seminar will discuss how short‑term gig work (Skima‑Baito) and foreign‑worker recruitment can help mitigate this gap, especially in the restaurant industry.\n\nKey details:\n- Date & time: 2025‑09‑26, 14:00–15:00\n- Format: Zoom webinar\n- Cost: Free (pre‑registration required)\n- Speakers: Sato Daisuke, Director of Sales at PERSOL Global Workforce; Terashima Shunichiro, General Manager of Shareful’s First Sales Division.\n- Shareful’s Skima‑Baito app currently serves about 10 million users, connecting individuals seeking short‑term work with companies needing temporary staff.\n\nBoth companies highlighted their missions: PERSOL Global Workforce focuses on supporting foreign talent under the \"Special Skill\" and \"Technical/Intellectual/International Business\" visa categories, while Shareful aims to expand the labor‑sharing market by enabling quick, one‑day hiring without resumes.\n\nThe seminar will feature real‑world case studies illustrating how combining gig workers and foreign talent can alleviate staffing shortages in restaurants.\n\nFor more information, participants can register at https://s.sharefull.com/lp/wp/webinar_250926/index.html.\nOriginal language: ja\nPublish date: September 19, 2025 02:40 AM\nSource:[ASCII.jp](https://ascii.jp/elem/000/004/320/4320988/)\n\n**Shark Tank's Kevin O'Leary disagrees with Microsoft on key issue**\nThe article reports that Microsoft (MSFT) will require employees living within 50 miles of its Redmond, Washington headquarters to work onsite at least three days per week by February 2026, aligning the company with other large employers such as Meta, Google, JPMorgan, and Amazon that have tightened return‑to‑office (RTO) policies. Microsoft has laid off more than 15,000 workers since early 2025, and the RTO mandate is seen by some as a tool for workforce reduction. The policy will affect 53,000 employees based at the Redmond campus, potentially increasing traffic in the Puget Sound area. Kevin O’Leary, a Shark Tank investor, publicly criticized the 9‑to‑5 office model, stating on LinkedIn: 'I don't believe in the 9 to 5 job market any more. None of my team works in an office any more because they don't want to. We have people working for us all around the world. We somehow are very, very productive and that's the new economy.' He added, 'I don't care when you get it done. I don't care if it's two in the morning or eight in the morning. There is no 9 to 5. Just get it done by the deadline.' The article notes that RTO policies are increasingly used as a performance metric and a subtle way to prompt resignations or terminations. It also highlights criticism of Microsoft’s continued H1‑B visa hiring amid layoffs and the broader national trend of shifting away from remote work as a default.\nOriginal language: en\nPublish date: September 15, 2025 12:08 AM\nSource:[TheStreet](https://www.thestreet.com/personal-finance/shark-tanks-kevin-oleary-disagrees-with-microsoft-on-key-issue)\n\n**End of Home Office in 2025? Understanding the Current Scenario**\nThe article discusses the possible end of home office in Brazil by 2025, highlighting a growing trend toward in‑person work among large companies while noting that remote work remains highly valued by employees. According to a survey by Grupo Top RH with Infojobs, '85,3% of Brazilian professionals would change jobs for more remote days per week', indicating strong demand for flexibility. Market data from Gupy shows that only '5% of job postings in June 2024 were fully remote', compared with '87,2% that were in‑person', and the number of in‑person hires rose from 55,000 in April 2023 to 87,000 in April 2024. The IBGE reports that just '8,3% of Brazilian workers work exclusively remotely'. Major global firms such as Amazon and Apple have already implemented partial return policies, requiring employees to be in the office at least three days a week. The article warns that abrupt termination of remote work can lead to employee resistance, lower motivation, higher turnover, and deteriorating workplace culture. It also outlines the legal framework under Brazil’s Consolidated Labor Laws (CLT), which allows employers to mandate a return to the office with a minimum 15‑day notice and a contractual addendum, but employees may retain remote work if health risks are proven. Finally, the piece suggests hybrid work as a balanced solution, citing ABRH Brasil research that shows hybrid models are as popular as fully in‑person arrangements. The article is presented in an objective, data‑driven tone without editorial bias.\nOriginal language: pt\nPublish date: September 14, 2025 02:00 PM\nSource:[Portal Contabeis](https://www.contabeis.com.br/noticias/72785/fim-do-home-office-em-2025-entenda-o-cenario-atual/)\n\n**Korean Student Aid Foundation hires 33 new staff and 2 part‑time workers**\nOn August 22, 2025, the Korean Student Aid Foundation (한국장학재단) announced that it will recruit 33 new full‑time employees and 2 new part‑time workers for the 2025 general staff hiring and the 2025 second‑half open hiring. The 33 full‑time positions are divided into 23 general administration (5th grade), 5 IT development & operation, 2 information security, and 3 6th‑grade administrative support. The two part‑time positions are one field‑training support project manager and one central employment support center operations assistant. The foundation increased the general staff quota by 50 % from last year and introduced a new information‑security role. It also plans to give extra points to candidates with disabilities, veterans, and self‑reliance‑preparation youth, and to target talent from Daegu, Gyeongbuk, and other non‑metropolitan areas. Applications close September 4 at 6 p.m. on the foundation’s recruitment website. The full‑time selection process will include written test, written exam in late September, practical interview in late October, and in‑depth interview in early November, with final results announced November 14. The part‑time process will have written test in early September, interview in mid‑September, and final results announced September 30.\nOriginal language: ko\nPublish date: August 22, 2025 02:02 AM\nSource:[아시아경제](https://www.asiae.co.kr/article/2025082211010182433)\n\n**Gyeonggi Province Job Foundation Releases Report on 0.5&0.75 Job Program**\nThe Gyeonggi Province Job Foundation has released a report on the '0.5&0.75 job' program, which allows public institution employees to work 20-38 hours a week. The report found that participants used the program for various reasons, including self-development (48%), childcare and education (28%), and health and leisure. The program's 'hybrid' work system, which allows employees to work 32-38 hours a week without adjusting their workload, was highly praised by users. However, the report also noted that the program's entry barrier is the reduction in wages, with 44% of respondents expressing negative opinions on continuing to use the program after the wage support ends. The report concludes that the program's success depends on the organization's culture, and that a mutual understanding and respect culture is essential for the program's successful implementation. 'The 0.5&0.75 job program is not just a simple work-time reduction policy, but a effective alternative for achieving work-life balance,' said Kim Min-young, a researcher at the Gyeonggi Province Job Foundation. 'As it is a new type of work system, it is necessary to encourage the use of the program through some support, such as wage support, until the program is fully established.'\nOriginal language: ko\nPublish date: August 07, 2025 10:26 PM\nSource:[아시아경제](https://www.asiae.co.kr/article/2025080807264586286)\n\n**Gyeonggi Province Selects 47 Additional Companies for 4.5-Day Workweek Pilot Project**\nGyeonggi Province and the Gyeonggi Province Job Foundation announced the selection of 47 additional companies for the '2025 Gyeonggi 4.5-day workweek pilot project' through the second round of recruitment. The province initially selected 50 companies, but received 105 applications, leading to a second round of recruitment. The second round saw 54 companies apply, with 47 being selected as 4.5-day workweek pilot companies. The selected companies include 25 small and medium-sized enterprises with 10-30 employees, 19 with 30-100 employees, and 3 with over 100 employees. The pilot project aims to reduce working hours through labor-management agreements, without reducing wages, and to create a healthy work environment. The selected companies will receive up to 260,000 KRW per employee per month in wage preservation incentives and up to 20 million KRW in support for improving work processes, consulting, and attendance management systems. Gyeonggi Province Labor Director Choi Hong-gyu said, 'We appreciate the high interest and active participation of companies in the second round of recruitment' and 'expect the project to contribute to improving the work-life balance of workers and enhancing the competitiveness of companies.' The province plans to continue recruiting and selecting companies to promote the 4.5-day workweek and measure its effectiveness.\nOriginal language: ko\nPublish date: July 15, 2025 10:23 AM\nSource:[아시아경제](https://www.asiae.co.kr/article/2025071519233807611)\n\n**AI talent war: OpenAI executives slam Meta's aggressive hiring approach - The Economic Times**\nThe war for AI talent is intensifying between Meta and OpenAI. Mark Zuckerberg's Meta has been aggressively hiring and offering signing bonuses as high as $100 million to OpenAI employees, including top researchers. OpenAI's chief research officer, Mark Chen, has addressed Meta's tactics in a memo to employees, saying 'I feel a visceral feeling right now, as if someone has broken into our home and stolen something.' Chen also stated that OpenAI is 'recalibrating comp' and 'scoping out creative ways to recognise and reward top talent.' The report notes that OpenAI staff are working long hours, with some employees working 80 hours per week, and the company is shutting down next week to give employees time to recharge. However, Chen warned that Meta may try to poach top talent during this time, saying 'Meta knows we're taking this week to recharge and will take advantage of it to try and pressure you to make decisions fast and in isolation.'\nOriginal language: en\nPublish date: June 30, 2025 07:09 AM\nSource:[Economic Times](https://economictimes.indiatimes.com/tech/artificial-intelligence/ai-talent-war-openai-executives-slam-metas-aggressive-hiring-approach/articleshow/122155120.cms)\n\n**Emplois d'été Canada 2025: A Program to Support Young People**\nThe Emplois d'été Canada (EEC) program is part of the Stratégie emploi et compétences jeunesse (SECJ), a horizontal initiative of the Government of Canada implemented jointly by 12 federal ministries, organizations, and state-owned companies. The SECJ helps young people (15-30 years old), particularly those facing employment obstacles, to obtain employment support, skill-based training, and professional experience needed to integrate the labor market. The EEC program, administered by Emploi et Développement social Canada, provides salary subsidies to non-profit and public sector employers, as well as private sector organizations with 50 or fewer full-time employees, to offer quality summer jobs to young people aged 15-30. The funded jobs allow young people to improve their skills or acquire new ones. For many young people, it is their first work experience, which will influence their future education and career choices. The program takes into account national and local priorities, as well as labor market needs. Projects that support young people facing employment obstacles are prioritized, including those with disabilities, Indigenous youth, Black or 2ELGBTQI+ youth, and youth from racialized groups, rural or remote communities, or minority language communities. By offering young people equal opportunities to improve their skills, EEC facilitates their success in the labor market. The jobs funded by the EEC program are full-time (30-40 hours per week) and last 6-16 weeks, with an average of 8 weeks at 35 hours per week. The hiring period for young people for 2025 runs from April 21 to July 21, 2025, and the jobs will end no later than August 30, 2025. Up to 76,000 jobs counting for young people and our communities will be posted on the Government of Canada's Job Bank website and mobile app, which will be regularly updated. Young people can therefore frequently check the Job Bank to see which new jobs are offered in their community.\nOriginal language: fr\nPublish date: June 06, 2025 05:21 PM\nSource:[Government of Canada](https://www.canada.ca/fr/emploi-developpement-social/nouvelles/2025/06/document-dinformation--emplois-dete-canada-2025.html)\n\n",
    "date": "2025-09-26T01:06:14.392017",
    "summary": "Across all expert perspectives—ranging from nonprofit administration, management, labor economics, and organizational sociology—the consensus is that the Forethought Foundation is very likely to have two or fewer full-time equivalent (FTE) employees at the end of 2025. The main reasoning includes: the Foundation’s historical reliance on a lean core staff (typically 1–2 FTEs) supplemented by contractors, part-timers, or academic collaborators; absence of recent public announcements about expansion, large new grants, or active hiring; sector norms in the Effective Altruism and academic think tank spaces, which tend to favor flexibility and low overhead; and rigorous resolution criteria that exclude volunteers and count only employees working at least 35 hours per week.\n\nWhile all experts acknowledged a nonzero probability that a late-year funding windfall or major program launch could spur a rapid increase in FTEs, there was no public evidence of such developments. The possibility of organizational abandonment—with FTEs dropping to zero—was deemed unlikely given the Foundation’s ongoing activity, but would also resolve the question negatively.\n\nProbabilities assigned to the chance of the Foundation having more than two FTEs by the end of 2025 clustered consistently in a low range (12% to 20%), with most responses between 15% and 18%. In summary, absent surprise funding or a public pivot, experts strongly expect the Foundation to continue its status quo of a very small full-time staff, and the likelihood of exceeding two FTEs in 2025 is considered low.",
    "forecasters": [
        "Nonprofit Administration (IRSForm990StaffingStandards)",
        "Nonprofit Administration (CharityNavigatorEvaluationCriteria)",
        "Human Resources (WorkforcePlanningBestPractices)",
        "Organizational Sociology (ResourceDependenceTheory)",
        "Organizational Sociology (InstitutionalIsomorphism)",
        "Nonprofit Management (LifeCycleModelNonprofits)",
        "Nonprofit Management (SocialEnterpriseTheory)",
        "Labor Economics (TheoryOfLaborDemand)",
        "Labor Economics (ScaleEconomiesTheory)"
    ]
}