{
    "deliberation_results": {
        "Nonprofit Operations (BoardSource Governance Model)": {
            "time_to_resolution": "Approximately 3 months until January 1, 2026",
            "perspective_relevance": "As an expert in Nonprofit Operations (BoardSource Governance Model), I bring a nuanced understanding of nonprofit organizational structures, operational scaling, board oversight, talent management, and funding dynamics—core elements in determining whether a nonprofit like Nonlinear Fund will grow its staff to a specified threshold within a set timeframe.",
            "status_quo": "The status quo is that the Nonlinear Fund is a small, recently formed nonprofit focused on AI safety research and incubation, with ambiguous and limited public information about its current staffing. Absent major changes, nonprofits in this space tend to remain lean, often under 10 FTEs within their first few years.",
            "perspective_derived_factors": [
                {
                    "factor": "Nonprofit Growth and Scaling Patterns",
                    "effect": "Decreases probability. Historically, new nonprofits in technical/EA-adjacent domains grow slowly unless they secure substantial, multi-year funding. Most remain under 10 FTEs for several years unless they have outsized success or need for rapid scaling."
                },
                {
                    "factor": "Funding Availability and Donor Confidence",
                    "effect": "Decreases probability. The AI safety funding ecosystem has become more cautious following controversies, with major donors scrutinizing governance and operational transparency. Without evidence of a recent large grant or explicit scaling plan, aggressive hiring is unlikely."
                },
                {
                    "factor": "Board Governance and Risk Appetite",
                    "effect": "Decreases probability. BoardSource principles emphasize prudent growth and risk management, especially in nonprofits reliant on restricted funding. Boards are typically wary of scaling headcount rapidly due to sustainability concerns."
                },
                {
                    "factor": "Sector-specific Trends (AI Safety/EA Movement)",
                    "effect": "Decreases probability. Recent scandals and increased donor due diligence in the EA and AI safety space have led to slower growth, more focus on accountability, and sometimes contraction or consolidation rather than expansion."
                },
                {
                    "factor": "Labor Market and Work Culture Trends",
                    "effect": "Marginal. While some startups are adopting extreme work cultures (996), nonprofits, especially those with international staff or academic origins, tend to offer more flexible or hybrid arrangements. The ability to attract 9+ FTEs is more constrained by funding than by willingness to work long hours."
                },
                {
                    "factor": "Transparency and Reporting Requirements",
                    "effect": "Decreases probability. The resolution criterion requires public evidence of 9+ FTEs. Many small nonprofits do not provide detailed, up-to-date staffing info, and unless there is a deliberate push to publicize growth, lack of evidence will favor a 'No' resolution."
                }
            ],
            "no_scenario": "Nonlinear Fund continues operating with a small team, possibly expanding to 5-8 FTEs, focuses on a few core projects, and either does not receive or does not publicly announce a major scaling grant. No public information demonstrates 9+ FTEs as of January 1, 2026. Alternatively, the org contracts or is dormant, further reducing FTEs.",
            "yes_scenario": "Nonlinear Fund secures a major multi-year grant or partnership (e.g., from Open Philanthropy, Survival and Flourishing Fund, or similar), launches ambitious new programs, and publicly announces a significant hiring round, resulting in public confirmation of 9 or more FTEs by January 1, 2026.",
            "final_reasoning": "The base rate for early-stage nonprofits in technical/EA-adjacent areas surpassing 8 FTEs within 3-4 years is low, typically under 20-25%. No public evidence suggests Nonlinear Fund has recently received a transformative grant or has announced aggressive hiring. Sector trends and BoardSource governance principles both caution against rapid, unsustainable expansion absent clear, recurring revenue. The resolution requires public evidence, which further decreases the probability since many nonprofits do not publicize granular staffing data unless there is a strategic reason. The news articles do not reference Nonlinear Fund specifically, nor do they indicate a sector-wide hiring boom. All these factors, combined with the strong status quo bias (small, slow-growing orgs remain small), lead me to estimate a probability at the lower end but not at zero, to account for the possibility of a late-year funding surprise or strategic shift.",
            "final_probability": 17
        },
        "Human Resources Management (Workforce Planning)": {
            "time_to_resolution": "Approximately 3 months until January 1, 2026.",
            "perspective_relevance": "As an expert in Human Resources Management (Workforce Planning), I bring an understanding of the drivers behind workforce scaling in early-stage organizations, especially in mission-driven and grant-funded spaces like AI safety. My expertise allows me to analyze signals of organizational growth, the impact of market and funding environments, and operational scaling constraints—factors that directly affect FTE headcount at small, non-profit research incubators such as the Nonlinear Fund.",
            "status_quo": "Status quo is that the Nonlinear Fund remains a small organization with a lean team, likely below or near the 8 FTE threshold, focusing on maximizing impact with minimal staff, as is common for early-stage AI safety efforts. If nothing changes, the organization maintains or only modestly increases headcount, remaining at or below 8 FTE.",
            "perspective_derived_factors": [
                {
                    "factor": "Funding Environment",
                    "effect": "Decreases probability. The Effective Altruism and AI safety funding ecosystem has faced significant scrutiny and contraction since 2022, especially post-FTX collapse and reputational issues. New grants are harder to secure, making aggressive hiring less likely barring major new fundraising success."
                },
                {
                    "factor": "Organizational Maturity and Mission Focus",
                    "effect": "Decreases probability. Early-stage research incubators in niche fields commonly operate lean, scaling talent slowly to avoid mission drift and overextension. Unless a large-scale project or program expansion has been announced, rapid hiring is atypical."
                },
                {
                    "factor": "AI Startup Labor Market Trends",
                    "effect": "Marginally increases probability. The news on U.S. startups adopting extreme work hours (996 system) suggests a willingness in the AI sector to push harder for impact. If Nonlinear Fund follows this trend or leverages remote/hybrid or intense work cultures, they could achieve more output per FTE, reducing the need to hire up to or beyond 9 FTE."
                },
                {
                    "factor": "Transparency and Public Reporting",
                    "effect": "Decreases probability. The resolution requires public disclosure of headcount. Many small nonprofits prefer not to publicize staff growth unless seeking to signal expansion to funders, which can limit available evidence of >8 FTE even if borderline."
                },
                {
                    "factor": "Base Rate for Similar Organizations",
                    "effect": "Decreases probability. Historical base rates for early-stage EA/AI safety incubators (e.g., similar organizations tracked on Metaculus) show most remain well below 10 FTE for several years post-founding unless backed by exceptional funding or urgent programmatic expansion."
                },
                {
                    "factor": "Risk of Organizational Turbulence or Abandonment",
                    "effect": "Decreases probability. The field has seen significant turbulence (leadership changes, funding shocks, reputational crises). The question will resolve \"No\" if the project is clearly abandoned, which is an additional risk factor in this domain."
                }
            ],
            "no_scenario": "Nonlinear Fund continues operating with a core team of 4-7 FTE, utilizing contractors, fellows, or volunteers as needed, and does not announce a major scale-up or receive a large new grant. Alternatively, the organization becomes defunct or is quietly sunsetted in the face of funding or reputational difficulties, with public information confirming less than 9 FTE or abandonment.",
            "yes_scenario": "Nonlinear Fund secures a significant new funding round or partnership, announces a large-scale research or incubation program, and transparently reports a headcount of 9 or more FTE (exclusive of volunteers/part-timers) as of January 1, 2026, likely as part of a public-facing update to signal growth and attract further funding.",
            "final_reasoning": "Base rates for small, mission-driven AI safety organizations suggest a strong tendency to remain lean, especially in an environment where funding is constrained and the field is under increased scrutiny. The broader trend toward intense work cultures in the AI sector does not directly incentivize large staff expansion for nonprofits, as they can achieve more with fewer highly committed staff. No recent news or evidence suggests Nonlinear Fund has announced a major growth phase or received transformative funding. The additional risk of organizational abandonment or contraction further lowers the likelihood. Taking into account the public reporting requirement and the lack of signals indicating imminent scaling, the probability of Nonlinear Fund having more than eight FTEs on January 1, 2026 is low, though not negligible if an unexpected funding windfall or program expansion occurs in Q4 2025. Overall, the best estimate is that Nonlinear Fund remains at or below the threshold.",
            "final_probability": 17
        },
        "Organizational Sociology (Resource Dependence Theory)": {
            "time_to_resolution": "Approximately 3 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Organizational Sociology with deep knowledge of Resource Dependence Theory (RDT), I analyze how organizations respond to resource constraints, dependencies, and the competitive environment. This lens is especially relevant for a small, grant-dependent nonprofit like the Nonlinear Fund, which operates in a competitive field (AI safety) with uncertain funding streams and strong reputational pressures. RDT emphasizes how organizations shape their structures, staffing, and strategies to secure critical resources (funding, legitimacy, talent) and manage dependencies.",
            "status_quo": "As of late 2025, the Nonlinear Fund is a small incubator in the AI safety space, reportedly with a lean staff. There are no recent public announcements indicating rapid expansion, and most similar EA/AI safety orgs remain small and highly sensitive to funding and reputation cycles. Absent major new developments, the Fund is likely to remain at or below 8 FTEs.",
            "perspective_derived_factors": [
                {
                    "factor": "Funding Environment and Resource Flows",
                    "effect": "Decreases probability. The EA/AI safety funding landscape has become more cautious after recent scandals and market volatility. Most new grants are risk-averse, focused on due diligence, and large staffing expansions are rare unless there is a major new funder or project. Without evidence of a large new grant, rapid headcount growth is unlikely."
                },
                {
                    "factor": "Reputational Risks and Sector Dynamics",
                    "effect": "Decreases probability. The Nonlinear Fund has faced public controversy and scrutiny in the past. In the EA/AI safety sector, organizations facing reputational questions often shrink or freeze hiring to reduce risk, rather than expand aggressively, especially if their legitimacy is at stake."
                },
                {
                    "factor": "Strategic Response to Resource Dependency",
                    "effect": "Decreases probability. RDT suggests small nonprofits under resource constraints will minimize fixed costs (like payroll) and instead rely on contractors, part-timers, or collaborations to remain agile. This is especially true when future funding is uncertain."
                },
                {
                    "factor": "Sectoral Base Rates for Similar Organizations",
                    "effect": "Decreases probability. Incubators and meta-orgs in the EA/AI safety space (e.g., Lightcone, Longview, SERI, AI Objectives Institute) very rarely exceed 8 FTEs unless they are well-established or have a stable long-term endowment."
                },
                {
                    "factor": "External Labor Market and Remote/Hybrid Trends",
                    "effect": "Slightly increases probability. The AI sector is experiencing labor market churn and some orgs are experimenting with aggressive hiring and long work hours, but these are mostly for-profit startups, not nonprofits, and often involve over-hiring engineers, not general nonprofit staff."
                },
                {
                    "factor": "Recent News/Disclosures from Nonlinear Fund",
                    "effect": "Neutral or decreases probability. No public signals or announcements indicate a major ramp-up; if anything, the organization has been less visible since reputational controversies."
                }
            ],
            "no_scenario": "The Fund continues to operate with a core team (likely under 8 FTEs), possibly with some part-time/contract staff, but does not announce or document 9+ FTEs by January 1, 2026. Alternatively, the organization goes dormant or is unofficially wound down due to lack of funding or persistent reputational issues.",
            "yes_scenario": "The Fund announces a major new grant or partnership in Q4 2025, and rapidly hires a large number of full-time staff (e.g., to launch a new initiative or scale up operations). Public documentation (website, org chart, payroll info) confirms 9+ FTEs as of January 1, 2026.",
            "final_reasoning": "The base rate for small, grant-dependent AI safety nonprofits to grow to 9+ FTEs within a short period, especially after reputational controversy, is extremely low. Resource Dependence Theory strongly predicts risk aversion, cost minimization, and a reluctance to commit to fixed payroll expansion without secure long-term funding. The current news contains no evidence of a major new resource influx or organizational pivot by the Nonlinear Fund. The broader sector trend is toward cautious growth, not aggressive scaling, especially for organizations under reputational scrutiny. While there is a general sectoral trend of over-hiring in for-profit AI, this is not directly relevant for Nonlinear Fund's nonprofit context. Therefore, the probability of Nonlinear Fund having more than 8 FTEs on January 1, 2026, is very low barring an unforeseen major development.",
            "final_probability": 7
        },
        "Organizational Sociology (Population Ecology Theory)": {
            "time_to_resolution": "About 3 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Organizational Sociology (Population Ecology Theory), my perspective centers on how organizations emerge, grow, and survive or die in response to environmental conditions, resource constraints, and competition. The Nonlinear Fund operates in a competitive, resource-dependent ecosystem (AI safety/EA funding), and its workforce size is a direct function of ecological pressures, niche availability, and organizational legitimacy. Population ecology theory emphasizes inertia, liability of newness, and resource partitioning—all crucial for assessing whether a small, young organization will expand or contract its staff.",
            "status_quo": "The Nonlinear Fund is a small, relatively recent organization in AI safety. As of past public updates (2023–2024), it reportedly had a handful of employees, with no strong indications of rapid scaling. Barring major changes, the default is that it will have 8 or fewer FTEs on Jan 1, 2026.",
            "perspective_derived_factors": [
                {
                    "factor": "Liability of Newness and Smallness",
                    "effect": "Decreases probability. New and small organizations face higher risks of disbandment and slower growth due to lack of established routines, legitimacy, and resource buffers."
                },
                {
                    "factor": "Resource Dependence and Funding Volatility",
                    "effect": "Decreases probability. The AI safety/EA funding environment has become more competitive and selective, with increased scrutiny on project impact and management, making rapid staff growth less likely without clear, sustained inflows."
                },
                {
                    "factor": "Sectoral/Field Dynamics and Niche Partitioning",
                    "effect": "Neutral to slightly decreasing probability. AI safety is experiencing a proliferation of small, specialized organizations rather than consolidation into large ones. This tends to favor staying small and nimble."
                },
                {
                    "factor": "Organizational Inertia",
                    "effect": "Decreases probability. Once organizations find a viable size and niche, especially under funding constraints, they tend to maintain status quo rather than rapidly expand."
                },
                {
                    "factor": "Recent Trends in Work Culture and Employment Practices",
                    "effect": "Slightly increases probability. The rise of extreme work cultures (e.g., 996) and the ability for knowledge orgs to extract more FTE-hours per head could, in principle, allow small orgs to maintain output with fewer people, but also creates the potential for rapid staff increases if trying to scale impact in a competitive field."
                },
                {
                    "factor": "Public Scrutiny and Reputational Risk in EA/AI Safety",
                    "effect": "Decreases probability. Recent scandals and increased demands for transparency in the EA/AI safety space make organizations less likely to hire aggressively without clear justification."
                }
            ],
            "no_scenario": "The Nonlinear Fund maintains its current scale, either due to steady but limited funding, a deliberate choice to stay nimble, or inability to justify/fund new hires. Alternatively, organizational difficulties or public controversies constrain growth, resulting in 8 or fewer FTEs on January 1, 2026.",
            "yes_scenario": "The Nonlinear Fund secures significant new funding or a surge in project activity, necessitating rapid hiring to execute on new grants or initiatives. Alternatively, a strategic pivot (e.g., incubating multiple AI safety projects in-house) compels a staff increase, pushing FTEs to 9 or more by the resolution date.",
            "final_reasoning": "Population ecology theory predicts that most young, resource-dependent organizations remain small or exit the field rather than scaling rapidly, absent a major influx of resources or a shift in ecological opportunity. The current AI safety/EA landscape is funding-constrained and risk-averse, with a trend toward small, specialized orgs. There is no public signal of major expansion at Nonlinear Fund. The base rate for small, early-stage nonprofits crossing the 8+ FTE threshold within 3 years is low—typically under 25%. Given the lack of news suggesting imminent growth, but acknowledging a small chance of a step-change in funding/activity, the probability of Nonlinear Fund having more than 8 FTEs on Jan 1, 2026 is low, but not negligible.",
            "final_probability": 17
        },
        "Nonprofit Management (Nonprofit Lifecycle Model)": {
            "time_to_resolution": "Approximately 3 months until January 1, 2026",
            "perspective_relevance": "As an expert in Nonprofit Management and the Nonprofit Lifecycle Model, I bring a nuanced understanding of organizational capacity, growth trajectories, staffing patterns, and risk factors common to new and mid-stage nonprofit initiatives—especially in the highly dynamic AI safety space. This expertise allows me to evaluate whether Nonlinear Fund is likely to scale staff above the 8 FTE threshold by the target date, given both sector trends and unique organizational challenges.",
            "status_quo": "Nonlinear Fund is a small, relatively new AI safety-focused nonprofit incubator. As of early 2024, there were no public indications of staff growth to 9+ FTEs. If nothing changes, the organization would likely remain at or below 8 FTEs, or possibly stagnate or contract due to sector volatility.",
            "perspective_derived_factors": [
                {
                    "factor": "Nonprofit Lifecycle Stage",
                    "effect": "Decreases probability—Nonlinear Fund is still in the early-to-mid phase, where most nonprofits stabilize before major scaling. Scaling up to 9+ FTEs in such a short time is uncommon without a major funding or programmatic shift."
                },
                {
                    "factor": "Sectoral Funding Environment",
                    "effect": "Decreases probability—The broader EA and AI safety funding environment has been turbulent since the FTX collapse, with funders becoming more risk-averse and scrutinizing grantees more closely, limiting rapid staff expansion."
                },
                {
                    "factor": "Public Controversy and Reputation Risk",
                    "effect": "Decreases probability—Nonlinear Fund faced significant public allegations and controversies in 2023, which likely dampened donor enthusiasm and made large-scale hiring riskier."
                },
                {
                    "factor": "Incubator Model Staff Needs",
                    "effect": "Decreases probability—Incubators often scale through networks, contractors, and project-based roles rather than large FTE staff increases; FTE thresholds are hard to cross without a change in model."
                },
                {
                    "factor": "AI Safety Talent Pool and Recruitment Trends",
                    "effect": "Neutral to slightly increases probability—There is strong interest in AI safety, and talent is available, but most individuals seek established organizations or flexible/remote, project-based work."
                },
                {
                    "factor": "Recent Macro Trends in Work Culture (e.g., 996, Return to Office)",
                    "effect": "Neutral—While some startups are pushing extreme work hours, nonprofits in EA/AI safety tend to avoid such models, and this trend is not strongly correlated with FTE headcount increases in this sector."
                }
            ],
            "no_scenario": "Nonlinear Fund continues operating but does not expand staff due to funding constraints, reputational risk, or strategic choice to remain lean and network-based. Alternatively, the project is abandoned or dissolves, making FTE count moot.",
            "yes_scenario": "Nonlinear Fund secures a major new grant or partnership, overcomes reputation issues, and strategically pivots to a more program-delivery-focused model that necessitates hiring several new FTEs, pushing it above 8 FTEs by January 1, 2026.",
            "final_reasoning": "The base rate for early-stage, niche nonprofits (especially in high-risk, highly-scrutinized fields like AI safety) to scale past 8 FTEs within 3.5 years is low. The status quo is under 9 FTEs, and only a major positive shock—such as a large grant, successful program pivot, or reputational turnaround—would justify rapid growth. All available evidence suggests the organization has not overcome the reputational and sectoral funding headwinds, and the incubator model itself does not necessitate rapid internal staff growth. None of the recent news or sectoral trends point to a tailwind for rapid hiring in this specific context. Therefore, the likelihood that Nonlinear Fund will have more than 8 full-time equivalent employees on January 1, 2026 remains low.",
            "final_probability": 13
        },
        "Nonprofit Management (Strategic Philanthropy)": {
            "time_to_resolution": "Approximately 3 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Nonprofit Management (Strategic Philanthropy), I am positioned to evaluate the factors influencing nonprofit staffing, organizational lifecycle, funding trends, and mission-driven scaling in the context of the AI safety and effective altruism community. My expertise enables me to consider not only broad labor market and operational trends but also the unique constraints and incentives that shape employment practices in small, impact-oriented nonprofit organizations like Nonlinear Fund.",
            "status_quo": "The Nonlinear Fund has historically operated with a small core team and a reliance on project-based work, contractors, and volunteers. As of the last public reporting, it was not known to have more than 8 full-time equivalent (FTE) employees, and there is no recent news or indication of a major scaling initiative.",
            "perspective_derived_factors": [
                {
                    "factor": "Nonprofit Funding Volatility",
                    "effect": "Decreases probability. AI safety nonprofits often face unpredictable and lumpy funding cycles, especially those aligned with effective altruism, which can limit long-term hiring commitments and incentivize lean operations."
                },
                {
                    "factor": "Strategic Philanthropy & Grantmaking Preference",
                    "effect": "Decreases probability. Nonlinear Fund's model is focused on research incubation and grantmaking, which typically require a small, highly specialized staff rather than large operational teams."
                },
                {
                    "factor": "AI Safety Sector Labor Market",
                    "effect": "Neutral to slightly increases probability. The competitive AI labor market does create upward wage and staffing pressures, but Nonlinear Fund is unlikely to match tech-sector compensation or scale in the same way as for-profit AI startups."
                },
                {
                    "factor": "Sectoral Trends Toward Lean Nonprofit Operations",
                    "effect": "Decreases probability. There is a strong trend in EA and AI safety organizations to minimize overhead and focus on impact per dollar, which discourages rapid headcount expansion."
                },
                {
                    "factor": "Reputational/Liability Issues and Recent Turmoil in EA/AI Safety Orgs",
                    "effect": "Decreases probability. Recent controversies and leadership challenges in the EA/AI safety space have led to more cautious expansion and greater scrutiny of nonprofit governance, further reducing the likelihood of rapid hiring."
                },
                {
                    "factor": "Broader Labor Trends (e.g., 996 work culture, remote vs. office mandates)",
                    "effect": "Neutral. While some for-profit startups are adopting extreme work norms, these trends are less relevant for most nonprofits, which face different labor supply, mission, and cultural pressures."
                },
                {
                    "factor": "Availability of Public Information",
                    "effect": "Decreases probability. Resolution requires public confirmation of staffing, which implies that any major headcount change would likely have been communicated to funders and the community, but there is no such evidence as of now."
                }
            ],
            "no_scenario": "The Nonlinear Fund continues to operate with a small, focused team (fewer than 9 FTEs), relying on contractors, part-time contributors, and volunteers for flexibility and cost efficiency. No major new funding round or scaling initiative is announced, and public reporting as of January 1, 2026, indicates 8 or fewer FTEs. Alternatively, the fund is abandoned or becomes dormant, with no evidence of a full-time staff expansion.",
            "yes_scenario": "The Nonlinear Fund secures a major new grant or strategic partnership, prompting a significant scale-up of in-house research, grantmaking, or operational capacity. A public announcement is made before January 1, 2026, indicating a staff expansion to 9 or more FTEs, with roles clearly defined and reported in accordance with the resolution criteria.",
            "final_reasoning": "Given the status quo bias, the historic staffing patterns of the Nonlinear Fund, and strong sectoral and philanthropic incentives to maximize impact per FTE, it is unlikely that the organization will exceed 8 FTEs by January 1, 2026. The absence of public signals regarding expansion, recent sectoral caution about growth and governance, and the nature of the fund's work (grantmaking, incubation) all point toward a lean team. While labor market trends in AI are compelling for for-profits, they do not translate directly to small nonprofits. I find little evidence in the news or in sectoral trends to support a sudden, major shift in staffing. The base rate for young, early-stage nonprofits to make such a jump in FTE within a single year is low, especially absent transformative funding news.",
            "final_probability": 12
        },
        "Labor Economics (Human Capital Theory)": {
            "time_to_resolution": "Approximately 3 months (from 2025-09-27 to 2026-01-01)",
            "perspective_relevance": "As a labor economics (human capital theory) expert, I can analyze the incentives and constraints faced by a specialized AI safety research incubator like the Nonlinear Fund in expanding its staff. Human capital theory emphasizes the cost-benefit analysis of hiring, the productivity of skilled labor, the value of organizational knowledge, and the impact of labor market trends (such as remote vs. in-office work, workweek length, and cultural shifts) on employment decisions. I can also evaluate how the current macro-labor trends and specific sector dynamics (AI safety, nonprofit funding, startup norms) affect the probability of headcount growth.",
            "status_quo": "The Nonlinear Fund is a small, recently launched AI safety incubator. As of the last public information, it had fewer than 9 FTEs. Unless there is a significant organizational change, the Fund is likely to remain small with 8 or fewer FTEs.",
            "perspective_derived_factors": [
                {
                    "factor": "Sector Funding Environment",
                    "effect": "AI safety is a high-interest area with significant funding from philanthropy and tech, but also faces volatility and scrutiny, especially in light of recent controversies and shifts in donor priorities. A favorable funding environment increases the probability of staff expansion, but instability or negative press could constrain hiring."
                },
                {
                    "factor": "Human Capital Scarcity and Specialization",
                    "effect": "AI safety research requires specialized talent. The pool of experienced researchers and project managers is limited, and hiring is competitive. This scarcity limits rapid expansion, reducing the probability of exceeding 8 FTEs unless the Fund can attract talent with higher compensation, remote options, or unique mission appeal."
                },
                {
                    "factor": "Workplace Norms and Labor Market Trends",
                    "effect": "Tech/startup sectors are adopting more intense work cultures (e.g., 996), but also facing pushback and higher turnover when mandating in-office or high hours. Nonprofit and research orgs may struggle to compete for talent if they cannot offer flexibility or competitive compensation. If the Fund is flexible/adaptive, it could increase hiring, but missteps here would reduce retention and hiring success."
                },
                {
                    "factor": "Organizational Maturity and Management Capacity",
                    "effect": "Young organizations often grow slowly due to limited management bandwidth, risk aversion, and the need to develop internal processes. Unless there is a major scale-up, the default is incremental rather than rapid headcount growth."
                },
                {
                    "factor": "Public Perception, Transparency, and Accountability",
                    "effect": "Nonprofit orgs in EA/AI safety are under increased scrutiny after recent sector scandals. If Nonlinear faces reputational challenges or is slow to publish staff data, this increases the risk of stagnation or contraction."
                }
            ],
            "no_scenario": "The Nonlinear Fund maintains or contracts its staff due to bottlenecks in fundraising, inability to attract enough specialized full-time employees, or a deliberate decision to stay lean. Alternatively, the Fund could be inactive, slow to report headcount, or even wind down operations if unable to demonstrate impact or secure donor confidence.",
            "yes_scenario": "The Fund secures a new major grant or partnership, successfully recruits additional specialized staff, and expands its project portfolio, justifying and financing a larger full-time team. The organization demonstrates the management capacity to onboard and retain >8 FTEs, and transparently reports this on January 1, 2026.",
            "final_reasoning": "Base rates for small, specialized, early-stage nonprofits or research orgs exceeding 8 FTEs within three years of launch are low unless they secure unusually strong funding or are rapidly scaling in response to a critical opportunity. The AI safety field is well funded, but also volatile and scrutinized. The news does not mention Nonlinear Fund specifically, nor suggest a sector-wide hiring boom for small orgs; if anything, it highlights both the high-intensity work norms and the challenges of attracting/retaining talent as work preferences evolve. Given the definition of FTE (35+ hours, not including volunteers), and the typical growth patterns of similar orgs, the status quo is likely to persist barring a major, visible change. There is no public signal of such a change. Therefore, while not impossible, it is significantly more likely than not that the Nonlinear Fund will have 8 or fewer FTEs on January 1, 2026.",
            "final_probability": 23
        }
    },
    "deliberation_probability": [
        17,
        17,
        7,
        17,
        13,
        12,
        23
    ],
    "deliberation_mean_probability": 15.142857142857142,
    "deliberation_sd": 5.047394424471945,
    "deliberation_probability_result": 15,
    "group_results": {
        "nonprofitOperationsBoardsourceGovernanceModel": {
            "forecaster_to_engage": "Labor Economics (Human Capital Theory)",
            "response_type": "critique",
            "response": "While the Labor Economics (Human Capital Theory) forecast correctly emphasizes the low base rate for early-stage nonprofits surpassing 8 FTEs, it slightly overstates the relevance of sectoral volatility and the general funding environment in AI safety. From a Nonprofit Operations (BoardSource) perspective, the decisive factors are not just the volatility or the high/low funding in the sector, but the specific organizational and board-level governance constraints that limit rapid headcount expansion. Human capital supply and demand are important, but nonprofits often face unique board-mandated ceilings on staff growth, and their reporting requirements (especially regarding FTEs and public disclosure) further constrain the likelihood of a 'Yes' outcome. In this case, the 23% probability seems a bit high, given that there is no evidence of a pending funding windfall, no public signals of a hiring spree, and the board’s likely risk aversion. The critique is that the estimate should give more weight to nonprofit governance constraints and the lack of reporting incentives, both of which further lower the probability."
        },
        "humanResourcesManagementWorkforcePlanning": {
            "forecaster_to_engage": "Organizational Sociology (Population Ecology Theory)",
            "response_type": "defense",
            "response": "The Population Ecology Theory forecast is strongly grounded in empirical organizational research, which shows that most small, resource-dependent organizations in crowded, uncertain fields tend to remain small or exit rather than scale rapidly. This aligns well with workforce planning realities: hiring up to or beyond 9 FTEs requires not only resource influx, but also internal operational maturity—HR systems, onboarding, compliance, and management capacity—all of which are costly for early-stage nonprofits and incubators. Furthermore, the forecast wisely acknowledges a small, nonzero chance of a funding or opportunity shock, reflecting realistic uncertainty. This approach is robust, as it avoids both overconfidence and unwarranted optimism, and matches observed base rates for similar organizations. The 17% probability is justified given the lack of public signals of transformative change and the sector’s tendency toward risk aversion and resource conservation."
        },
        "organizationalSociologyResourceDependenceTheory": {
            "forecaster_to_engage": "Nonprofit Management (Strategic Philanthropy)",
            "response_type": "defense",
            "response": "The Strategic Philanthropy perspective is particularly strong in highlighting the incentive structure that governs staffing decisions in organizations like Nonlinear Fund. In the context of Resource Dependence Theory, organizations adapt their internal structure—including headcount—not only to absolute funding levels but also to the expectations and preferences of their funders. Strategic philanthropists often demand demonstrable impact per dollar and per FTE, which further incentivizes lean teams and outsourcing rather than internal growth. This is especially salient in the AI safety/EA nonprofit space, where funders are acutely aware of reputational and operational risks and are likely to scrutinize any major expansion. The forecast also wisely discounts the relevance of for-profit sector labor trends, reinforcing that nonprofit scaling depends more on philanthropic strategy and resource reliability than on broad sectoral labor market dynamics. Overall, this analysis robustly supports a low probability for Nonlinear Fund exceeding 8 FTEs, and the reasoning is well-aligned with both sectoral base rates and RDT predictions."
        },
        "organizationalSociologyPopulationEcologyTheory": {
            "forecaster_to_engage": "Nonprofit Management (Nonprofit Lifecycle Model)",
            "response_type": "critique",
            "response": "The Nonprofit Lifecycle Model perspective accurately notes the general low base rate for rapid staff expansion in early-stage, niche nonprofits, and appropriately identifies the need for major positive shocks to drive growth. However, it somewhat underestimates the potential for ecological 'niche openings'—sudden, exogenous changes in the broader AI safety ecosystem (such as a high-profile collapse of a peer organization, regulatory shifts, or a new funder entering the space) that could create space and resources for Nonlinear Fund to expand unexpectedly. Population Ecology Theory suggests that, while inertia dominates, the sector is not entirely static; rare but significant environmental disruptions sometimes catalyze rapid scaling for surviving organizations. By not explicitly considering this, the forecast may be slightly overconfident in its low probability. While the probability estimate is reasonable, incorporating the possibility of ecological opportunity shocks could make the reasoning more robust and the uncertainty range wider."
        },
        "nonprofitManagementNonprofitLifecycleModel": {
            "forecaster_to_engage": "Nonprofit Operations (BoardSource Governance Model)",
            "response_type": "defense",
            "response": "The Nonprofit Operations (BoardSource Governance Model) forecast is particularly strong in its emphasis on the board’s role as a gatekeeper for staffing and organizational growth. From the Nonprofit Lifecycle Model perspective, this governance constraint is a major bottleneck for early-stage nonprofits, even when there is some resource slack or sectoral opportunity. The BoardSource model rightly points out that boards are often cautious, risk-averse, and focused on sustainability, making them unlikely to authorize a rapid move past 8 FTEs without a compelling, well-documented reason. This operational constraint is frequently more binding than external labor market or sectoral trends, especially given the public reporting requirement for resolution. The estimate’s conservatism is justified, and its reasoning complements lifecycle analysis by underscoring the slow, deliberative nature of nonprofit growth as shaped by board oversight."
        },
        "nonprofitManagementStrategicPhilanthropy": {
            "forecaster_to_engage": "Organizational Sociology (Resource Dependence Theory)",
            "response_type": "defense",
            "response": "The Resource Dependence Theory (RDT) forecast is especially strong from a strategic philanthropy perspective, because it recognizes that small AI safety nonprofits like the Nonlinear Fund operate under strong pressures to minimize fixed costs and avoid payroll expansion unless long-term, reliable resources are secured. RDT's emphasis on risk aversion and cost minimization is highly relevant given the scrutiny and volatility in the effective altruism and AI safety funding space. This complements the philanthropic imperative to demonstrate impact-per-dollar, discouraging rapid internal scaling in favor of lean, high-leverage operations. The forecaster also correctly downplays the relevance of for-profit sector over-hiring trends, focusing instead on the distinctive nonprofit funding environment and the reputational caution that has become prevalent since recent sectoral controversies. This aligns well with the strategic incentives at play and supports a strong, well-justified low probability forecast."
        },
        "laborEconomicsHumanCapitalTheory": {
            "forecaster_to_engage": "Human Resources Management (Workforce Planning)",
            "response_type": "critique",
            "response": "The Workforce Planning perspective provides a solid analysis of internal operational challenges and sectoral headwinds for staffing growth, but it could more explicitly consider the role of human capital constraints specific to AI safety research. While the argument that mission-driven nonprofits remain lean is valid, it understates the impact of talent scarcity and the resulting high marginal value (and cost) of each additional qualified hire. In a field where the supply of relevant human capital is extremely limited, even a moderate funding uptick may not translate into rapid hiring, and recruiting frictions are often the main limiting factor, not just resource or operational caution. Additionally, the forecast could better address how evolving remote work norms and labor preferences affect the organization's ability to attract talent—an important consideration if the Nonlinear Fund seeks to scale with geographically distributed hires. These nuances could further justify the low probability, or at least clarify the specific mechanisms constraining expansion."
        }
    },
    "revision_results": {
        "Nonprofit Operations (BoardSource Governance Model)": {
            "my_phase1_final_probability": 17,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, my initial assessment is reinforced. The consensus probability among forecasters with nonprofit and organizational sociology expertise clusters between 7% and 17%, with only the Labor Economics perspective offering a slightly higher estimate (23%). My critique of that forecast highlighted that it underweights the specific operational and board-level governance constraints unique to nonprofits, which act as additional barriers to rapid staff expansion even if funding and labor supply conditions were more favorable. No new information surfaced in the deliberation to suggest an imminent transformative event at Nonlinear Fund. The lack of public signals, sector-specific hiring, or evidence of a governance shift keeps the probability low. Thus, I maintain my original probability.",
            "revised_probability": 17
        },
        "Human Resources Management (Workforce Planning)": {
            "my_phase1_final_probability": 17,
            "reasoning_for_revised_probability": "Upon reviewing the group deliberation, especially the defense of the Population Ecology Theory perspective and the critique of the Labor Economics (Human Capital Theory) estimate, my view is reinforced that sector base rates, operational realities, and governance risk aversion all argue for a low probability. The consensus among the most relevant models (Population Ecology, BoardSource Governance, Nonprofit Lifecycle, Strategic Philanthropy) clusters tightly in the low teens to high single digits, with the main upward pressure stemming from general sectoral volatility—which, as discussed, is less relevant for a niche, grant-dependent nonprofit without evidence of new funding or public expansion. No recent evidence or argumentation suggests a step change is likely. Therefore, I see no compelling reason to revise my probability estimate.",
            "revised_probability": 17
        },
        "Organizational Sociology (Resource Dependence Theory)": {
            "my_phase1_final_probability": 7,
            "reasoning_for_revised_probability": "The group deliberation reinforced my initial very low probability. All forecasters, regardless of disciplinary lens, converged on a low base rate for rapid staff expansion in early-stage, grant-dependent nonprofits—especially those operating in high-scrutiny EA/AI safety spaces and particularly following reputational challenges. The arguments from BoardSource Governance and Strategic Philanthropy perspectives highlighted additional barriers, such as board-level risk aversion and funder expectations for lean operations, which are fully compatible with Resource Dependence Theory's predictions of risk aversion and resource minimization in the face of uncertainty. No one surfaced any credible contravening evidence or plausible scenario for a major expansion. If anything, the deliberation suggests my initial 7% probability might be slightly high, but given the need to account for tail risk (last-minute major grant or pivot), I will hold my estimate steady.",
            "revised_probability": 7
        },
        "Organizational Sociology (Population Ecology Theory)": {
            "my_phase1_final_probability": 17,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I find that most expert perspectives converge around a low probability (7-23%), with no compelling evidence or argument for a probability significantly above my initial estimate. The critiques and defenses reinforce the underlying mechanisms that keep early-stage nonprofits small: resource and governance constraints, heightened funder scrutiny, and sectoral risk aversion. The one critique to the Nonprofit Lifecycle Model—suggesting a need to acknowledge potential for sudden ecological 'niche openings'—is valid, but already accounted for in my initial scenario planning and nonzero estimate. There remains no public signal of transformative funding, hiring, or sectoral shock affecting Nonlinear Fund. Therefore, no revision is warranted, and the original probability stands.",
            "revised_probability": 17
        },
        "Nonprofit Management (Nonprofit Lifecycle Model)": {
            "my_phase1_final_probability": 13,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I find that the consensus across expert perspectives—including BoardSource Governance, Resource Dependence, Strategic Philanthropy, and Population Ecology—is strongly aligned with my initial reasoning. The key points reinforced are the very low base rates for rapid staff expansion in early-stage, grant-dependent nonprofits, the strong influence of board governance and operational constraints, and the absence of any public signals of transformative funding or strategy change for Nonlinear Fund. The critique from Population Ecology Theory does suggest a nonzero, though still marginal, chance of a rare ecological 'niche opening' event, but this is already reflected in the small probability assigned. The defense of BoardSource Governance Model further validates the importance of internal controls and transparency requirements, which make a sudden, unpublicized staff surge even less likely. Given these points and the lack of new information indicating a positive shock, I see no compelling reason to adjust my probability. My estimate remains slightly above the absolute minimum but firmly in the low range.",
            "revised_probability": 13
        },
        "Nonprofit Management (Strategic Philanthropy)": {
            "my_phase1_final_probability": 12,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I find strong consensus among forecasters with adjacent expertise (governance, workforce planning, nonprofit lifecycle, and resource dependence) that the base rate for rapid staff expansion in early-stage, grant-dependent nonprofits—especially in the AI safety/EA space—is extremely low. The most compelling critiques (notably from BoardSource Governance and Population Ecology Theory) further emphasize the constraining influence of board governance and the lack of any external signals of a major resource opportunity or ecological niche opening. While the Population Ecology critique suggests a small additional allowance for rare sectoral shocks, this is already accounted for in my initial probability. No new specific evidence or major alternative scenario emerged from deliberation to warrant upward revision. Given the strong alignment of independent models around a probability in the 7-17% range, I am confident my initial estimate is appropriately calibrated. I will therefore maintain my original probability.",
            "revised_probability": 12
        },
        "Labor Economics (Human Capital Theory)": {
            "my_phase1_final_probability": 23,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I am inclined to slightly lower my probability estimate. The critiques from the Nonprofit Operations (BoardSource Governance Model) and other nonprofit management perspectives emphasized the powerful, often underappreciated constraint posed by board-level governance and reporting practices, which act as a binding brake on staff expansion—especially in the absence of public signals about a major funding influx. Additionally, the consensus among forecasters from organizational sociology and nonprofit management further supports a low base rate and highlights the importance of external shocks or sectoral 'niche openings' as rare, low-probability events. My initial forecast may have slightly overemphasized the general sectoral volatility and underweighted these unique nonprofit governance and reporting constraints. Therefore, I am revising my probability downward to align more closely with the consensus and the most compelling arguments.",
            "revised_probability": 17
        }
    },
    "revision_probability": [
        17,
        17,
        7,
        17,
        13,
        12,
        17
    ],
    "revision_mean_probability": 14.285714285714286,
    "revision_sd": 3.860668582611295,
    "revision_probability_result": 14,
    "question_details": {
        "id": 38990,
        "title": "Will the Nonlinear Fund have more than eight full-time equivalent employees on January 1, 2026?",
        "created_at": "2025-08-31T06:17:57.691603Z",
        "open_time": "2025-09-26T09:16:19Z",
        "cp_reveal_time": "2025-09-26T10:46:19Z",
        "spot_scoring_time": "2025-09-26T10:46:19Z",
        "scheduled_resolve_time": "2026-01-01T23:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-09-26T10:46:19Z",
        "actual_close_time": "2025-09-26T10:46:19Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "This question is synced with an identical question on Metaculus. The original question opened on 2022-06-03 05:00:00 and can be found [here](https://www.metaculus.com/questions/7100). This question will resolve to the same value as the synced question. The original question's background info at this time is below. \n\nThe [Nonlinear Fund](http://www.nonlinearfund.org/) is a [recently launched](https://forum.effectivealtruism.org/posts/fX8JsabQyRSd7zWiD/introducing-the-nonlinear-fund-ai-safety-research-incubation) incubator, aiming to \"​research, fund, and seed AI Safety interventions\".\n\n`{\"format\":\"metac_closes_in_period\",\"info\":{\"post_id\":7100,\"question_id\":7100}}`",
        "resolution_criteria": "This question will resolve as **Yes** if the Nonlinear Fund has 9 or more full-time equivalent employees on January 1, 2026, according to public information given by the Nonlinear Fund.  For this question, a full-time equivalent is defined as working 35 hours or more per week, without including volunteers. The question will resolve as **No** if the project has clearly been abandoned or it is determined there are 8 or fewer full-time equivalent employees on January 1, 2026",
        "fine_print": "",
        "post_id": 39613,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**U.S. Startups Embrace Chinese 996 Work Culture**\nU.S. startups are increasingly adopting the Chinese \"996\" work culture, demanding employees work from 9 a.m. to 9 p.m., six days a week, and in many cases 70+ hour weeks.  For example, Rilla’s AI‑engineer posting explicitly required \"70 hours a week,\" while Weekday AI’s software‑engineer posting warned that \"Applicants who do not want to work six days a week (only Sunday off) are not suitable for this role.\"  Brendan Foody, CEO of Mercor, declared on X that the company would \"adopt the 996 work system.\"  The trend is framed as a response to fierce AI competition with China, with the San Francisco Standard noting that firms fear rivals might \"seize the market by working harder,\" and the Wall Street Journal reporting that founders see \"no room for alcohol, sleep, or leisure\" in pursuit of a $1 trillion company (≈1,400 trillion Korean won).  The spread is not limited to AI; a venture partner at Index Ventures said the 996 model is becoming the new startup standard in Silicon Valley and beyond, with companies in New York and Europe following suit.  Forbes highlighted that the high‑intensity culture is \"gradually permeating the broader U.S. workplace,\" citing finance, consulting, and law firms.  In contrast, China’s Supreme People’s Court ruled the 996 system illegal in 2021, and the government announced measures to reduce excessive competition at the 2024 Two Sessions.  The article presents these developments with a mix of direct quotes and factual reporting, aiming to explain the rise of extreme work hours in U.S. startups.\nOriginal language: en\nPublish date: September 25, 2025 08:49 AM\nSource:[Chosun.com](https://www.chosun.com/english/market-money-en/2025/09/25/D2PRQO2N5FEHVPNIMQRSOJSL2E/)\n\n**Zurich Debates 35‑Hour Work Week – Legal Questions Arise**\nThe Zurich city council debate over a 35‑hour work week for public employees has stalled after the finance director Daniel Leupi refused to extend the deadline. The motion, introduced by David Garcia Nuñez (AL) and Anna Graff (SP), seeks to reduce working hours to 35 per week while keeping full pay, targeting staff in the VBZ, police and care sectors. Leupi cited high costs and the risk that reduced hours could leave up to 1,500 specialists short. A legal opinion concluded that a pilot would constitute a 'massive Eingriff in das städtische Recht und insbesondere sein Lohnsystem' and that a statutory framework would be needed to comply with Article 8 of the Swiss Constitution. The motioners accused the council of a delay tactic and demanded the matter be referred to a commission. The council rejected the extension request, leaving Leupi to answer the commission. The debate echoes a 2023 pilot in hospitals where 70 assistant doctors worked 42 hours instead of 46. 45 % of Swiss workers reported that resources and burdens in their work life are just balancing, according to recent surveys. The motioners’ pilot would involve staff in shift work, such as those in the VBZ, police or care sector. Leupi warned that a reduction could result in a shortage of up to 1,500 specialists. The legal opinion noted that the city, as an employer, must treat all employees equally and that a pilot would be a 'massive Eingriff in das städtische Recht und insbesondere sein Lohnsystem'. The motioners’ request for a commission was rejected, and the council will now face questions from commission members.\nOriginal language: de\nPublish date: September 25, 2025 03:15 AM\nSource:[Neue Zürcher Zeitung](https://www.nzz.ch/zuerich/35-stunden-woche-fuer-staedtische-angestellte-zuercher-stadtrat-fuerchtet-juristische-probleme-al-wittert-eine-verzoegerungstaktik-ld.1903802)\n\n**35‑Hour Work Week in Zürich: Implementation Stalled**\nThe city of Zürich has been debating a pilot for a 35‑hour work week for three years.  The proposal, initiated by Councilor David Garcia Nuñez and Anna Graff in 2022, aims to reduce sick leave and improve working conditions for municipal employees in shift work, including nursing, city police and the VBZ.  In March 2023 the left‑green majority approved the pilot, but the conservative bloc called it ‘frivolous’ and warned that the scheme could create up to 1,500 new full‑time positions and cost up to 140 million Swiss francs annually.  The council has repeatedly asked for a one‑year extension to prepare the plan, citing legal questions about equal treatment of all municipal staff and a desire to limit the test to social‑service departments (SEB).  Garcia Nuñez has criticised the delay, saying the council has not clarified anything in the past two years.  Trade unions (Syna, Transfair, VPOD) protested the restriction to SEB, offering full support in an open letter to Councilor Michael Baumer.  A legal opinion in the fall of 2024 challenged the partial implementation, arguing that a pilot limited to specific departments is unlawful and would require a new legal basis to comply with constitutional equality.  Despite these obstacles, the left‑wing council remains undeterred, arguing that a pilot is not a ‘zombie apocalypse’ and citing the health director’s own 42‑plus‑4 project that studies shorter work hours for assistant doctors and nurses.  The council continues to demand answers from the commission before granting another extension.\nOriginal language: de\nPublish date: September 24, 2025 06:03 PM\nSource:[Tages Anzeiger](https://www.tagesanzeiger.ch/35-stunden-woche-in-zuerich-umsetzung-des-pilotversuchs-stockt-315247434394)\n\n**Mediator assigned as college full-time support staff strike closes in on two weeks**\nOntario full‑time support staff at 24 colleges have been on strike since September 11, 2025 after failing to reach a new contract with the College Employer Council (CEC). A ministry‑appointed mediator has been assigned to help negotiate a settlement. Dayna Smockum, Director of Communications for the Ministry of Colleges, Universities, Research Excellence and Security, said the mediator is ready to support a fair resolution and that the goal is to put students first: 'We remain hopeful that all parties reach a fair deal that puts students first.' OPSEU Local 421 President Tim Prewer said picket lines allow only one vehicle at a time and that the college has not yet met with members; he also highlighted safety concerns and requested a meeting on the line: 'Members would like to be able to have multiple vehicles safely line up off of Wallbridge‑Loyalist Road and further along the college roadway.' CEC CEO Graham Lloyd said the council has offered more than $145 million in wage, benefit and job‑security improvements and is willing to meet in mediation on September 26, 2025, hoping to end the strike: 'Colleges have consistently bargained in good faith and have put forward more than $145 million in improved wages, benefits, and job security, and advised OPSEU of issues it cannot accept.' The strike is expected to close in about two weeks.\nOriginal language: en\nPublish date: September 24, 2025 02:26 PM\nSource:[91x.fm](https://91x.fm/2025/09/24/mediator-assigned-as-college-full-time-support-staff-strike-closes-in-on-two-weeks/)\n\n**Council to vote today on motion to rescind Ottawa's return-to-office mandate**\nOn September 24 2025, Ottawa City Council will vote on a motion to rescind the city’s return‑to‑office mandate that requires municipal employees to work five days a week in the office. City Manager Wendy Stephanson announced on August 26 that the mandate would take effect on Jan. 1, stating that a five‑day office standard would strengthen organizational culture and build public trust. Councillor Jeff Leiper will introduce a motion arguing that no evidence shows reduced productivity or taxpayer value under the current hybrid arrangement, and that a five‑day standard would not significantly improve either. The motion would direct the city manager to rescind the mandate and continue to accommodate hybrid work. Horizon Ottawa and several unions—including the Civic Institute of Professional Personnel, the Amalgamated Transit Union, the Canadian Association of Professional Employees and the Public Service Alliance of Canada—will rally outside City Hall to support Leiper’s motion. Tom Ledgley, Coordinator of Horizon Ottawa, said, 'Remote work technology and practices are well‑developed and effective,' and that studies show productivity remains strong when people work from home. Ottawa employs about 17,100 full‑time equivalent positions, with roughly 85 % of staff onsite each day. Stephanson clarified that alternative work arrangements will remain available, and that a regular on‑site presence is 'critical to help strengthen relationships, reinforce team norms, support formal systems and processes, facilitate ongoing knowledge transfer, support mentorship and succession planning, protect the integrity of our corporate memory, build confidence in the city's ability to deliver service excellence, and ultimately strengthen public trust.' The motion comes amid Ontario’s mandate that all members of the Ontario Public Service be in the office four days a week from November, and federal core public service employees must be in the office at least three days a week.\nOriginal language: en\nPublish date: September 24, 2025 12:29 PM\nSource:[Pulse24.com                        ](https://www.cp24.com/news/canada/2025/09/24/council-to-vote-today-on-motion-to-rescind-ottawas-return-to-office-mandate/)\n\n**Financial Union Calls for Nationwide Strike Over 4.5‑Day Workweek and Wage Increase**\nThe Financial Union of Korea announced a nationwide strike on 26 September 2025, the first such action since September 2022.  The strike, scheduled to begin at 11 a.m. on Gwanghwamun Sejong-daero, is aimed at securing a 4.5‑day workweek, a 5 % wage increase (later revised to 3.9 %) and additional hiring and retirement‑extension measures.  Employers have offered only a 2.4 % raise and have opposed the shorter workweek.  Union chair Kim Hyung‑seon said the union has “been demanding a 4.5‑day week to overcome national crises such as low birth rates, care gaps and regional decline, yet no responsible answer has been given for months.”  He also criticized that while banks and financial firms enjoy record profits, the share returned to workers is “too modest.”  Historically, participation in the 2022 strike was only 0.8 % among the five major banks and 9.4 % overall.  Bank officials expect that even if the strike proceeds, low participation will prevent major disruptions to branch operations.  Banks have prepared emergency plans, monitoring staff levels in real time and planning phased responses to minimize customer inconvenience.  Public sentiment remains lukewarm; many consumers fear that a shortened branch‑operating schedule would inconvenience them.  The government plans to legislate a reduction in statutory working hours within the year, raising questions about the strike’s effectiveness.  The union claims it has held more than 35 negotiations over several months, but the employer side has “evaded responsibility,” prompting the union’s 100,000 members to go on strike.  \"수개월간 35차례 넘게 교섭을 이어왔으나 사용자 측은 끝내 책임을 회피했다,\" the union said, emphasizing its resolve.\nOriginal language: ko\nPublish date: September 25, 2025 09:00 PM\nSource:[뉴시스 (NEWSIS)](https://www.newsis.com/view/NISX20250925_0003344557)\n\n**SBIR And STTR Programs To Expire Without Continuing Resolution Passage**\nThe U.S. House passed a continuing resolution (CR) that funds the federal government through November 21, 2025, but the Senate must act by September 30 to avoid a shutdown. If the Senate fails to pass the CR, key programs that small businesses and federal agencies rely on—namely the Small Business Innovation Research (SBIR) and Small Business Technology Transfer (STTR) programs—will be at risk. These programs, dubbed 'America's Seed Fund', were created in 1982 and 1992 respectively, and together award grants to more than 4,000 recipients, creating an average of 65,578 jobs per year. Notable innovations funded include lasik eye surgery and the Mars Perseverance Rover. Although the current CR includes funding for SBIR and STTR through fiscal year 2026, the programs still require reauthorization by Congress; disagreement remains over whether to simply reauthorize or to redesign them. A government shutdown would harm both Main Street businesses and federal operations, underscoring the importance of passing the CR and securing the future of SBIR and STTR.\nOriginal language: en\nPublish date: September 25, 2025 02:26 PM\nSource:[Forbes](https://www.forbes.com/sites/rhettbuttle/2025/09/25/sbir-and-sttr-programs-to-expire-without-continuing-resolution-passage/)\n\n**More Companies Revert to Office Work: A Mistake That Could Cost Them**\nCompanies are increasingly mandating a full‑time return to the office, citing productivity gains, but recent studies suggest the shift may not deliver the promised benefits. A 2024 S&P 500 survey found that firms often impose in‑person mandates after stock‑price declines, aiming to boost employee performance and financial results. However, a Fast Company article notes that hybrid work does not harm productivity; the real drop comes from insufficient investment in technology and systems that enable employees to perform at their best. The Australian Productivity Commission reports that hybrid arrangements do not reduce output, and that the main performance loss stems from outdated infrastructure and inefficient processes. For many firms, office space represents 10‑20 % of operating costs; a return mandate requires at least 15 m² per worker, plus utilities, heating, cooling, high‑speed internet, etc. Telework has also improved work‑life balance, with employees in cities like Atlanta saving 2‑3 hours daily on commuting, which could be redirected to focus and creative problem‑solving. Stanford research shows that workers who telework two days a week are as productive, equally likely to be promoted, and 33 % less likely to resign than full‑time office workers. Other studies find remote and hybrid setups reduce sick leave, limit distractions, and increase satisfaction. The article argues that forcing a five‑day office schedule without clear objectives or empathy risks eroding corporate culture, trust, and engagement, and that the future lies in greater flexibility benefiting both employers and employees. Key quotes include: the article refers to a \"100% présentiel\" policy, cites \"33% moins de risques de démissionner\" for hybrid workers, and notes that office costs can be \"10 à 20% de leurs coûts d'exploitation\".\nOriginal language: fr\nPublish date: September 25, 2025 10:00 AM\nSource:[Slate.fr](https://www.slate.fr/societe/teletravail-bureau-presentiel-entreprise-productivite-bien-etre-vie-personnel-professionnel-travail)\n\n**U.S. Startups Embrace Chinese 996 Work Culture**\nU.S. startups are increasingly adopting the Chinese \"996\" work culture, demanding employees work from 9 a.m. to 9 p.m., six days a week, and in many cases 70+ hour weeks.  For example, Rilla’s AI‑engineer posting explicitly required \"70 hours a week,\" while Weekday AI’s software‑engineer posting warned that \"Applicants who do not want to work six days a week (only Sunday off) are not suitable for this role.\"  Brendan Foody, CEO of Mercor, declared on X that the company would \"adopt the 996 work system.\"  The trend is framed as a response to fierce AI competition with China, with the San Francisco Standard noting that firms fear rivals might \"seize the market by working harder,\" and the Wall Street Journal reporting that founders see \"no room for alcohol, sleep, or leisure\" in pursuit of a $1 trillion company (≈1,400 trillion Korean won).  The spread is not limited to AI; a venture partner at Index Ventures said the 996 model is becoming the new startup standard in Silicon Valley and beyond, with companies in New York and Europe following suit.  Forbes highlighted that the high‑intensity culture is \"gradually permeating the broader U.S. workplace,\" citing finance, consulting, and law firms.  In contrast, China’s Supreme People’s Court ruled the 996 system illegal in 2021, and the government announced measures to reduce excessive competition at the 2024 Two Sessions.  The article presents these developments with a mix of direct quotes and factual reporting, aiming to explain the rise of extreme work hours in U.S. startups.\nOriginal language: en\nPublish date: September 25, 2025 08:49 AM\nSource:[Chosun.com](https://www.chosun.com/english/market-money-en/2025/09/25/D2PRQO2N5FEHVPNIMQRSOJSL2E/)\n\n**Zurich Debates 35‑Hour Work Week – Legal Questions Arise**\nThe Zurich city council debate over a 35‑hour work week for public employees has stalled after the finance director Daniel Leupi refused to extend the deadline. The motion, introduced by David Garcia Nuñez (AL) and Anna Graff (SP), seeks to reduce working hours to 35 per week while keeping full pay, targeting staff in the VBZ, police and care sectors. Leupi cited high costs and the risk that reduced hours could leave up to 1,500 specialists short. A legal opinion concluded that a pilot would constitute a 'massive Eingriff in das städtische Recht und insbesondere sein Lohnsystem' and that a statutory framework would be needed to comply with Article 8 of the Swiss Constitution. The motioners accused the council of a delay tactic and demanded the matter be referred to a commission. The council rejected the extension request, leaving Leupi to answer the commission. The debate echoes a 2023 pilot in hospitals where 70 assistant doctors worked 42 hours instead of 46. 45 % of Swiss workers reported that resources and burdens in their work life are just balancing, according to recent surveys. The motioners’ pilot would involve staff in shift work, such as those in the VBZ, police or care sector. Leupi warned that a reduction could result in a shortage of up to 1,500 specialists. The legal opinion noted that the city, as an employer, must treat all employees equally and that a pilot would be a 'massive Eingriff in das städtische Recht und insbesondere sein Lohnsystem'. The motioners’ request for a commission was rejected, and the council will now face questions from commission members.\nOriginal language: de\nPublish date: September 25, 2025 03:15 AM\nSource:[Neue Zürcher Zeitung](https://www.nzz.ch/zuerich/35-stunden-woche-fuer-staedtische-angestellte-zuercher-stadtrat-fuerchtet-juristische-probleme-al-wittert-eine-verzoegerungstaktik-ld.1903802)\n\n**35‑Hour Work Week in Zürich: Implementation Stalled**\nThe city of Zürich has been debating a pilot for a 35‑hour work week for three years.  The proposal, initiated by Councilor David Garcia Nuñez and Anna Graff in 2022, aims to reduce sick leave and improve working conditions for municipal employees in shift work, including nursing, city police and the VBZ.  In March 2023 the left‑green majority approved the pilot, but the conservative bloc called it ‘frivolous’ and warned that the scheme could create up to 1,500 new full‑time positions and cost up to 140 million Swiss francs annually.  The council has repeatedly asked for a one‑year extension to prepare the plan, citing legal questions about equal treatment of all municipal staff and a desire to limit the test to social‑service departments (SEB).  Garcia Nuñez has criticised the delay, saying the council has not clarified anything in the past two years.  Trade unions (Syna, Transfair, VPOD) protested the restriction to SEB, offering full support in an open letter to Councilor Michael Baumer.  A legal opinion in the fall of 2024 challenged the partial implementation, arguing that a pilot limited to specific departments is unlawful and would require a new legal basis to comply with constitutional equality.  Despite these obstacles, the left‑wing council remains undeterred, arguing that a pilot is not a ‘zombie apocalypse’ and citing the health director’s own 42‑plus‑4 project that studies shorter work hours for assistant doctors and nurses.  The council continues to demand answers from the commission before granting another extension.\nOriginal language: de\nPublish date: September 24, 2025 06:03 PM\nSource:[Tages Anzeiger](https://www.tagesanzeiger.ch/35-stunden-woche-in-zuerich-umsetzung-des-pilotversuchs-stockt-315247434394)\n\n**Employees: OK, We'll Return from Remote to Office, But We'll Massively Sabotage Work**\nEmployees in the United Kingdom are threatening to sabotage office work if forced to abandon remote or hybrid arrangements, according to a study by Owl Labs. The survey found that more than 90% of respondents said they would 'примут меры' (take action) if they lost the right to work remotely or even in a hybrid model that requires at least one office visit per week. The study also shows a steep decline in fully remote workers—from 7% in 2024 to 4% in 2025—and a rise in office staff from 42% to 51% over the same period. Hybrid workers fell from 51% to 45%, with 40% now required to work three days a week and 27% four days. Only 34% of hybrid workers would prefer a three‑day office schedule, and 11% would not want to appear at all. The report cites that 75% of UK employers have not tightened mandatory office presence, yet companies such as Vodafone and Microsoft are actively pushing for returns. Indeed’s research notes that employers are using the labour market to demand more face‑to‑face interaction for collaboration, culture or simply because they feel they can: 'Мы видим, как работодатели используют ситуацию на рынке труда, чтобы требовать больше личного общения…' The findings suggest a growing disconnect between employer expectations and employee preferences for flexibility. Employees say the main reasons for returning are strengthening corporate culture (79%), managerial control (78%) and productivity (77%). Yet a quarter of staff practice 'work‑to‑rule', a fifth over‑book their schedules to avoid meetings, and 17% merely pretend to work.\nOriginal language: ru\nPublish date: September 24, 2025 02:28 PM\nSource:[CNews.ru](https://www.cnews.ru/news/top/2025-09-24_sotrudniki_grozyatsya_massovo)\n\n**Mediator assigned as college full-time support staff strike closes in on two weeks**\nOntario full‑time support staff at 24 colleges have been on strike since September 11, 2025 after failing to reach a new contract with the College Employer Council (CEC). A ministry‑appointed mediator has been assigned to help negotiate a settlement. Dayna Smockum, Director of Communications for the Ministry of Colleges, Universities, Research Excellence and Security, said the mediator is ready to support a fair resolution and that the goal is to put students first: 'We remain hopeful that all parties reach a fair deal that puts students first.' OPSEU Local 421 President Tim Prewer said picket lines allow only one vehicle at a time and that the college has not yet met with members; he also highlighted safety concerns and requested a meeting on the line: 'Members would like to be able to have multiple vehicles safely line up off of Wallbridge‑Loyalist Road and further along the college roadway.' CEC CEO Graham Lloyd said the council has offered more than $145 million in wage, benefit and job‑security improvements and is willing to meet in mediation on September 26, 2025, hoping to end the strike: 'Colleges have consistently bargained in good faith and have put forward more than $145 million in improved wages, benefits, and job security, and advised OPSEU of issues it cannot accept.' The strike is expected to close in about two weeks.\nOriginal language: en\nPublish date: September 24, 2025 02:26 PM\nSource:[91x.fm](https://91x.fm/2025/09/24/mediator-assigned-as-college-full-time-support-staff-strike-closes-in-on-two-weeks/)\n\n**Council to vote today on motion to rescind Ottawa's return-to-office mandate**\nOn September 24 2025, Ottawa City Council will vote on a motion to rescind the city’s return‑to‑office mandate that requires municipal employees to work five days a week in the office. City Manager Wendy Stephanson announced on August 26 that the mandate would take effect on Jan. 1, stating that a five‑day office standard would strengthen organizational culture and build public trust. Councillor Jeff Leiper will introduce a motion arguing that no evidence shows reduced productivity or taxpayer value under the current hybrid arrangement, and that a five‑day standard would not significantly improve either. The motion would direct the city manager to rescind the mandate and continue to accommodate hybrid work. Horizon Ottawa and several unions—including the Civic Institute of Professional Personnel, the Amalgamated Transit Union, the Canadian Association of Professional Employees and the Public Service Alliance of Canada—will rally outside City Hall to support Leiper’s motion. Tom Ledgley, Coordinator of Horizon Ottawa, said, 'Remote work technology and practices are well‑developed and effective,' and that studies show productivity remains strong when people work from home. Ottawa employs about 17,100 full‑time equivalent positions, with roughly 85 % of staff onsite each day. Stephanson clarified that alternative work arrangements will remain available, and that a regular on‑site presence is 'critical to help strengthen relationships, reinforce team norms, support formal systems and processes, facilitate ongoing knowledge transfer, support mentorship and succession planning, protect the integrity of our corporate memory, build confidence in the city's ability to deliver service excellence, and ultimately strengthen public trust.' The motion comes amid Ontario’s mandate that all members of the Ontario Public Service be in the office four days a week from November, and federal core public service employees must be in the office at least three days a week.\nOriginal language: en\nPublish date: September 24, 2025 12:29 PM\nSource:[Pulse24.com                        ](https://www.cp24.com/news/canada/2025/09/24/council-to-vote-today-on-motion-to-rescind-ottawas-return-to-office-mandate/)\n\n**Tech giants end remote work model, citing reasons**\nMicrosoft announced on 9 February 2026 that it will require employees to return to the office at least three days a week, ending its long‑standing remote‑work policy and marking the end of the last major tech company to defend the home‑office model. The change follows a broader trend: Apple, Google, Amazon and Meta have already reduced or eliminated flexible work arrangements. Microsoft’s new policy will take effect in the Redmond region and is part of a strategy to improve communication, engagement and data‑security control, according to Amy Coleman, the company’s executive vice‑president of people. \n\nThe article cites a 2025 Insper report that surveyed 1,432 technology workers. It found that, on average, IT professionals worked 2.64 remote days per week, a level higher than other sectors, and that 94% of respondents want to keep at least one remote day. Moreover, 83% said they would accept a salary reduction to maintain remote work. The study also warned that cutting remote options could raise turnover, especially among women, and affect talent retention.\n\nOther big‑tech moves are highlighted: Amazon now requires five office days a week (since 2 January 2025), Google mandates three office days for employees within 80 km (since April 2025), Apple has a fixed hybrid schedule of three office days a week (since September 2022), and Meta continues a three‑day‑per‑week policy (since 2023). \n\nExperts explain that the shift is partly strategic: \"Como demandam mais inovação do que outras organizações, algumas questões acabam se tornando mais importantes, como a complexidade de produtos e serviços,\" said André Miceli of FGV. \"Há também uma questão de cultura e identidade organizacional: a convivência presencial reforça valores importantes para a empresa,\" added Tatiana Iwai of Insper. \n\nThe article also notes that Microsoft cut about 15,000 jobs in 2025, and that Amazon and Meta announced similar layoffs amid AI investments, suggesting that the return to the office may also serve as a way to monitor and reduce workforce size. \n\nQuotes from the article include: \n- 'O caso delas chama atenção não apenas pelo tamanho e pelo hype, mas também porque frequentemente ditam tendências de mercado e sempre foram associadas a culturas de grande autonomia e flexibilidade,' said Tatiana Iwai. \n- 'Quando olhamos para os últimos cinco anos, continuamos a acreditar que as vantagens de estar juntos no escritório são significativas,' said Amazon CEO Andy Jassy. \n- 'Se houver reversão total ou considerável do remoto, podemos prever aumento do turnover, diminuição da satisfação, do engajamento e do bem‑estar,' concluded Iwai.\nOriginal language: pt\nPublish date: September 14, 2025 01:44 PM\nSource:[Estadão](https://www.estadao.com.br/link/empresas/as-gigantes-da-tecnologia-mataram-o-home-office-apesar-de-suas-ferramentas-digitais-veja-motivos/)\n\n**Meta Insiders Claim Mark Zuckerberg's Company Suppressed Research on Child Safety in Virtual Reality**\nAccording to the Washington Post, documents disclosed to Congress by a group of Meta employees show that the company’s legal team screened, edited, and sometimes vetoed internal research on child safety in virtual reality after leaked studies led to 2021 congressional hearings. The employees allege that Meta’s actions were aimed at creating ‘plausible deniability’ about any negative effects of its products. Meta denies wrongdoing, stating that since the start of 2022 it has approved nearly 180 Reality Labs‑related studies on social issues, including youth safety and well‑being. The company claims these studies led to product updates such as new supervision tools that let parents see who their teens are connected with in VR, how much time they spend, and which apps they access, and to automatic protections for teens that limit unwanted contact, such as default voice‑channel settings in Horizon Worlds that allow users to hear or be heard only from people they know. A Meta spokesperson told Breitbart, ‘These few examples are being stitched together to fit a predetermined and false narrative; in reality since the start of 2022, Meta has approved nearly 180 Reality Labs‑related studies on social issues, including youth safety and well‑being.’ The documents also reveal that Meta did not create parental controls for ‘tween’ VR users until the FTC began investigating its compliance with a law meant to protect children online, and that children younger than 13 were bypassing age restrictions to use the company’s VR services. Another Meta spokesperson said, ‘From the start, we built safety features into our devices and made it clear those devices were meant for people over 13 – this was stated in the Oculus Safety Center, on the packaging, and in the user guides.’ Former researcher Jason Sattizahn wrote in an affidavit that he was fired after disputes with managers over restrictions on his research, and another researcher quit in 2023 after four years at the company, citing ethical concerns. Experts have warned that cutting‑edge internet technology can expose children to real‑time contact with adult predators, citing Roblox as an example of a platform facing legal challenges over predators and groomers reaching children.\nOriginal language: en\nPublish date: September 08, 2025 07:20 PM\nSource:[Breitbart](https://www.breitbart.com/tech/2025/09/08/meta-insiders-claim-mark-zuckerbergs-company-suppressed-research-on-child-safety-in-virtual-reality/)\n\n**Finsa Collective Agreement to Reduce Weekly Working Hours Below 37 Hours by 2027**\nThe 2024‑2027 collective agreement of Financiera Maderera (Finsa) will progressively cut the weekly working time from 38.19 hours in 2023 (1,744 annual hours) to 36.97 hours in 2027 (1,688 annual hours). The schedule is 37.80 hours in 2024 (1,712 annual hours), 37.50 hours in 2025, and 37.32 hours in 2026. The reduction is conditioned on the legal approval of a maximum ordinary daily duration of 37.5 hours. The agreement also fixes eight production‑stop days each year, six of which are common to all four Finsa sites (24‑25 July, 24‑25‑31 December, 1 January); the remaining two days are set by local company committees and must not exceed four stoppage periods per year. Employees working night shifts during the four Christmas days receive compensation ranging from €60.97 to €213.38, depending on the shift. Salary adjustments include a linear 60 % reduction of shift supplements over 2024‑2026 (20 % per year), with €528 deducted from shift supplements each year to raise base salaries by €1.45 per day and €44 per month for all groups. These increases are paid in the 12 monthly payments and extra payments of the agreement. The agreement also introduces a professional classification model based on development and learning, and ties salary updates to the economic and social sustainability of the activity. Finsa reported €1.208 billion in revenue and employed 3,342 staff in the last fiscal year. The article quotes the agreement: 'El convenio colectivo de Finsa establece ocho días de parada de fabricación al año,' and notes the compensation range for night‑shift workers: 'los trabajadores que presten servicio en turnos en alguna de las cuatro jornadas navideñas reseñadas recibirán compensaciones económicas, que van de 60,97 a 213,38 euros.'\nOriginal language: es\nPublish date: September 08, 2025 05:10 PM\nSource:[La Voz de Galicia](https://www.lavozdegalicia.es/noticia/economia/2025/09/09/convenio-laboral-finsa-preve-rebajar-jornada-semanal-debajo-37-horas-ano-2027/0003_202509G9P32993.htm)\n\n**Poland Offers 20,000 zł per Employee in Short‑Work Pilot – Final Days to Apply**\nThe Polish Ministry of Family, Labour and Social Policy (MRPiPS) launched a pilot program in August 2024 to test shortened working hours while keeping pay unchanged.  The program invites employers from all sectors to submit proposals for custom work‑time models, such as a four‑day week, shorter days, longer holidays or flexible start times.  For each employee participating, a company can receive up to 20 000 zł, and the total grant per company can reach 1 000 000 zł.  The Ministry plans to allocate 50 000 000 zł from the Labour Fund for the entire project, which will run in three phases: preparatory (until end‑2025), test (full 2026) and summary (until May 2027).  As of 4 September, almost 300 fully completed applications had been received and 1 500 were still in progress, according to the ministry’s head of the department, Agnieszka Dziemianowicz‑Bąk, who said, 'Te liczby pokazują, że są w Polsce pracodawcy, którzy chcą skorzystać z tej wyjątkowej szansy skrócenia czasu pracy z zachowaniem wynagrodzenia.'  The deadline for submitting applications is 15 September, with results announced by 15 October.  A survey by SWPS University found that 65 % of women and 63 % of men are interested in a shorter work week; 36 % of women and 37 % of men favour a four‑day week with eight‑hour days, while 29 % of women and 19 % of men prefer a five‑day week with six‑to‑seven‑hour days or a ten‑hour four‑day week, respectively.  The ministry emphasised that the pilot is the first of its kind in Central and Eastern Europe, and that the goal is to improve work‑life balance, health and productivity, with the minister stating, 'Pracujemy, żeby żyć - a nie żyjemy, żeby pracować.'\nOriginal language: pl\nPublish date: September 08, 2025 04:11 AM\nSource:[Bankier.pl](https://www.bankier.pl/wiadomosc/Daja-20-tys-zl-na-pracownika-To-ostatni-dzwonek-na-zgloszenia-Kto-ma-szanse-na-rzadowa-dotacje-9004529.html)\n\n**Concerns rise over potential closure of ArcelorMittal South Africa's long steel business**\nArcelorMittal South Africa (AMSA) announced that no sustainable solution has been found to secure the future of its Long Steel Business beyond the current deferral period ending 30 September 2025. The company has placed its Newcastle blast furnace into temporary care and maintenance and is preparing for a possible closure that would affect roughly 4,000 jobs, including about 2,000 local positions and 3,500 national positions. AMSA said it has worked with the Industrial Development Corporation (IDC), government and other stakeholders, but 'Unfortunately, no solution has been concluded yet.' The Newcastle Growth Coalition Chapter, chaired by Johan Pieters, has called for an urgent meeting with AMSA, IDC, provincial and national leaders, and local businesses to discuss the future of the long steel business. Matthew Shunmugam, chair of the Newcastle Residents Forum, warned that the loss of over 2,000 direct jobs and thousands more in the steel value chain would devastate the community, increase unemployment, and harm local GDP. Willie Venter of Solidarity said the retrenchments could trigger a broader industrial crisis. Minister Nomakhosazana Meth noted that a R416,838,844.46 allocation from the Unemployment Insurance Fund (UIF) under the Temporary Employer/Employee Relief Scheme (TERS) had been secured for 2,982 employees, but the funding collapsed because AMSA could not provide a guarantee against retrenchments. The JSE SENS announcement reiterated that the company has explored strategic options but no solution has been implemented.\nOriginal language: en\nPublish date: September 03, 2025 03:14 PM\nSource:[IOL](https://iol.co.za/business-report/economy/2025-09-03-concerns-rise-over-potential-closure-of-arcelormittal-south-africas-long-steel-business/)\n\n**Budget 2026: Cuts, Complaints, Inefficiencies and Privileges**\nThe 2025 Budget Commission has received 18 institutional presentations, but there are about 100 state entities in total.  At the current pace of 20 institutions per week, the commission would need roughly a month to finish the reviews, and the major ministries of Education and Health—whose complexity could extend the schedule to about five weeks—remain pending.  \n\nIn mid‑year, Minister of Economy and Finance Felipe Chapman ordered a $1.9 billion spending containment, forcing several agencies to halt investments and even review payrolls.  The MEF also issued an order to close the fiscal year early, further limiting execution capacity.  Consequently, most of the 18 entities report frozen or cut budgets, which could restrict their 2026 investment plans and may lead the commission to request increases that could push the total state budget above $35 000 million. \n\nOfficials attending the hearings often argue that more money will solve management inefficiencies, but the government’s logic is that additional funds can actually amplify waste.  Historically, the state has provided money first and demanded efficiency later, resulting in a rising budget without clear improvements in education, health or security.  The MEF’s containment strategy aims to force better fiscal discipline, though it creates turbulence for agencies that now face a “new round of increases” to cover their needs. \n\nDuring the hearings, the Tribunal Electoral revealed that it pays private‑car insurance for its employees and provides special childcare and medical services.  Deputy Janine Prado asked, with justified concern, why the Tribunal’s staff do not use the public health system.  The Tribunal replied that its employees work overtime and therefore require such support, a justification that places them above ordinary citizens who also work extra hours but lack comparable benefits. \n\nPrado is the only deputy who has attended and asked questions at all sessions; many colleagues are absent or only attend popular sessions, which hampers the commission’s ability to make balanced cuts or increases.  The lack of participation is especially troubling given that the National Assembly itself has been criticized for its handling of public funds. \n\nThe hearings also highlighted that several institutions owe labor benefits for more than five years, exposing a contradiction: the state demands compliance from the private sector while failing to meet its own obligations.  \n\nKey metrics: \n- 18 institutions presented to the commission; \n- ~100 state institutions in total; \n- Current pace: 20 per week, requiring ~1 month; \n- Major ministries pending, extending schedule to ~5 weeks; \n- $1.9 billion spending containment; \n- Potential total budget >$35 000 million; \n- Housing deficit reported by the Ministry of Housing: ~150 000 units; annual production: 1–2 k units; \n- Proposed “government city” at the Ministry of Public Works in Albrook. \n\nThe article presents a critical view of the current budget process, highlighting inefficiencies, privilege disparities, and the need for better fiscal discipline.\nOriginal language: es\nPublish date: September 01, 2025 11:56 AM\nSource:[TVN](https://www.tvn-2.com/contenido-exclusivo/presupuesto-2026-recortes-lamentos-ineficiencias_1_2204311.html)\n\n**Shorter Work Hours for Same Pay: High Interest from Companies**\nThe Ministry of Family, Labour and Social Policy announced a pilot programme for shortened working hours while keeping salaries unchanged. In the first week of the call for proposals, 150 complete applications were received and 694 are currently being prepared, with the deadline set for 15 September. The pilot is open to micro‑, small‑, medium‑, large‑, and public‑sector organisations, allowing a wide range of business sizes to test the model. Funding comes from the Employment Fund reserve and is earmarked exclusively for activities listed in the regulations, covering organisational and technological changes, staff training, and wage subsidies during the programme. The total budget for 2025‑2027 is 50 million PLN, with a maximum grant of 1 million PLN per project and a per‑employee cost cap of 20 000 PLN; 10 million PLN were allocated for 2025 alone. Projects must involve at least half of the employer’s workforce, guarantee wage maintenance and employment stability, and may experiment with various models such as a four‑day week, shorter daily hours, longer holidays, or flexible start times. The call will close on 15 September, and the list of approved projects will be announced on 15 October 2025. The pilot will run in three stages: a preparatory phase until the end of 2025, a testing phase throughout 2026, and a concluding phase ending in May 2027. The ministry highlighted the strong interest from employers, saying, 'Te liczby pokazują, że są w Polsce pracodawcy, którzy chcą skorzystać z tej wyjątkowej szansy skrócenia czasu pracy z zachowaniem wynagrodzenia.'\nOriginal language: pl\nPublish date: August 23, 2025 02:38 PM\nSource:[TVN24](https://tvn24.pl/biznes/z-kraju/skrocony-czas-pracy-juz-setki-firm-chca-wziac-udzial-w-pilotazu-st8612846)\n\n**Will the Government Shorten the Work Week? New Tests Begin**\nThe Polish Ministry of Family, Labour and Social Policy has launched a pilot programme to test shortened working hours, attracting strong interest from employers. Since the call opened on 14 August, 150 complete applications have been received and 694 are currently being prepared. The programme, funded from the Labour Fund reserve, has a total budget of 50 million złoty for 2025‑2027, with a maximum grant of 1 million złoty per project. Funds may only be used for organisational and technological changes, employee training and wage subsidies as outlined in the regulations. Participation requires that at least half of an employer’s workforce be covered by the programme, with the employer guaranteeing current wage levels and employment stability. Pilot models include a four‑day work week, reduced daily hours and flexible hours. The programme runs in three phases: a preparatory phase until the end of 2025, a testing phase throughout 2026, and a concluding phase ending in May 2027. The Ministry will publish the list of qualified projects on 15 October 2025. Minister Agnieszka Dziemianowicz‑Bąk noted, 'The number of applications demonstrates the high level of interest among employers in this initiative.' The aim is to assess how different shortened‑time models affect business efficiency and employee well-being, with results informing future systemic solutions.\nOriginal language: pl\nPublish date: August 23, 2025 07:59 AM\nSource:[www.money.pl](https://www.money.pl/gospodarka/duze-zainteresowanie-pilotazem-skroconego-czasu-pracy-nowe-testy-7192313334147680a.html)\n\n**150 Firms Already Seek Shorter Working Hours – Ministry Reveals Scale of Interest**\nThe Ministry of Family, Labour and Social Policy (MRPiPS) announced that a pilot for a shortened working time has attracted strong interest. Since the call opened on 14 August, 150 complete applications have been received and an additional 694 are being prepared, with employers having until 15 September to submit their proposals. The programme targets a wide range of entities, from micro‑ to large enterprises and public institutions, to test different organisational models such as a four‑day week, shorter daily hours or flexible schedules. All projects will be evaluated according to the same criteria, regardless of the order of submission. Funding comes from the Labour Fund reserve and is earmarked for organisational and technological changes, employee training and wage subsidies. The total budget for 2025‑2027 is 50 million PLN, with a maximum grant of 1 million PLN per project. Projects must involve at least half of the employer’s workforce, ensuring salary continuity and employment stability. The pilot is divided into three stages: a preparatory phase until the end of 2025, a test phase in 2026, and a concluding phase ending in May 2027. The list of qualified projects will be announced on 15 October 2025. Minister Agnieszka Dziemianowicz‑Bąk noted, 'Ministerstwo Rodziny, Pracy i Polityki Społecznej (MRPiPS) ogłosiło, że liczby zgłoszeń pokazują duże zainteresowanie pracodawców tą inicjatywą.'\nOriginal language: pl\nPublish date: August 22, 2025 06:55 PM\nSource:[FAKT24.pl](https://www.fakt.pl/pieniadze/skrocony-czas-pracy-wielkie-zainteresowanie-naborem-do-pilotazu/mjze78k)\n\n**Poland Launches Pilot Program to Test Shorter Working Time**\nThe Polish Ministry of Family, Labor and Social Policy has launched a pilot program to test the implementation of a shorter working time. The program, which will run from 2025 to 2027, will provide 50 million PLN in funding. According to Minister Agnieszka Dziemianowicz-Bąk, 'We work to live, not live to work.' The pilot program aims to answer the question of whether and how working time can be shortened while maintaining the same salary. Any employer, regardless of size or sector, can apply to participate in the program. The program will test different models of shortening working time, such as a four-day working week, reduced working hours, or flexible start times. The Ministry of Labor emphasizes the importance of diversity in approaches and the need to find the most effective models of shortening working time. 'Over 50% of Poles want to shorten working time,' said a survey by the SWPS University. The pilot program will be funded by the Labor Fund, with a maximum of 1 million PLN per project. Employers can propose their own projects, tailored to the needs of their employees or the company's conditions and possibilities. The application process is simple, with a electronic form available on the Ministry's website. The deadline for applications is September 15, and the list of selected projects will be published by October 15, 2025.\nOriginal language: pl\nPublish date: August 13, 2025 03:42 PM\nSource:[Bankier.pl](https://www.bankier.pl/wiadomosc/Rusza-pilotaz-skroconego-czasu-pracy-mozna-skladac-wnioski-Pracujemy-zeby-zyc-a-nie-zyjemy-zeby-pracowac-8993122.html)\n\n",
    "date": "2025-09-27T01:03:29.531550",
    "summary": "Across all expert perspectives, there is strong consensus that the probability of the Nonlinear Fund having more than eight full-time equivalent employees on January 1, 2026, is low—generally estimated between 7% and 23% (with most probabilities clustering in the low teens). Common reasoning includes:\n\n- The base rate for young, small, grant-funded nonprofit organizations (especially in the AI safety and effective altruism space) exceeding 8 FTEs within the first few years is low, except in cases of transformative funding or strategic pivots.\n- The nonprofit ecosystem—especially in AI safety—has recently faced funding volatility, greater scrutiny, and reputational challenges, reducing the likelihood of aggressive hiring or rapid internal expansion.\n- Nonlinear Fund’s operational model (as described publicly) does not necessitate large staff numbers and, like many incubators or regrantors, likely continues to rely on a small core staff, contractors, and volunteer networks.\n- None of the experts found public evidence of recent large grants, significant announced expansion, or an upcoming shift in organizational model and communication, all of which would be required for public confirmation of 9+ FTEs as mandated for a Yes resolution.\n- While general labor market trends such as intense work cultures are noted, they are seen as more relevant for for-profit startups and do not meaningfully increase the probability of staff growth in this nonprofit context.\n- Additional risk comes from the possibility of organizational stagnation, contraction, or even abandonment—any of which would assure a No resolution.\n\nIn summary, unless an unexpected, publicly documented surge in funding or staffing is announced in late 2025, experts judge it significantly more likely that the Nonlinear Fund will remain at or below 8 FTEs on January 1, 2026.",
    "forecasters": [
        "Nonprofit Operations (BoardSource Governance Model)",
        "Human Resources Management (Workforce Planning)",
        "Organizational Sociology (Resource Dependence Theory)",
        "Organizational Sociology (Population Ecology Theory)",
        "Nonprofit Management (Nonprofit Lifecycle Model)",
        "Nonprofit Management (Strategic Philanthropy)",
        "Labor Economics (Human Capital Theory)"
    ]
}