{
    "deliberation_results": {
        "RealEstateAnalysis (ComparativeMarketAnalysis)": {
            "time_to_resolution": "Approximately 3.25 months (Until data from December 2025 is published, likely in early January 2026)",
            "perspective_relevance": "As a RealEstateAnalysis (ComparativeMarketAnalysis) expert, my perspective is uniquely relevant because CMA emphasizes empirically grounding forecasts in recent market performance, supply-demand imbalances, comparable sales, and signals of market momentum or inflection. CMA views prioritize base rates, historical comparables, and market frictions (liquidity, regulation, investor behavior) to calibrate the odds of both continued price surges and mean-reversion. I can parse the nuances in pricing momentum versus underlying fundamentals (affordability, interest rates, macro shifts, regulatory overhang) and distinguish secular from cyclical pressures in forecasting significant swings above historical norms.",
            "status_quo": "If nothing changes, Madrid would see a strong increase in housing prices—but likely not exceeding 18% YoY for December 2025, given both historical base rates and official forecasts for a slowdown from the exceptional 2024 (+20%) surge. Consensus analyst and banking forecasts for 2025 remain in the 6-10% range, with only outlier scenarios crossing 18%.",
            "perspective_derived_factors": [
                {
                    "factor": "Historical Price Change and Base Rate",
                    "effect": "DECREASES probability. Historically, even in the context of strong supply-demand imbalances and speculative fervor, >18% annual price growth is rare and tends to revert quickly. The 20% growth in 2024 was itself an outlier and likely represents a peak. Base rate for 18%+ increases in developed European city markets is <5% per year."
                },
                {
                    "factor": "Demand/Supply Imbalance",
                    "effect": "INCREASES probability. Madrid faces an acute shortage—reports show a deficit of 60,000+ homes, and national Spanish deficit is at least 765,000 units. This structural imbalance is directly tied to about 39% of observed price pressure and supports high SCM predictions for continued double-digit price growth locally."
                },
                {
                    "factor": "Momentum Effect (Recent Performance)",
                    "effect": "INCREASES probability moderately. Madrid posted 14% YoY gains for the last available period (mid-2025), making a further acceleration to >18% not inconceivable if demand-supply frictions worsen. However, such momentum generally loses steam as affordability erodes and policy responses intensify."
                },
                {
                    "factor": "Affordability Ratios and Demand Elasticity",
                    "effect": "DECREASES probability significantly. Price/income and rent/price ratios in Madrid are now near multi-year extremes, creating a natural demand cap. Youth and lower-income buyer participation has collapsed; median buyer age continues to rise. These limit the pool of new buyers, making repeat outperformance less likely."
                },
                {
                    "factor": "Macroeconomic and Regulatory Responses",
                    "effect": "DECREASES probability. ECB rates are likely to remain steady, with no significant mortgage easing in the short term. Efforts to curb speculation (ending Golden Visa, rent controls) are starting to bite, especially at the high end. Political pressure is mounting for supply-side and fiscal interventions."
                },
                {
                    "factor": "Foreign and Investor Demand",
                    "effect": "INCREASES probability slightly. Foreign buyers, especially non-resident and investment-oriented, are a bigger share than ever (20%+ in some reports). However, growth in this cohort is moderating and policy tightening could dull the effect."
                },
                {
                    "factor": "Analyst/Official Forecasts",
                    "effect": "DECREASES probability. The consensus among major banks, think tanks, and index compilers is for 6–10% growth for 2025 nationally, with hotspots like Madrid potentially reaching low double digits, but not 18%+. UBS puts Madrid in the 'moderate bubble risk' but not in runaway territory, and CaixaBank expects 10% in 2025 followed by ~6% in 2026."
                }
            ],
            "no_scenario": "Madrid's price growth slows in late 2025 as affordability ratios cap demand, policy interventions cool speculative fervor, and international investment growth plateaus or slightly recedes. Official YoY growth for December 2025 comes in at 12–15%. Supply continues to lag demand, but buyers are less able (or willing) to stretch to ever higher prices. Macro stability, but no new shocks add fuel. Resolution source (Idealista) shows less than 18% nominal gain over December 2024.",
            "yes_scenario": "Momentum from early and mid-2025 proves stronger than expected: distressed supply is completely soaked up, further amplifying the effect of the deficit. Foreign/investor demand further accelerates, outpacing weak regulatory constraints. One or more macro tailwinds emerge: economic stimulus, ECB dovish pivot, or a spike in overseas investment (e.g., emerging market flight to safety). Local shortages in Madrid become so severe that we see a parabolic price squeeze similar to 2024, and the December 2025 Idealista data registers >18% YoY increase.",
            "final_reasoning": "While Madrid continues to exhibit all the classic signs of a heated market—acute supply shortages, robust transaction volumes, surging rents, and solid foreign demand—the probability of sustaining >18% YoY nominal price growth into December 2025 is modest. The 2024 price explosion is atypical and followed by consensus expectations of a 'cooling' as affordability hits record stress, regulatory brakes are gradually applied, and mortgage conditions remain tight amid above-target inflation. Bank and analytic consensus anchor projections around 6–10% for Spain as a whole, with major capitals likely outpacing average but not doubling it. Comparative market analysis suggests that, with affordability as stretched as it currently is, and mounting macro and political headwinds, continuation of outlier double-digit gains is unlikely to repeat. The scenario for >18% growth requires several tailwinds coinciding—a further worsening of the supply squeeze, acceleration in foreign capital flows, and a complete absence of effective policy dampeners—all possible but less plausible in the most probable trajectory. Given these mixed, but mostly mean-reverting, signals, I judge the probability of Madrid exceeding 18% nominal housing price growth in 2025 as moderate at best.",
            "final_probability": 23
        },
        "RealEstateAnalysis (HedonicPricingModel)": {
            "time_to_resolution": "Approximately 3 months (until Idealista publishes December 2025 data in early January 2026).",
            "perspective_relevance": "As an expert in RealEstateAnalysis (HedonicPricingModel), I can systematically dissect the impact of various determinants (e.g., supply constraints, demographic shifts, credit conditions, international demand) on Madrid's housing prices. Hedonic models decompose observed price changes into attributable factors, distinguishing between fundamental shifts (e.g., rising demand vs. speculative excess), thus allowing for probabilistic judgment grounded in comparable international and temporal data.",
            "status_quo": "Madrid housing prices have recently risen sharply (20% in 2024, 14% YoY per latest global indices). However, leading banks and research houses forecast a 6–10% increase for 2025 in Spain overall, with high-demand areas like Madrid likely experiencing higher but not necessarily >18% increases. Historically, consecutive annual price rises of 18%+ are very rare in established European capitals.",
            "perspective_derived_factors": [
                {
                    "factor": "Severe Housing Supply Deficit",
                    "effect": "Increases probability. The shortage (deficit up to 765,000 homes nationally; >60,000 in Madrid province) continues to intensify, with new supply lagging far behind household formation, placing acute upward pressure on prices."
                },
                {
                    "factor": "Foreign and Non-resident Demand",
                    "effect": "Increases probability. Non-residents now contribute a record share of transactions and pay much higher per m² prices, particularly in Madrid’s premium segments, amplifying price escalation."
                },
                {
                    "factor": "Sustained High Household Formation & Demographic Growth",
                    "effect": "Increases probability. Madrid continues to attract both domestic and international migrants. New household creation outpaces construction, especially with single-person households rising sharply."
                },
                {
                    "factor": "Cautious Financing, No Bubble Dynamics",
                    "effect": "Decreases probability. Although demand is strong and financing has improved, lending standards remain tighter than in the 2008 bubble era, with lower LTVs and less speculative buying, moderating runaway price increases."
                },
                {
                    "factor": "Recent Extreme Price Growth (Base Rate Caution)",
                    "effect": "Decreases probability. The 20% surge in 2024 is very difficult to sustain in consecutive years (mean reversion tendency). Most analyst forecasts (e.g., CaixaBank, Tinsa) cap 2025 gains at 6%–10% for Spain. The longer the extreme ramp-up continues, the greater the headwinds."
                },
                {
                    "factor": "Policy and Regulatory Pressures",
                    "effect": "Slightly decreases probability. Measures such as ending the golden visa, calls for stronger rent controls, and criticism of speculative purchasing indicate a political headwind—though supply response lags, and actual impact has so far been limited."
                },
                {
                    "factor": "Affordability Ceiling and Demand Elasticity",
                    "effect": "Decreases probability. Access to homeownership among young and low-income buyers has collapsed; even with robust demand, stretched affordability (prices decoupling from incomes) creates natural limits and can trigger demand substitution (renting, moving to periphery)."
                }
            ],
            "no_scenario": "The market continues to experience tight supply and robust demand, but price growth cools after the exceptional 2024. Affordability reaches a breaking point for domestic buyers, foreign demand plateaus due to global economic headwinds or regulatory measures, and new supply slightly improves in 2H 2025. Rates remain stable but high enough to moderate credit-fueled purchases. Madrid prices rise robustly (+9–14%), but do not clear the extreme 18% threshold.",
            "yes_scenario": "Supply shortages worsen further, with almost no meaningful delivery of new stock. Persistent and intensifying foreign investment (possibly due to flight-to-quality or geopolitically-driven capital flows) triggers bidding wars for limited stock across all segments, not just luxury. Domestic household formation stays strong, and a softening in mortgage rates in Q4 2025 catalyzes more buying late in the year. Demand swamps available properties, pushing nominal increases over 18% for the second consecutive year.",
            "final_reasoning": "Madrid’s housing market fundamentals—most notably the extreme supply deficit and international capital inflows—create powerful upward pressure on prices. However, the magnitude of this pressure must be weighed against base rates: even in expansionary cycles, consecutive years of 18%+ nominal growth are rare in mature capital cities, especially after a 20% rise in 2024. While annualized price indices show ongoing double-digit YoY gains (~14% as of Q3), all major forecasts for 2025 now cluster below 18% (typically 6–10%). Recent hedonic drivers (demographics, foreign demand, supply dysfunction) remain unmitigated, but affordability is at a crisis point, and regulatory/political risks—though as yet ineffective—will erode speculative momentum. The persistence of high mortgage costs acts as a brake, and expectation of rate cuts in 2026 may cause some buyers to defer purchases, further tempering excess. Thus, while a 10–15% nominal rise is very likely, breaking the 18%+ barrier again will require a fresh, exogenous shock—such as a surge in investor panic-buying—which is not strongly evidenced in current trends/material. The status quo and expert consensus hence make >18% rise possible but improbable.",
            "final_probability": 15
        },
        "BankingAndFinance (RiskAssessmentStandards)": {
            "time_to_resolution": "Approximately 3.5 months (forecast date: September 25, 2025; question resolves when December 2025 prices are published, typically January 2026)",
            "perspective_relevance": "As an expert in BankingAndFinance (RiskAssessmentStandards), I bring a firm understanding of systemic risk, supply-demand analysis, asset price cycles, credit conditions, and how regulatory and macroeconomic factors interact to shape real estate price dynamics. I also focus on the difference between price momentum and fundamental value, the risk of overvaluation, and the inertia that typifies most housing markets unless jolted by severe external shocks.",
            "status_quo": "Madrid housing prices are rising rapidly: 20% in 2024, 14% year-on-year per major indices, with ongoing double-digit growth in 2025. Most base-case forecasts (e.g., CaixaBank) now expect 6–10% price growth in Spain in 2025, though Madrid outpaces national averages. The status quo is continued, but slowing, price appreciation, with a tendency toward normal (i.e., single-digit to low double-digit) growth in line with the broader European trend.",
            "perspective_derived_factors": [
                {
                    "factor": "Extremely tight housing supply and widening supply deficit",
                    "effect": "Increases the probability. With more than 39% of price pressures attributed to a housing deficit, and deficits in Madrid persisting/worsening, structural undersupply supports ongoing price increases, and makes sharp repricing unlikely barring a demand collapse."
                },
                {
                    "factor": "Sustained and robust demand—including foreign investment and new household formation",
                    "effect": "Moderately increases probability. Demand drivers (international capital, migration, tourism, internal household creation) are durable and, in aggregate, support persistent price pressures in the absence of a supply response."
                },
                {
                    "factor": "Mounting affordability constraints and outpacing of wage growth",
                    "effect": "Decreases the probability. Extreme price gains have severely reduced affordability, with the gap widening each quarter. This eventually constrains demand, especially from local buyers, and may reduce pace of appreciation (even if it does not trigger outright declines)."
                },
                {
                    "factor": "High, but not extreme, risk of market overheating or regulatory/financial intervention",
                    "effect": "Moderately decreases probability. Bubble indicators are rising. UBS and CaixaBank describe Madrid as at moderate (not extreme) risk. Regulatory interventions (golden visa end, discussions around taxes/rent controls) have not yet dented the price, but the likelihood of sharper policy or public reactions grows with further unsustainable surges."
                },
                {
                    "factor": "Recent price momentum and real-time indicators",
                    "effect": "Neutral to slightly increases probability. Recent price growth is very high (12–14% YoY in Q2 2025; rent growth double digits), but projections and consensus expectations point to a deceleration in H2 2025, with most major banks and analysts forecasting 5–10% for the full year."
                },
                {
                    "factor": "Mortgage and credit market conditions, despite ECB holding rates",
                    "effect": "Neutral to slight increase. Credit availability remains strong (14% uptick in new mortgages, resilient demand for housing credit), but real rates remain moderately high as ECB refrains from cuts; this restrains some speculative activity and limits the upside for price spikes."
                },
                {
                    "factor": "Increasing political and popular pressure for housing affordability",
                    "effect": "Slightly decreases probability. While direct interventions have had little bite so far, the risk that new, more disruptive measures will be deployed increases if prices rise excessively (e.g., above 18% again), which would introduce policy uncertainty that could cap or even reverse price gains in late Q4."
                }
            ],
            "no_scenario": "Price growth remains robust but slows, finishing 2025 with an annual increase in Madrid housing prices of 10–15% (consistent with consensus forecasts and fundamentals), due perhaps to an affordability ceiling being reached, some demand dampening from high prices and reduced credit growth, and/or anticipation of further regulatory measures that cap excessive appreciation.",
            "yes_scenario": "Prices in Madrid continue their recent momentum unimpeded: structural supply deficits worsen, foreign capital and new household formation sustain very strong demand, credit is amply available, and policy remains ineffective. Speculative buying and price inertia in key neighborhoods drive 2025 appreciation above 18% (annualized), perhaps approaching the extremes of 2024 (20%), due to a feedback loop of scarcity, fear of missing out, and investment flows—despite rising bubble risk and affordability crises.",
            "final_reasoning": "Base rates and forecasting discipline favor slower changes—housing price surges at this scale rarely persist in mature markets for multiple consecutive years, and all published analyst projections for Spain in 2025 anticipate single-digit to low double-digit growth, with Madrid possibly at the top end of national increases, but not exceeding 18%. However, supply-demand imbalances are extreme by historic standards, foreign demand is strong, and price momentum is currently in double digits, so a high-end outcome is plausible. Still, affordability ceilings, slowing wage growth, macro prudence, and the risk of policy intervention all point to meaningful headwinds. Given forecast discipline, abundance of base-rate-aligned projections, and the tendency for markets to cool after explosive gains, the odds of >18% growth in 2025 are meaningfully less than 50%, but not extremely low due to the extraordinary constraints and ongoing demand. I estimate the probability at 27%.",
            "final_probability": 27
        },
        "UrbanPlanning (MunicipalHousingPolicyReview)": {
            "time_to_resolution": "Approximately 3 months (until Idealista releases December 2025 data, expected in early January 2026)",
            "perspective_relevance": "As an expert in Urban Planning and Municipal Housing Policy Review, I focus on the structural (e.g., planning, land-use, supply-side) and policy determinants of housing affordability and price trends. My expertise allows rigorous assessment of how supply constraints, planning delays, local regulation, and demographic or market dynamics may drive or limit price growth, particularly in urban markets like Madrid.",
            "status_quo": "Base rates and the latest consensus forecasts from Caixabank, Tinsa, and UBS indicate expectations of a 6-10% rise in Madrid house prices for 2025, with Madrid recently clocking a 14% annual rise, though 2024 saw a sharp and possibly unsustainable 20% gain. The status quo outcome is that prices rise, but by less than 18%.",
            "perspective_derived_factors": [
                {
                    "factor": "Extreme supply deficit (structural undersupply)",
                    "effect": "Increases probability. Madrid faces some of Spain’s steepest housing deficits. Institutional, land-use, and regulatory bottlenecks have prevented adequate new construction. With the deficit widening, upward price pressure remains intense unless supply is rapidly ramped up—unlikely given planning/permit delays and construction timelines."
                },
                {
                    "factor": "Demand fundamentals (demographic growth and strong household formation)",
                    "effect": "Increases probability. Spain, and Madrid in particular, face high rates of household creation (immigration, smaller households, youth, etc.), exceeding new units delivered. Demand for both sale and rental housing remains robust, stoking competition for available housing and supporting continued price growth."
                },
                {
                    "factor": "Foreign/capital buyer dynamics",
                    "effect": "Increases probability. Foreign buyers (migrants, investors, 2nd home seekers) now comprise record shares of transactions. While luxury segment is most affected, spillover impacts entire market. Even removal of the golden visa scheme has not significantly dulled demand from non-residents, who pay higher prices."
                },
                {
                    "factor": "Affordability and credit conditions",
                    "effect": "Decreases probability. Although financing has loosened with improved economic/purchasing conditions and lower rates, price increases have outpaced disposable income. There are early signs of affordability ceilings, especially for local first-time buyers, as monthly financial outlays approach or exceed sustainable levels. Mortgage lending is still rising but may stall if interest rates or the cost of living increase."
                },
                {
                    "factor": "Macro & market cycle risk (overvaluation, risk of correction/cooldown)",
                    "effect": "Decreases probability. Multiple reports warn that Spain, especially Madrid, now shows clear signs of overvaluation (ECB, CaixaBank, UBS). A double-digit price rise on top of 2024’s 20% would push Madrid well above 2008’s bubble peaks. While Spanish banking and credit fundamentals are more robust than in 2007-08, overvaluation may constrain further expansion. If macroeconomic headwinds (higher rates, recession, regulatory changes) emerge late in the year, a sharp cooldown could follow."
                },
                {
                    "factor": "Municipal/regulatory responses",
                    "effect": "Uncertain/biased toward mild decrease. Policy levers (rent controls, tax/disincentive for non-residents, social housing) have thus far failed to expand supply or curb prices meaningfully. However, the possibility of more aggressive interventions (eg, restrictions on second homes, fiscal or credit controls) cannot be ruled out if political/social pressure intensifies, which could dampen tail-end price surges."
                }
            ],
            "no_scenario": "In this scenario, the market experiences strong price growth for most of 2025 but tapers substantially in Q4 due to one or more of: affordability ceilings being hit, mortgage rates inching upward, waning investor or foreign demand, or effective regulatory interventions. The increase for the year ends at 10–17%: strong, but not above 18%. Market momentum cools as buyer exhaustion, social backlash, logistical bottlenecks, and possible early effects of new supply begin to moderate prices.",
            "yes_scenario": "In this scenario, supply remains deeply constrained, demographic pressure intensifies, and foreign capital continues to inflow into Madrid, with zero meaningful relief from municipal or national regulation. Demand for housing (for both residence and investment) outstrips sluggish new delivery by a wide margin. Mortgage costs remain manageable or fall slightly as ECB and banks ease. Transaction and price momentum from mid-2024 continues unabated. By December, headline figures show an annual price increase exceeding 18%, possibly hitting or exceeding 20%, paralleling or surpassing the 2024 surge.",
            "final_reasoning": "Recent data show extraordinary price growth in Madrid (14–20% YoY), fueled by record demand, foreign capital, structural supply deficit, and only cosmetic regulatory responses. All core drivers—household formation, urban migration, foreign appetite for Spanish urban assets—remain robust, and new supply is months/years behind need. However, the degree of overvaluation and the duration of unsustainably high increases (20%+ for two years running) is historically rare. Most sector reports (UBS, CaixaBank, INE) forecast price growth in Madrid in 2025 of 7–14%. Achieving >18% would require another year of exceptionally tight conditions and sustained demand without a material correction or slowdown, despite mounting affordability concerns. The status quo thus favors a strong but sub-18% increase; risk of a late-year drop/cooldown/plateau is significant, especially with international signals of overvaluation and potential macro headwinds (rising rates, spillover from broader European markets, late-cycle fatigue). The base rate for >18% moves is low, but the current market's momentum and housing crisis raise the likelihood above historical norms, justifying a non-trivial—but still sub-50%—probability. I estimate a 30% chance that Madrid housing prices will rise by more than 18% in 2025.",
            "final_probability": 30
        },
        "Economics (SupplyAndDemandTheory)": {
            "time_to_resolution": "Approximately 3.3 months (Question resolves once December 2025 prices are published, likely January 2026)",
            "perspective_relevance": "As an Economics (SupplyAndDemandTheory) expert, my perspective is highly relevant since housing prices are critically shaped by the interaction of supply constraints and demand dynamics. Madrid's market currently exemplifies textbook cases where limited supply, rising demand, and price inelasticity interact to create sustained upward price pressure, nuanced by regulatory interventions, financing conditions, and international capital flows.",
            "status_quo": "In 2024, Madrid housing prices rose by 20%. Status quo projections for 2025, as per most major analysts and banks, point to a continued but slower increase—typically in the 6-10% range for Spain and 10-12% for Madrid, with some outlier projections higher but few reaching last year’s 20%. Absent a major shock or supply surge, a double-digit but sub-18% rise is the central forecast.",
            "perspective_derived_factors": [
                {
                    "factor": "Structural supply deficit",
                    "effect": "Increases probability; with a documented housing shortage of 60,000+ units in Madrid, and national supply decreasing, this exerts extreme pressure for above-average price rises."
                },
                {
                    "factor": "Robust demand—domestic and foreign",
                    "effect": "Increases probability; high migration, new household formation, and foreign buyers (especially non-residents) sustain strong demand, disproportionately affecting high-priced, supply-constrained cities."
                },
                {
                    "factor": "Affordability and wage decoupling",
                    "effect": "Decreases probability; rapid price increases are mismatched with wage growth, which may dampen local demand elasticity and could temper further explosive rises absent extremely inelastic demand."
                },
                {
                    "factor": "Recent base rate of price change and regression to the mean",
                    "effect": "Decreases probability; 2024’s +20% was an outlier. Historically, year-on-year increases above 15-18% are rare and tend to correct or moderate as substitution effects and buyer fatigue emerge."
                },
                {
                    "factor": "Interest rates and mortgage conditions",
                    "effect": "Slightly increases probability; continued easy financing, high mortgage issuance, and ECB policy holding off on sharp tightening supports demand. However, if rates edge up, this could moderate buyer appetite."
                },
                {
                    "factor": "Regulatory interventions (e.g., end of golden visa, rent controls)",
                    "effect": "Mixed effect; attempts to cool demand (ending golden visa, rent controls) might marginally decrease upward pressure, but to date, these have proven insufficient—especially for the owner-occupied market."
                },
                {
                    "factor": "Bubble risk, investor behavior, and speculative demand",
                    "effect": "Increases probability of large, unsustainable spikes, but bubble risk also means an elevated chance of a sudden pullback or pause if sentiment sours."
                },
                {
                    "factor": "International capital flows",
                    "effect": "Increases probability; with restriction-induced capital movement from other cities (e.g., Paris, London) into Madrid, upward price momentum could be sustained, especially at the high end."
                },
                {
                    "factor": "Forecast consensus and anchoring",
                    "effect": "Decreases probability; professional forecasts and bank analyses center on 7-12% rises, revealing an expert consensus against another +18% year. Rarely do prices double-up on consecutive extreme spikes outside hyperinflation or sudden speculative booms."
                }
            ],
            "no_scenario": "Housing prices in Madrid continue to rise, but at a moderated pace: as affordability becomes strained, local demand softens, and some foreign demand is stymied by new regulations and the end of golden visas. Prices climb by 8-14%, aligned with bank forecasts and typical of mature booms, but the 18% threshold is not breached. Investor sentiment, while still strong, becomes more cautious amid growing bubble warnings and gradual yield compression.",
            "yes_scenario": "The compounding supply shortage, surging household creation, and a rush of international capital fleeing tighter-regulated markets coalesce to drive a second consecutive year of outsized gains. Foreign buyers intensify activity, new supply is negligible, and owner-occupiers act ahead of anticipated further price hikes. Demand is extraordinarily inelastic due to rental market stress and societal homeownership preferences. Prices thus surge more than 18% year-on-year, shocking even bullish analysts.",
            "final_reasoning": "The status quo and expert base rates—from both historical Madrid price changes and current analyst forecasts—point decidedly below 18% as the modal outcome for 2025. Supply constraints are indeed acute, and demand remains robust, but the combination of stretched affordability, recent regulatory interventions, exhaustion from last year’s shocking +20% surge, and a narrowing band of plausible year-on-year price changes (as befits a market further into the expansion) all counsel moderation. Structural forces remain strongly inflationary for prices, and a spike over 18% can’t be ruled out (especially if international capital inflows accelerate or a speculative frenzy takes hold). However, with forecast consensus in the 6%-12% range for Madrid and very few historical precedents for consecutive years with 18%+ gains, the probability is real but moderate. In my judgment, an 18%+ increase is less likely than not, but not so improbable as to be dismissed, given the supply-demand imbalance and foreign demand tail-risks.",
            "final_probability": 27
        },
        "Economics (RealEstateMarketCycleTheory)": {
            "time_to_resolution": "Approximately 3 months (until December 2025 data is published and available, typically by January 2026).",
            "perspective_relevance": "As an expert in Real Estate Market Cycle Theory, my lens emphasizes the dynamics of cyclical overheating, mean reversion tendencies, supply-demand imbalances, and the likelihood of sharp inflections near the late stages of market expansions. This perspective is especially pertinent in evaluating whether Madrid’s >18% annual house price growth is sustainable after already seeing 20% growth in 2024 – a rare, late-cycle, and potentially unstable situation.",
            "status_quo": "Madrid’s housing prices are in a powerful uptrend, having increased by 20% in 2024 and 14% year-on-year by Q3 2025, fueled by structural shortages, robust demand, and strong international interest. Without significant external shocks or abrupt market corrections, the base rate for large, consecutive double-digit price increases in developed urban real estate markets is historically low outside of bubbles. Most forecasts call for continued—but decelerating—price growth.",
            "perspective_derived_factors": [
                {
                    "factor": "Structural Supply Shortage",
                    "effect": "Increases probability. The chronic deficit in new housing—pointed to as the key driver in multiple articles and analyst notes—provides ongoing upward pressure and explains much of the recent price surge."
                },
                {
                    "factor": "Foreign Demand & Investment-Driven Purchases",
                    "effect": "Increases probability modestly. The surge in non-resident (often cash-rich) buyers supports further price gains, particularly at the high end; however, the recent end of Spain’s Golden Visa may temper the luxury segment."
                },
                {
                    "factor": "Late-Cycle Expansion Signs & Bubble Risk",
                    "effect": "Decreases probability. Classic market theory predicts that above-trend price appreciation attracts more speculative demand and eventually leads to exhaustion—even without a crash, rapid gains almost always moderate after an explosive year."
                },
                {
                    "factor": "Affordability Constraints & Demand Elasticity",
                    "effect": "Decreases probability. Wages are not keeping up with prices, already thinning local buyer pools and shifting demand toward lower segments. Eventually, this caps how much prices can keep rising, unless there is an external capital injection."
                },
                {
                    "factor": "Forecast Consensus and Mean Reversion",
                    "effect": "Decreases probability. With analysts (e.g., Caixabank, Tinsa) predicting 6–9% further increases for 2025, and with Q2 and Q3 data so far well below the previous year’s explosive pace, the base-rate expectation is clearly for deceleration."
                },
                {
                    "factor": "Macro Environment: Rates, Credit, and European Economic Trends",
                    "effect": "Neutral-slightly increases. While ECB rates are not expected to fall imminently, credit conditions remain relatively supportive in Spain. Eurozone economic fragility could limit upside but is not yet triggering distress in lending."
                },
                {
                    "factor": "Recent Momentum",
                    "effect": "Increases probability. A 14% Y/Y gain in Madrid still by Q3 signals unusually strong momentum—late-cycle spikes sometimes precede one more blow-off top."
                }
            ],
            "no_scenario": "After 20% growth in 2024, housing price appreciation in Madrid decelerates significantly, with Q4 seeing only mild quarter-on-quarter changes due to affordability limits, more cautious lending, marginally cooling international demand, regulatory friction (e.g., rent controls, end of Golden Visa), and the psychological exhaustion of buyers. Prices for December 2025 are up, but by less than 18% from the previous year (for example, 12–16%), matching expert consensus. No market crash is required—just a sharp moderation in gains consistent with cyclical mean reversion.",
            "yes_scenario": "Despite affordability strains, structural shortages, foreign capital inflows, continued migration, and speculative momentum drive a market frenzy, causing another ‘late-cycle blow-off’ in Q4. Surge pricing, particularly in prime districts or from high-end international purchases, pushes Idealista’s average up over 18% Y/Y. Policy efforts to contain rent or demand fail, and the psychological expectation of ever-rising prices persists, overpowering affordability limits for at least one more year.",
            "final_reasoning": "Madrid's housing market is displaying classic late-cycle characteristics after a 20% rise in 2024, with bubble concerns gaining attention. Yet, mean reversion and affordability barriers typically stall similar extended surges. Empirically, few major markets sustain consecutive 18%+ annual gains, especially after a mega-jump. Q2 2025 data shows a 12.7% national increase Y/Y, with Madrid around 14%—below the 2024 pace. Broad market consensus (CaixaBank, Tinsa, UBS) projects decelerating, high single-digit or low double-digit growth for 2025, not an accelerating repeat of 2024. The ongoing, acute supply shortage and foreign demand argue for continued pressure, but probably insufficient for another 18% leap bar a speculative mania or external macro shock (both low probability). Most factors—historical base rates, consensus, late-cycle theory—point to a sharp moderation, though upside tail risk remains due to severe supply-demand mismatch and momentum.",
            "final_probability": 20
        },
        "Economics (MonetaryPolicyTransmission)": {
            "time_to_resolution": "Approximately 3.5 months (question resolves with publication of December 2025 Madrid housing data, expected January 2026, today is September 25, 2025).",
            "perspective_relevance": "As an expert in Economics with a specialization in Monetary Policy Transmission, my analysis incorporates how central bank decisions, credit conditions, and macro-prudential regulation interact with structural market drivers, such as supply constraints and demographic trends. This allows for an understanding not only of immediate market pressures but also of how policy, credit, and global capital flows feed through to asset price inflation, notably housing. My expertise enables a nuanced analysis of whether a local housing boom can persist at elevated rates in the face of broader financial conditions and economic feedback mechanisms.",
            "status_quo": "Over the past year (2024 Q2–2025 Q2), Madrid housing prices have already risen about 14%. Spanish housing overall is projected by banks and analysts to see a 6–10% annual increase, with Madrid at the higher end due to severe supply deficits, robust demand, and continued foreign capital inflows. If nothing changes, robust (but moderating) growth in housing prices in Madrid would continue, but the likelihood of a second consecutive ~20% surge is low per mainstream forecasts.",
            "perspective_derived_factors": [
                {
                    "factor": "Unyielding Supply Constraint",
                    "effect": "Strongly increases probability. A chronic housing shortage in Madrid is driving persistent upward price pressure, with multiple sources citing deficits exceeding 60,000 units locally and >700,000 nationally, and new construction unable to close the gap within a year."
                },
                {
                    "factor": "Sustained Demand and Household Formation",
                    "effect": "Moderately increases probability. Demographic trends (migration, new households, rising single-person living) and robust international demand remain intact, even as affordability wanes for some cohorts, supporting ongoing price increases."
                },
                {
                    "factor": "Policy Rate Environment and Credit Availability",
                    "effect": "Neutral to slightly negative. The European Central Bank is holding rates stable with no imminent cuts, keeping mortgage costs from falling further and moderating newly-leveraged demand. However, Spanish household debt levels remain historically low, so risk of demand collapse is contained."
                },
                {
                    "factor": "Market Overvaluation and Affordability Limits",
                    "effect": "Significantly decreases probability. Multiple analyses quantify Spanish housing (especially Madrid) as overvalued by 8–10%. Wage growth lags price gains. The base rate for >18% nominal annual increases is therefore low—second consecutive surges of this magnitude are rare as buyers/renters get priced out and political calls for intervention increase."
                },
                {
                    "factor": "Foreign/Investor Activity",
                    "effect": "Slightly increases probability. Foreign buyers/‘fly-to-yield’ capital are undeterred by high local prices and drive the top end of the market, but a much larger impact would be needed to propel citywide prices >18% again in a single year."
                },
                {
                    "factor": "Recent and Projected Growth Rates",
                    "effect": "Strongly decreases probability. The 2024 rise was an outlier at 20%. Bank sector and research consensus for 2025 is 6–10% at the national level; Madrid is forecasted to outperform but not to match last year's extraordinary rate. Reversion to the mean is likely after such a sharp surge."
                }
            ],
            "no_scenario": "Price growth in Madrid decelerates from 2024 highs as affordability bites, supply remains tight but demand finds its ceiling, and foreign investor appetite is offset by slower local demand or stricter regulation. ECB rates hold or ease only very modestly, leaving mortgage rates stable or only slightly lower. The final Madrid price increase comes in the 10–14% range, clearly above the Spanish national average but well below the >18% threshold.",
            "yes_scenario": "A continued and perhaps intensified housing crisis, worsened by a construction bottleneck, migration surge, or speculative fervor, combines with unforeseen monetary tailwinds (e.g., faster ECB rate cuts), or an external shock (flight from risk assets into real estate). Investor demand, both domestic and international, more than replaces softening end-user demand, driving another city-wide surge above 18%. The government fails to introduce or enforce measures to cool the luxury/foreign/investor market, and the supply shortfall proves even worse than measured.",
            "final_reasoning": "Base rates for two consecutive years of >18% nominal price increases in a major developed-world city are extremely low outside short-lived bubbles. Supply constraints, strong demand, and chronic deficiencies in affordable construction make high single-digit/low double-digit gains extremely likely for Madrid, and this is supported by current year-to-date data and analyst projections. However, virtually all authoritative forecasts for 2025—though acknowledging acute supply problems and a record price trajectory—predict a normalization of price growth (6% to 10%), with only the most bullish scenarios hinting at double digits, and none citing >18%. Reversion to sustainable growth rates is a natural expectation given the limits of affordability even in the presence of external capital inflows. The base rate is further supported by supply-deficit-driven inflation but capped by overvaluation, stagnant wages, and a lack of monetary or regulatory shocks that would inject further upside risk short-term. Thus, while the chance of a >18% rise is materially above zero (given the unique supply-demand imbalance), the probability remains low—though not negligible—at this late point in the year, with most data pointing to strong but moderating growth.",
            "final_probability": 12
        },
        "Urban Studies (UrbanGrowthTheory)": {
            "time_to_resolution": "Approximately 3.5 months, until December 2025 prices are published (expected Jan 2026).",
            "perspective_relevance": "As an expert in Urban Studies (UrbanGrowthTheory), my perspective synthesizes the drivers of urban housing prices: demand/supply dynamics, international investment, historical urban price cycles, regulatory context, and demographic trends. This lens allows for nuanced evaluation of price growth drivers, cyclicality, bubble risk, and the limits of unsustainable surges in major global cities like Madrid.",
            "status_quo": "Absent shocks, housing prices in Madrid continue an upward trajectory, but at a more moderate pace than the 2024 spike (20%), possibly landing in the 6-10% annual nominal range typical for high-demand, supply-constrained cities under sustained growth, but usually not maintaining 20%+ rises for consecutive years.",
            "perspective_derived_factors": [
                {
                    "factor": "Severe and Growing Housing Shortage",
                    "effect": "Strongly increases probability. The housing deficit in Madrid is acute (over 60,000 units needed), with national shortfall driving 39% of past price gains. No evidence of meaningful short-term supply relief."
                },
                {
                    "factor": "Insatiable Demand and Foreign Investment",
                    "effect": "Increases probability. Record foreign demand now constitutes 18% of sales, and non-resident/high-net-worth buyers pay significant premiums, driving up the upper end − Madrid is positioned as an alternative to mature, more regulated global markets."
                },
                {
                    "factor": "Base Rate of Extreme Price Rises in Developed Urban Markets",
                    "effect": "Decreases probability. In developed cities, consecutive years of 18%+ rises are rare outside of bubble or crisis-phase dynamics, as affordability ceilings and regulatory/political pressures typically slow the pace."
                },
                {
                    "factor": "Affordability Barriers and Social/Political Backlash",
                    "effect": "Decreases probability. Worsening affordability (housing well above wage growth), rising age of first-time buyers, and calls for intervention pose limits on how far demand can translate into double-digit rises; regulatory or public backlash could begin to constrain price acceleration, even if not fundamentally correcting it."
                },
                {
                    "factor": "Macro and Interest Rate Environment",
                    "effect": "Mixed/slight decrease. While rates remain high for now (ECB has not cut), mortgage acquisition is growing, but high inflation (2.7–3%) and flat Eurozone growth may sap some domestic demand and financing ability. However, non-resident/cash buyers cushion this somewhat."
                },
                {
                    "factor": "Recent Evidence of Price Trajectory",
                    "effect": "Decreases probability relative to 2024. Latest Q2 2025 yoy data show Madrid up ~14% (not 20%), and multiple major forecasts (UBS, CaixaBank Research, Tinsa) anticipate full-year rises in the 6–10% range—less than 2024 and below the 18% threshold."
                },
                {
                    "factor": "Bubble Risk and Terminal Cycle Signs",
                    "effect": "Mixed. UBS flags a moderate but rising bubble risk; bubble psychology can drive overshoots, but also means risk of an abrupt reversal or plateau if confidence weakens."
                }
            ],
            "no_scenario": "Madrid's nominal housing prices surge in early and mid-2025 but moderate in Q4 due to affordability barriers, regulatory or political interventions, marginal supply responses, or softer domestic/international demand. End-of-year data from Idealista shows a year-over-year increase of 12–16%, strong but below the 18% threshold, in line with forecaster/analyst projections.",
            "yes_scenario": "Structural shortage persists or worsens, with construction unable to keep up with household formation. Intensifying foreign investor demand, lunar luxury development, and speculative domestic enthusiasm accelerate prices well above forecast. Geopolitical or currency shifts spur additional safe-haven buying. Madrid posts another year of 19–22% nominal growth, beating 18%.",
            "final_reasoning": "Madrid faces structurally severe undersupply, record demand, and international investment which drive strong price growth. However, major sectoral forecasts (UBS, CaixaBank, Tinsa, government), recent base rate evidence from Q2 2025 (14% annual rise), and the rarity (historically) of back-to-back 18–20% annual price jumps in developed world capitals all weigh against another extreme surge. The fact that 2024 delivered 20% growth makes further double-digit compounding increasingly unsustainable against a backdrop of severe affordability erosion, growing political backlash, and ongoing but not accelerating international demand (especially as mid/high-end regulation intensifies). While bubbles can drive overshoots, the expectation from sector actors and base rates is for continued, but decelerating, nominal price growth (likely 10–15%), not a second year over 18%. Some 'tail risk' of another outsized jump persists due to the magnitude of shortages and cash-based speculative demand, but evidence and modelling do not justify a probability over 25%.",
            "final_probability": 20
        },
        "Urban Studies (LandUseEconomics)": {
            "time_to_resolution": "About 3.5 months until December 2025 data is published (expected by early January 2026)",
            "perspective_relevance": "As an expert in Urban Studies with a focus on Land Use Economics, I bring specialized insight into the mechanisms driving urban housing markets: supply-demand imbalances, regulatory environments, construction pipelines, demographic drivers, international capital flows, and land use constraints. In rapidly growing international cities such as Madrid, these factors—especially persistent supply constraints amid surging demand—are key to understanding price trajectories.",
            "status_quo": "The baseline expectation, as set by most institutional forecasts (Caixabank, reports cited in news), is for 2025 Madrid housing price increases of about 6–10%. The national figure is projected around 6–7%, with higher pressure in Madrid. In 2024, Madrid experienced a notable ~20% nominal increase, but the consensus expectation is for some cooling—albeit not a reversal.",
            "perspective_derived_factors": [
                {
                    "factor": "Supply Constraint and Housing Deficit",
                    "effect": "Increases probability. Madrid faces an acute and worsening housing shortage, estimated at >60,000 units. Construction is lagging household formation. This structural constraint underpins ongoing price pressure, making drastic declines very unlikely barring exogenous shock."
                },
                {
                    "factor": "Demand Composition (Foreign Buyers, Demographics, Internal Migration)",
                    "effect": "Increases probability. Non-resident/foreign purchases have risen sharply, disproportionately affecting premium markets like Madrid. Madrid’s role as a capital, economic hub, and international magnet amplifies housing demand even as youth/local affordability declines."
                },
                {
                    "factor": "International Capital Flows and Investment Climate",
                    "effect": "Increases probability. Reports document Madrid’s 'internationalization' and capital inflow (bubble risk elevated, with comparisons to dynamic global hubs like Dubai and Miami), adding upward price momentum—particularly at the high end."
                },
                {
                    "factor": "Affordability Constraints and Credit Access",
                    "effect": "Decreases probability. While demand remains robust, the sharp outpacing of price over wage growth tightens access. Youth purchases have collapsed; median buyer age rising, mortgage uptake down. Some ceiling on effective local demand is forming, possibly limiting price exuberance."
                },
                {
                    "factor": "Monetary Policy and Mortgage Rates",
                    "effect": "Slightly decreases probability. While conditions remain supportive (rate cuts are only expected in 2026 and current credit is accessible), further rises in mortgage rates or consumer caution could moderate demand, risking price deceleration."
                },
                {
                    "factor": "Regulatory/Policy Changes (Rent Controls, Golden Visa, Social Housing Initiatives)",
                    "effect": "Mildly decreases probability. Policy interventions (elimination of golden visa, rent controls, calls for social housing) have, so far, had limited impact, but a strong government response could temper speculative activity or alter luxury price dynamics."
                },
                {
                    "factor": "Base Rate/Mean Reversion",
                    "effect": "Strongly decreases probability. Historically, double-digit annual price increases are rare and infrequently repeated in consecutive years outside of bubble phases. Precedent suggests a cooling after a 20% year, reinforced by nearly all institutional forecasts projecting single-digit increases for 2025. 18%+ increases are extraordinary and would mark a second consecutive year of unusual exuberance."
                }
            ],
            "no_scenario": "Despite simmering supply constraints, the market absorbs some demand via rising prices, pricing out local buyers, and reducing transaction volumes. Affordability barriers bite, international inflows plateau, and moderation in macro sentiment leads to a deceleration: Madrid prices climb 8–12%, perhaps even 14%, but fall short of the exceptional 18% mark as balance-of-forces imposes new limits.",
            "yes_scenario": "Supply constraints combine with fresh capital inflows (perhaps spurred by negative real rates or geopolitical flight to Madrid’s perceived safe assets), and speculative dynamics erupt in the premium/luxury segment. Limited elasticity in supply plus persistent migration drives prices upward. No regulatory intervention blunts the trend. A second consecutive year of extreme price appreciation (>18%) occurs—possibly due to a late-year surge or intensified foreign demand.",
            "final_reasoning": "Madrid is amid a structurally tight, demand-rich housing market: deficits are widening, foreign and investment demand is strong, and institutional reports confirm the city's anomalously high global price increases (~14% YoY in late Q3 2025, per UBS and national statistics). Yet, even in the face of severe shortages and capital inflows, major bank forecasts (Caixabank, Tinsa) and sector consensus expect some moderation: national prices up ~6–10%, with Madrid at the top end but still below 18%. Nominal price acceleration >18% two years running is very rare in advanced urban economies lacking a clear bubble trigger (especially given the abolition of the golden visa and tighter rent regulation at margins). Affordability limits are biting hard (median age of buyers up, youth market collapsed); credit growth is solid but not spectacular; and macro/ECB policy acts as a governor. While a Yes outcome is possible—especially with global capital flows 'breaking the trend'—the base rate, status quo, and the weight of national/institutional projections argue for substantial regression toward the mean. Supply constraints ensure robust price increases, but an >18% surge would represent continued extraordinary exuberance in a market with existing affordability stress and policy attention. Given observed Q2–Q3 trajectory (+12–14%) and typical seasonal cooling, a final year-on-year result above 18% is possible but not likely unless there is a late-year capital inflow spike or speculative bubble behavior. Therefore, while I overweight the upside risk relative to historical cycles (reflecting extraordinary supply shortages and global demand), my probability remains cautious.",
            "final_probability": 17
        },
        "RegionalStudiesIberia (SouthernEuropeanHousingModel)": {
            "time_to_resolution": "Approximately 3.5 months (to January 2026, with December 2025 data likely available before Jan 7)",
            "perspective_relevance": "As an expert in RegionalStudiesIberia and the Southern European Housing Model, I draw on in-depth knowledge of the unique interaction between housing supply, demand, demographic changes, financial structures, regulatory tendencies, and macroeconomic constraints specifically affecting Spain and, by extension, Madrid. I can interpret how persistent supply-side inertia, external capital flows, tourism, Spanish household structures, and policy responses all intersect to shape housing market outcomes differently than in Northern Europe. This helps ground expectations amid cyclical booms and the apparent decoupling from wage growth or historical affordability norms.",
            "status_quo": "The default scenario is continued strong price growth in Madrid, but moderating to single digits. Most major forecasts and historical precedent point toward a price increase below the extraordinary 20% seen in 2024, with consensus expectations clustered around 6–10% for Spain overall, higher for Madrid but still likely under 18%.",
            "perspective_derived_factors": [
                {
                    "factor": "Persistent Structural Supply Deficit",
                    "effect": "Increases probability—The supply gap is severe and growing, especially in Madrid, where construction remains insufficient to meet demand from new household formation and inward migration, exerting powerful and durable upward pressure."
                },
                {
                    "factor": "International and Investment Demand",
                    "effect": "Increases probability—Foreign and non-resident buyers now account for 18–20% of sales in Madrid, often targeting higher segments and sustaining price increases. End of golden visa slightly tempers luxury demand but has not quelled broader upward momentum."
                },
                {
                    "factor": "Strong Labour Market and Demographic Trends",
                    "effect": "Increases probability—Economic stability, net migration, and high household-creation rates reinforce baseline demand. Spain is adding ~180,000 households per year with housing starts lagging well behind."
                },
                {
                    "factor": "Diminishing Affordability and Household Strain",
                    "effect": "Decreases probability—Even with strong demand, extraordinary price gains are running ahead of local incomes, raising barriers to entry and squeezing first-time buyers (notably youth). This growing affordability crisis eventually constrains how far prices can outpace fundamentals."
                },
                {
                    "factor": "Monetary Policy and Mortgage Environment",
                    "effect": "Marginally decreases probability—With ECB interest rates holding and no imminent cuts, mortgage costs stay modestly elevated, potentially dampening speculative or marginal demand. However, banks remain willing to lend, and financing is not a binding constraint yet."
                },
                {
                    "factor": "Price Overvaluation and Bubble Concerns",
                    "effect": "Slightly decreases probability—Institutions like UBS and CaixaBank warn of overvaluation in Madrid (estimated at 8–10% above equilibrium). While risk of a sharp correction in 2025 is low (due to financial stability, cautious lending, and absence of overbuilding), overvaluation signals greater vulnerability to shocks and should act as a drag on further acceleration."
                },
                {
                    "factor": "Base Rate: Historical Price Rises",
                    "effect": "Decreases probability—Double-digit annual increases over 18% are rare and usually follow major shocks or unique periods (e.g., post-pandemic). Even in recent boom years, sustained back-to-back >18% rises in a mature city market like Madrid are highly unusual."
                },
                {
                    "factor": "Policy and Regulatory Backdrop",
                    "effect": "Neutral to slightly decreasing—Recent efforts (rent controls, golden visa removal) are insufficient to change supply/demand balance this cycle, but might exert mild psychological drag as market participants anticipate future intervention."
                },
                {
                    "factor": "Tourism and Short-Term Rental Demand",
                    "effect": "Marginally increases probability—Madrid continues to benefit from high tourist demand, although 2026 may bring some deceleration. The impact is more visible in rents but spills into housing purchase demand as well."
                }
            ],
            "no_scenario": "Nominal house prices in Madrid rise, but by no more than 18% relative to December 2024. This could happen if affordability barriers harden, demand is restrained by interest rates or economic sentiment, or if policy/intervention chills speculative activity. Price gains slow to the consensus range (e.g., 9–14%), marking a robust but cooling market compared to the 20% surge witnessed in 2024. No major macroeconomic shock occurs, but growth reverts to trend.",
            "yes_scenario": "Madrid prices accelerate further, surpassing 18% annual growth from December 2024 to December 2025. This would likely require continued supply failure, another influx of foreign/investor demand, possible positive financial shocks (unexpected rate cuts), or a speculative feedback loop drawing in buyers despite widespread unaffordability. Strong household formation, combined with investor appetite and still-tight supply, could reproduce or outdo the 2024 growth rate, but this needs a confluence of bullish momentum and absence of consumer/policy backlash.",
            "final_reasoning": "Several forces support continued price inflation in Madrid: entrenched supply shortages (worse in Madrid than nationally), unrelenting demand from domestic and international entrants, and a labor market that has powered sustained household formation. The 2024 increase (+20%) was exceptional, and recent data put Q2 2025 year-on-year gains at 14%—a strong figure near the high-water mark among global capitals. Still, the policy consensus (e.g., CaixaBank, Tinsa) as well as semi-official macroeconomic projections uniformly forecast a moderation to 6-10% annual Spain-wide, acknowledging even Madrid may modestly outperform but is unlikely to repeat consecutive years of 18%+ increases in a relatively mature and already expensive market. Overvaluation signals, affordability gaps (with youth buying plunging), and purchase effort indices at record strains suggest the market faces increasing headwinds to further acceleration. Policy interventions have been ineffective so far, but the risk of a more forceful policy or behavioral shift rises as overvaluation becomes more socially and politically salient. Base rates are especially important here: runs of back-to-back >18% rises in a city Madrid’s size and maturity are historically rare barring extraordinary exogenous shocks (e.g. post-lockdown, regime-change). While local structural factors strongly favor ongoing outperformance, a repeat of last year’s explosive growth is improbable in absence of new demand or credit shock. Upside tails exist, but the most likely scenario is a robust but moderated gain, with the final year-on-year figure (as per Idealista) likely in the 12–16% range. Based on the overall evidence, especially sharp recent increases making continued exponential acceleration hard to sustain, I judge the probability of >18% growth as meaningfully above baseline—but clearly below even odds.",
            "final_probability": 25
        }
    },
    "deliberation_probability": [
        23,
        15,
        27,
        30,
        27,
        20,
        12,
        20,
        17,
        25
    ],
    "deliberation_mean_probability": 21.6,
    "deliberation_sd": 5.815687596683837,
    "deliberation_probability_result": 22,
    "group_results": {
        "realestateanalysisComparativemarketanalysis": {
            "forecaster_to_engage": "UrbanPlanning (MunicipalHousingPolicyReview)",
            "response_type": "defense",
            "response": "UrbanPlanning (MunicipalHousingPolicyReview) correctly emphasizes the extraordinary market momentum and structural constraints facing Madrid—demand, migration, foreign capital, and a chronic lag in supply, all amplified by the city’s slow regulatory response. Their reasoning gives appropriate weight to the severity of the undersupply and clearly acknowledges that a late-year cooldown or plateau is plausible given both local and global signals of overvaluation. Where their argument is especially robust from a comparative market analysis perspective is in recognizing the plausibility of continued strong (though sub-18%) price growth, rooted in fresh data (recent 14–20% YoY gains) and detailed sectoral forecasts. Their probability (30%) is slightly higher than my own but defensible, given that momentum from a hot market often persists longer than expected in the presence of structural barriers to new supply and delayed policy intervention. Importantly, they resist the temptation to stretch the probability towards an extreme, instead situating their estimate in a reasonable band where both recent price history and institutional projections overlap, but with a modest overweight to short-term upside risk. This approach aligns well with the way a prudent comparative market analyst would interpret the tangled but potent signals now visible in Madrid’s residential market."
        },
        "realestateanalysisHedonicpricingmodel": {
            "forecaster_to_engage": "Economics (MonetaryPolicyTransmission)",
            "response_type": "critique",
            "response": "While Economics (MonetaryPolicyTransmission) accurately highlights the very low base rate for back-to-back >18% nominal price surges in major cities and appropriately emphasizes the cooling effects of affordability constraints and monetary conditions, their probability (12%) arguably underweights the exceptional extent of current supply-demand imbalances uniquely plaguing Madrid. From a HedonicPricingModel viewpoint, pricing momentum is not just driven by macro-rate cycles or aggregate national trends, but by multi-factor market frictions—such as spatial heterogeneity of undersupply, persistent structural demand (e.g., rising single-person households and migration), and increasing cross-border investment, much of it less rate-sensitive. These factors have historically led to higher-than-expected persistence of outsized price gains in global cities, especially where regulation lags and speculative demand compounds. Furthermore, recent Q3 YoY data still show double-digit growth, indicating momentum has not yet abated. While moderation is likely, the chance that Madrid's unique structural and behavioral drivers result in another outsized annual gain (even if under 18%) is higher than in more balanced urban markets. Therefore, a probability somewhat above 12% is warranted, with tail risk higher than suggested by purely macro-level base rates."
        },
        "bankingandfinanceRiskassessmentstandards": {
            "forecaster_to_engage": "Economics (SupplyAndDemandTheory)",
            "response_type": "defense",
            "response": "Economics (SupplyAndDemandTheory) presents a balanced assessment integrating both strong inflationary pressures from entrenched supply shortages and robust, even if somewhat fatigued, demand. From a BankingAndFinance (RiskAssessmentStandards) perspective, their emphasis on the base rates for consecutive extreme price surges in developed city markets is methodologically sound—base rate discipline prevents overweighting the recency or unusual size of last year's 20% increase. Their rationale also reflects macroprudential instincts by highlighting regulatory and affordability limits as natural headwinds to continuation of extraordinary appreciation, which aligns with how risk-focused financial analysis tempers extrapolation from momentum alone. They do not dismiss upside risk; rather, they articulate clearly that the probability of >18% growth is real but moderate, matching the way a prudent risk officer would frame the uncertainty in these conditions. Their probability estimate (27%) is nearly identical to my own and is robustly justified in terms of both market fundamentals and risk-management reasoning."
        },
        "urbanplanningMunicipalhousingpolicyreview": {
            "forecaster_to_engage": "Urban Studies (LandUseEconomics)",
            "response_type": "defense",
            "response": "Urban Studies (LandUseEconomics) provides a nuanced, empirically grounded perspective that is highly consistent with a municipal housing policy review lens. Their emphasis on the persistence and depth of Madrid's supply constraints—coupled with a candid appraisal of how even extreme shortages and strong capital inflows are, in practice, often checked by affordability and macroprudential brakes—accurately reflects the complex tension seen in advanced urban markets. Notably, the discussion on how major bank forecasts and the status quo point to strong but not 'hyperbolic' gains is well founded, and the insight that nominal surges of >18% for two consecutive years would be anomalous absent a clear macro or behavioral trigger is supported by comparative global urban data. Importantly, the analysis doesn't neglect the possibility of tail-risk acceleration but assigns it an appropriately modest probability, echoing urban-planning logic that meaningful intervention (or exhaustion of buyer pools) eventually caps unsustainable climbs. The main difference is a somewhat more conservative probability (17%), which is justifiable, but the overall approach—anchored in structural analysis, base rates, and critical attention to overvaluation signals—complements and substantiates my own reasoning as a municipal housing policy expert."
        },
        "economicsSupplyanddemandtheory": {
            "forecaster_to_engage": "RealEstateAnalysis (HedonicPricingModel)",
            "response_type": "defense",
            "response": "RealEstateAnalysis (HedonicPricingModel) offers a strong methodological argument grounded in multi-factor price determination, which aligns closely with a supply-and-demand analytical approach. Their reasoning appropriately accounts for structural supply deficiencies and the elevated contribution of foreign capital—two powerful hedonic drivers pushing Madrid housing prices higher. Where their analysis is particularly compelling is its transparent differentiation between national and Madrid-specific momentum: unlike macro-only perspectives, it recognizes that high-end capital inflows and spatial frictions may generate higher persistence in outsized gains, even when consensus points to moderation. Their identification of increased affordability pressure and regulatory headwinds mirrors my own caution, and their assignment of a low—but not negligible—probability to another outsized jump reflects both base rates and the validity of current market-data signals. In sum, their forecasting process robustly integrates unique Madrid factors while keeping perspective on historic limits, providing a justifiably lower but reasonable probability (15%) for an >18% increase."
        },
        "economicsRealestatemarketcycletheory": {
            "forecaster_to_engage": "Urban Studies (UrbanGrowthTheory)",
            "response_type": "defense",
            "response": "Urban Studies (UrbanGrowthTheory) captures a key late-cycle dynamic emphasized in RealEstateMarketCycleTheory: the mounting unsustainability of rapid consecutive price jumps in large, mature markets, especially after an explosive year. Their reasoning rightly highlights the role of severe undersupply, international investment, and record demand in keeping price increases robust, alongside a sober read of the rarity for back-to-back 18–20% jumps in developed-world capitals. I also appreciate their explicit reference to Q2 2025 data (~14% YoY) and the alignment with sector forecasts (10–15%) for Madrid—grounding their probability both in near-term evidence and historic base rates. They give deserved weight to 'tail risk' and do not discount the possibility of one last late-stage surge, but their judgment that the most likely scenario is deceleration with continued strong—but sub-18%—appreciation is highly consistent with cycle theory and international market behavior. Their estimate (20%) is both cautious and fully justified in light of the available evidence, and their structured approach strengthens the overall consensus for a low but non-negligible probability of extreme upside."
        },
        "economicsMonetarypolicytransmission": {
            "forecaster_to_engage": "BankingAndFinance (RiskAssessmentStandards)",
            "response_type": "critique",
            "response": "BankingAndFinance (RiskAssessmentStandards) presents a disciplined approach rooted in base rates, macroprudential caution, and the classic tendency for exuberant markets to revert to the mean after surges. However, from a MonetaryPolicyTransmission perspective, this analysis could give greater consideration to the ways in which monetary and credit channel effects may interact with deep structural shortages and persistent capital inflows in ways that temporarily defy historical moderation patterns. For example, even if ECB policy rates stay stable, local lending conditions in Spain—abetted by competitive banking behavior and risk-tolerance underpinned by low overall household indebtedness—might still enable price momentum to overshoot analyst consensus, especially in capital focal points like Madrid. Additionally, the analysis could further separate the risk posed by global investor flows, which are often less interest-rate-sensitive, potentially extending the period of outsized gains in a highly capitalized market. While the baseline is well-justified, a richer modeling of these monetary and behavioral transmission mechanisms might warrant a somewhat higher probability on the possibility of exceeding 18%, especially given the persistent deviations observed in other global 'superstar' cities under supply crisis. Thus, while the overall risk discipline is sound, it may slightly underestimate the upside tail if it over-relies on mean-reversion and macro base rates without enough attention to current, localized transmission factors."
        },
        "urbanStudiesUrbangrowththeory": {
            "forecaster_to_engage": "RegionalStudiesIberia (SouthernEuropeanHousingModel)",
            "response_type": "defense",
            "response": "RegionalStudiesIberia (SouthernEuropeanHousingModel) effectively integrates both region-specific and city-level factors in the Madrid housing market, yielding a nuanced and credible probability estimate. Their analysis highlights several crucial points from an UrbanGrowthTheory standpoint: the entrenched supply shortfall, the increasing importance of labor market and household formation, and the empirical rarity of sequential years with >18% growth in mature markets. Particularly strong is their recognition that unique local demand, compounded by global capital flows, will keep Madrid outpacing most national trends—yet not at an endlessly accelerating rate. The forecaster rightly weighs the risk of further political/regulatory intervention as overvaluation stress escalates, reflecting both cyclical and institutional urban change. They do not ignore the upward tail risk posed by extraordinary local constraints, but they correctly anchor their estimate on historical and international base rates, concluding that a robust, but sub-18% increase, is most likely. Their probability (25%) judiciously balances the acute upside drivers with the natural mean-reversion expected at this advanced stage of market expansion, aligning closely with the insights derived from urban growth and market cycle theory."
        },
        "urbanStudiesLanduseeconomics": {
            "forecaster_to_engage": "RealEstateAnalysis (ComparativeMarketAnalysis)",
            "response_type": "defense",
            "response": "RealEstateAnalysis (ComparativeMarketAnalysis) excels at properly contextualizing Madrid's housing trajectory within both cross-market comparables and longer-term statistical base rates. Their analysis underscores that, although Madrid's current supply-demand crisis and foreign investment pressures could theoretically perpetuate another extreme nominal price gain, the most likely outcome in comparable developed markets is a regression toward more sustainable, even if robust, annual growth figures following a year of outlier appreciation. From a LandUseEconomics viewpoint, their recognition of mounting headwinds—specifically stretched affordability, incipient policy friction, and market psychology after a record year—is correct and empirically grounded. They also draw on recent transaction and price data to show why extended extreme growth is structurally difficult to maintain without a true policy or demand shock. Importantly, by situating their probability (23%) not too far from the prevailing consensus, yet slightly overweight relative to strict mean reversion, they capture both the unusual local drivers and the rarity of repeated outsized gains. This approach resonates well with urban land-use models, which forecast eventual constraints even when bottlenecks and exogenous capital have powered temporary surges."
        },
        "regionalstudiesiberiaSoutherneuropeanhousingmodel": {
            "forecaster_to_engage": "BankingAndFinance (RiskAssessmentStandards)",
            "response_type": "critique",
            "response": "BankingAndFinance (RiskAssessmentStandards) offers a well-argued, disciplined appraisal, emphasizing the low base rate of back-to-back >18% price increases and introducing meaningful skepticism grounded in affordability ceilings and macroprudence. However, from the perspective of Southern European Housing Model dynamics, their reasoning may slightly underweight the unique persistence and resilience of price surges in submarkets like Madrid. In Spain (and specifically Madrid), structural supply inertia, deeply embedded homeownership culture, slow and fragmented policy response, and the growing internationalization of the residential asset market can generate longer cycles of outsized appreciation than the typical mean-reversion observed in more liquid, supply-responsive Northern European or Anglo-Saxon contexts. Furthermore, the dampening effect of potential policy intervention mentioned by BankingAndFinance may be less immediate or impactful than suggested, given institutional inertia and electoral calculations. While their 27% estimate is reasonable, a richer integration of these Southern European structural specificities—especially the slow burn of chronic underbuilding relative to migration and household creation—might support either a slightly higher or more fat-tailed probability, as Madrid may remain an exception to some macroprudential assumptions."
        }
    },
    "revision_results": {
        "RealEstateAnalysis (ComparativeMarketAnalysis)": {
            "my_phase1_final_probability": 23,
            "reasoning_for_revised_probability": "After engaging with group deliberation, I note that most forecasters across diverse methodologies (hedonic pricing, banking/finance, urban planning, macro, land-use, and regional comparative models) converge tightly in the 15–30% range for the probability of >18% price growth in Madrid for 2025. Notably, UrbanPlanning (MunicipalHousingPolicyReview) provides a compelling case for overweighting structural tail risks due to the severe supply crisis and ongoing strong pipeline of demand, which echo my own factors but put a more acute emphasis on the momentum and lag in policy effectiveness. None of the analyses bring forth new conclusive evidence that would shift the central trajectory upward—major bank/sector forecasts and historical base rates still do not support a shift into the high-30%+ range, while collective expert judgement leans toward a 'robust but not extraordinary' repeat increase. However, the uniform recognition of ongoing market explosiveness, modest upside tail risk in the face of inertia, and lack of evidence for a sharp downside reversal—combined with external validation of my base rates—nudges my confidence slightly toward the upper bound of my initial range. As such, I am revising upward by a small margin.",
            "revised_probability": 25
        },
        "RealEstateAnalysis (HedonicPricingModel)": {
            "my_phase1_final_probability": 15,
            "reasoning_for_revised_probability": "The group deliberation confirmed the core logic of my Phase 1 outlook: a powerful combination of supply shortages and demand persistence continues to push Madrid's nominal price growth to double digits. Multiple forecasters independently converged on a central estimate in the 15-30% range, with a shared analytical base: historical rarity of consecutive 18%+ surges, forecasts from banks and data providers capping growth at 6-14%, and severe affordability limits. Critiques of the lowest probabilities (e.g., 12%) pointed out Madrid's extraordinary supply-demand mismatch and persistent momentum, supporting a slightly heavier overweight to upside risk than the pure national macro base rate would suggest. Nevertheless, no compelling evidence or scenario emerged to make >18% the likeliest outcome or even raise it above one-in-five odds. There is broad consensus that, absent an external shock or true speculative mania—which are not evident in Q3 data—the year will close with strong but not ultra-extreme growth. Thus, my estimate remains near the low end of the consensus range, but I have increased it slightly (from 15% to 18%) to reflect the recurring argument that Madrid's unique frictional dynamics may sustain momentum modestly beyond conventional expectations.",
            "revised_probability": 18
        },
        "BankingAndFinance (RiskAssessmentStandards)": {
            "my_phase1_final_probability": 27,
            "reasoning_for_revised_probability": "Group deliberation showed tight clustering and strong base-rate alignment among experienced forecasters from real estate market analysis, urban studies, and economics disciplines. Nearly all concur that the supply deficit and price momentum make a >18% rise more likely than base rates alone would suggest, but historical rarity, stretched affordability, and a growing consensus for moderation among local and international reports put clear limits on further upside. The most persuasive arguments reinforced the view that the exceptional momentum could allow for risk of another outsized gain, but that 2025 is overwhelmingly likely to see robust but decelerating annual growth (with Madrid at the top end nationally, but below the >18% threshold). None provided compelling new evidence or logic that would move the probability sharply up or down from my initial assessment. Therefore, my probability estimate remains at 27%.",
            "revised_probability": 27
        },
        "UrbanPlanning (MunicipalHousingPolicyReview)": {
            "my_phase1_final_probability": 30,
            "reasoning_for_revised_probability": "After reviewing the group input, I find near-unanimous consensus among diverse domain experts—spanning banking risk, economics, comparative real estate analysis, and regional studies—that the base case expectation for 2025 is strong but not extreme nominal housing price growth in Madrid. All experts, even those most bullish on supply-demand pressures, emphasize the rarity of consecutive years with >18% price gains for a major mature city, especially after a 20% surge. A few critiques argue for slightly higher tail risk due to unique market and demographic factors, but these are generally situated within a still-moderate probability range (all probabilities cluster between 12% and 30%). Notably, more granular real estate models and urban studies focus on how overvaluation, political response risk, and affordability ceilings are intensifying into late 2025. There is little new evidence favoring a higher probability than my phase 1 estimate; if anything, the group analysis bolsters the view that 30% is toward the upper end of defensible probabilities. Given this convergence and slightly increased conviction in the strength of headwinds (overvaluation, late-cycle moderation), I will slightly revise my probability downward to 25%.",
            "revised_probability": 25
        },
        "Economics (SupplyAndDemandTheory)": {
            "my_phase1_final_probability": 27,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, my initial judgment remains well-calibrated relative to both the evidence and the range of peer estimates. The consensus among forecasters—including those using comparative market, hedonic, urban-planning, and financial risk perspectives—is robust: virtually all locate the probability of a >18% Madrid housing price increase in 2025 somewhere in the 12%–30% band, with most clustering around 15–27%. Arguments for moderation (recent base rates, expert consensus, affordability ceilings) are repeatedly affirmed, while the acknowledgment of persistent tail risk from supply deficits and capital inflows is common to almost all forecasts. No new evidence or compelling argument emerged to significantly tilt the probability higher or lower than my prior estimate. Thus, my perspective as a supply-and-demand theorist remains aligned with the group, and there is no sufficient justification to revise my probability.",
            "revised_probability": 27
        },
        "Economics (RealEstateMarketCycleTheory)": {
            "my_phase1_final_probability": 20,
            "reasoning_for_revised_probability": "After engaging with the group, I find that the consensus among diverse disciplinary experts—banking, urban planning, hedonic modeling, comparative market analysis, supply/demand theory, and urban studies—is tightly clustered in the 12–30% band, with most between 15% and 27%. Nearly every forecaster, regardless of perspective, stresses the rarity of consecutive >18% jumps in mature global cities, and while all note the uniquely severe supply-demand mismatch in Madrid, none identify sufficiently strong upward shocks or shifts to override the natural mean reversion that typically follows a year like 2024. Those slightly higher (27–30%) are justifiably weighting momentum and acute shortages, but most detailed modelers and analysts either converge on or slightly underweight my initial 20%. No compelling new evidence or arguments were raised that materially affect the core base-rate, consensus, or cyclical analysis underlying my original estimate. If anything, the evident group convergence toward a cautious rather than outlier tail-risk posture slightly strengthens my confidence in the original call.",
            "revised_probability": 20
        },
        "Economics (MonetaryPolicyTransmission)": {
            "my_phase1_final_probability": 12,
            "reasoning_for_revised_probability": "Reviewing group deliberation, the consensus among forecasters draws consistently on the rarity of consecutive >18% surges in major cities like Madrid, with almost all probabilities clustered below 30% and most under 20%. There are some persuasive arguments from comparative market and hedonic modeling perspectives that Madrid’s extraordinary supply deficit and continued strong demand, particularly from less interest-rate-sensitive foreign/investor capital, might overweight normal base rates and create more persistent upside risk than classic macro models suggest. However, these forces are already substantially considered in my initial structural factors. The clearest new insight is a subtle reinforcement: while upside tail risk should not be wholly discounted in this unique context, the building consensus around moderating (but still strong) price growth aligns with my initial analysis. I do not see sufficient new evidence to widen the probability estimate beyond my original cautious range, though the group process validates that the event’s chance is non-trivial but below the base frequency for such extreme moves.",
            "revised_probability": 12
        },
        "Urban Studies (UrbanGrowthTheory)": {
            "my_phase1_final_probability": 20,
            "reasoning_for_revised_probability": "The group deliberation revealed broad multidisciplinary agreement, with almost all forecasters clustering in the 12-30% range and most—across economics, banking, real estate, and regional urban studies—placing their probabilities between 15% and 27%. My base rate-driven, status quo-oriented analysis from Phase 1 is reinforced by the consensus that (a) Madrid's market remains exceptionally tight and price-supportive, (b) back-to-back double-digit surges are historically rare, and (c) all major forecasts for 2025 anticipate strong but moderating growth (typically in the 10-15% range). No compelling new evidence emerged from group review to suggest a need for a more bullish stance; on the contrary, most deliberators also caution against overweighting momentum. Tail risk for an outsized run exists, but is adequately captured in the low 20s percentage band. Therefore, my original probability remains well-calibrated.",
            "revised_probability": 20
        },
        "Urban Studies (LandUseEconomics)": {
            "my_phase1_final_probability": 17,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, the broad consensus is remarkably consistent with my own initial assessment. Most expert forecasters with a wide range of disciplinary perspectives, including Comparative Market Analysis, UrbanGrowthTheory, RealEstateMarketCycleTheory, and Regional Southern European Housing Models, all point to a low but non-negligible likelihood—typically ranging from around 12% up to 30%, with clustering in the 15–27% band. These analyses robustly reaffirm the methodological case for mean reversion following the 2024 surge, and provide further reinforcement that double-digit price increases are highly probable (12–16%), but >18% would require an additional exogenous shock or persistent capital inflow unlikely to go undetected at this late stage. No compelling new evidence or perspective emerged in deliberation to justify a notable upward adjustment, and most participants validated the weighting of supply constraints, affordability ceilings, and the role of global capital, as well as the use of historic base rates. The risks remain asymmetric, with upside tail risk slightly elevated due to the ongoing supply crisis and speculative interest, but still far from likely. Thus, I will maintain my initial probability as the most justifiable point estimate.",
            "revised_probability": 17
        },
        "RegionalStudiesIberia (SouthernEuropeanHousingModel)": {
            "my_phase1_final_probability": 25,
            "reasoning_for_revised_probability": "After group deliberation, the broad consensus across quantitative, comparative, financial, and urban theory perspectives is that a repeat of Madrid’s >18% price increase is possible but not likely, with most expert estimates clustering in the 15–30% range. Critiques and defenses reinforced that Madrid’s unique blend of severe supply shortage, strong foreign capital flows, and idiosyncratic regional market dynamics mean its probability of outsized growth this cycle is modestly higher than base-rate-driven expectations for similar Northern European or Anglosphere cities. However, the persistence of affordability constraints, mounting political sensitivity, and evidence of slight deceleration in recent YoY price growth (14% in Q2 2025), all suggest mean reversion remains the modal outcome. My initial focus on the Spanish/Southern European housing model’s inertia aligns with these conclusions, though several colleagues pointed out that policy risk is likely overestimated short-term and supply inertia underweighted in most forecasts. While this might support a small upward revision, the weight of current price momentum, recent data, and broad consensus justify only a minor move. Consequently, I will slightly increase my probability to 27% to better reflect the non-trivial tail risk and the possibility for Madrid to defy ‘mean reversion’ for longer than typical developed urban cores.",
            "revised_probability": 27
        }
    },
    "revision_probability": [
        25,
        18,
        27,
        25,
        27,
        20,
        12,
        20,
        17,
        27
    ],
    "revision_mean_probability": 21.8,
    "revision_sd": 5.181162460726786,
    "revision_probability_result": 22,
    "question_details": {
        "id": 38828,
        "title": "Will housing prices in Madrid rise by more than 18% in 2025?",
        "created_at": "2025-08-31T05:08:24.133769Z",
        "open_time": "2025-09-24T17:57:06Z",
        "cp_reveal_time": "2025-09-24T19:27:06Z",
        "spot_scoring_time": "2025-09-24T19:27:06Z",
        "scheduled_resolve_time": "2025-12-31T22:59:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-09-24T19:27:06Z",
        "actual_close_time": "2025-09-24T19:27:06Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "This question is synced with an identical question on Metaculus. The original question opened on 2025-02-27 12:57:00 and can be found [here](https://www.metaculus.com/questions/35570). This question will resolve to the same value as the synced question. The original question's background info at this time is below. \n\nIn 2024, house prices in the city of Madrid rose by 20%, and the Madrid real estate market is expected to continue its upward trajectory in 2025. According to [ <u>Caixabank Research</u> ](https://www.caixabankresearch.com/en/sectoral-analysis/real-estate/spanish-real-estate-market-2024-2025-expansive-mode), the current state of the Spanish real estate market is generally characterized by strong demand and tight supply. [ <u>They forecast</u> ](https://www.caixabankresearch.com/en/sectoral-analysis/real-estate/new-forecasts-spanish-real-estate-sector-expansionary-cycle-takes) a 6%-7% increase for house prices in Spain.\n\n`{\"format\":\"metac_closes_in_period\",\"info\":{\"post_id\":35570,\"question_id\":35020}}`",
        "resolution_criteria": "The question will be answered as **Yes** if, according to the sales price data published on the [ <u>Idealista portal</u> ](https://www.idealista.com/sala-de-prensa/informes-precio-vivienda/venta/madrid-comunidad/madrid-provincia/madrid/), the average price of housing in the **city of Madrid** per square meter rises by more than 18% from December 2024 to December 2025. It will be answered as **No** if the increase is 18% or less, or if there is a decrease in prices.",
        "fine_print": "* At the time of writing this question, December 2024 prices are €4,952/m² according to the graph and table \"Historical variation in sales prices in Madrid\" in the resolution source. However, the increase will be calculated based on the December 2024 prices shown when the December 2025 data is published.\n * Nominal figures will be compared, without discounting the effect of inflation.\n\n • If Idealista has not published data for December 2025 by January 7, this question will be resolved based on the increase from November 2024 to November 2025. If this is not available, this question will be **cancelled**.",
        "post_id": 39451,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Spain’s Housing Crisis Worsens: 700,000 Homes Needed While Supply Falls**\nSpain’s housing crisis is worsening, with a projected need for 700,000 finished homes in 2025 to meet new household creation, while supply is falling. The Bank of Spain previously estimated a deficit of 400,000–450,000 homes between 2022 and 2024, but José Luis Escrivá now says 700,000 will be required: 'José Luis Escrivá señaló que en 2025 se necesitarían unas 700.000 viviendas terminadas para los nuevos hogares creados.' Caixabank’s study found a 515,000‑home deficit over 2021‑2024 based on net household creation of 970,000 versus 454,000 new‑construction permits; when finished houses and alternative uses are considered, the deficit rises to 765,000. Idealista reports that the supply of available homes has dropped 39 % since the second quarter of 2019, further tightening the market: 'Idealista alertan de que el número de viviendas que salen al mercado nacional no solo no aumenta al mismo ritmo de la demanda, sino que está disminuyendo.' INE data project that Spain will add almost 3.7 million households in the next 15 years, with one‑person households growing from 5.4 million to 7.7 million—a 41.86 % increase—meaning more dwellings will be needed. The article concludes that the only solution is to build more homes.\nOriginal language: es\nPublish date: September 24, 2025 04:35 AM\nSource:[Libertad Digital](https://www.libertaddigital.com/libremercado/2025-09-24/mier-se-agrava-la-crisis-de-vivienda-en-espana-se-necesitan-700-000-pero-la-oferta-se-hunde-7299101/)\n\n**El precio de la vivienda en España bajo Sánchez alcanza niveles no vistos desde 2008**\nIn the second quarter of 2025, Spain’s average free‑housing price climbed to 2,093.5 €/m², a 10.4 % year‑over‑year increase that leaves the market only 0.3 % below the peak of the 2008 bubble. Prices are rising across all autonomous communities, with San Sebastián at 6,071 €/m²—over 250 % above the national average—and Madrid and the Balearic Islands above 3,900 €/m². The surge outpaces wage growth, tightening access for young and low‑income households and pushing rents higher. Analysts argue the growth is driven by solid demand, cautious financing and a stable labour market, and not a repeat of the 2008 bubble. Structural tension from limited new housing and international interest could still pose over‑valuation risks in the most active areas. Projections forecast a 5–7 % price increase by the end of 2025, with continued pressure in major capitals and tourist zones, while other regions may see milder gains. The widening affordability gap underscores the need for new housing policies. 'El aumento del precio de la vivienda tiene un impacto social significativo, especialmente para jóvenes y familias con ingresos medios o bajos,' the article notes.\nOriginal language: es\nPublish date: September 24, 2025 01:24 AM\nSource:[Periodista digital](https://www.periodistadigital.com/economia/20250924/precio-vivienda-espana-sanchez-alcanza-niveles-vistos-2008-noticia-689405135698/)\n\n**Madrid Housing Price Surge Raises Risk of Real‑Estate Bubble**\nAccording to the UBS Global Real Estate Bubble Index 2025, Madrid has become \"'Madrid se ha consolidado como una de las capitales más dinámicas del panorama inmobiliario internacional.'\" The city recorded the highest real‑price growth among the 21 cities analysed, with a 14 % increase over the last year, compared with stagnation in much of Europe and North America. This surge pushed Madrid into the moderate‑risk bubble group, receiving a risk score of 0.80, up from a lower level a year earlier. UBS analysts note that the risk is even higher in cities such as Miami, Tokyo, Zurich, Los Angeles or Dubai, where Dubai has also seen the largest rise in risk since the previous edition. The price climb is attributed to strong foreign demand—positioning Madrid as an alternative to more mature markets like London, Paris or Vancouver—and to limited supply in central areas, which pressures prices even in less exclusive neighbourhoods. \"'El Gobierno ha intentado enfriar el mercado con medidas como la eliminación del programa de golden visa para compradores de vivienda y un mayor control sobre los alquileres.'\" yet these initiatives have not succeeded in curbing the escalation. In terms of affordability, a qualified worker would need about six to seven years to buy a 60‑m² apartment in Madrid, compared with 10–15 years in cities like Hong Kong, Paris or London. For renters, UBS points out that Madrid is close to markets where buying remains relatively profitable, meaning rent is expensive relative to purchase. The city’s trajectory contrasts with European centres that have corrected past excesses, such as Paris, London or Munich, and aligns with Dubai and Tokyo, which still experience strong real‑price growth. UBS concludes that the return of international investment to markets with looser regulation and higher potential returns is driving Madrid’s continued rise.\nOriginal language: es\nPublish date: September 23, 2025 04:34 PM\nSource:[EL PAÍS](https://elpais.com/economia/2025-09-23/la-escalada-de-los-precios-de-la-vivienda-en-madrid-eleva-el-riesgo-de-burbuja-inmobiliaria.html)\n\n**Miguel Sebastián warns that even with a stable economy, people notice housing problems**\nOn the Spanish TV program Al rojo vivo, former minister and economist Miguel Sebastián warned that, despite a stable economy, the public still feels the housing crisis. He said, 'Aunque la economía vaya bien, la gente nota el problema de la vivienda', linking the issue to a loss of purchasing power amid high prices. The latest inflation data from the Instituto Nacional de Estadística (INE) showed the consumer price index (CPI) at 2.7 % year‑on‑year in August, unchanged from July; food inflation moderated to 2.3 %, while fuel and air transport kept household costs high. Sebastián noted that inflation is falling but the most recent figure was not good and he predicts a rise to 3 % in September, which he described as 'malo'. Eurostat reported euro‑area inflation at 2 % in August, underscoring Spain’s steeper inflation. ECB President Christine Lagarde said the bank was in a 'good position' and would not cut rates in the short term, a stance that could affect mortgage costs. Housing market data from Idealista indicated the highest price level on record, and CaixaBank Research forecasts price increases of over 10 % in about 60 % of Spanish municipalities with more than 25 000 residents. Sebastián rejected policies that would encourage more home ownership, arguing instead that 'Hace falta vivienda en alquiler. Es el objetivo' and that Spain’s high home‑ownership rates make further debt‑based ownership unsustainable. He also expressed concern about Spain’s public deficit, citing France’s situation as a warning that Spain could face a similar 'callejón sin salida' if fiscal imbalances are not corrected. The broader European context remains fragile, with inflation near the ECB target and growth projected at only about 1 % in 2026, which explains why, according to Sebastián, 'la gente nota' the everyday pressure despite apparent recovery.\nOriginal language: es\nPublish date: September 23, 2025 02:49 PM\nSource:[El Confidencial](https://www.elconfidencial.com/economia/2025-09-23/miguel-sebastian-economista-economia-vaya-bien-problema-vivienda-1qrt_4214673/)\n\n**Madrid’s Housing Prices Surge, Bubble Risk Rising**\nThe UBS Global Real Estate Bubble Index reports that Madrid’s housing market has seen the largest price increase among major world cities, rising 14% over the past year, and is now positioned at a moderate but rising bubble‑risk level.  The index, which covers 21 cities, places Madrid in the middle of the table, behind Miami – the highest‑risk market – but ahead of cities such as London, Paris and Milan, which have low risk.  In the global context, prices in large cities have been stable in real terms, following three years of cooling after the 2020‑2022 boom, yet Madrid “breaks the trend” as the most dynamic market in Western Europe.\n\nRent prices in Madrid have also surged, with a 10% real‑term increase in the last year, driven by \"the strong creation of new households\" and \"the limited pace of new housing construction\".  Analysts warn that demand far outstrips supply, pressuring both the sale and rental markets, and that the structural shortage of new construction – exacerbated by long urban planning timelines and a lack of final‑stage land – remains a key issue.\n\nForeign investment has been a key driver of price growth in the capital, and the end of Spain’s Golden Visa programme – which allowed residence permits through property purchase – has particularly impacted the luxury segment.  Regulatory measures to tighten rent controls have sparked debate among owners, funds and sector associations.\n\nUBS author Maciej Skoczek notes that \"more stringent rules, such as new taxes or purchase prohibitions and rent‑control measures, have reduced the attractiveness of previously highly demanded markets such as Vancouver, Sydney, Amsterdam, Paris, New York, Singapore and London, but have not fully contained the pressure when supply is insufficient.\"\nOriginal language: es\nPublish date: September 23, 2025 12:04 PM\nSource:[elEconomista.es](https://www.eleconomista.es/vivienda-inmobiliario/noticias/13559036/09/25/ni-nueva-york-ni-londres-ni-paris-el-riesgo-de-burbuja-inmobiliaria-crece-en-madrid-con-los-precios-de-la-vivienda-disparados.html)\n\n**Real Estate Market: More Supply, Rising Prices, Increasing Vacancy and Cautious Demand**\nAccording to a new report from Economic Trends compiled by the Colegio de Profesionales Inmobiliarios de Córdoba (CPI), the rental stock in Córdoba is 83.4 % above the 2023 average, surpassing pre‑Ley de Alquileres levels. Vacancy in residential properties rose to 3.7 %, up 0.2 percentage points from the previous month, while commercial vacancy reached 3.1 %, up 0.9 points. In July, real‑estate sales were 0.2 % lower than the same month in 2024, indicating a stagnant market. Apartments accounted for 40.4 % of transactions, followed by houses (25.5 %) and housing (13.8 %). New rental contracts saw price increases of +50.2 % for houses, +51.8 % for apartments, and +102.5 % for commercial spaces, reflecting continued rent pressure. July rental activity fell 34.7 % YoY, showing a decline in demand for new leases. In Córdoba Capital, a two‑bedroom apartment rents for $600,000 (as of 15 August), while in Nueva Córdoba the same unit rents for $720,000. One‑bedroom rents range from $410,000 to $540,000 depending on the area. Median sale prices for two‑bedroom apartments are US$144,500 in Nueva Córdoba and US$75,000 in the city centre; one‑bedroom medians range from US$58,000 to US$88,350. The report concludes that the market’s recovery remains dependent on macro‑economic factors such as inflation, mortgage credit and income expectations. The article notes, 'El stock de inmuebles habitacionales destinados al alquiler superó el nivel que tenía al momento de entrada en vigencia de la normativa.'\nOriginal language: es\nPublish date: September 24, 2025 03:16 PM\nSource:[La Voz](https://www.lavoz.com.ar/clasificados-inmuebles/mercado-inmobiliario-mas-oferta-precios-en-alza-vacancia-creciente-y-demanda-cautelosa/)\n\n**Spain’s Housing Crisis Worsens: 700,000 Homes Needed While Supply Falls**\nSpain’s housing crisis is worsening, with a projected need for 700,000 finished homes in 2025 to meet new household creation, while supply is falling. The Bank of Spain previously estimated a deficit of 400,000–450,000 homes between 2022 and 2024, but José Luis Escrivá now says 700,000 will be required: 'José Luis Escrivá señaló que en 2025 se necesitarían unas 700.000 viviendas terminadas para los nuevos hogares creados.' Caixabank’s study found a 515,000‑home deficit over 2021‑2024 based on net household creation of 970,000 versus 454,000 new‑construction permits; when finished houses and alternative uses are considered, the deficit rises to 765,000. Idealista reports that the supply of available homes has dropped 39 % since the second quarter of 2019, further tightening the market: 'Idealista alertan de que el número de viviendas que salen al mercado nacional no solo no aumenta al mismo ritmo de la demanda, sino que está disminuyendo.' INE data project that Spain will add almost 3.7 million households in the next 15 years, with one‑person households growing from 5.4 million to 7.7 million—a 41.86 % increase—meaning more dwellings will be needed. The article concludes that the only solution is to build more homes.\nOriginal language: es\nPublish date: September 24, 2025 04:35 AM\nSource:[Libertad Digital](https://www.libertaddigital.com/libremercado/2025-09-24/mier-se-agrava-la-crisis-de-vivienda-en-espana-se-necesitan-700-000-pero-la-oferta-se-hunde-7299101/)\n\n**El precio de la vivienda en España bajo Sánchez alcanza niveles no vistos desde 2008**\nIn the second quarter of 2025, Spain’s average free‑housing price climbed to 2,093.5 €/m², a 10.4 % year‑over‑year increase that leaves the market only 0.3 % below the peak of the 2008 bubble. Prices are rising across all autonomous communities, with San Sebastián at 6,071 €/m²—over 250 % above the national average—and Madrid and the Balearic Islands above 3,900 €/m². The surge outpaces wage growth, tightening access for young and low‑income households and pushing rents higher. Analysts argue the growth is driven by solid demand, cautious financing and a stable labour market, and not a repeat of the 2008 bubble. Structural tension from limited new housing and international interest could still pose over‑valuation risks in the most active areas. Projections forecast a 5–7 % price increase by the end of 2025, with continued pressure in major capitals and tourist zones, while other regions may see milder gains. The widening affordability gap underscores the need for new housing policies. 'El aumento del precio de la vivienda tiene un impacto social significativo, especialmente para jóvenes y familias con ingresos medios o bajos,' the article notes.\nOriginal language: es\nPublish date: September 24, 2025 01:24 AM\nSource:[Periodista digital](https://www.periodistadigital.com/economia/20250924/precio-vivienda-espana-sanchez-alcanza-niveles-vistos-2008-noticia-689405135698/)\n\n**Madrid Housing Price Surge Raises Risk of Real‑Estate Bubble**\nAccording to the UBS Global Real Estate Bubble Index 2025, Madrid has become \"'Madrid se ha consolidado como una de las capitales más dinámicas del panorama inmobiliario internacional.'\" The city recorded the highest real‑price growth among the 21 cities analysed, with a 14 % increase over the last year, compared with stagnation in much of Europe and North America. This surge pushed Madrid into the moderate‑risk bubble group, receiving a risk score of 0.80, up from a lower level a year earlier. UBS analysts note that the risk is even higher in cities such as Miami, Tokyo, Zurich, Los Angeles or Dubai, where Dubai has also seen the largest rise in risk since the previous edition. The price climb is attributed to strong foreign demand—positioning Madrid as an alternative to more mature markets like London, Paris or Vancouver—and to limited supply in central areas, which pressures prices even in less exclusive neighbourhoods. \"'El Gobierno ha intentado enfriar el mercado con medidas como la eliminación del programa de golden visa para compradores de vivienda y un mayor control sobre los alquileres.'\" yet these initiatives have not succeeded in curbing the escalation. In terms of affordability, a qualified worker would need about six to seven years to buy a 60‑m² apartment in Madrid, compared with 10–15 years in cities like Hong Kong, Paris or London. For renters, UBS points out that Madrid is close to markets where buying remains relatively profitable, meaning rent is expensive relative to purchase. The city’s trajectory contrasts with European centres that have corrected past excesses, such as Paris, London or Munich, and aligns with Dubai and Tokyo, which still experience strong real‑price growth. UBS concludes that the return of international investment to markets with looser regulation and higher potential returns is driving Madrid’s continued rise.\nOriginal language: es\nPublish date: September 23, 2025 04:34 PM\nSource:[EL PAÍS](https://elpais.com/economia/2025-09-23/la-escalada-de-los-precios-de-la-vivienda-en-madrid-eleva-el-riesgo-de-burbuja-inmobiliaria.html)\n\n**Miguel Sebastián warns that even with a stable economy, people notice housing problems**\nOn the Spanish TV program Al rojo vivo, former minister and economist Miguel Sebastián warned that, despite a stable economy, the public still feels the housing crisis. He said, 'Aunque la economía vaya bien, la gente nota el problema de la vivienda', linking the issue to a loss of purchasing power amid high prices. The latest inflation data from the Instituto Nacional de Estadística (INE) showed the consumer price index (CPI) at 2.7 % year‑on‑year in August, unchanged from July; food inflation moderated to 2.3 %, while fuel and air transport kept household costs high. Sebastián noted that inflation is falling but the most recent figure was not good and he predicts a rise to 3 % in September, which he described as 'malo'. Eurostat reported euro‑area inflation at 2 % in August, underscoring Spain’s steeper inflation. ECB President Christine Lagarde said the bank was in a 'good position' and would not cut rates in the short term, a stance that could affect mortgage costs. Housing market data from Idealista indicated the highest price level on record, and CaixaBank Research forecasts price increases of over 10 % in about 60 % of Spanish municipalities with more than 25 000 residents. Sebastián rejected policies that would encourage more home ownership, arguing instead that 'Hace falta vivienda en alquiler. Es el objetivo' and that Spain’s high home‑ownership rates make further debt‑based ownership unsustainable. He also expressed concern about Spain’s public deficit, citing France’s situation as a warning that Spain could face a similar 'callejón sin salida' if fiscal imbalances are not corrected. The broader European context remains fragile, with inflation near the ECB target and growth projected at only about 1 % in 2026, which explains why, according to Sebastián, 'la gente nota' the everyday pressure despite apparent recovery.\nOriginal language: es\nPublish date: September 23, 2025 02:49 PM\nSource:[El Confidencial](https://www.elconfidencial.com/economia/2025-09-23/miguel-sebastian-economista-economia-vaya-bien-problema-vivienda-1qrt_4214673/)\n\n**Youth Home Purchases in Spain Collapse to Less Than Half in 20 Years**\nThe article reports a steep decline in home purchases by Spanish youth (18‑30 years old), falling from 22.5 % in 2007 to 9.5 % in 2025, a drop of more than half. The median age of buyers has risen from 40 to 47‑48 years, an increase of eight years. Housing prices per square metre have returned to the 2007 level of €2,077, but are 27 % below that historical peak when adjusted for inflation. Mortgage usage has fallen from 87 % of sales in 2007 to 54 % in 2024, with the share of the purchase price financed by a mortgage dropping from 84 % to 72 %. The number of mortgages signed fell from 722,000 in 2007 to roughly half that in 2024. In high‑price areas such as Madrid (80 % of mortgages), larger loans are requested, whereas in less‑demanded provinces the debt burden is higher relative to income. The average financial effort needed to buy a house has decreased from six annual income‑based instalments in 2008 to 5.1 in 2024, though in expensive regions like the Balearic Islands up to eight instalments are required. Foreign buyers have tripled their share of purchases, rising from 4.4 % in 2007 to 12.6 % in 2024, and now account for one in five homes in 2025, especially in the Balearic Islands, Alicante, Málaga, Murcia and the Canary Islands. The share of foreign residents in sales is 13 % overall, with 7 % non‑resident buyers; in provinces such as Alicante (32 %) and Málaga (20 %) the non‑resident share is particularly high. The article cites Alberto Martínez, director general of the Centro Tecnológico del Notariado, who warned in the Spanish Congress that the housing crisis is most acute in places like San Sebastián (€6,000/m²), Barcelona (€4,500/m²), Madrid (€4,900/m²) and the Balearic Islands (€3,800/m²). He noted that protected housing supply has collapsed, with only 10 % of the 1995 peak of 122,000 units currently being built. The article presents these figures without editorial commentary, focusing on factual data.\nOriginal language: es\nPublish date: September 23, 2025 12:38 PM\nSource:[La Razón](https://www.larazon.es/economia/viviendas-compradas-jovenes-desploman-menos-mitad-apenas-20-anos_2025092368d294bc31b8a3479b7840a2.html)\n\n**UBS: Madrid and Dubai Record Highest Increase in Real Estate Bubble Risk**\nUBS’s latest Global Real Estate Bubble Index shows that Miami has the highest bubble risk among the cities examined, followed by Tokyo and Zurich. Los Angeles, Geneva, Amsterdam and Dubai also show visibly high risk, with Dubai registering the largest increase in risk since the previous edition, alongside Spain’s capital. UBS notes that Madrid has the largest real‑price growth of any city in the study, rising 14% compared with last year. According to the firm, Madrid, Frankfurt and Munich fall into the moderate‑risk group, while London, Paris and Milan are considered low‑risk. Most experts dismiss a housing bubble in Spain, arguing the current issue is a supply shortage rather than a financial one. Cities that were flagged as high risk in 2021—such as Frankfurt, Paris, Toronto, Hong Kong and Vancouver—have seen an average real‑price decline of almost 20% from their peaks due to rising interest rates, whereas cities with lower imbalances have fallen about 5% on average. Hong Kong is the least affordable city in the study, requiring roughly 14 years of income to buy a 60‑m² apartment. UBS warns that the ongoing, likely unsustainable rise in public debt could give the real‑estate market a new boost in the coming years, especially in a period of financial repression where demand for assets with positive real returns, like housing, increases. In the short term, UBS expects central banks to cut policy rates by 2026, gradually reducing real financing costs, while limited supply in most urban centers supports further price rises.\nOriginal language: es\nPublish date: September 23, 2025 12:36 PM\nSource:[Expansión](https://www.expansion.com/inmobiliario/mercado/2025/09/23/68d2943c468aebf7588b4597.html)\n\n**Madrid’s Housing Prices Surge, Bubble Risk Rising**\nThe UBS Global Real Estate Bubble Index reports that Madrid’s housing market has seen the largest price increase among major world cities, rising 14% over the past year, and is now positioned at a moderate but rising bubble‑risk level.  The index, which covers 21 cities, places Madrid in the middle of the table, behind Miami – the highest‑risk market – but ahead of cities such as London, Paris and Milan, which have low risk.  In the global context, prices in large cities have been stable in real terms, following three years of cooling after the 2020‑2022 boom, yet Madrid “breaks the trend” as the most dynamic market in Western Europe.\n\nRent prices in Madrid have also surged, with a 10% real‑term increase in the last year, driven by \"the strong creation of new households\" and \"the limited pace of new housing construction\".  Analysts warn that demand far outstrips supply, pressuring both the sale and rental markets, and that the structural shortage of new construction – exacerbated by long urban planning timelines and a lack of final‑stage land – remains a key issue.\n\nForeign investment has been a key driver of price growth in the capital, and the end of Spain’s Golden Visa programme – which allowed residence permits through property purchase – has particularly impacted the luxury segment.  Regulatory measures to tighten rent controls have sparked debate among owners, funds and sector associations.\n\nUBS author Maciej Skoczek notes that \"more stringent rules, such as new taxes or purchase prohibitions and rent‑control measures, have reduced the attractiveness of previously highly demanded markets such as Vancouver, Sydney, Amsterdam, Paris, New York, Singapore and London, but have not fully contained the pressure when supply is insufficient.\"\nOriginal language: es\nPublish date: September 23, 2025 12:04 PM\nSource:[elEconomista.es](https://www.eleconomista.es/vivienda-inmobiliario/noticias/13559036/09/25/ni-nueva-york-ni-londres-ni-paris-el-riesgo-de-burbuja-inmobiliaria-crece-en-madrid-con-los-precios-de-la-vivienda-disparados.html)\n\n**Barceló Anticipates a Tourism Cycle Shift, Yet Prices Remain Rising**\nBarceló, Spain’s second‑largest hotel group by rooms, forecasts a shift in the tourism cycle after a record‑breaking 2024 that ended with €3.200 billion in revenue, €500 million in operating profit and €300 million in net profit.  CEO Raúl González said, 'Mi impresión es que el ciclo empieza a declinar. No va a ser una caída brusca, pero sí una desaceleración en la demanda.' He notes that while occupancy is slowing, price levels will not fall; in summer the average revenue per available room rose 6‑7 % driven solely by higher rates.  The group expects a single‑digit growth in revenue, EBITDA and net profit next year and plans to invest at least €400 million in acquisitions, targeting 20 new openings.  Key markets for expansion are Italy, Portugal and Spain’s own high‑growth destinations such as Asturias, which has maintained its pre‑pandemic hotel capacity.  González also warned that the broader tourism slowdown could moderate investor sentiment and make purchase prices more rational, but he insists the hotel sector is not responsible for negative effects like tourismophobia or rising housing costs, citing a 29 % increase in Spain’s hotel rooms between 2005 and 2025.\nOriginal language: es\nPublish date: September 23, 2025 11:55 AM\nSource:[Cinco Días](https://cincodias.elpais.com/companias/2025-09-23/barcelo-anticipa-un-cambio-de-ciclo-en-el-turismo-pero-con-precios-todavia-al-alza.html)\n\n**Real‑Estate Analyst Warns Spain: Monthly Room Rent Equals Full Apartment**\nReal‑estate analyst Ferran Font warns that the monthly rent for a single room in Spain’s major provincial capitals now equals that of a full apartment.  According to pisocompartido.com, the price of shared‑room rentals rose 12.55 % from 422.92 € in 2024 to 475.98 € in 2025, an increase of 108.13 % when compared to the previous year.  Font attributes the surge to demand outpacing supply and the contagion of residential rent hikes, noting that the price spike disproportionately affects renters aged 18‑25 (50.78 %) and 26‑35 (29.38 %).  The most affected cities are Madrid, Barcelona and Valencia, while the provinces of Madrid, Barcelona, Sevilla, Valencia and Málaga account for 61.37 % of room seekers.  Font says the market’s rapid rise undermines the traditional savings‑to‑buy model, stating, 'La mensualidad de una habitación en las capitales de provincia con mayor concentración de demanda iguala a la de un piso completo hace una década en algunos casos', and that 'el mercado de las habitaciones en pisos compartidos se ha contagiado de la subida de los alquileres residenciales'.\nOriginal language: es\nPublish date: September 21, 2025 10:07 AM\nSource:[elespanol.com](https://www.elespanol.com/sociedad/20250921/analista-inmobiliario-alerta-espana-mensualidad-habitacion-iguala-piso-completo/1003743928183_0.html)\n\n**Housing Prices Surge 12.7% in Q2, Highest Increase in 18 Years**\nThe Instituto Nacional de Estadística (INE) reported that the price of free‑market housing in Spain rose 12.7% in the second quarter of 2025 compared with the same period in 2024, marking the largest quarterly increase in 18 years. The rise is part of a 45‑quarter streak of year‑on‑year gains. New‑home prices climbed 12.1% and used‑home prices jumped 12.8%, the latter a 0.1‑point rise over the previous quarter and the highest in 18 years since Q1 2007. Regional variations were pronounced: Murcia led with a 14.6% increase, followed by Aragón and La Rioja at 13.7%, Castilla y León and Andalucía at 13.6%, and Asturias at 13.5%. Lower‑mid‑range increases were seen in Cantabria (10.8%), Castilla‑La Mancha (11.3%), Canarias and Cataluña (11.6%) and Baleares (11.7%).\n\nCaixaBank Research attributes up to 39% of the price rise to the accumulated housing deficit, which has reached 515,000 units over the past four years, rising to 600,000 if finished homes are counted and 765,000 if alternative uses are included. The deficit is most acute in high‑pressure provinces such as Madrid, Barcelona, Alicante, Valencia and Málaga.\n\nThe market remains in an expansionary phase, with 700,000 transactions recorded in the first half of 2025—19.7% more than the same period in 2024—and 132,000 new homes approved, a 13% year‑on‑year increase. Foreign demand is significant: 18% of sales (133,000 units) were purchased by foreigners, with 44% of those being non‑resident buyers, who tend to drive up prices.\n\nYolanda Díaz, vice‑president of the Spanish government, criticised the “buitre” funds that she says are taking over cities, calling for immediate rent reductions and a public social‑rent housing park. She also highlighted the impact of tourist and seasonal rentals on Galicia’s housing market. The article cites María Matos of Fotocasa, who described the price rise as \"logical\" given the limited supply, and Ferran Font of Pisos.com, who noted that the price increase is unlikely to change in the short term.\nOriginal language: es\nPublish date: September 05, 2025 11:47 AM\nSource:[esdiario.com](https://www.esdiario.com/economia/250905/166374/precio-vivienda-libre-dispara-12-7-segundo-trimestre-mayor-alza-18-anos.html)\n\n**Housing already shows signs of overvaluation, but will continue to rise this and next year**\nAccording to CaixaBank Research, the housing deficit in Spain accounts for 39 % of the price increases observed between 2021 and 2024. Between May 2024 and May 2025, 132 000 new homes were approved – a 13 % year‑over‑year rise – with projections of 140 000 in 2025 and 150 000 in 2026. New household creation is roughly 180 000 per year, so the construction gap will widen. CaixaBank warns that the expected price rise over the next two years will be 'superior al previsto para la renta disponible por hogar', making access to housing harder in high‑demand areas. Banco de España estimated that housing prices are 1.1 %–8.5 % above long‑term equilibrium by the end of 2024, up from 0.8 %–4.8 % six months earlier. The ECB estimates a 10 % overvaluation of the Spanish residential market by the end of 2024. CaixaBank notes that overvaluation is already present in most territories, with the Balearic Islands and Madrid showing the strongest signs. Despite the price rise, the market is not expected to crash; the lack of excess supply, a stronger financial sector, and lower household debt (42.5 % of GDP versus over 80 % in 2010) mean prices are unlikely to fall sharply. The study concludes that accelerating affordable housing construction is the only way to curb prices. In August, the average price per square metre reached €2 498, up 14.8 % from the previous month, according to Idealista.\nOriginal language: es\nPublish date: September 05, 2025 06:23 AM\nSource:[El Español](https://www.elespanol.com/invertia/observatorios/vivienda/20250905/vivienda-da-senales-sobrevaloracion-seguira-encareciendose-proximo-ano/1003743911616_0.html)\n\n**Housing Shortage Drives Prices Up, Explaining Up to 39 % of the Rise**\nThe housing market in Spain is in a strong expansion phase, with prices at their highest since 2010 after adjusting for inflation. According to the CaixaBank Research Sectorial Inmobiliario report, demand has risen to 700,000 transactions in the last year, a 20 % increase. The report attributes this surge to improved financing conditions, higher household purchasing power from a robust labour market, and sustained demographic growth driven by migration and new family types, while the lack of supply is the main driver of price pressure.\n\nIn the past year 132,000 new homes were approved, a 13 % rise over the previous year, yet production remains insufficient to balance the market. The authors calculate that between 2021 and 2024 the housing deficit has accumulated 765,000 units, equal to 4 % of Spain’s housing stock, and that this shortfall explains 39 % of the price increase observed during the period. The deficit is most acute in Madrid, Alicante, Barcelona, Valencia and Málaga, each needing more than 60,000 additional homes, while the “España vaciada” region has a smaller deficit but still exceeds 3,000 units in provinces such as Jaén, Guadalajara, Lugo, Albacete, Burgos and Ciudad Real.\n\nSecond‑hand purchases dominate the market, but new‑home sales are gaining ground, rising 22.2 % in the first half of the year, although still below the 2007 level when 42 % of purchases were new homes.\n\nPrices have surpassed 2010 levels in real terms. Madrid and Catalonia lead the rise, followed by Andalucía, the Balearic Islands, the Canary Islands, the Valencian Community and Murcia. The report notes that the price surge since mid‑2024 has shifted demand toward more affordable areas, also lifting prices in provinces bordering Madrid (Segovia, Ávila, Toledo, Valladolid) and Barcelona.\n\nCaixaBank Research projects a 10 % price increase this year and an additional 6.3 % in 2026, outpacing the growth of disposable household income and further tightening housing affordability.\n\nForeign demand is a key factor: more than 50,000 homes were bought by foreigners in the first half of the year, 14 % of all transactions, four points above the historical average for 2006‑2024. The Ministry of Housing data show that one in five homes is now purchased by non‑resident foreigners, compared with 7 % in 2007. Non‑resident buyers, who are mainly vacation or investment purchasers with higher purchasing power, paid an average price of €3,063 per square metre in the second half of 2024, nearly double the €1,713 per square metre paid by nationals. The price paid by non‑residents has risen 38 % since 2019.\n\nThe report states, 'Es urgente reactivar la promoción residencial para mitigar las presiones en los precios', and notes that the deficit explains 'continúan acelerándose y dificultan el acceso a la vivienda'. It concludes, 'Esta tendencia refleja que España se ha consolidado como uno de los destinos más atractivos para la inversión en inmuebles de lujo en Europa'.\nOriginal language: es\nPublish date: September 05, 2025 05:10 AM\nSource:[El Diario Vasco](https://www.diariovasco.com/economia/vivienda/falta-vivienda-agrava-explica-imparable-escalada-precios-20250905071028-ntrc.html)\n\n**Spain's Housing Shortage Drives 39% of Price Rise, Says CaixaBank Research**\nSpain’s housing market is in a sustained expansion phase, with prices at record highs and demand reaching 700,000 transactions – a 20 % increase over the previous year. A sectorial report from CaixaBank Research attributes the surge to improved financing conditions, higher household purchasing power from a strong labour market, and continued demographic growth, while a persistent supply deficit – estimated at 765,000 units (4 % of Spain’s housing stock) between 2021 and 2024 – is the main driver of price pressure, accounting for 39 % of the observed price rise. The report warns that the deficit is widening, with Madrid, Alicante, Barcelona, Valencia and Málaga each needing more than 60,000 additional homes, and that foreign buyers now represent 14 % of all transactions, with non‑resident purchases averaging €3,063 per m² versus €1,713 for nationals. Prices are projected to climb 10 % this year and 6.3 % in 2026, outpacing disposable income and tightening affordability. The report calls for urgent action to boost affordable housing construction, noting that only the province of Soria has no residential deficit. Key quotes from the study include: 'continúan acelerándose y dificultan el acceso a la vivienda', 'Es urgente reactivar la promoción residencial para mitigar las presiones en los precios', and 'Esta tendencia refleja que España se ha consolidado como uno de los destinos más atractivos para la inversión en inmuebles de lujo en Europa'.\nOriginal language: es\nPublish date: September 05, 2025 05:10 AM\nSource:[El Comercio](https://www.elcomercio.es/economia/vivienda/falta-vivienda-agrava-explica-imparable-escalada-precios-20250905071028-ntrc.html)\n\n**Housing Prices Start Showing Signs of Overvaluation**\nCaixaBank Research’s latest Sectorial Real Estate Report indicates that Spanish housing prices are showing signs of overvaluation. The study attributes 39% of the recent price rise to a deficit of 765,000 homes—about 4% of the total stock—resulting from slow construction and population growth. The report notes that the price of housing is currently 1.1% to 8.5% above its long‑term equilibrium level by the end of 2024, up from 0.8% to 4.8% six months earlier, and that the European Central Bank estimates a 10% overvaluation by the same deadline. It also highlights that foreign non‑resident purchases, which now account for 7.9% of transactions, have increased by 40% since 2019, further driving up prices. The study projects a 10.8% price rise in 2025, easing to 6% the following year. Overvaluation is most pronounced in the Balearic Islands and Madrid, where prices have decoupled from household income, making home ownership increasingly difficult for young people. Despite the current overvaluation, the report stresses that the financial position of households, the construction sector, and the banking system is stronger than during the 2007‑2008 crisis, and that the risk of a sharp price correction remains contained. \"En ambos casos, por el momento, se trata de niveles aún contenidos, pero la tendencia es claramente al alza,\" the study notes, underscoring the upward trend.\nOriginal language: es\nPublish date: September 05, 2025 04:24 AM\nSource:[LaVanguardia](https://www.lavanguardia.com/economia/20250905/11029786/precio-vivienda-empieza-dar-signos-sobrevaloracion.html)\n\n**Spain's Housing Shortfall Explains Up to 39% of Market Price Rise**\nCaixaBank Research’s sectorial real‑estate report shows that Spain’s cumulative housing deficit of 515,000 units over the last four years could explain up to 39 % of the 6 % annual price rise observed, versus a 3.7 % rise if the deficit were absent. The deficit climbs to 600 000 when finished units are counted and to 765 000 when alternative uses are subtracted. The shortfall is concentrated in high‑pressure provinces such as Madrid, Barcelona, Alicante, Valencia and Málaga, while the depopulated “España vaciada” shows a smaller gap. The market entered an expansive phase in the first half of 2025, with 700 000 property transactions recorded in the 12 months to June – a 19.7 % increase over the same period in 2024 – driven by better financing conditions, rising household purchasing power and steady demographic growth. New construction has recovered, with 132 000 new homes approved in the 12 months to May, an inter‑annual rise of 13 %. Foreign demand has become a key driver: 18 % of sales in the last year up to Q1 2025 were bought by foreigners, amounting to 133 000 transactions – a record high – with more than half from resident foreigners and 44 % from non‑resident buyers, who tend to pay higher prices for medium‑to‑high‑end properties. The Mediterranean arc and the archipelagos dominate foreign demand, but new hotspots such as Castellón, Asturias, Huelva and Córdoba are emerging. The report notes the market is ‘en plena fase expansiva’ and that foreign purchases reached ‘un máximo histórico’.\nOriginal language: es\nPublish date: September 05, 2025 02:59 AM\nSource:[europa press](https://www.europapress.es/catalunya/noticia-deficit-vivienda-espana-explica-39-subida-precio-caixabank-research-20250905045949.html)\n\n**Housing Shortage Drives Up Prices, Explains Up to 40% of the Surge | Diario Sur**\nThe Spanish housing market is in an expansionary phase, with prices at their highest since 2010 (inflation‑adjusted). According to the CaixaBank Research Sectorial Inmobiliario report, demand rose 20% to 700,000 transactions last year, driven by better financing conditions, higher household purchasing power and sustained demographic growth. However, supply remains insufficient, with a housing deficit of 765,000 units—about 4% of Spain’s stock—accumulated between 2021 and 2024. This shortfall accounts for 39% of the price increase observed in the same period. The report notes that only the province of Soria has no residential deficit, while Madrid, Alicante, Barcelona, Valencia and Málaga each need more than 60,000 homes, and provinces such as Jaén, Guadalajara, Lugo, Albacete, Burgos and Ciudad Real have deficits above 3,000 units. New‑home purchases grew 22.2% in the first half of the year, yet they still lag behind the 2007 level where 42% of sales were new homes. Prices are projected to rise 10% this year and 6.3% in 2026, outpacing disposable income growth and tightening affordability. Foreign buyers now account for 14% of transactions—50,000 homes in the first half—an increase of four points over the 2006‑2024 average, and 18% of all sales, up from 7% in 2007. The average price per square metre for foreign purchases was €3,063 in the second half of 2024, nearly double the €1,713 for national buyers, reflecting a 38% rise since 2019. The report stresses that \"Es urgente reactivar la promoción residencial para mitigar las presiones en los precios\" and that \"Esta tendencia refleja que España se ha consolidado como uno de los destinos más atractivos para la inversión en inmuebles de lujo en Europa\".\nOriginal language: es\nPublish date: September 04, 2025 10:02 PM\nSource:[Sur](https://www.diariosur.es/economia/falta-vivienda-agrava-explica-imparable-escalada-precios-20250905000247-nt.html)\n\n**Spanish Residential Market Sees Intense Activity and Rising Prices**\nThe Spanish residential market is experiencing intense activity, driven by a solid national and international demand, the renewed attractiveness of Spain as a destination for second-home investment, and a stabilization of financial conditions. According to recent data from Tinsa and CaixaBank, the price of housing could increase by up to 9% in 2025. This growth is more pronounced in markets such as Madrid, Barcelona, Málaga, and coastal areas, where demand is particularly high. In cities like Málaga, for example, the rental prices have already reached one of the highest levels in the country, as highlighted by the latest Idealista price report. The number of operations in the residential market has grown by 60% between 2023 and 2024, and the total value of transactions has increased by 157% during the same period.\nOriginal language: es\nPublish date: August 21, 2025 05:40 AM\nSource:[elEconomista.es](https://www.eleconomista.es/autor/Jorge-Perez-Curto)\n\n**Real Estate Portals: Mortgage Data Show 'Good Pulse' of Sector**\nThe real estate portals have assured that the data on new mortgages for housing show the 'good pulse' of the sector, supported by the dynamism of the real estate market and the interest of banks in continuing to grant mortgages. According to the data released by the National Institute of Statistics (INE), the number of mortgages constituted on housing increased by 14% in April compared to the same month in 2024, reaching 39,176 loans, the highest figure in a month of April since 2010. Juan Villén, director general of Idealista Hipotecas, expressed his confidence that the growth of the number of mortgages on housing will be maintained at least 'until summer', but 'certainly' until the end of the year, but he asks to 'keep an eye' on the evolution of inflation, interest rates and consumer confidence, which could 'condition or modify this positive trend'. Ferran Font, director of Studies of Pisos.com, lamented that, despite the good data on mortgages, the accessibility to housing continues 'without improving', since the demand remains 'very active' and, with good financing conditions, but the supply 'does not rise', with the prices being at 'maximums and without signs of changing in the short term'. María Matos, director of Studies of Fotocasa, highlighted that, although 2025 already has better conditions in mortgages, these may 'not be enough' to counteract the accelerated increase in the value of housing, which can cause buyers to opt for 'more accessible mortgages', but face 'higher purchase prices'. The Federation of Associations of Real Estate Companies (Fadei) has indicated that housing is going through 'a phase of great activity' due to a very favorable context for both purchase and sale, with 'competitive interest rates' and a 'very high' housing need due to 'sustained demographic growth'.\nOriginal language: es\nPublish date: June 20, 2025 08:50 AM\nSource:[europa press](https://www.europapress.es/economia/construccion-y-vivienda-00342/noticia-portales-inmobiliarios-aseguran-datos-hipotecas-muestran-buen-pulso-sector-20250620105046.html)\n\n**Housing prices in Spain continue to rise, with a 9.9% increase in May**\nThe Spanish housing market has started 2025 with a strong upward trend, with prices increasing by 9.9% in May compared to the same month in 2024, and 0.9% compared to the previous month, according to the Tinsa index. This growth exceeds inflation and shows sustained pressure in all regions, with the highest increases in the archipelagos, capitals, and large cities. The director of the studies service, Cristina Arias, has pointed out that the price increase is general, but is especially visible where the available space is scarce. 'The competition for the limited land in the islands and urban centers is generating a very acute tensioning', she has noted. CaixaBank Research has revised its forecast for 2025 upwards, predicting a 9% growth, 3.1 percentage points above its previous estimate. The economist Judit Montoriol links this trend not only to the improvement in financial conditions, but also to a recovery of household purchasing power and foreign demand pressure. The fall in interest rates has had an immediate effect on mortgage credit, with financing for the purchase of housing growing by 35.4% in the first quarter of the year compared to the same period in 2024. However, this bonanza has a negative side, as the prices are rising at a faster rate than the income, which is putting pressure on accessibility ratios. The report warns that this gap may worsen if the current imbalance between supply and demand is maintained.\nOriginal language: es\nPublish date: June 05, 2025 01:29 PM\nSource:[EL PAÍS](https://elpais.com/economia/2025-06-05/el-precio-de-la-vivienda-no-cede-y-podria-subir-hasta-un-9-en-2025.html)\n\n",
    "date": "2025-09-25T01:15:17.964591",
    "summary": "All experts agree that Madrid's housing market is experiencing extraordinary supply shortages and strong demand, especially from foreign investors, which have driven very high price increases in recent years (20% in 2024, ~14% YoY in Q2–Q3 2025). The central scenario forecasted by almost all is for ongoing robust but moderating price growth in 2025—major bank and analyst projections cluster in the 6–10% range for Spain, with Madrid likely at the higher end, yet few expect a repeat of last year’s >18% surge. While supply-side constraints, demographic pressures, and capital inflows still exert upward momentum, affordability ceilings, mean reversion after an exceptional year, and emerging policy pressures are seen capping further explosive price jumps. Most forecasters highlight the historical rarity of consecutive >18% gains, the moderation already evidenced in recent data, and the brewing risk of regulatory intervention or demand fatigue. They allow some chance for a >18% increase if exogenous shocks (e.g., investment frenzy, rate cuts, speculative fever) arise, but view it as a tail risk—probabilities given by experts for a Yes outcome (more than 18% increase) range from 12% to 30%, with most clustering in the 15–27% range. Consensus: while a repeat of 2024’s extraordinary surge isn’t impossible given unique structural issues, the most likely outcome is strong but sub-18% price growth for Madrid housing in 2025.",
    "forecasters": [
        "RealEstateAnalysis (ComparativeMarketAnalysis)",
        "RealEstateAnalysis (HedonicPricingModel)",
        "BankingAndFinance (RiskAssessmentStandards)",
        "UrbanPlanning (MunicipalHousingPolicyReview)",
        "Economics (SupplyAndDemandTheory)",
        "Economics (RealEstateMarketCycleTheory)",
        "Economics (MonetaryPolicyTransmission)",
        "Urban Studies (UrbanGrowthTheory)",
        "Urban Studies (LandUseEconomics)",
        "RegionalStudiesIberia (SouthernEuropeanHousingModel)"
    ]
}