{
    "deliberation_results": {
        "RegulatoryAffairs (FederalRulemakingProcess)": {
            "time_to_resolution": "Approximately 3 months until January 1, 2026.",
            "perspective_relevance": "As an expert in Regulatory Affairs with deep knowledge of the Federal Rulemaking Process, I have insight into the legal, procedural, and political hurdles that federal regulations face after promulgation, including judicial review, administrative changes, and statutory authority. This perspective is highly relevant given the FTC rule was challenged in court, vacated, and subsequently abandoned by the agency, all of which are classic issues in federal rulemaking and administrative law.",
            "status_quo": "The status quo is that the FTC’s non-compete ban is not in effect. The rule has been vacated by a federal court, nationwide injunctions are in place, and the FTC has voluntarily dismissed its appeals of these rulings. The FTC has officially abandoned the rulemaking and is pursuing a case-by-case enforcement strategy instead.",
            "perspective_derived_factors": [
                {
                    "factor": "Judicial Rulings and Vacatur",
                    "effect": "Strongly decreases probability. The nationwide vacatur by the Northern District of Texas, which found the FTC lacked statutory authority, is a major legal barrier that cannot be easily or quickly reversed. Courts have clearly ruled the FTC overstepped its authority."
                },
                {
                    "factor": "FTC Voluntary Withdrawal and Administrative Shift",
                    "effect": "Strongly decreases probability. The FTC, now under new leadership, has not only dismissed its appeals but has publicly stated it will not pursue the rule. This signals a durable administrative and political shift away from the blanket ban approach."
                },
                {
                    "factor": "Change in Presidential Administration",
                    "effect": "Strongly decreases probability. The new administration (Trump) is rolling back numerous Biden-era regulations and has appointed new FTC leadership that opposes the non-compete rule, making reinstatement before 2026 highly unlikely."
                },
                {
                    "factor": "Precedent and Base Rates",
                    "effect": "Strongly decreases probability. Historically, once a major rule is vacated and the agency abandons its defense, especially after a change in administration, it is nearly unprecedented for such a rule to be revived and enacted in the same or similar form within a short window."
                },
                {
                    "factor": "Ongoing FTC Enforcement (Case-by-Case)",
                    "effect": "Neutral to slightly decreases probability. The FTC’s continued case-by-case enforcement is not a substitute for a nationwide rule and in fact further signals the agency has pivoted away from rulemaking."
                },
                {
                    "factor": "State Law Developments",
                    "effect": "Neutral. While some states are tightening or loosening their own non-compete laws, this does not affect the probability of a federal rule in the FTC’s form being enacted before 2026."
                }
            ],
            "no_scenario": "The FTC’s non-compete rule remains vacated. The agency, under new leadership installed by the Trump administration, does not attempt further rulemaking or judicial appeal prior to 2026. No other federal entity steps in, and the legal and political context remains unfavorable. Employers continue to operate under the patchwork of state laws, and the FTC focuses on targeted enforcement actions rather than a blanket rule.",
            "yes_scenario": "A highly improbable and extraordinary scenario unfolds: a rapid and unexpected shift in political will or judicial interpretation (e.g., a Supreme Court reversal), new Congressional legislation explicitly authorizing the FTC to ban non-competes, or a dramatic reversal by the FTC itself leads to the rule being reinstated and enacted in substantially its original form before January 1, 2026.",
            "final_reasoning": "Every major relevant factor points strongly against the possibility of the FTC’s non-compete ban being enacted before 2026. The rule has been vacated nationwide by a federal court on statutory grounds, and the FTC has voluntarily abandoned its appeals and rulemaking, explicitly stating its intent to pursue case-by-case enforcement instead. The administration has changed to one that is actively rolling back regulatory actions from the previous administration, and all public and legal signals confirm the agency has no intention of resurrecting the rule in the near term. The base rate for an abandoned/vacated federal rule being revived and enacted in essentially the same form within a year or two—especially after an administration change—is extremely low, bordering on zero. There are no plausible legal, political, or administrative mechanisms in play that could overcome these obstacles in the brief window before 2026. Therefore, the probability of the rule being enacted in more or less its current form before 2026 is essentially zero.",
            "final_probability": 0
        },
        "LaborLawPractice (EmploymentAgreementCompliance)": {
            "time_to_resolution": "Approximately 3 months until January 1, 2026",
            "perspective_relevance": "As an expert in LaborLawPractice (EmploymentAgreementCompliance), I closely track federal and state regulatory trends, court challenges, and employer compliance responses to non-compete law changes. My expertise offers insight into the practical barriers and legal nuances that impact the enactment and enforceability of sweeping employment regulations like the FTC’s proposed ban.",
            "status_quo": "The FTC’s nationwide ban on non-compete agreements has been blocked by federal courts and, as of September 2025, the agency has formally abandoned its appeal and rulemaking efforts. The legal landscape has reverted to a patchwork of state laws, and the FTC is pursuing only targeted, case-by-case antitrust enforcement rather than a categorical ban.",
            "perspective_derived_factors": [
                {
                    "factor": "Judicial Rejection and Agency Abandonment",
                    "effect": "Strongly decreases probability. The rule was vacated nationwide as courts found the FTC lacked statutory authority, and the FTC has now dismissed its appeals, indicating a finality to its regulatory effort."
                },
                {
                    "factor": "Administration Change and Political Climate",
                    "effect": "Strongly decreases probability. The Trump administration has reversed course on many Biden-era labor regulations, including the non-compete ban, and appointed FTC leadership hostile to the rule’s legal basis."
                },
                {
                    "factor": "Precedent and Base Rate of Major Federal Labor Rule Enactment After Judicial Blockage",
                    "effect": "Strongly decreases probability. Historically, federal regulatory efforts that are struck down by courts and abandoned by agencies are almost never revived and enacted in substantially their prior form in the same political cycle."
                },
                {
                    "factor": "Ongoing FTC Targeted Enforcement and Public Pressure",
                    "effect": "Slightly increases probability. Although the blanket ban is dead, the FTC is signaling a willingness to pursue egregious cases and is gathering information, which could conceivably (though extremely unlikely in this timeframe) lay groundwork for a future, narrower rule."
                },
                {
                    "factor": "Resolution Criteria—‘At Most Minor Changes’",
                    "effect": "Decreases probability. The criteria require enactment of the rule in essentially its April 2024 form, which has been explicitly abandoned both in court and by the agency."
                },
                {
                    "factor": "State Law Developments",
                    "effect": "Neutral to slightly decreasing. While some states have tightened non-compete restrictions, these changes are not relevant to the federal rule’s enactment."
                }
            ],
            "no_scenario": "The FTC’s rule remains vacated. The agency does not reinitiate rulemaking or seek new authority from Congress. Federal non-compete policy defaults to a combination of targeted FTC enforcement and varied state laws, with no blanket federal ban in effect by January 1, 2026.",
            "yes_scenario": "A highly improbable convergence: a court rapidly reverses its prior decision, or Congress amends the FTC Act to explicitly grant the FTC authority, and the FTC re-promulgates essentially the same rule, overcoming legal, political, and procedural hurdles to enactment by the end of 2025.",
            "final_reasoning": "All recent news and legal developments confirm that the FTC has formally abandoned its proposed blanket ban on non-competes, dismissed all appeals, and shifted to case-by-case enforcement. Federal courts have held the FTC lacks statutory authority for such a sweeping labor rule, and this finding is now unchallenged. The Trump administration and the current FTC leadership are ideologically and procedurally opposed to reviving the rule. No new legal pathway or political momentum exists to resurrect or enact the ban in substantially its original form before 2026. The base rate for similar regulatory reversals being undone within months is essentially zero. The only plausible Yes scenario—Congressional action or a court reversal followed by rapid rulemaking—is fantastical in the given time frame. Therefore, the probability that the FTC’s proposed ban on non-competes for most workers will be enacted in more or less its current form before 2026 is virtually nil.",
            "final_probability": 1
        },
        "USGovernmentRelations (LegislativeAndStakeholderEngagement)": {
            "time_to_resolution": "Approximately 3 months until January 1, 2026.",
            "perspective_relevance": "As an expert in US Government Relations (Legislative and Stakeholder Engagement), I have direct insight into the interplay between regulatory agencies, the judiciary, and the executive branch, as well as a deep understanding of how political transitions, lobbying, and administrative priorities affect the implementation or rollback of federal rules. I also understand the importance of base rates in federal regulatory enactment and blocking, the mechanics of administrative law, and the influence major stakeholders (business lobbies, labor, political appointees) have on regulatory outcomes.",
            "status_quo": "The FTC’s nationwide non-compete ban has been vacated by federal courts, and the FTC has officially abandoned its appeals. No federal ban is in effect, and non-compete regulation has reverted to a patchwork of state laws. The FTC is focusing on case-by-case enforcement rather than rulemaking.",
            "perspective_derived_factors": [
                {
                    "factor": "Judicial Rulings and Vacatur",
                    "effect": "Strongly decreases probability. The Northern District of Texas issued a nationwide vacatur and injunction, finding the FTC lacked authority. Appeals have been voluntarily dismissed, cementing the court decision and ending the rule’s federal prospects."
                },
                {
                    "factor": "FTC Leadership and Political Environment",
                    "effect": "Strongly decreases probability. The shift to a Trump-appointed FTC Chair and majority, with a stated position against the rule, ensures no administrative effort to revive or defend the rule before 2026."
                },
                {
                    "factor": "Administrative Procedure and Time Constraints",
                    "effect": "Strongly decreases probability. With the rule vacated, appeals dropped, and less than 3 months left, there is no viable procedural route to re-enact the rule in 'more or less its current form' before 2026."
                },
                {
                    "factor": "Stakeholder and Political Opposition",
                    "effect": "Decreases probability. Major business interests, such as the US Chamber of Commerce, have successfully challenged the rule, and the current administration is aligned with their opposition."
                },
                {
                    "factor": "Potential for Congressional or Executive Action",
                    "effect": "Negligible. There is no evidence of Congressional efforts to revive a ban, and executive action is aligned with the rollback, not reenactment."
                },
                {
                    "factor": "FTC’s Stated Future Strategy",
                    "effect": "Decreases probability. The FTC has publicly stated it will now pursue targeted enforcement under Section 5, not a blanket rule."
                },
                {
                    "factor": "Base Rate of Overturned Major Rules Being Revived Quickly After Judicial Defeat and Administrative Abandonment",
                    "effect": "Strongly decreases probability. Historically, once a major rule is vacated, appeals dropped, and the agency reverses course, such rules are almost never revived in the short term, especially under an opposing administration."
                }
            ],
            "no_scenario": "The FTC’s non-compete ban remains vacated and unenforceable. The FTC continues targeted, case-by-case enforcement against egregious non-competes under Section 5, but no blanket rule is in effect. State law governs non-compete enforcement, with variation across states. No new federal rule is enacted before January 1, 2026.",
            "yes_scenario": "An extremely unlikely scenario: A dramatic legal or political reversal occurs—such as an unexpected Supreme Court intervention overturning the lower court’s vacatur and ordering immediate reinstatement, or Congress passes a law mandating a near-total ban on non-competes, or a new emergency rulemaking process is undertaken and survives immediate legal challenge, all before 2026.",
            "final_reasoning": "The overwhelming weight of evidence and process points to a decisive 'No.' The FTC’s nationwide non-compete ban was vacated by a federal court, with the court finding the FTC lacked statutory authority to issue such a rule. The FTC, under new Trump-appointed leadership, voted to abandon all appeals and has officially walked away from the rulemaking process, shifting to targeted enforcement. News articles confirm the FTC has not only dropped the appeal but is messaging to stakeholders that the national ban is dead, and employers are advised to follow state law. There is no indication of Congressional action, no new rulemaking, and no plausible legal avenue to revive the rule in the remaining three months of 2025. The base rate for rapid regulatory reversal after such a confluence of judicial, administrative, and political opposition is near zero. All credible scenarios and expert analysis converge on the rule not being enacted in its current or substantially similar form before 2026.",
            "final_probability": 0
        },
        "Law (AdministrativeProceduresActDoctrine)": {
            "time_to_resolution": "Approximately 3 months (until January 1, 2026).",
            "perspective_relevance": "As an expert in Administrative Procedures Act (APA) doctrine, my perspective is central to evaluating the likelihood of agency rulemaking surviving judicial review and being enacted, especially when issues of statutory authority, rulemaking procedure, and major questions doctrine are at play. The FTC's non-compete rule's fate hinges on administrative law principles, federal court precedents, and current executive branch priorities.",
            "status_quo": "The FTC's nationwide non-compete ban has been vacated by federal courts, and the agency has officially withdrawn its appeals, with the current administration shifting to case-by-case enforcement instead of blanket rulemaking. The ban is not in effect and is not moving forward in the courts or via agency action.",
            "perspective_derived_factors": [
                {
                    "factor": "Judicial Vacatur and Permanent Injunctions",
                    "effect": "Strongly decreases probability. The Northern District of Texas vacated the rule nationwide, holding the FTC lacked statutory authority and that the rule was arbitrary and capricious. The FTC chose not to appeal further, meaning the vacatur is now final."
                },
                {
                    "factor": "Change in FTC and Presidential Administration",
                    "effect": "Decreases probability. The Trump administration replaced leadership at the FTC. The new chair (Andrew Ferguson) and the Republican majority have publicly stated the rule was an unlawful overreach and have abandoned further defense or pursuit of the rule in its original form."
                },
                {
                    "factor": "Abandonment of Appeals and Rulemaking",
                    "effect": "Strongly decreases probability. The FTC has not only withdrawn its appeals but has also voted to abandon the rule, with no indication of plans to issue a substantively similar replacement before 2026."
                },
                {
                    "factor": "Major Questions Doctrine and Supreme Court Precedent",
                    "effect": "Strongly decreases probability. The courts cited the major questions doctrine, which restricts agency ability to issue sweeping rules absent clear congressional authorization. This doctrine is now a significant barrier to similar regulations."
                },
                {
                    "factor": "Active State Law Landscape and Patchwork Regulation",
                    "effect": "Marginally decreases probability. With the federal rule dead, states are continuing to adjust their own non-compete laws, further reducing the likelihood of a new federal solution in the near term."
                },
                {
                    "factor": "No Evidence of Revival or Congressional Action",
                    "effect": "Strongly decreases probability. There are no signs of imminent congressional legislation or new federal agency initiatives that could enact a similar ban before 2026."
                }
            ],
            "no_scenario": "The FTC's appeals remain withdrawn, the vacatur stands, and the agency pursues only targeted, case-by-case enforcement actions against individual companies under existing antitrust laws. No new rulemaking or legislation is undertaken or enacted before January 1, 2026. The state patchwork of non-compete laws persists.",
            "yes_scenario": "Despite the current withdrawal, the FTC (or Congress) reverses course, rapidly proposes and enacts a substantially similar ban through new rulemaking or legislation, withstanding judicial scrutiny and logistical hurdles, all before January 1, 2026. Alternatively, a major court reversal or a dramatic shift in the political environment enables the original rule to take effect.",
            "final_reasoning": "The base rate for major federal labor regulations being enacted after being vacated and after the relevant agency has withdrawn its appeals is near zero, especially under an administration and FTC leadership openly opposed to the regulation. APA doctrine, the major questions doctrine, and the lack of any ongoing appeals or legislative push make it exceedingly unlikely that the FTC's proposed ban on non-competes will be enacted in any form—let alone its original form—before 2026. All recent news confirms that the rule is 'dead,' with the agency moving to case-by-case enforcement and no sign of further rulemaking in this area. Therefore, the probability of enactment before 2026 is vanishingly small.",
            "final_probability": 0
        },
        "Law (ChevronDeference)": {
            "time_to_resolution": "About 3 months (until January 1, 2026)",
            "perspective_relevance": "My expertise in Law, specifically in administrative law and Chevron deference, is highly relevant to this question. The core legal issue surrounding the FTC’s non-compete ban is whether the FTC had statutory authority to issue such a sweeping rule—a question intimately tied to interpretations of the FTC Act, the Administrative Procedure Act, the major questions doctrine, and, until recently, Chevron deference. My knowledge allows me to assess both the legal process and the likelihood of administrative or judicial reversal, as well as the impact of changes in Supreme Court doctrine and agency leadership.",
            "status_quo": "The FTC’s nationwide ban on non-compete agreements has been vacated by a federal court, the appeals have been dismissed by the FTC under the Trump administration, and the rule will not take effect. The FTC has shifted to case-by-case enforcement rather than rulemaking. State laws govern non-compete enforceability.",
            "perspective_derived_factors": [
                {
                    "factor": "Judicial Vacatur and FTC Abandonment",
                    "effect": "Strongly decreases probability. The district court vacated the rule nationwide, and the FTC has officially abandoned all appeals, making the ban dead as a matter of law and agency posture."
                },
                {
                    "factor": "Change in FTC Leadership and Administration",
                    "effect": "Strongly decreases probability. The shift to a Trump-appointed FTC chair (Andrew Ferguson) and Republican majority led directly to the agency's withdrawal from appellate litigation and formal rulemaking on non-competes."
                },
                {
                    "factor": "Chevron Deference and Major Questions Doctrine",
                    "effect": "Strongly decreases probability. The courts relied on the 'major questions' doctrine and the narrowing of Chevron deference to conclude that the FTC lacked clear Congressional authorization for such a broad rule, making future revival via administrative action highly unlikely before 2026."
                },
                {
                    "factor": "No Remaining Appeals or Pending Litigation Supporting the Rule",
                    "effect": "Strongly decreases probability. With all appeals dropped and no remaining federal litigation seeking to reinstate the rule, there is no legal pathway for the current rule to be reinstated in time."
                },
                {
                    "factor": "Political and Regulatory Environment",
                    "effect": "Strongly decreases probability. The Trump administration has demonstrated a clear pattern of rolling back Biden-era regulatory efforts, and there is no indication of a reversal or new initiative that could re-enact the ban before January 2026."
                },
                {
                    "factor": "Alternative FTC Strategy (Targeted Enforcement, RFI, Consent Orders)",
                    "effect": "Slightly decreases probability. The FTC is focusing on case-by-case enforcement and sector-specific actions, which, even if aggressive, fall far short of a blanket ban as described in the original rule."
                }
            ],
            "no_scenario": "The FTC’s appeals are dropped, the court’s vacatur remains in place, and no further rulemaking occurs before January 1, 2026. The FTC continues case-by-case enforcement but does not reissue or enforce a nationwide ban. Non-compete agreements remain governed by state law and ad hoc federal action.",
            "yes_scenario": "A highly improbable scenario in which a sudden, successful legal maneuver (e.g., Supreme Court reversal, unlikely given current doctrine and timing) or a rapid, bipartisan legislative grant of clear authority enables the FTC to reissue and enact a substantially similar rule before January 1, 2026. Alternatively, an administrative or procedural loophole is exploited to revive the rule, which then survives any further legal challenge—none of which are even hinted at in the current news or legal landscape.",
            "final_reasoning": "The cumulative evidence from all recent news is overwhelming: the FTC’s non-compete ban is dead. Both the legal and administrative pathways for its enactment before 2026 have been foreclosed. The agency’s withdrawal of appeals, public statements from new leadership, and the absence of any ongoing or prospective nationwide litigation or rulemaking all point to the end of this regulatory effort for the foreseeable future. The courts have issued a nationwide vacatur, explicitly relying on doctrines that are unlikely to be quickly overturned (major questions, narrowed Chevron). There is no sign of congressional intervention or reversal. The FTC’s pivot to targeted enforcement is not a substitute for the blanket ban, and the Metaculus resolution criteria require the rule to be enacted in its current or near-current form. The base rate for a vacated agency rule being revived and implemented within a year after such a comprehensive defeat, especially under an antagonistic administration, is effectively zero. No credible scenario exists for a Yes resolution before January 2026.",
            "final_probability": 0
        },
        "Law (MajorQuestionsDoctrine)": {
            "time_to_resolution": "Approximately 3 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in the Major Questions Doctrine and administrative law, I bring a specialized understanding of the structural limits on agency authority, the nuances of judicial review (especially under the APA), and recent Supreme Court trends that have sharply curtailed agency action on matters of vast economic and political significance without explicit Congressional authorization. This is directly relevant given the rule was struck down on major questions/authority grounds, and the FTC has abandoned its appeals.",
            "status_quo": "The FTC's broad ban on non-compete agreements is not in effect; litigation blocked the rule, and the FTC has withdrawn all appeals, officially abandoning the regulation. Non-compete enforcement now reverts to the pre-rule state-by-state patchwork, with the FTC pursuing only case-by-case enforcement against egregious agreements.",
            "perspective_derived_factors": [
                {
                    "factor": "Judicial Block and Major Questions Doctrine",
                    "effect": "Strongly decreases probability. The rule was struck down on the grounds that the FTC lacked statutory authority (major questions doctrine), and courts have recently been hostile to agency power without clear Congressional mandates."
                },
                {
                    "factor": "FTC Voluntary Dismissal of Appeals",
                    "effect": "Greatly decreases probability. The FTC has not only lost in court but has also formally abandoned further litigation and rulemaking attempts on this issue, indicating institutional acquiescence to the judicial defeat."
                },
                {
                    "factor": "Change in FTC/Presidential Administration",
                    "effect": "Greatly decreases probability. The new Trump administration and new FTC chair are ideologically opposed to the blanket ban, preferring targeted enforcement, and have actively reversed the prior administration's rulemaking priorities."
                },
                {
                    "factor": "Lack of Congressional Action",
                    "effect": "Decreases probability. There is no legislative movement to authorize such a ban, and Congressional gridlock makes future legislative authorization extremely unlikely before 2026."
                },
                {
                    "factor": "Irreversible Procedural Posture",
                    "effect": "Greatly decreases probability. The FTC has not just paused but officially dismissed its appeals and vacated the rule, making re-enactment through administrative channels before 2026 virtually impossible."
                },
                {
                    "factor": "Base Rate for Agency Rules Reinstated After Vacatur",
                    "effect": "Decreases probability. Historically, once a major agency rule is vacated and the agency walks away, the base rate for rapid re-enactment in the same or similar form is extremely low within a short time frame."
                },
                {
                    "factor": "State Law Patchwork and Ongoing Targeted Enforcement",
                    "effect": "Neutral to slightly decreases probability. The FTC is still interested in policing non-competes on a case-by-case basis, but this does not amount to a rule with the same scope or effect as the abandoned ban."
                }
            ],
            "no_scenario": "The FTC's ban remains vacated, with no further appeals or new rulemaking. Non-compete agreements continue to be governed by state law, with the FTC only intervening in specific, egregious cases. There is no Congressional action to authorize a new rule. The regulatory landscape remains a patchwork, and the ban is not enacted in any form close to the original rule before 2026.",
            "yes_scenario": "An extraordinarily unlikely scenario in which the FTC, perhaps under new leadership after a dramatic political realignment, manages to quickly promulgate a substantively identical rule, withstand immediate legal challenges, and have it take effect before January 1, 2026. Alternatively, Congress passes clear authorizing legislation and the FTC acts with unprecedented speed to re-issue the rule and implement it before the deadline.",
            "final_reasoning": "Every major structural, legal, and political factor militates against the FTC's non-compete ban being enacted in anything like its current form before 2026. The courts have blocked the rule on major questions/ultra vires grounds; the FTC has abandoned all appeals and formally rescinded the rule; the new administration is ideologically opposed and has shifted enforcement priorities; and there is no plausible path for new rulemaking or Congressional action within the timeframe. The base rate for an agency rule, especially one already vacated and abandoned, to be reinstated quickly and in substantially the same form is close to zero. The only plausible scenario for a 'Yes' outcome would require unprecedented, coordinated, and rapid legal, administrative, and political shifts that run contrary to all observable evidence and trends as of late September 2025.",
            "final_probability": 1
        },
        "PoliticalScience (SeparationOfPowersTheory)": {
            "time_to_resolution": "Approximately 3 months until January 1, 2026.",
            "perspective_relevance": "As an expert in Political Science specializing in Separation of Powers Theory, I am uniquely attuned to the interplay between executive actions, independent agency authority, judicial checks, and the impact of administrative law. This expertise allows for nuanced assessment of how regulatory attempts, court challenges, and political turnover shape the fate of major federal rules like the FTC's non-compete ban.",
            "status_quo": "The FTC's proposed non-compete ban has been vacated by federal courts, and as of September 2025, the FTC has formally abandoned all appeals and withdrawn the rule. Enforcement has shifted to a case-by-case approach under existing antitrust law, with the national blanket ban definitively off the table.",
            "perspective_derived_factors": [
                {
                    "factor": "Judicial Overturn and Major Questions Doctrine",
                    "effect": "Strongly decreases probability — The rule was vacated nationwide by a federal court on statutory and administrative grounds, explicitly finding the FTC lacked authority. The Supreme Court's recent reinforcement of the 'major questions' doctrine raises the bar for agencies to enact sweeping economic regulations without clear congressional authorization."
                },
                {
                    "factor": "Administrative Withdrawal and Political Shift",
                    "effect": "Strongly decreases probability — The FTC, now under Trump-appointed leadership, voted 3-1 to abandon further defense of the rule, dismissing all appeals. This cements the agency’s unwillingness to pursue the rule even if new legal avenues appeared."
                },
                {
                    "factor": "Precedent and Base Rate of Regulatory Recovery",
                    "effect": "Strongly decreases probability — Historically, once a major rule is vacated and the agency withdraws, especially after a change in administration, federal regulatory bans of this scope do not reappear within months, especially absent a substantial political or legislative shift."
                },
                {
                    "factor": "Possible Legislative Overturn or Congressional Action",
                    "effect": "Slightly increases probability — Theoretically, Congress could enact a statutory ban on non-competes, but there is no evidence of serious legislative movement or sufficient bipartisan support for such an action in the current divided political environment."
                },
                {
                    "factor": "State-Level Action and Patchwork Regulation",
                    "effect": "Neutral — While states may continue to restrict non-competes, the question hinges on federal enactment, specifically the FTC’s rule."
                },
                {
                    "factor": "Future Administrative Actions before 2026",
                    "effect": "Strongly decreases probability — There is neither time nor political will within the FTC to reinitiate rulemaking, especially given the legal precedent and current agency leadership."
                }
            ],
            "no_scenario": "The scenario that is currently playing out: The FTC’s ban remains vacated, the agency does not attempt to reissue or re-litigate the rule, no new federal rule is promulgated, and non-compete regulation defaults to the patchwork of state laws. The only federal action is targeted enforcement under existing antitrust statutes, not a blanket ban.",
            "yes_scenario": "A highly unlikely scenario: An unexpected political or legal development—such as a rapid Congressional override, an emergency regulatory maneuver by the FTC reversing its current posture, or a successful Supreme Court reversal of the Texas ruling—results in the original or only slightly amended rule being enacted before January 2026.",
            "final_reasoning": "All credible news sources and legal analyses confirm that the FTC has formally abandoned its nationwide non-compete ban, withdrawn all appeals, and accepted the court’s vacatur. The agency’s leadership—now explicitly opposed to the original rule—has shifted to a litigation/enforcement model targeting only egregious cases. The legal basis for the rule was found lacking, and the Supreme Court’s recent 'major questions' doctrine makes any similar future rulemaking by the FTC exceedingly unlikely within the short time frame left. There is no legislative momentum for a Congressional ban. Historically, once an agency rule is withdrawn after judicial defeat and a change in administration, it is not resurrected in the same or similar form absent a major political realignment. The status quo—no national FTC ban—will persist through 2025. The chances the FTC’s proposed ban is enacted before 2026 in anything remotely like its current form are functionally zero.",
            "final_probability": 0
        },
        "PoliticalScience (PolicyProcessModel)": {
            "time_to_resolution": "Approx. 3 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Political Science with a focus on the Policy Process Model, I bring a structured lens to institutional dynamics, agency authority, regulatory rollback, and the influence of judicial, executive, and interest group actors on the fate of federal rules. This perspective emphasizes the inertia of regulatory policy, the role of legal challenges and court authority, and the impacts of administration change and intergovernmental relations.",
            "status_quo": "The FTC's blanket ban on non-compete agreements is not in effect. The rule was blocked by federal courts, vacated nationwide, and the FTC has formally abandoned its appeals, shifting instead to targeted, case-by-case enforcement under existing antitrust law.",
            "perspective_derived_factors": [
                {
                    "factor": "Judicial Rulings and Legal Authority",
                    "effect": "Strongly decreases probability. Multiple courts have ruled the FTC lacks statutory authority for a blanket ban, and the most recent and relevant decisions have been left uncontested by the FTC."
                },
                {
                    "factor": "Executive Branch/Agency Leadership Change",
                    "effect": "Strongly decreases probability. The Trump administration's FTC leadership has decided not only to drop appeals but to explicitly abandon the rule, signaling no intent to re-promulgate or defend it before the deadline."
                },
                {
                    "factor": "Policy Inertia and Base Rates for Major Federal Labor Reforms",
                    "effect": "Decreases probability. Historically, sweeping federal labor reforms, especially those that overturn established contract law, face high legal and political barriers and are rarely enacted quickly or over judicial/administrative reversal."
                },
                {
                    "factor": "Interest Group and Business Opposition",
                    "effect": "Decreases probability. Business groups (e.g., U.S. Chamber of Commerce) have succeeded in litigation and will continue to oppose any similar efforts, making legislative or regulatory revival highly unlikely before 2026."
                },
                {
                    "factor": "State Policy Patchwork and Subnational Precedent",
                    "effect": "Neutral to slightly increases probability. Some states continue to move toward more restrictions on non-competes, but this is not relevant for the specific question of a federal FTC rule in nearly its current form."
                },
                {
                    "factor": "FTC’s New Case-by-Case Enforcement Strategy",
                    "effect": "Decreases probability for a blanket rule, but indicates ongoing regulatory attention. Does not substitute for the enactment of the broad rule at issue."
                }
            ],
            "no_scenario": "The FTC’s blanket ban remains vacated, with no further federal rulemaking. The FTC continues case-by-case enforcement of anticompetitive non-competes, but no broad regulation is enacted. State laws continue to govern non-compete enforceability, resulting in a patchwork system. No action is taken before January 1, 2026, that would constitute enactment of the original rule or any version not limited to minor exceptions.",
            "yes_scenario": "Despite the judicial and administrative setbacks, an unexpected legal or political development (such as a successful last-minute appeal or congressional intervention) reinstates the rule in more or less its original form, and it is enacted before January 1, 2026. Alternatively, the FTC reissues a similar rule and fast-tracks it through rulemaking and litigation, prevailing in court, all within the remaining three months.",
            "final_reasoning": "The latest and most authoritative reporting demonstrates that the FTC not only abandoned its appeals but has formally and publicly accepted the nationwide vacatur of the rule, with no indication of intent to revive it. The Trump administration’s FTC leadership—hostile to the rule—controls the agency and has explicitly shifted away from rulemaking in favor of targeted enforcement. Courts have ruled unequivocally that the FTC lacks authority for this kind of substantive labor regulation, and the agency is not contesting those rulings. There is no evidence of congressional action or any other regulatory process that could revive the rule before the resolution deadline. The base rate for rapid reversal of such a major administrative and political defeat, especially under an antagonistic administration, is extremely low. Given the requirement that the rule be enacted in 'more or less its current form,' and that any changes affecting at least 10% of workers or the applicability to existing contracts would count as a 'No,' the probability of enactment before January 1, 2026, is vanishingly small.",
            "final_probability": 1
        },
        "Economics (LaborMarketRegulationTheory)": {
            "time_to_resolution": "Approximately 3 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Labor Market Regulation Theory, my perspective is highly relevant because the FTC's non-compete ban directly addresses the interplay between federal regulatory authority, labor mobility, contract enforcement, and the economic impact of labor restrictions. My knowledge of how administrative rulemaking interacts with judicial review, political cycles, and the economic rationale for and against non-compete agreements informs a nuanced assessment of the likelihood of enactment.",
            "status_quo": "The status quo is that there is no federal ban on non-compete agreements; regulation occurs at the state level with a patchwork of differing laws. The FTC's proposed rule has been vacated by court order, and the FTC has abandoned its appeals and withdrawn the rule.",
            "perspective_derived_factors": [
                {
                    "factor": "Judicial Rejection and Legal Authority",
                    "effect": "Strongly decreases probability; courts have ruled the FTC lacks authority to issue a sweeping ban on non-competes, and the agency itself has withdrawn appeals and accepted the vacatur."
                },
                {
                    "factor": "Change in Administration and FTC Leadership",
                    "effect": "Strongly decreases probability; the Trump administration and new FTC Chair Andrew Ferguson have publicly opposed the rule, favoring case-by-case enforcement over broad rulemaking."
                },
                {
                    "factor": "Regulatory and Political Environment",
                    "effect": "Strongly decreases probability; 2025 has seen a widespread rollback of Biden-era regulations, and there is no political will at the executive or agency level to revive the rule in its current form before 2026."
                },
                {
                    "factor": "FTC Stance and Alternative Strategies",
                    "effect": "Decreases probability; the FTC has shifted to targeted enforcement of egregious non-competes rather than pursuing a blanket regulatory approach."
                },
                {
                    "factor": "Base Rate of Reversing Withdrawn Major Regulations",
                    "effect": "Strongly decreases probability; historically, once a federal agency has withdrawn a rule and accepted defeat in court, especially in a hostile political climate, the chances of it being revived within months are extremely low."
                },
                {
                    "factor": "State-Level Action and Patchwork Regulation",
                    "effect": "Neutral; while some states continue to tighten or loosen non-compete enforcement, this does not affect the federal rule in question."
                }
            ],
            "no_scenario": "The FTC, under current leadership and direction from the Trump administration, does not attempt to revive the 2024 rule. No new legal or political developments restore the FTC's authority or political will to enact a similar rule before January 1, 2026. The federal landscape remains a patchwork of state laws, with the FTC only pursuing targeted enforcement against particularly abusive non-competes on a case-by-case basis. Employers continue to rely on state-level guidance, and no sweeping federal ban is enacted.",
            "yes_scenario": "A highly improbable combination of events occurs: either a favorable court ruling unexpectedly overturns the existing vacatur and reinstates the rule, or a sudden and radical shift in political power and FTC leadership (e.g., a rapid change in administration) enables the FTC to reissue and swiftly enact a new rule in essentially the same form before January 1, 2026. Alternatively, Congress passes a law granting the FTC explicit authority to issue such a rule, and it is enacted without major changes.",
            "final_reasoning": "All available evidence from September 2025 shows that the FTC has definitively abandoned the nationwide non-compete ban, withdrawn its appeals, and publicly accepted the court's ruling that it lacks the authority to enact such a sweeping rule. The current administration and FTC leadership are ideologically opposed to the rule and have shifted strategy to targeted enforcement. There is no legal, political, or administrative path to re-enactment in 'more or less its current form' before January 2026, and the base rate for resurrection of major, defeated regulatory efforts within such a short window is close to zero. While some state-level changes may continue, these are irrelevant to the federal rule at issue. The only conceivable path to a 'Yes' would require an extraordinary and highly unlikely upheaval in legal or political circumstances. Therefore, the probability that the FTC's proposed ban on non-compete agreements for most workers will be enacted in more or less its current form before 2026 is effectively zero.",
            "final_probability": 1
        }
    },
    "deliberation_probability": [
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1
    ],
    "deliberation_mean_probability": 1.0,
    "deliberation_sd": 0.0,
    "deliberation_probability_result": 1,
    "group_results": {
        "regulatoryaffairsFederalrulemakingprocess": {
            "forecaster_to_engage": "Economics (LaborMarketRegulationTheory)",
            "response_type": "defense",
            "response": "I support the reasoning provided by the Economics (LaborMarketRegulationTheory) forecaster, particularly the emphasis on base rates and the practical impossibility of rapid regulatory resurrection after a judicial vacatur and administrative abandonment. From a regulatory affairs perspective, the argument is especially sound because it recognizes the fundamental importance of legal authority and the institutional inertia that follows a decisive defeat in the courts and a change in agency leadership. The economics perspective accurately notes that neither state-level experimentation nor case-by-case enforcement is germane to the resolution criteria, and that the only conceivable path to a Yes outcome would require an unprecedented legal or political reversal in a matter of months. This aligns with the realities of the federal rulemaking process, in which reversals of this magnitude are functionally unheard of within such a short timeframe, especially under hostile political leadership. The defense here is that this forecast correctly integrates administrative, legal, and economic realities to reach a well-supported, near-zero probability."
        },
        "laborlawpracticeEmploymentagreementcompliance": {
            "forecaster_to_engage": "Law (MajorQuestionsDoctrine)",
            "response_type": "critique",
            "response": "While the Law (MajorQuestionsDoctrine) forecaster correctly identifies the major legal and political barriers to the FTC's non-compete ban being enacted, their probability assignment of 1% may understate the degree of finality in both the court's decision and the FTC's abandonment. In this scenario, the judicial reliance on the major questions doctrine and the current administration's explicit opposition combine to create a regulatory dead end, with no plausible signals of Congressional intervention or new litigation to revive the rule. The only possible Yes scenario would require an extraordinary and historically unprecedented sequence of events—such as a sudden Congressional grant of authority coupled with immediate agency re-promulgation and rapid judicial approval—all within a three-month window. Given the strong evidence of political, legal, and administrative closure, a probability of strictly zero is more defensible than even a 1% tail risk. The critique, then, is that even highly unlikely theoretical scenarios do not meet the threshold for meaningful probability in this context."
        },
        "usgovernmentrelationsLegislativeandstakeholderengagement": {
            "forecaster_to_engage": "PoliticalScience (PolicyProcessModel)",
            "response_type": "defense",
            "response": "I support the PoliticalScience (PolicyProcessModel) forecaster's analysis, particularly their attention to the institutional and procedural realities that govern regulatory outcomes. The forecast rightly emphasizes the importance of the agency's formal abandonment of the rule, the clear and public shift in enforcement posture, and the extreme unlikelihood of rapid policy reversal under an antagonistic administration. As someone focused on US Government Relations and stakeholder engagement, I recognize that, once an agency has not only lost in court but also accepted defeat and moved on to a fundamentally different enforcement strategy, the probability of a quick turnaround is functionally zero. The forecaster’s use of historical precedent and procedural logic is sound, and their attention to the resolution criteria—especially the requirements for enactment in 'more or less its current form'—demonstrates a careful reading of both the facts and the question. This defense affirms that the assignment of a near-zero probability is justified by the convergence of legal, political, and procedural barriers."
        },
        "lawAdministrativeproceduresactdoctrine": {
            "forecaster_to_engage": "Law (ChevronDeference)",
            "response_type": "defense",
            "response": "The Law (ChevronDeference) forecaster's argument is especially compelling from an Administrative Procedures Act (APA) perspective. They correctly highlight the decisive impact of the nationwide vacatur, the FTC's explicit abandonment of its appeals, and the current administration's open opposition to the rule. The application of the major questions doctrine, as noted, forecloses the possibility of a rapid legal turnaround. Importantly, the forecast draws a sharp distinction between the agency's move to case-by-case enforcement and what is required for a Yes resolution under the question's criteria—a distinction sometimes blurred in public discourse. Their base rate reasoning is also sound: in APA and administrative law history, a rule that is vacated, unappealed, and abandoned by both the agency and political overseers is functionally dead for the foreseeable future. Thus, their assignment of zero probability is well-defended and appropriately reflects both recent legal developments and the practical realities of federal regulatory process."
        },
        "lawChevrondeference": {
            "forecaster_to_engage": "LaborLawPractice (EmploymentAgreementCompliance)",
            "response_type": "defense",
            "response": "I endorse the reasoning provided by the LaborLawPractice (EmploymentAgreementCompliance) forecaster. Their legal analysis is well-grounded, emphasizing not only the formal abandonment of the rule and the dismissal of all appeals, but also the unchallenged judicial finding that the FTC lacks statutory authority for such a sweeping labor regulation. From an administrative law perspective, this is a terminal event: agency leadership aligned with the administration has no intention to revive the rule, and the base rate for such a reversal—especially after a change in administration and a definitive court ruling—is not just low, but essentially zero. The forecaster also appropriately weighs the implausibility of a rapid Congressional intervention or judicial turnaround within the remaining timeframe, which aligns with both doctrine and regulatory history. Their near-zero probability is thus justified and reflects the closure of all plausible legal and political pathways to enactment before 2026."
        },
        "lawMajorquestionsdoctrine": {
            "forecaster_to_engage": "PoliticalScience (SeparationOfPowersTheory)",
            "response_type": "defense",
            "response": "The PoliticalScience (SeparationOfPowersTheory) forecaster accurately identifies the decisive role of both structural constitutional barriers and recent jurisprudence in shaping the fate of the FTC non-compete rule. Their argument correctly integrates the significance of the major questions doctrine and the separation of powers in limiting agency authority—especially in the face of explicit judicial rebuke and the absence of Congressional action. The historical point that no major federal rule has been resurrected in substantially the same form after such a combination of judicial, administrative, and political opposition is especially salient. This perspective is reinforced by the clear signals from the current administration and the FTC's leadership that there is no intention to revisit or reissue the rule. The assignment of a zero probability is fully justified: it reflects not just the legal and administrative closure, but the broader constitutional dynamics that prevent rapid or extraordinary regulatory reversals absent a seismic political shift. The defense here is that the forecast appropriately weighs both institutional inertia and doctrinal developments, providing a robust and comprehensive rationale for a 'No' outcome."
        },
        "politicalscienceSeparationofpowerstheory": {
            "forecaster_to_engage": "LaborLawPractice (EmploymentAgreementCompliance)",
            "response_type": "critique",
            "response": "While your legal reasoning is meticulous and your assignment of a near-zero probability is justified, I would challenge your position that even a 1% probability is 'fantastical.' In Separation of Powers Theory, even highly unlikely scenarios—such as an unprecedented, emergency Congressional action or an extraordinary judicial reconsideration—cannot be absolutely ruled out in the U.S. political system, which is occasionally subject to unlikely coalitional shifts or strategic litigation. While I agree that the practical base rate and all evidence point to a near-zero chance, giving literally zero probability arguably discounts the residual uncertainty inherent in a complex, multi-branch system. A vanishingly small probability (e.g., 0.1%) might more accurately reflect true epistemic humility, even if the real-world chance is for all intents and purposes zero. Thus, I critique the strict determinism of your forecast, not the overall direction or conclusion."
        },
        "politicalsciencePolicyprocessmodel": {
            "forecaster_to_engage": "USGovernmentRelations (LegislativeAndStakeholderEngagement)",
            "response_type": "defense",
            "response": "The USGovernmentRelations (LegislativeAndStakeholderEngagement) forecaster's analysis is well-founded and synthesizes both institutional process and political realities. Their focus on the absence of any Congressional action, new rulemaking, or viable legal pathway is crucial: in the US policy process, once an agency has both lost in court and withdrawn its own rulemaking under a new administration, the probability of reversal or rapid resurrection is not just low but virtually nil. From a policy process perspective, the convergence of judicial, administrative, and executive opposition—combined with the lack of stakeholder mobilization for rapid legislative rescue—means the window for a Yes outcome is closed. Their invocation of base rates for regulatory reversals after comprehensive defeats is empirically sound and consistent with both political science literature and practical government relations experience. This defense affirms that their zero probability assignment is justified by the combined weight of legal, procedural, and stakeholder-related barriers."
        },
        "economicsLabormarketregulationtheory": {
            "forecaster_to_engage": "RegulatoryAffairs (FederalRulemakingProcess)",
            "response_type": "defense",
            "response": "I concur with the RegulatoryAffairs (FederalRulemakingProcess) forecaster’s assessment, particularly their emphasis on the institutional inertia and rulemaking realities that follow a court vacatur and agency abandonment. From an economics perspective focused on labor market regulation, the forecast accurately recognizes that the only plausible path for a Yes outcome would require not just a change in legal authority but also an unprecedented reversal of both administrative and political course within a matter of months—an outcome with vanishing base rate probability. Their argument about the unlikelihood of regulatory resurrection in the face of explicit judicial, executive, and administrative opposition is especially strong. The defense here is that their zero-probability assignment is entirely warranted given all relevant process, legal, and economic constraints, and that their synthesis of regulatory process theory and recent events is compelling and robust."
        }
    },
    "revision_results": {
        "RegulatoryAffairs (FederalRulemakingProcess)": {
            "my_phase1_final_probability": 0,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I find no new evidence or argument that would justify raising the probability above zero. All forecasters, from a range of disciplinary perspectives (law, economics, political science, labor practice, and government relations), independently converge on the same conclusion: the FTC's non-compete ban is definitively dead for the foreseeable future. The legal, administrative, and political barriers are uniformly insurmountable within the time window, and there is no plausible pathway—either through litigation, agency action, or legislation—that could revive and enact the rule in more or less its current form before 2026. The group consensus and underlying reasoning reinforce the initial analysis.",
            "revised_probability": 0
        },
        "LaborLawPractice (EmploymentAgreementCompliance)": {
            "my_phase1_final_probability": 1,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, including the consistent consensus across relevant legal, regulatory, political, and economic perspectives, I see no new information or arguments that warrant increasing the probability of the FTC's non-compete ban being enacted before 2026. In fact, the group discussion reinforced the strength of the initial reasoning: the base rate for reversal after a court vacatur and agency abandonment is virtually zero, and the political and legal climate is especially hostile to such a revival. No plausible Yes scenario exists within the time frame and the resolution criteria. Therefore, my probability remains unchanged.",
            "revised_probability": 1
        },
        "USGovernmentRelations (LegislativeAndStakeholderEngagement)": {
            "my_phase1_final_probability": 0,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, my initial forecast is reinforced. All engaged forecasters—across regulatory, legal, economic, and political science perspectives—overwhelmingly converge on the view that there is no plausible legal, administrative, or political path for the FTC's non-compete ban to be enacted in its current or near-current form before 2026. Even those who assign a nonzero probability (e.g., 1%) acknowledge that it would require an unprecedented, highly implausible chain of events, and the critique from LaborLawPractice (EmploymentAgreementCompliance) persuasively argues that even this 1% is not justified given the degree of closure evidenced in the legal, administrative, and political arenas. No new information arose in deliberation suggesting an overlooked path to enactment. Therefore, my probability remains at 0.",
            "revised_probability": 0
        },
        "Law (AdministrativeProceduresActDoctrine)": {
            "my_phase1_final_probability": 0,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I see strong consensus across all relevant expert domains—regulatory affairs, labor law, government relations, major questions doctrine, and Chevron deference—that the possibility of the FTC's non-compete ban being enacted in its current form before 2026 is functionally zero. All forecasters independently recognize the combination of legal, administrative, and political barriers as insurmountable within the remaining time frame. There were no substantive arguments or evidence presented suggesting even a small tail risk of the rule being revived. The probability of 0 remains justified by the overwhelming convergence of expert analysis and recent developments.",
            "revised_probability": 0
        },
        "Law (ChevronDeference)": {
            "my_phase1_final_probability": 0,
            "reasoning_for_revised_probability": "After reviewing all group deliberation, the consensus across multiple domains (regulatory affairs, labor law, administrative law, political science, economics) reinforces my initial assessment: there is overwhelming legal, procedural, and political finality to the FTC's abandonment of the non-compete ban. All forecasts, including those with expertise in relevant legal doctrines and regulatory processes, reach the same conclusion, and arguments for even a minimal tail risk (1%) are not supported by any credible scenario or precedent. No new information has emerged to suggest any plausible path to the rule's enactment before 2026. Therefore, there is no reason to revise my initial probability.",
            "revised_probability": 0
        },
        "Law (MajorQuestionsDoctrine)": {
            "my_phase1_final_probability": 1,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, every expert across regulatory, legal, policy, and economics perspectives converges on the same conclusion: the probability of the FTC's non-compete ban being enacted in more or less its current form before 2026 is essentially zero. The most compelling critique of my initial 1% probability is that, given the explicit legal, administrative, and political closure, even a 1% tail risk is not warranted. The courts have vacated the rule on major questions grounds, the FTC has not only abandoned appeals but formally rescinded the rule, and the current administration is ideologically opposed. There is no plausible path—legal, administrative, or legislative—for enactment before the deadline. The base rate for such a regulatory resurrection is functionally zero. Therefore, the most defensible probability is 0%.",
            "revised_probability": 0
        },
        "PoliticalScience (SeparationOfPowersTheory)": {
            "my_phase1_final_probability": 0,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I find that all other expert forecasters converge on a near-zero probability, with the reasoning consistently grounded in legal, administrative, and political realities. No new arguments or evidence emerged during deliberation to suggest any plausible legal, political, or procedural pathway by which the FTC's proposed non-compete ban could be enacted before 2026. While there was a minor critique regarding the strict use of 'zero' versus a vanishingly small but nonzero probability, the overwhelming consensus is that, for practical purposes and given the resolution's criteria, the probability is functionally zero. Therefore, I see no reason to revise my probability upward.",
            "revised_probability": 0
        },
        "PoliticalScience (PolicyProcessModel)": {
            "my_phase1_final_probability": 1,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, there is overwhelming consensus among experts from multiple disciplines—law, regulatory affairs, government relations, labor practice, and economics—that the likelihood of the FTC's non-compete ban being enacted in anything like its current form before 2026 is vanishingly small. All relevant news since September 2025 confirms the rule's formal abandonment, the lack of any legal, legislative, or administrative pathway to revival in the relevant timeframe, and the decisive opposition of the current administration and agency leadership. No new arguments or evidence in the group discussion suggest any plausible scenario for a Yes resolution. The only minor point of contention is whether the probability should be strictly zero or allow for a vanishingly small tail risk (e.g., 0.1%). Given the full closure of all plausible procedural, legal, and political pathways, I will maintain my initial probability of 1%, acknowledging this as an expression of extreme confidence, but not absolute certainty, in line with the most epistemically cautious forecasts.",
            "revised_probability": 1
        },
        "Economics (LaborMarketRegulationTheory)": {
            "my_phase1_final_probability": 1,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, there is overwhelming consensus among experts from diverse but relevant fields—including regulatory affairs, administrative law, political science, and labor law—that the probability of the FTC's proposed non-compete ban being enacted in its current or near-current form before 2026 is effectively zero. All forecasters cited the decisive legal, procedural, and political barriers: the rule's nationwide vacatur, the FTC's formal abandonment and withdrawal of appeals, the administration's opposition, and the absence of any plausible legislative or judicial path to reversal within the short time window remaining. The discussions reinforced the extremely low base rate of regulatory resurrection under these conditions, and no new arguments emerged that would justify increasing the probability. The only minor critique was whether to assign literally zero or a vanishingly small positive probability, but no substantive scenario was advanced for a Yes outcome. Therefore, I see no reason to revise my original probability.",
            "revised_probability": 1
        }
    },
    "revision_probability": [
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1
    ],
    "revision_mean_probability": 1.0,
    "revision_sd": 0.0,
    "revision_probability_result": 1,
    "question_details": {
        "id": 38814,
        "title": "Will the FTC's proposed ban on non-compete agreements for most workers be enacted in more or less its current form before 2026?",
        "created_at": "2025-08-31T05:08:15.152606Z",
        "open_time": "2025-09-29T05:00:39Z",
        "cp_reveal_time": "2025-09-29T06:30:39Z",
        "spot_scoring_time": "2025-09-29T06:30:39Z",
        "scheduled_resolve_time": "2026-01-01T15:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-09-29T06:30:39Z",
        "actual_close_time": "2025-09-29T06:30:39Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "This question is synced with an identical question on Metaculus. The original question opened on 2025-01-01 09:31:03 and can be found [here](https://www.metaculus.com/questions/31227). This question will resolve to the same value as the synced question. The original question's background info at this time is below. \n\nIn April 2024, the Federal Trade Commission (FTC) issued a [final rule](https://www.ftc.gov/news-events/news/press-releases/2024/04/ftc-announces-rule-banning-noncompetes) banning most non-compete agreements in the United States, claiming that this would generate over 8,500 new businesses each year, raise worker wages, lower health care costs, and boost innovation. The rule would prohibit employers from entering into or enforcing non-compete clauses with workers, including employees and independent contractors, with limited exceptions for senior executives. Employers would be required to rescind existing non-compete agreements and notify affected workers that such clauses are no longer in effect.\n\nThe rule was scheduled to take effect on September 4, 2024, however, on August 20, 2024, Judge Ada Brown of the U.S. District Court for the Northern District of Texas [blocked the rule](https://hrdailyadvisor.blr.com/2024/10/11/after-judge-blocks-ftcs-worker-non-compete-ban-now-what/) nationwide, ruling that the FTC lacked the statutory authority to implement such a ban and that the rule was \"arbitrary and capricious\". On October 18, 2024, the FTC [filed an appeal](https://www.psca.org/news/psca-news/2024/10/where-does-the-ftcs-non-compete-ban-stand-now/) with the U.S. Court of Appeals for the Fifth Circuit.\n\n`{\"format\":\"metac_closes_in_period\",\"info\":{\"post_id\":31227,\"question_id\":30897}}`",
        "resolution_criteria": "This question will resolve as **Yes** if FTC's [ban on noncompetes](https://www.ftc.gov/legal-library/browse/rules/noncompete-rule) is enacted before January 1, 2026 with at most minor changes.\n\nAs of December 2024, the current form of the regulation would apply to all workers at companies which are under FTC's jurisdiction, with a single exception of individuals earning more than $151,164 who are in a \"policy-making position\". It also applies to both existing and future non-compete agreements.\n\nMinor changes are defined as amendments in the current exceptions that affect less than 10% of workers under FTC's jurisdiction (as judged by Metaculus), as changes to the notice requirements employers should give to their employees, or other changes of a similar scope as judged by Metaculus admins.\n\nIf the rule is not enacted before January 1, 2026 or if it is enacted with other changes, including but not limited to changes that affect at least 10% of workers or changes to if the rule would be applied to existing contracts at all, would resolve this question as **No**.",
        "fine_print": "This question resolves based on the first day the corresponding rule is enacted. If the rule is enacted and then subsequently amended or blocked, the resolution of this question will not be affected.",
        "post_id": 39437,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**The Knowledge Group Has Scheduled a Live Webcast on U.S. Non-Compete Agreements Post-FTC: What Employers and Counsel Need to Know - PR.com**\nThe Knowledge Group announced a live webcast titled 'The Knowledge Group Has Scheduled a Live Webcast on U.S. Non-Compete Agreements Post-FTC: What Employers and Counsel Need to Know' that will take place on Tuesday, October 14, 2025, from 12:00 PM to 1:00 PM (ET). The event follows the Federal Trade Commission's (FTC) decision to ban its recent non‑compete rule and to withdraw all appeals related to that ban, a move that has left employers and counsel facing a patchwork of inconsistent state laws across the country. James Gale, Co‑Chair of Intellectual Property Litigation at Cozen O'Connor, will lead the discussion, offering practical guidance on navigating the post‑FTC environment, assessing the impact on existing agreements, and exploring alternative contractual strategies. The agenda includes an overview of the FTC’s prior rule and its current status, anticipated litigation trends, recent state‑law changes affecting non‑compete enforcement, implications for existing agreements, alternative protective measures for confidential information and trade secrets, drafting enforceable non‑solicitation and non‑disclosure agreements, and compliance strategies for multi‑state employers. The webcast is part of The Knowledge Group’s continuing‑education program, which has served lawyers, accountants, and business professionals since 2006.\nOriginal language: en\nPublish date: September 28, 2025 05:18 PM\nSource:[PR.com](https://www.pr.com/press-release/949407)\n\n**5 Policies the US Has Rolled Back So Far in 2025 (and How It Affects Your Money)**\nAccording to the Brookings Institute, the Trump administration has rolled back more than 60 regulatory changes in 2025, including five major policies. First, the Department of Health and Human Services (HHS) proposed new rules that would change the enrollment period, add verification requirements, eliminate certain recipients, and roll back tax credits for the Affordable Care Act (ACA). The Center for American Progress says these changes increase costs for people with ACA marketplace coverage and shrink enrollment. Second, the Department of Transportation (DOT) rescinded a Biden rule that required cash refunds for delayed flights and a rule that required disclosure of baggage and other fees. Airline industry groups welcomed the change, while passenger groups warned it could raise air‑travel costs. Tomasz Pawliszyn, CEO of AirHelp, said, 'To revert back now will hinder the air travel experience and leave millions of travelers without adequate compensation in the event of a disruption.' Third, the administration rescinded a Biden executive order that capped out‑of‑pocket drug costs at pharmacies and lowered prices for Medicare beneficiaries. The HHS secretary was directed to select payment models for specific drugs and submit a report within 90 days. Supporters said it could further cap prescription drug prices for Medicare beneficiaries. Fourth, a federal judge overturned a Biden policy that kept medical debt off credit reports, a rule that was designed to relieve the burden of health‑care expenses affecting nearly one‑third of Americans. The ruling was seen as a major blow to the Consumer Financial Protection Bureau and could make it harder for some Americans to obtain credit. Fifth, the administration rescinded a Biden executive order that raised the minimum wage for federal contractors to $15 an hour (or $10.50 for tipped workers) from $10.95 or $7.65. The order was already facing lawsuits and is still litigated. If the change sticks, federal contractors may see less income than they would have otherwise.\nOriginal language: en\nPublish date: September 28, 2025 10:55 AM\nSource:[GOBankingRates](https://www.gobankingrates.com/money/economy/policies-us-rolled-back-so-far-2025-how-affects-money/)\n\n**FTC Walks Away From Rulemaking -- But Not The Fight On Non-Competes**\nOn September 5, 2025, the Federal Trade Commission (FTC) shifted its strategy on non‑compete agreements by voting 3‑1 to abandon the Non‑Compete Clause Rule, a regulation that had banned most non‑compete clauses nationwide. The decision followed the FTC’s voluntary dismissal of appeals in two lawsuits—Ryan, LLC v. FTC (5th Cir.) and Properties of the Villages, Inc. v. FTC (11th Cir.)—which had issued nationwide injunctions against the Rule. Commissioner Holyoak and Chairman Ferguson stated that the Rule was \"patently obvious\" illegal, arguing that the FTC lacked authority to preempt state law and that it would \"render categorically unlawful a species of contract that has been lawful since the eighteenth century.\" Ferguson also warned that the FTC would continue to enforce antitrust laws against non‑compete agreements on a case‑by‑case basis under Section 5 of the FTC Act.\n\nCommissioner Meador concurred, calling the Rule overbroad and noting that economic considerations require a balanced approach. Commissioner Slaughter dissented, citing potential harms such as barriers to worker mobility, wage suppression, and stifled innovation, and urged the FTC to follow the Administrative Procedure Act’s notice‑and‑comment process before withdrawing the Rule.\n\nThe Rule had been promulgated on April 23, 2024 after a January 5, 2023 notice‑and‑comment period. It applied prospectively and retrospectively, preempting state non‑compete laws except those more restrictive. The Rule was originally adopted by a 3‑2 party‑line vote and was scheduled to take effect in September 2024, but was stayed by injunctions in the Ryan and Properties cases. The Ryan Court’s August 20, 2024 ruling set the Rule aside nationwide, finding it violated the APA because the FTC lacked statutory authority and the Rule was arbitrary and capricious.\n\nDespite the Rule’s repeal, the FTC remains focused on non‑compete enforcement. Chairman Ferguson has directed a Joint Labor Task Force and issued a Request for Information to assess the scope and effects of non‑compete agreements. In September 2025, the FTC sent letters to large healthcare employers urging them to eliminate unfair or anticompetitive non‑competes, especially in rural areas. The agency also targeted Gateway Services, Inc., the largest pet cremation business, for broad non‑compete agreements that allegedly stifled job mobility and competition. The proposed consent order would require Gateway to stop enforcing existing non‑competes and prohibit future agreements.\n\nOverall, the FTC’s strategy has moved from a blanket ban to a more tailored, case‑by‑case enforcement approach, while continuing to monitor and address non‑compete agreements that may harm competition and workers.\nOriginal language: en\nPublish date: September 28, 2025 09:10 AM\nSource:[Mondaq Business Briefing](https://www.mondaq.com/unitedstates/employee-rights-labour-relations/1683444/ftc-walks-away-from-rulemaking-but-not-the-fight-on-non-competes)\n\n**\"Preparatory steps\" don't breach non-compete clauses**\nOn September 26 2025 the Fair Work Commission’s full bench ruled that employees who take preparatory steps to set up a competing business while still employed are unlikely to breach fiduciary or contractual obligations. The bench said, 'The fiduciary and contractual obligations of employees do not provide an absolute bar to employees who may wish to make preparations for the establishment of a competitive business whilst remaining in the service of their existing employer.' The decision followed Commissioner Benjamin Redford’s hearing of a case in which Plumbtrax Pty Ltd dismissed an employee in December 2024 for alleged serious misconduct, claiming the employee had created and registered his own business and promoted it using the employer’s resources during work time. The bench refused the employer’s unfair dismissal appeal, concluding that the employee’s preparatory activities did not constitute a breach of non‑compete clauses.\nOriginal language: en\nPublish date: September 26, 2025 11:14 AM\nSource:[hrdaily.com.au](https://www.hrdaily.com.au/news/preparatory-steps-don-t-breach-non-compete-clauses-12941)\n\n**No Unbudgeted Spending: Government Imposes Tough New Measures to Curb Overspending**\nThe Zimbabwean government has issued Treasury Circular 10 of 2025, imposing strict spending controls that require all Ministries, Departments and Agencies (MDAs) to operate strictly within the 2025 Approved Budget. Treasury says that years of unplanned spending have eroded budget credibility and widened the fiscal deficit, so any unbudgeted expenditure will now be considered void and subject to penalties. A key provision is that any contract worth US$2 million or more must receive prior written approval from Treasury; contracts below that threshold must stay within the current year’s budget allocation, and contracts signed outside these rules will not be honoured. Workshops, conferences and foreign travel are largely suspended for the remainder of 2025, with training limited to government facilities such as ZIPAM and PSC Academies and events held close to participants to cut transport costs. Special per diem rates have been abolished, and vehicle hiring for MDAs funded from the Consolidated Revenue Fund is banned; pool vehicles must be logged and audited every two weeks. A general recruitment freeze is introduced, except for critical sectors such as health, education and security, and all institutions funded from the Consolidated Revenue Fund must migrate to the Salary Service Bureau payroll system immediately to enhance transparency. Fuel allocations to all government institutions have been cut by 25 %, and capital expenditure is restricted to only three categories of projects: high‑impact projects driving growth or reducing life‑risk, protective works, and ongoing projects with existing payment commitments. Procurement of new vehicles, furniture and equipment is deferred until 2026 unless already approved. Treasury says these measures are necessary to contain expenditures, rebuild trust in the national budget, reduce arrears and strengthen economic stability. 'Any unbudgeted expenditure will now be considered void, with penalties for non‑compliance,' the circular states.\nOriginal language: en\nPublish date: September 29, 2025 02:31 AM\nSource:[iharare.com](https://iharare.com/no-unbudgeted-spending-government-imposes-tough-new-measures-to-curb-overspending/)\n\n**Saiz to Facilitate Partial Retirement in the Administration with Interim Staff**\nThe Spanish government is studying the opening of a transitional period that would allow temporary staff to act as releasers, thereby unblocking the backlog of partial‑retirement requests for public‑sector labour personnel. The Ministry of Social Security is finalising a formula to reverse the block caused by the new partial‑retirement regime that entered into force on 1 April. The last tripartite pension agreement, reached a little over a year ago, introduced changes that did not consider the impact on public‑sector labour staff. The new rule requires that a releaser be hired permanently, full‑time, and remain employed for at least two years after the partial‑retirement process ends. This rigidity has made it difficult for administrations to create fixed positions, leading to a backlog that previously could be resolved by hiring temporary staff. According to the article, there were about 250,000 labour contracts in the administration in 2024, and the total public workforce was 3.5 million, of which 981,000 were temporary, giving a temporary rate of almost 28 %. The EU Court of Justice, in a 13 June 2024 ruling, declared that successive temporary contracts in the public sector constitute abuse and urged administrations to convert them to permanent contracts or provide deterrent compensation. The Supreme Court has submitted a question to the Court of Justice about the procedure for long‑duration interim staff, which could clarify the application of the ruling. The Ministry says it will wait for an agreement with social partners before finalising the solution, but sources say the plan is to keep the old rule for a transitional period until public administrations can fill the positions with permanent staff. Sources quoted the plan as: 'La idea es mantener la norma anterior durante un periodo de tiempo', indicating that the temporary window is intended to allow administrations to recruit permanent staff once the new regulations are fully implemented.\nOriginal language: es\nPublish date: September 28, 2025 08:38 PM\nSource:[Expansión](https://www.expansion.com/economia/politica/2025/09/28/68d99c9e468aebac118b4583.html)\n\n**The Knowledge Group Has Scheduled a Live Webcast on U.S. Non-Compete Agreements Post-FTC: What Employers and Counsel Need to Know - PR.com**\nThe Knowledge Group announced a live webcast titled 'The Knowledge Group Has Scheduled a Live Webcast on U.S. Non-Compete Agreements Post-FTC: What Employers and Counsel Need to Know' that will take place on Tuesday, October 14, 2025, from 12:00 PM to 1:00 PM (ET). The event follows the Federal Trade Commission's (FTC) decision to ban its recent non‑compete rule and to withdraw all appeals related to that ban, a move that has left employers and counsel facing a patchwork of inconsistent state laws across the country. James Gale, Co‑Chair of Intellectual Property Litigation at Cozen O'Connor, will lead the discussion, offering practical guidance on navigating the post‑FTC environment, assessing the impact on existing agreements, and exploring alternative contractual strategies. The agenda includes an overview of the FTC’s prior rule and its current status, anticipated litigation trends, recent state‑law changes affecting non‑compete enforcement, implications for existing agreements, alternative protective measures for confidential information and trade secrets, drafting enforceable non‑solicitation and non‑disclosure agreements, and compliance strategies for multi‑state employers. The webcast is part of The Knowledge Group’s continuing‑education program, which has served lawyers, accountants, and business professionals since 2006.\nOriginal language: en\nPublish date: September 28, 2025 05:18 PM\nSource:[PR.com](https://www.pr.com/press-release/949407)\n\n**5 Policies the US Has Rolled Back So Far in 2025 (and How It Affects Your Money)**\nAccording to the Brookings Institute, the Trump administration has rolled back more than 60 regulatory changes in 2025, including five major policies. First, the Department of Health and Human Services (HHS) proposed new rules that would change the enrollment period, add verification requirements, eliminate certain recipients, and roll back tax credits for the Affordable Care Act (ACA). The Center for American Progress says these changes increase costs for people with ACA marketplace coverage and shrink enrollment. Second, the Department of Transportation (DOT) rescinded a Biden rule that required cash refunds for delayed flights and a rule that required disclosure of baggage and other fees. Airline industry groups welcomed the change, while passenger groups warned it could raise air‑travel costs. Tomasz Pawliszyn, CEO of AirHelp, said, 'To revert back now will hinder the air travel experience and leave millions of travelers without adequate compensation in the event of a disruption.' Third, the administration rescinded a Biden executive order that capped out‑of‑pocket drug costs at pharmacies and lowered prices for Medicare beneficiaries. The HHS secretary was directed to select payment models for specific drugs and submit a report within 90 days. Supporters said it could further cap prescription drug prices for Medicare beneficiaries. Fourth, a federal judge overturned a Biden policy that kept medical debt off credit reports, a rule that was designed to relieve the burden of health‑care expenses affecting nearly one‑third of Americans. The ruling was seen as a major blow to the Consumer Financial Protection Bureau and could make it harder for some Americans to obtain credit. Fifth, the administration rescinded a Biden executive order that raised the minimum wage for federal contractors to $15 an hour (or $10.50 for tipped workers) from $10.95 or $7.65. The order was already facing lawsuits and is still litigated. If the change sticks, federal contractors may see less income than they would have otherwise.\nOriginal language: en\nPublish date: September 28, 2025 10:55 AM\nSource:[GOBankingRates](https://www.gobankingrates.com/money/economy/policies-us-rolled-back-so-far-2025-how-affects-money/)\n\n**FTC Walks Away From Rulemaking -- But Not The Fight On Non-Competes**\nOn September 5, 2025, the Federal Trade Commission (FTC) shifted its strategy on non‑compete agreements by voting 3‑1 to abandon the Non‑Compete Clause Rule, a regulation that had banned most non‑compete clauses nationwide. The decision followed the FTC’s voluntary dismissal of appeals in two lawsuits—Ryan, LLC v. FTC (5th Cir.) and Properties of the Villages, Inc. v. FTC (11th Cir.)—which had issued nationwide injunctions against the Rule. Commissioner Holyoak and Chairman Ferguson stated that the Rule was \"patently obvious\" illegal, arguing that the FTC lacked authority to preempt state law and that it would \"render categorically unlawful a species of contract that has been lawful since the eighteenth century.\" Ferguson also warned that the FTC would continue to enforce antitrust laws against non‑compete agreements on a case‑by‑case basis under Section 5 of the FTC Act.\n\nCommissioner Meador concurred, calling the Rule overbroad and noting that economic considerations require a balanced approach. Commissioner Slaughter dissented, citing potential harms such as barriers to worker mobility, wage suppression, and stifled innovation, and urged the FTC to follow the Administrative Procedure Act’s notice‑and‑comment process before withdrawing the Rule.\n\nThe Rule had been promulgated on April 23, 2024 after a January 5, 2023 notice‑and‑comment period. It applied prospectively and retrospectively, preempting state non‑compete laws except those more restrictive. The Rule was originally adopted by a 3‑2 party‑line vote and was scheduled to take effect in September 2024, but was stayed by injunctions in the Ryan and Properties cases. The Ryan Court’s August 20, 2024 ruling set the Rule aside nationwide, finding it violated the APA because the FTC lacked statutory authority and the Rule was arbitrary and capricious.\n\nDespite the Rule’s repeal, the FTC remains focused on non‑compete enforcement. Chairman Ferguson has directed a Joint Labor Task Force and issued a Request for Information to assess the scope and effects of non‑compete agreements. In September 2025, the FTC sent letters to large healthcare employers urging them to eliminate unfair or anticompetitive non‑competes, especially in rural areas. The agency also targeted Gateway Services, Inc., the largest pet cremation business, for broad non‑compete agreements that allegedly stifled job mobility and competition. The proposed consent order would require Gateway to stop enforcing existing non‑competes and prohibit future agreements.\n\nOverall, the FTC’s strategy has moved from a blanket ban to a more tailored, case‑by‑case enforcement approach, while continuing to monitor and address non‑compete agreements that may harm competition and workers.\nOriginal language: en\nPublish date: September 28, 2025 09:10 AM\nSource:[Mondaq Business Briefing](https://www.mondaq.com/unitedstates/employee-rights-labour-relations/1683444/ftc-walks-away-from-rulemaking-but-not-the-fight-on-non-competes)\n\n**Student Loan Update: Trump Admin Faces New Lawsuit Over Forgiveness Student loan update: Trump admin faces new lawsuit over forgiveness**\nOn September 16, 2025, the American Federation of Teachers (AFT) filed a request for class certification and a preliminary injunction in the U.S. District Court for the District of Columbia, alleging that the U.S. Department of Education (ED) and Secretary Linda McMahon unlawfully delayed or shut down income‑driven repayment (IDR) and Public Service Loan Forgiveness (PSLF) relief. The complaint cites an IDR backlog of more than 1.08 million pending applications as of August 31, 2025, and 74,510 pending PSLF Buyback requests, with only 5,600 decisions in August. AFT argues that these delays could push IDR discharges past December 31, 2025, when the current federal tax exemption expires; discharges dated January 1, 2026 or later would become taxable, while PSLF discharges remain tax‑free.\n\nThe lawsuit coincides with ED’s proposed PSLF rules that would allow the Secretary to deem employers ineligible if their activities involve a ‘substantial illegal purpose’. NASFAA senior policy analyst Megan Walter warned that granting the Secretary unilateral authority to make such determinations “without a court finding” undermines due‑process and could create a legal limbo for borrowers and employers. Walter urged the Department to rely on existing judicial and IRS determinations and to include detailed due‑process procedures.\n\nED’s stance, announced in April, is to resume aggressive collections on defaulted federal loans, framing forgiveness as a taxpayer burden. This approach clashes with AFT’s focus on ensuring timely, lawful processing of statutory relief. AFT’s claim of ‘irreparable harm’ is bolstered by the risk that borrowers who qualify for cancellation may face wage garnishment or offsets while their IDR/PSLF applications remain pending.\n\nKey dates: AFT filed its suit on March 19, 2025; ED paused IDR intake around February 26, reopened on March 26; a July 14 letter confirmed monthly status reports on the backlog. The court will hear AFT’s preliminary‑injunction and class‑certification motions on October 31, 2025, potentially affecting borrowers seeking IDR cancellation before 2026.\n\nQuotes: ‘I think the most significant legal risk is granting the Secretary of Education what NASFAA sees as unilateral authority to determine that an employer has a ‘substantial illegal purpose’ without that determination being based on an actual court finding.’ – Megan Walter. ‘The government can and will collect defaulted federal student loan debt by withholding money from borrowers, tax refunds, federal pensions and even their wages,’ – Karoline Leavitt, White House press secretary.\n\nThe article presents the facts and statements from involved parties without editorializing, offering a clear, evidence‑based overview of the legal dispute and its potential impact on student‑loan borrowers.\nOriginal language: en\nPublish date: September 27, 2025 09:00 AM\nSource:[Newsweek](https://www.newsweek.com/student-loan-update-trump-admin-faces-new-lawsuit-over-forgiveness-10790279)\n\n**EEOC to Close All Pending Disparate Impact Investigations by September 30, 2025**\nOn September 27, 2025 the Equal Employment Opportunity Commission (EEOC) announced it will administratively close all pending charges that rely solely on disparate impact by the end of September 2025. The decision follows President Trump’s April 23, 2025 executive order, 'Restoring Equality of Opportunity and Meritocracy', which directed federal agencies to eliminate reliance on disparate impact liability. According to an internal agency memorandum, staff must close those cases by September 30 and issue 'right to sue' letters by October 31, giving charging parties 90 days to pursue litigation in federal court. The EEOC will no longer investigate or resolve charges based solely on disparate impact; ongoing matters that also allege intentional discrimination may proceed only on that theory. The agency has already withdrawn from several suits, and other federal agencies—Department of Justice, Department of Housing and Urban Development, Consumer Financial Protection Bureau, and Federal Trade Commission—must apply similar restrictions in fair housing, credit, and consumer protection. This change marks a significant shift, as disparate impact has been a cornerstone of systemic discrimination enforcement since the Supreme Court recognized it in Griggs v. Duke Power Co. and codified it into Title VII in 1991. While Title VII still prohibits disparate impact discrimination, workers will now need to seek private counsel and file lawsuits on their own, bearing the cost and complexity of proving the case.\nOriginal language: en\nPublish date: September 27, 2025 05:11 AM\nSource:[JD Supra](https://www.jdsupra.com/legalnews/eeoc-to-close-all-pending-disparate-8881352/)\n\n**BREAKING: FTC Abandons Noncompete Rule, Announces Targeted Enforcement Actions Amidst FTC Staffing Shake-ups**\nThe Federal Trade Commission (FTC) announced on September 5 2025 that it will dismiss its appeals of district‑court decisions blocking its Non‑compete Rule, effectively abandoning the nationwide ban on non‑compete agreements. The rule, approved 3‑2 in April 2024 and published in the Federal Register (89 FR 38342) on May 7 2024, would have prohibited new post‑employment non‑competes and invalidated existing ones, affecting roughly 30 million workers—about one in five American employees. The rule was challenged on three grounds: lack of statutory authority, unconstitutional delegation of power, and arbitrary and capriciousness. Courts were split: the Eastern District of Pennsylvania sided with the FTC, while the Northern District of Texas enjoined the rule. The FTC appealed to the Fifth and Eleventh Circuits, but under new Chair Andrew Ferguson—appointed by President Trump on Inauguration Day 2025—the agency decided to withdraw its appeals and accept the vacatur. Ferguson said the FTC would shift from rulemaking to “aggressive enforcement,” issuing enforcement actions and warning letters to employers. The article also notes ongoing litigation over Trump’s removal of Democratic commissioners and the Supreme Court’s recent “major questions” decision. While the FTC will no longer pursue a nationwide ban, it remains committed to enforcing antitrust laws against non‑compete agreements.\n\nKey metrics and facts:\n- 30 million workers (1 in 5) bound by non‑competes.\n- Rule approved 3‑2; published 89 FR 38342.\n- Courts: Eastern District of Pennsylvania (FTC‑friendly) vs. Northern District of Texas (enjoined rule).\n- FTC withdrew appeals in Ryan, LLC v. FTC (5th Cir.) and Properties of the Villages v. FTC (11th Cir.) on Sept 5 2025.\n\nNotable quotes:\n- Ferguson’s dissent: ‘by far the most extraordinary assertion of authority in the Commission’s history.’\n- Ferguson’s statement: ‘aggressive enforcement’.\n\nEvidence: The article cites court decisions, FTC press releases, the Federal Register, and statements from Ferguson and other officials.\n\nOriginal language: en\nPublish date: September 26, 2025 08:15 PM\nSource:[JD Supra](https://www.jdsupra.com/legalnews/breaking-ftc-abandons-noncompete-rule-4803669/)\n\n**\"Preparatory steps\" don't breach non-compete clauses**\nOn September 26 2025 the Fair Work Commission’s full bench ruled that employees who take preparatory steps to set up a competing business while still employed are unlikely to breach fiduciary or contractual obligations. The bench said, 'The fiduciary and contractual obligations of employees do not provide an absolute bar to employees who may wish to make preparations for the establishment of a competitive business whilst remaining in the service of their existing employer.' The decision followed Commissioner Benjamin Redford’s hearing of a case in which Plumbtrax Pty Ltd dismissed an employee in December 2024 for alleged serious misconduct, claiming the employee had created and registered his own business and promoted it using the employer’s resources during work time. The bench refused the employer’s unfair dismissal appeal, concluding that the employee’s preparatory activities did not constitute a breach of non‑compete clauses.\nOriginal language: en\nPublish date: September 26, 2025 11:14 AM\nSource:[hrdaily.com.au](https://www.hrdaily.com.au/news/preparatory-steps-don-t-breach-non-compete-clauses-12941)\n\n**FTC Walks Away from Noncompete Ban Appeals -- But Not from Noncompetes**\nThe Federal Trade Commission (FTC) has officially dropped its appeals in the two cases that struck down its nationwide non‑compete ban, following a 3‑1 vote earlier this month. The agency decided to walk away from the fight, leaving in place court rulings that vacated the rule, after weighing its options for more than six months following a change in presidential administrations. The abandoned rule, finalized in April 2024, would have banned nearly all post‑employment non‑compete agreements across the country and required employers to notify workers that their existing non‑competes were unenforceable, with only narrow exceptions for senior executives and business sales. At the time the FTC estimated that roughly 30 million workers—about one in five—were bound by non‑competes. Legal challenges came fast: a Texas federal court struck down the ban nationwide in August 2024, finding the agency lacked statutory authority, and a Florida court issued a narrower injunction soon after. The FTC initially appealed both decisions but changed its posture after the administration shift, ultimately concluding that continuing the appeals was not the right move. The agency is not abandoning non‑compete enforcement altogether; it plans to use its adjudicatory powers to target what it calls \"onerous\" or \"unfair\" non‑compete agreements on a case‑by‑case basis, especially in sectors such as healthcare and staffing. Recent enforcement actions and warning letters underscore that message. The era of a blanket ban may be over, but employers should expect continued scrutiny—and a more surgical approach—from the FTC going forward.\nOriginal language: en\nPublish date: September 26, 2025 10:19 AM\nSource:[JD Supra](https://www.jdsupra.com/legalnews/ftc-walks-away-from-noncompete-ban-9360267/)\n\n**The FTC's Employee Noncompete Rule is Officially Dead, but Substantial Barriers to Noncompetes Remain in Effect**\nIn May 2024 the Federal Trade Commission (FTC) issued a final rule that would have banned almost all non‑compete agreements nationwide, classifying them as an unfair method of competition under Section 5 of the FTC Act. The rule would have prohibited new non‑competes for all workers, including senior executives, and would have invalidated existing non‑compete clauses for workers other than senior executives from September 2024 onward, while allowing senior‑executive clauses to remain in force. The rule contained only narrow exceptions, such as agreements tied to a bona fide sale of a business.\n\nTwo developments halted the rule. First, litigation challenged the rule’s substance and the FTC’s authority, resulting in injunctions against the rule. Second, the new Trump administration signaled it would review the rule and pursue appellate review of court rulings that struck it down.\n\nOn September 5 2025 the FTC withdrew its pending appeals, effectively ending the national policy. The FTC Chairman, however, stated the agency would \"continue to enforce the antitrust laws aggressively against non‑compete agreements,\" but on a case‑by‑case basis. Employers must still navigate a patchwork of state and local laws that regulate non‑compete enforceability.\n\nUnder federal law, non‑compete agreements will be evaluated under the \"rule of reason,\" balancing a legitimate pro‑competitive purpose against potential anti‑competitive effects. The FTC and the Department of Justice will scrutinize whether the restraint is reasonably necessary and whether less restrictive alternatives exist.\n\nFollowing the rule’s abandonment, FTC Chairman Ferguson issued warning letters to large healthcare and staffing companies, saying \"many healthcare employers and staffing companies include noncompete[s]… in employment contracts that may unreasonably limit employment options for… nurses, physicians, and other medical professionals\" and urged a thorough review of agreements. The FTC also noted that \"narrowly tailored noncompetes\" may serve valid purposes, but many are overbroad in duration, geographic scope, or inappropriate for certain roles.\n\nEmployers no longer face an absolute federal ban, but the FTC signals a high bar for proving a non‑compete is reasonable. Four states—California, Minnesota, North Dakota, and Oklahoma—have near‑total bans, and many others impose significant restrictions. Employers are advised to seek legal counsel on both state and federal law before drafting or renewing non‑compete agreements and to consider less risky means of protecting business interests.\n\nKey dates and facts: May 2024 rule issuance; September 2024 effective date for worker non‑competes; September 5 2025 FTC withdrawal; four states with near‑total bans; FTC’s \"rule of reason\" approach.\n\nQuotes: \"continue to enforce the antitrust laws aggressively against noncompete agreements\"; \"many healthcare employers and staffing companies include noncompete[s]… in employment contracts that may unreasonably limit employment options for… nurses, physicians, and other medical professionals\"; \"narrowly tailored noncompetes\" may serve valid purposes.\nOriginal language: en\nPublish date: September 23, 2025 06:09 PM\nSource:[JD Supra](https://www.jdsupra.com/legalnews/the-ftc-s-employee-noncompete-rule-is-7249961/)\n\n**https://natlawreview.com/article/five-takeaways-ftcs-decision-abandon-noncompete-rule**\nOn September 5 2025 the FTC announced it would accept the Texas court’s vacatur of its 2024 Non‑compete Rule, ending the agency’s attempt to ban most employee non‑compete agreements. The rule had been struck down in August 2024 and the FTC had appealed, but the change in administration led to the decision to 'accede to the vacatur.' The ruling means the rule cannot take effect or be enforced. The FTC, however, said it will continue to target over‑broad non‑competes. A week before the announcement it issued a consent order against the nation’s largest pet‑cremation company, requiring it to abandon non‑competes for all hires outside California except key employees. On September 10 it sent warning letters to several large healthcare employers and staffing firms, urging them to review and, if necessary, 'discontinue' restrictive covenants. The agency also requested information on non‑compete use to inform future enforcement. The article notes that the FTC’s authority to adopt substantive rules was limited by a 1973 D.C. Circuit decision, and a 2025 Texas district court held the FTC lacks such authority for labor practices. The FTC will focus on cases involving low‑wage, unskilled workers, broad geographic or temporal scopes, and agreements that violate state law. Nine states—including Arkansas, Louisiana, Maryland, Pennsylvania, Utah, Texas, Indiana, Wyoming, and Virginia—have recently tightened or limited non‑compete enforceability, while Florida has strengthened it. The FTC’s new approach treats non‑competes on a case‑by‑case basis, with employers bearing the burden to prove necessity and narrow tailoring.\nOriginal language: en\nPublish date: September 15, 2025 10:25 PM\nSource:[The National Law Review - A Free To Use Nationwide Database of Legal Publications](https://natlawreview.com/article/five-takeaways-ftcs-decision-abandon-noncompete-rule)\n\n**Trump Administration Ends FTC's Attempt To Ban Noncompetes**\nThe Federal Trade Commission (FTC) ended its attempt to ban non‑competition agreements nationwide by voluntarily dismissing its appeal of court rulings that blocked its Final Rule. On September 5, 2025, the FTC announced that it would no longer pursue enforcement of the rule that had been adopted during the Biden administration, which aimed to prohibit the majority of non‑compete clauses in employer‑worker agreements. The rule had attracted over 26,000 public comments and was challenged in three lawsuits—first in Pennsylvania, then Texas, and finally Florida. The courts in Texas and Florida ruled against the FTC, with the Northern District of Texas blocking the rule from taking effect on August 20, 2024. The Trump administration reversed the FTC’s course, and new Chair Andrew Ferguson stated that the agency would instead address unlawful non‑compete agreements through enforcement actions rather than formal rulemaking. The FTC has already launched an enforcement action against Gateway Services, Inc. and issued a request for information to better understand the scope and effects of non‑compete agreements. The voluntary dismissal of the appeals marks the end of the debate over the Final Rule, ensuring it will never go into effect. Employers can continue to operate under existing state laws regarding non‑compete practices, and the FTC will monitor enforcement actions and state legislation for future guidance.\nOriginal language: en\nPublish date: September 14, 2025 10:03 AM\nSource:[Mondaq Business Briefing](https://www.mondaq.com/unitedstates/employee-rights-labour-relations/1677104/trump-administration-ends-ftcs-attempt-to-ban-noncompetes)\n\n**Federal Trade Commission Ends Appeals, Shifts Focus to Noncompete Enforcement**\nThe Federal Trade Commission (FTC) has abandoned its 2024 non‑compete ban rule, after courts in Texas and Florida issued injunctions that halted the rule’s enforcement. The Texas court vacated the rule entirely, citing an overreach of FTC authority, while the Florida court issued a narrower, plaintiff‑specific injunction under the major‑questions doctrine. Following the appointment of Chair Andrew N. Ferguson, the FTC voluntarily dismissed both appeals, effectively ending the rule it had announced just over a year ago. \n\nDespite dropping the blanket ban, the FTC remains active on non‑compete enforcement. On September 4, 2025, it filed an action against Gateway Services, Inc., alleging that the company’s widespread use of one‑year non‑compete agreements violated Section 5 of the FTC Act. The proposed consent order would bar the firm from enforcing most of these agreements and impose long‑term compliance obligations, with limited exceptions for executives and business sales. \n\nThe agency’s strategy has shifted from a universal prohibition to a case‑by‑case ‘rule‑of‑reason’ analysis of the most egregious non‑compete uses. On the same day, the FTC issued a Request for Information to gather public input on the use and impact of non‑competes, with comments due by November 3, 2025. \n\nWith the federal standard shelved, state laws and court decisions will continue to govern non‑compete enforceability, creating a patchwork of statutes and judicial interpretations that vary widely across jurisdictions. Employers operating in multiple states or industries under scrutiny are advised to review their non‑compete practices with legal counsel. \n\nKey quotes: The original rule, championed by former Chair Lina Khan, argued that non‑compete clauses \"keep wages low, suppress new ideas, and rob the American economy of dynamism.\" The FTC’s new focus is to target \"the most egregious uses of noncompetes\" on a case‑by‑case basis.\nOriginal language: en\nPublish date: September 12, 2025 04:48 PM\nSource:[JD Supra](https://www.jdsupra.com/legalnews/federal-trade-commission-ends-appeals-1888797/)\n\n**Rule Abandoned, Crackdown Continues: The Federal Trade Commission's New Non-compete Strategy**\nOn September 5, 2025, the FTC withdrew its appeal in the case over its 2024 Non‑compete Clause Rule, effectively abandoning the challenge to a district court ruling that invalidated the rule. The court, led by Judge Ada E. Brown, found the FTC lacked authority to promulgate the rule, deeming it arbitrary and capricious and issuing a nationwide vacatur and injunction in August 2024. FTC Chair Andrew Ferguson and Commissioner Melissa Holyoak said the agency 'lacked authority for a sweeping rule' but would continue to police illegal non‑competes through enforcement. The 2024 rule had aimed to ban almost all post‑employment non‑compete agreements, requiring employers to rescind clauses and notify workers, with narrow exceptions. With the rule vacated, the FTC is pivoting to targeted enforcement under Section 5 of the FTC Act, focusing on cases where non‑compete clauses are coercive, exploitative, or harm competition. The agency has already filed a complaint against Gateway Services, alleging anticompetitive use of non‑competes that could affect about 1,800 employees, and proposed a consent order limiting such clauses. Future enforcement will target low‑ and middle‑wage workers, non‑compete restrictions on roles without competitively sensitive information, and market‑wide effects that suppress mobility and wages. The FTC also launched a public inquiry through its Joint Labor Task Force, inviting comments on non‑compete use, with submissions due by November 3, 2025. While the nationwide ban is gone, employers should expect continued scrutiny through complaints, consent orders, and litigation, and should review their policies to comply with federal and state laws, especially in states like California and Minnesota that have strict non‑compete bans.\nOriginal language: en\nPublish date: September 12, 2025 12:00 AM\nSource:[The National Law Review - A Free To Use Nationwide Database of Legal Publications](https://natlawreview.com/article/rule-abandoned-crackdown-continues-federal-trade-commissions-new-non-compete)\n\n**Trump's Federal Trade Commission Abandons Noncompete Ban**\nOn September 12 2025 the FTC voted 3‑1 to dismiss its appeal of a district‑court ruling that barred the agency from enforcing a nationwide ban on non‑compete agreements. The ban, announced by the FTC in April 2024 after a proposed rule in January 2023, would have invalidated nearly all existing non‑competes and prohibited new ones except in rare circumstances. The rule was supported by Commissioners Lina M. Khan, Rebecca Kelly Slaughter, and Alvaro M. Bedoya, and opposed by Andrew N. Ferguson and Melissa Holyoak. The ban never took effect because the U.S. Chamber of Commerce successfully challenged the FTC’s authority in a May 9 2024 lawsuit (Ryan LLC v. FTC), and the Northern District of Texas granted summary judgment in favor of the Chamber. The Fifth Circuit later granted a 120‑day pause on the FTC’s appeal, which was extended to September 8 2025. The FTC’s new chair, Andrew Ferguson, announced that the agency would focus on case‑by‑case enforcement rather than a broad ban, a shift that critics say will do little to protect the 30 million Americans subject to non‑compete agreements. The FTC also announced a 60‑day comment period on Regulations.gov to gather data on non‑compete prevalence. Lina M. Khan had said of the ban, 'Noncompete clauses keep wages low, suppress new ideas, and rob the American economy of dynamism, including from the more than 8,500 new startups that would be created a year once noncompetes are banned...' The article argues that the FTC’s ad‑hoc enforcement will impact fewer than 2,000 employees in a niche industry, and that the agency’s reversal is a win for corporations and a loss for workers.\nOriginal language: en\nPublish date: September 12, 2025 12:00 AM\nSource:[The National Law Review - A Free To Use Nationwide Database of Legal Publications](https://natlawreview.com/article/trumps-federal-trade-commission-abandons-noncompete-ban)\n\n**FTC Noncompete Ban Overturned: What It Means for Your Business - Law 4 Small Business (L4SB)**\nThe Federal Trade Commission (FTC) has withdrawn its appeal of a federal court ruling that blocked a proposed nationwide ban on non‑compete agreements, effectively ending the effort to invalidate most existing clauses. The FTC’s April 2024 rule, which would have prohibited nearly all non‑compete clauses, was estimated to affect about one in five American workers—roughly 30 million people—and was projected to boost worker wages by up to $300 billion annually. Business groups, including the U.S. Chamber of Commerce and Ryan LLC, sued, arguing the FTC overstepped its authority by pre‑empting state contract laws; a Texas judge agreed and issued a ruling that blocked the ban before it could take effect. In a joint statement, new FTC Chair Andrew Ferguson and Commissioner Melissa Holyoak called the rule an “extraordinary assertion of authority” that unlawfully over‑rode state laws, noting it “preempted the laws of all fifty States, and actively displaced hundreds of existing laws across forty‑six States.” With the appeal withdrawn, the Texas court’s decision stands, leaving non‑compete enforcement to a patchwork of state laws. The FTC will now focus on challenging non‑compete agreements that it deems anticompetitive under existing statutes such as the Sherman Act. Chair Ferguson acknowledged that non‑compete clauses can be abused and “severely inhibit workers’ ability to make a living.” The agency’s recent order to a large pet cremation company to stop enforcing non‑competes with nearly 1,800 employees illustrates this targeted approach. For small businesses, the reversal means they can continue to use non‑compete agreements, provided they comply with state‑specific laws, and must work closely with counsel to draft enforceable contracts. The change also restores the status quo of state‑by‑state regulation, creating complexity for employers and affecting talent mobility in regions where non‑competes are common.\nOriginal language: en\nPublish date: September 08, 2025 04:45 PM\nSource:[Law 4 Small Business](https://www.l4sb.com/blog/ftc-noncompete-ban-overturned-what-it-means-for-your-business/)\n\n**Under Trump, the Federal Trade Commission is abandoning its ban on noncompetes**\nThe Federal Trade Commission (FTC) has voted 3‑1 to dismiss the appeal of a Texas federal judge that halted its 2024 rule banning non‑compete agreements, effectively moving to vacate the ban that had been championed by former chair Lina Khan. The ban, which never took effect, was challenged by the Dallas‑based tax‑services firm Ryan LLC, which argued that the FTC had exceeded its authority. A 5th Circuit Court of Appeals ruling in September 2024 halted the ban nationwide, and the Biden administration appealed. In March 2025 the Trump administration asked the court for a 120‑day pause on the appeal, citing the change in administration and comments from new FTC chair Andrew Ferguson that the agency should reconsider the rule. The court granted a 60‑day pause in July, ending on September 8. Just before that deadline, the FTC announced it had voted 3‑1 to dismiss the appeal and take steps to vacate the rule. The dissenting vote was cast by Rebecca Kelly Slaughter, who returned to the commission after a court ruling. The FTC estimates that roughly 30 million people—about 1 in 5 American workers—are bound by non‑compete agreements, and that the rule would have prevented the creation of 8,500 new businesses and the loss of nearly $300 billion in wages annually. The FTC received 26,000 public comments on the rule, almost all supporting a nationwide ban. Andrew Ferguson, who has said non‑compete agreements can be ‘pernicious’ and that he prefers enforcement of the Sherman Act against non‑compete and no‑poach agreements, told Fox Business that his priority is to target violations rather than impose a blanket ban. Rebecca Slaughter argues that enforcement alone does not protect workers such as hair‑salon employees or fast‑food workers. Elizabeth Wilkins, former chief of staff to Khan and architect of the rule, warns that the FTC’s enforcement strategy will be insufficient, citing the agency’s limited staff of about 1,400 employees. The article also recounts the experience of Rebecca Denton, a real‑estate transaction coordinator in Colorado, who was trapped by a non‑compete when she wanted to leave her job during the pandemic surge. She ultimately quit and took lower‑paying gig work, citing the lack of a protective law until Colorado passed a limiting statute in 2022. The piece concludes that a clear, simple ban on non‑competes is the only way to truly protect workers, according to Wilkins.\nOriginal language: en\nPublish date: September 05, 2025 09:46 PM\nSource:[wlrh.org](https://www.wlrh.org/npr-news/2025-09-05/under-trump-the-federal-trade-commission-is-abandoning-its-ban-on-noncompetes)\n\n**Trump FTC Moves to Stop Defending Worker Noncompete Rule**\nThe Federal Trade Commission (FTC) announced it will no longer pursue appeals of court rulings that blocked a near‑total ban on worker non‑compete agreements, effectively ending the Biden administration’s effort to invalidate the rule. The FTC voluntarily dismissed cases in two separate appeals courts, reversing the litigation stance of its Democratic predecessor. The rule, adopted in 2024, would have barred the use of most non‑compete contracts, which affect roughly one in five U.S. workers, according to agency estimates. FTC Chairman Andrew Ferguson, a Republican at the time of the vote, dissented, arguing the regulation exceeded the FTC’s rule‑making authority. The rule was vacated by Judge Ada Brown of the U.S. District Court for the Northern District of Texas in August after a lawsuit by the U.S. Chamber of Commerce and Ryan LLC, which echoed Ferguson’s arguments. The Supreme Court’s June decision curtailed judges’ power to make such rulings under the ‘major questions’ doctrine. The FTC had appealed the decision to the Fifth Circuit and the Eleventh Circuit. Former FTC Chair Lina Khan defended the ban, noting the agency received more than 25,000 public comments supporting it and stating, 'a basic reality: robbing people of their economic liberty also robs them of all sorts of other freedoms, chilling speech, infringing on religious practice, and impeding people’s right to organize.' The FTC’s move follows a July 8 decision by the Eighth Circuit that vacated a rule requiring businesses to simplify cancellation of recurring memberships, another blow to regulatory efforts pursued during Khan’s tenure.\nOriginal language: en\nPublish date: September 05, 2025 09:22 PM\nSource:[news.bloomberglaw.com](https://news.bloomberglaw.com/white-collar-and-criminal-law/trump-ftc-moves-to-stop-defending-worker-noncompete-rule)\n\n",
    "date": "2025-09-30T01:11:43.911704",
    "summary": "All expert forecasters agree that the probability of the FTC's proposed ban on non-compete agreements for most workers being enacted in more or less its current form before 2026 is essentially zero. Across legal (Administrative Procedures Act, Chevron deference, Major Questions Doctrine), regulatory, political science, economics, and government relations perspectives, experts emphasize that federal courts have vacated the rule nationwide on statutory and major-questions grounds. The FTC has formally withdrawn all appeals, explicitly abandoned its rulemaking, and under new Trump administration-appointed leadership, has shifted to a case-by-case enforcement strategy rather than pursuing a blanket ban. No meaningful Congressional action is underway to grant the FTC explicit authority, and the historical base rate for a major overturned and administratively abandoned rule returning in the short term—especially after a change to a hostile administration—is nearly zero. All Yes scenarios are deemed highly improbable, involving extraordinary, rapid, and unlikely legal or political shifts. The consensus reasoning is that, given the legal, procedural, and political obstacles, there is effectively no viable path to enactment before the 2026 deadline, with all but one expert assigning a probability of 0 (and the remainder at 1, equivalent to nil in this context).",
    "forecasters": [
        "RegulatoryAffairs (FederalRulemakingProcess)",
        "LaborLawPractice (EmploymentAgreementCompliance)",
        "USGovernmentRelations (LegislativeAndStakeholderEngagement)",
        "Law (AdministrativeProceduresActDoctrine)",
        "Law (ChevronDeference)",
        "Law (MajorQuestionsDoctrine)",
        "PoliticalScience (SeparationOfPowersTheory)",
        "PoliticalScience (PolicyProcessModel)",
        "Economics (LaborMarketRegulationTheory)"
    ]
}