{
    "deliberation_results": {
        "Technology Market Analysis (Gartner Hype Cycle)": {
            "time_to_resolution": "Approximately 3 months until December 31, 2025.",
            "perspective_relevance": "As a technology market analyst with expertise in the Gartner Hype Cycle, I assess the adoption trajectories of emerging platforms, considering inflection points, user growth rates, and ecosystem factors. My perspective allows for nuanced evaluation of whether Bluesky can transcend early adopter interest and reach mass-market appeal within a short timeframe, accounting for both historical parallels and current competitive dynamics.",
            "status_quo": "Bluesky currently has about 38 million registered users as of late September 2025, with growth having slowed considerably after an initial post-2024 US election surge. If nothing changes substantially, it is unlikely to reach 100 million users by year-end.",
            "perspective_derived_factors": [
                {
                    "factor": "Adoption Trajectory Post-Inflection",
                    "effect": "Decreases probability. Bluesky's growth rate has slowed sharply after an initial surge. The Gartner Hype Cycle frequently sees a 'Trough of Disillusionment' after early hype, making rapid further growth less likely barring a new catalyst."
                },
                {
                    "factor": "Competitive Landscape",
                    "effect": "Decreases probability. Competing platforms (Threads, X, Meta properties) are absorbing most defectors from X. Bluesky, while growing, is orders of magnitude smaller and lacks the resources and network effects of Meta and X."
                },
                {
                    "factor": "Platform Differentiation and Value Proposition",
                    "effect": "Slightly increases probability. Bluesky's decentralized model and stronger moderation appeal to certain communities, but these features have not proven sufficient to drive mass adoption historically."
                },
                {
                    "factor": "Recent Moderation Controversies",
                    "effect": "Decreases probability. Heightened moderation and controversy risk alienating both new and existing users, stalling viral growth."
                },
                {
                    "factor": "Technical and Funding Constraints",
                    "effect": "Decreases probability. Bluesky's limited funding ($15 million Series A) constrains marketing, infrastructure, and feature development compared to larger rivals."
                },
                {
                    "factor": "Sociopolitical Catalysts",
                    "effect": "Neutral to slight increase. Major events (e.g., further controversies at X, new policy shifts, or world events) could spark another wave of migration, but no clear catalyst is evident or scheduled before year-end."
                },
                {
                    "factor": "Base Rate of Social Platform Hypergrowth",
                    "effect": "Decreases probability. Historically, very few social platforms have added 60+ million users in three months unless propelled by extraordinary viral network effects or integration with a large incumbent (e.g., Threads with Meta)."
                }
            ],
            "no_scenario": "Bluesky's user growth plateaus as the exodus from X slows and the platform struggles to appeal beyond its tech-savvy and progressive core base. Without a major new catalyst, growth continues at a modest pace, ending 2025 with 40–50 million users—well short of the 100 million target.",
            "yes_scenario": "A major event—such as a catastrophic failure or highly unpopular policy at X, or a viral trend that uniquely favors Bluesky—triggers a second, even larger migration. Bluesky rapidly scales infrastructure, addresses moderation challenges, and leverages endorsements from high-profile figures, resulting in an unprecedented surge to 100 million users by December 31, 2025.",
            "final_reasoning": "The base rate for social platforms achieving this level of hypergrowth from a 38 million user base, in the absence of deep-pocketed corporate backing or a viral surge triggered by external events, is extremely low. Bluesky's current momentum has slowed; while it benefited from a migration wave post-2024 election and X controversy, that surge appears to have peaked. The platform faces stiff competition from Meta's Threads and Instagram, which have far more resources and network effects. Technical, moderation, and funding challenges further hinder Bluesky's ability to scale sustainably and rapidly. Unless an unexpected, major catalyst occurs imminently, Bluesky is likely to end 2025 well below the 100 million user mark. My assessment, informed by technology adoption curves and competitive market analysis, is that the probability is quite low.",
            "final_probability": 8
        },
        "Technology Market Analysis (S Curve Adoption Model)": {
            "time_to_resolution": "3 months and 5 days (until January 1, 2026)",
            "perspective_relevance": "As an expert in Technology Market Analysis using the S Curve Adoption Model, I specialize in mapping the diffusion trajectory of new technologies and platforms, identifying inflection points, and quantifying the likelihood of exponential versus plateauing growth. This model is particularly apt for forecasting user base expansion in social media, where network effects, market saturation, and competitive dynamics are crucial.",
            "status_quo": "Bluesky has over 38 million users as of late September 2025. Growth was explosive following the US 2024 election, but has since slowed. The platform has introduced new features and strengthened moderation, but there are signs of deceleration and potential user churn. If nothing changes, Bluesky will not reach 100 million users by the end of 2025.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent User Growth Rate",
                    "effect": "Decreases probability. After a spike post-2024 election, growth has slowed to a crawl. The S curve's rapid adoption phase appears to have ended; we're entering early maturity or plateau."
                },
                {
                    "factor": "Market Saturation and Competing Platforms",
                    "effect": "Decreases probability. Meta’s Threads and Instagram are capturing much of the exodus from X (formerly Twitter). Bluesky is appealing but remains niche, especially as moderation controversies and ideological skew limit broader appeal."
                },
                {
                    "factor": "Network Effects and Switching Costs",
                    "effect": "Decreases probability. Social media S curves are strongly driven by network effects. Bluesky’s technical users and open protocol are attractive to early adopters, but mass-market users require a critical mass of their friends, celebrities, and brands, which Bluesky has not achieved."
                },
                {
                    "factor": "Media Attention and Outages",
                    "effect": "Decreases probability. Negative press around moderation (calls for violence, expulsions) and technical outages can inhibit viral growth, especially when user trust and platform stability are in question."
                },
                {
                    "factor": "Potential for Viral Events or External Shocks",
                    "effect": "Slightly increases probability. While unlikely, another high-profile controversy at X or a sudden celebrity migration could provide a short-term boost. However, recent evidence suggests such effects are transient."
                },
                {
                    "factor": "Bluesky’s European Outreach and New Features",
                    "effect": "Neutral to slightly positive. Efforts to expand in Europe and roll out new features could drive incremental growth but are unlikely to generate the tens of millions of users needed in three months."
                }
            ],
            "no_scenario": "Bluesky’s growth continues to slow, stalling at 40-50 million users by year-end. Network effects do not reach a tipping point, and most mainstream users stick with Threads, Instagram, or X. Technical issues and moderation controversies limit appeal beyond a progressive/tech-savvy niche.",
            "yes_scenario": "A dramatic event causes a mass exodus from X or Threads (e.g., scandal, major outage, or policy change), leading to a viral surge of new Bluesky users. High-profile figures migrate en masse, and Bluesky’s infrastructure and onboarding can absorb tens of millions of users in a short burst, pushing user count past 100 million.",
            "final_reasoning": "Base rates for social platforms show that even with favorable press and initial viral growth, it is rare for decentralized or alternative networks to sustain exponential growth long enough to challenge incumbents in less than a year. The S Curve for Bluesky shows a sharp inflection after the 2024 election, but all available metrics and news now indicate a flattening. Growth from 6M to 38M users in ~9 months is impressive, but to reach 100M in the next 3 months would require a second, even larger viral surge, which is not supported by recent news or historical adoption curves. Competing platforms (Threads, Instagram, X) remain stronger, and Bluesky’s ideological and technical positioning limits its mainstream appeal. The risk of another exodus event still exists but is low. My probability reflects a heavy status quo bias, the slow pace of real-world S curve adoption in late-stage growth, and the absence of imminent catalysts.",
            "final_probability": 8
        },
        "Product Management (Product Market Fit Assessment)": {
            "time_to_resolution": "Approximately 3 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Product Market Fit Assessment, I focus on the intersection of user growth trajectories, retention, feature adoption, competitive landscape, and the network effects required for social platforms to reach mass scale. My expertise brings a data-driven, growth funnel, and market-fit-centric lens to evaluate whether Bluesky can triple its user base in the remaining time.",
            "status_quo": "Bluesky currently has between 32 and 38 million users as of late September 2025. Growth has slowed markedly after explosive post-2024-election and X-user migration surges, and the latest news suggests stabilization, not continued exponential growth.",
            "perspective_derived_factors": [
                {
                    "factor": "Growth Rate Deceleration",
                    "effect": "Decreases probability. After surging from 10M to 38M in early/mid-2025, growth has now slowed. Exponential growth phases rarely persist, especially in social networks after an initial exodus event."
                },
                {
                    "factor": "Market Saturation & Network Effects",
                    "effect": "Decreases probability. The exodus from X provided a one-time boost, but Bluesky now faces the steeper challenge of converting mainstream users. Network effects seem weaker than in Meta’s ecosystem, and the product’s political/ideological tilt may hinder universal appeal."
                },
                {
                    "factor": "Competitive Landscape",
                    "effect": "Decreases probability. Threads is growing rapidly, with over 100M users, and Meta’s immense resources, cross-promotion, and product integration pose formidable competition. X, despite troubles, still has a larger user base. Bluesky is not the primary alternative for most users."
                },
                {
                    "factor": "Product Market Fit & Retention",
                    "effect": "Neutral to mildly negative. Bluesky’s core value proposition—decentralization, open protocol, customizable feeds—is attractive to a tech-savvy or ideological niche, but less so to mainstream audiences. Retention is challenged by moderation controversies and limited mass-market features."
                },
                {
                    "factor": "Recent Controversies & Moderation",
                    "effect": "Decreases probability. High-profile moderation issues and platform polarization could suppress adoption among both mainstream and right-leaning users, limiting viral growth."
                },
                {
                    "factor": "Potential for a New External Shock",
                    "effect": "Slightly increases probability. Another crisis at X or a major social media event could drive a new wave of users, but recent news suggests the biggest migration waves are past."
                },
                {
                    "factor": "Credibility and Data Source Stability",
                    "effect": "Neutral. The question will be voided if the source stops reporting, but for now the user count is credible and tracked."
                }
            ],
            "no_scenario": "Growth continues at the now-moderate rate of a few million users per month, without another major exodus event or viral catalyst. By January 1, 2026, Bluesky reaches 45-55 million users—short of the 100 million target. User churn and limited mainstream adoption prevent breakout growth.",
            "yes_scenario": "A major disruption at X or aggressive acquisition/partnerships by Bluesky sparks renewed migration. Bluesky launches a must-have feature or viral campaign, or secures a celebrity/institutional endorsement, leading to a doubling or tripling of users in a short span. Alternatively, a global regulatory shift favors decentralized platforms, incentivizing rapid signups.",
            "final_reasoning": "Bluesky’s current user base is roughly one-third of the 100M target, with about 3 months remaining. The base rate for social network 'tripling' at this late stage is extremely low unless driven by a unique, exogenous shock (e.g., X’s collapse, Meta scandal). The product’s value proposition is differentiated but not mass-market; growth drivers (X migration, election) have largely played out. Competition from Threads and Meta’s ecosystem further suppresses explosive growth potential. There is no evidence of a sustained, viral growth mechanism or mass feature launch on the immediate horizon. Given the product management lens, Bluesky is in the early adopter/early majority phase, not yet demonstrating the classic retention or viral loop needed to hit 100M at this pace. Barring a black swan event, the default outcome is a continued, but much slower, growth curve.",
            "final_probability": 8
        },
        "Sociology (Diffusion of Innovations)": {
            "time_to_resolution": "Approximately 3 months (until December 31, 2025)",
            "perspective_relevance": "As an expert in the sociology of diffusion of innovations, my perspective is especially relevant here because Bluesky's trajectory towards 100 million users depends on the mechanics of technology adoption, contagion effects, network externalities, and the competitive landscape among platforms. Understanding adoption curves, the role of early adopters, critical mass, and the influence of platform features and moderation policies is vital to forecasting whether Bluesky will achieve such rapid scale within a short time frame.",
            "status_quo": "Bluesky has grown from around 6 million users in mid-2025 to over 38 million by September 2025, but recent reports suggest growth has slowed considerably after the initial 'flight' from X (formerly Twitter). The current trajectory, absent any significant new catalysts, suggests it will not reach 100 million users by the end of 2025.",
            "perspective_derived_factors": [
                {
                    "factor": "Adoption Curve and Saturation",
                    "effect": "Decreases probability. Bluesky appears to have reached or is nearing the limit of its current innovation/early adopter base. The 'exodus' from X provided a unique, non-recurring burst of growth. Without a new wave of mainstream adoption, growth rates typically slow sharply after this phase."
                },
                {
                    "factor": "Competition and Substitution Effects",
                    "effect": "Decreases probability. Threads (Meta) and even X, despite its troubles, remain much larger and are direct substitutes for most users. Threads, in particular, is aggressively growing and likely capturing much of the anti-X/pro-alternative sentiment that would otherwise flow to Bluesky."
                },
                {
                    "factor": "Platform Differentiation and Network Effects",
                    "effect": "Increases probability slightly. Bluesky's decentralization pitch attracts a niche, and network effects could drive a second wave if a major event (e.g., new controversy at X or Threads) triggers a new migration."
                },
                {
                    "factor": "Moderation Policy and Platform Controversies",
                    "effect": "Decreases probability. Recent news of moderation struggles, violent posts, and user expulsion controversies may deter mainstream or institutional adoption, slowing growth. Overly strict policies could also alienate some users."
                },
                {
                    "factor": "External Catalysts (e.g., X collapse, regulatory action, celebrity migration)",
                    "effect": "Increases probability, but only if a major, unpredictable event occurs. Historically, such surges are rare and cannot be relied upon for base rate forecasting."
                },
                {
                    "factor": "Funding and Technical Stability",
                    "effect": "Neutral to slightly negative. Bluesky remains relatively underfunded compared to Meta, and there have been some technical issues (outages). This limits its ability to market aggressively or scale infrastructure quickly."
                }
            ],
            "no_scenario": "Growth continues to slow as the initial exodus from X plateaus and Threads absorbs most additional disaffected users. Bluesky maintains a strong, but niche, base among techies and some progressives, but without a new catalyst, user growth levels off well below 100 million. Moderation controversies and outages further dissuade mass-market adoption. By January 2026, Bluesky's user count is perhaps in the 40–50 million range.",
            "yes_scenario": "A high-profile scandal or failure at X or Threads, or a viral campaign by celebrities or institutions, triggers a second, even larger migration wave to Bluesky. The platform quickly onboards new users, leverages network effects, and perhaps benefits from regulatory or media attention that drives curiosity and mass adoption. Bluesky hits 100 million users just before the 2025 year-end deadline.",
            "final_reasoning": "The base rate for new social platforms achieving 100 million users in under two years is extremely low except for those with extraordinary resources (e.g., Meta's Threads) or unique network effects. Bluesky's growth was driven by a singular migration event post-2024 US election and Musk's policy shifts at X, which now appears to have subsided ('the exodus is over'). The current user count (~38 million) is far short of the target, and growth is slowing. There are no clear signs of an imminent new catalyst, and competitive platforms (Threads) are better resourced and more attractive to mainstream users. Moderation controversies and technical issues further hamper Bluesky's mass appeal. While another shock event could trigger a spike, this is not the status quo and is not likely based on current trends. Thus, the probability that Bluesky will reach 100 million users by end of 2025 is low, though not zero.",
            "final_probability": 10
        },
        "Sociology (Network Effects Theory)": {
            "time_to_resolution": "Approximately 3 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Sociology (Network Effects Theory), I focus on how user growth in social platforms accelerates or stalls due to network externalities, lock-in, switching costs, critical mass, and path dependence. Network effects are crucial for social media: rapid user growth can create self-reinforcing adoption, but friction, fragmentation, or negative externalities (e.g., moderation controversies) can also slow or reverse growth. I also consider how competing platforms and cultural/technological shifts affect these dynamics.",
            "status_quo": "Bluesky has grown rapidly, currently reporting about 38 million users (as of late September 2025). Growth has slowed since the initial surge after X/Twitter controversies and the 2024 US election. It now faces a plateau and increased competition from Meta’s Threads and X, with most recent reports indicating stabilization rather than continued exponential growth.",
            "perspective_derived_factors": [
                {
                    "factor": "Network Effects and Critical Mass",
                    "effect": "Increases probability. If Bluesky can sustain strong network effects—users inviting others, high engagement, visible public presence—growth can accelerate nonlinearly, potentially pushing it to 100 million. However, network effects can plateau if early adopters are not followed by mainstream users."
                },
                {
                    "factor": "Negative Network Effects (Fragmentation, Moderation Controversies)",
                    "effect": "Decreases probability. Intense moderation debates, perceived ideological monoculture, or failure to scale governance can make the platform less attractive, especially as it grows beyond core early adopters, slowing or reversing momentum."
                },
                {
                    "factor": "Competing Platforms' Response",
                    "effect": "Decreases probability. Meta’s Threads and established platforms (e.g., Instagram, X) are aggressively courting users with similar features, massive marketing, and resource advantages. If they successfully capture Bluesky’s potential user base, Bluesky’s growth could stall."
                },
                {
                    "factor": "Base Rates for Social Platform Explosive Growth",
                    "effect": "Decreases probability. Historically, few social networks have grown from ~30 million to 100 million users in less than a year unless driven by unique viral features or massive external events. The initial Bluesky surge was event-driven (X controversies, US election), but those drivers appear to be waning."
                },
                {
                    "factor": "Switching Costs and Decentralization Narrative",
                    "effect": "Slightly increases probability. Bluesky's open, decentralized approach may attract a distinct user segment, but switching costs (rebuilding networks, learning new features) and fragmentation among AT Protocol apps may limit the effect."
                },
                {
                    "factor": "Recent User Growth Trajectory and Plateau",
                    "effect": "Strongly decreases probability. The data shows a deceleration after the post-election surge, with stabilization and even slight declines in key user activity metrics. This suggests the main wave of migration has ended, making a 3x user surge in three months unlikely."
                }
            ],
            "no_scenario": "Bluesky’s user growth continues to plateau as X stabilizes, and Threads absorbs most disaffected users due to Meta’s marketing, network, and technical resources. Moderation controversies increase, deterring mainstream adoption. Growth slows to a trickle and Bluesky ends 2025 with well under 100 million users.",
            "yes_scenario": "A new controversy or technical failure at X or Threads drives another mass exodus, or Bluesky launches a viral feature or integration that catalyzes another adoption surge. Major influencers migrate, creating a network cascade, and Bluesky surpasses 100 million users by year’s end.",
            "final_reasoning": "The base rate for social networks tripling their user base from ~38 million to 100 million in three months is extremely low, particularly after the event-driven surge has faded and user growth is plateauing. Network effects can create nonlinear growth, but signs point to deceleration, not acceleration, and Bluesky faces strong headwinds from moderation controversies, ideological monoculture perceptions, and aggressive competition from Meta’s Threads. While a high-impact exogenous shock (like a catastrophic X/Threads event) could still catalyze growth, this is an outlier scenario. The most likely outcome, given current data and network effects theory, is that Bluesky will not reach 100 million users before the end of 2025.",
            "final_probability": 8
        },
        "Economics (Two Sided Market Theory)": {
            "time_to_resolution": "About 3 months (until December 31, 2025)",
            "perspective_relevance": "As an expert in two-sided market theory, I focus on how platforms grow by balancing and attracting both sides of their markets (users and developers/content providers), network effects, switching costs, and competitive dynamics. Social media platforms like Bluesky depend on positive feedback loops for user growth, and the ability to sustain these loops against established incumbents and shifting user preferences is central to my analysis.",
            "status_quo": "Bluesky has surpassed 38 million users after a rapid surge post-2024 US election, but growth has slowed significantly since early/mid 2025. The platform has not shown evidence of renewed surges or viral growth in recent months.",
            "perspective_derived_factors": [
                {
                    "factor": "Network effects and two-sided market tipping",
                    "effect": "Marginally increases probability. If Bluesky can reignite strong network effects (e.g., via a celebrity migration, a unique viral feature, or a major X meltdown), it could tip into a new growth phase. However, this is not currently evident."
                },
                {
                    "factor": "User migration from X (Twitter) and Threads",
                    "effect": "Slightly increases probability. Past surges were fueled by political events and dissatisfaction with X, but the 'exodus effect' seems to have plateaued, and the news reports suggest this migration has largely run its course."
                },
                {
                    "factor": "Competitive landscape (Meta’s Threads, X, Instagram)",
                    "effect": "Decreases probability. Meta’s platforms (especially Threads) have absorbed much of the disaffected X user base, and continue to grow rapidly. The market for text-based social platforms is crowded; Bluesky is not dominating mindshare or growth rates."
                },
                {
                    "factor": "Decentralization and value proposition",
                    "effect": "Marginally increases probability. Bluesky's decentralized, customizable approach may appeal to technical communities and privacy-sensitive users, but this is a niche. There is little evidence that mainstream users value or understand this enough to drive mass adoption."
                },
                {
                    "factor": "Recent moderation policy controversies and platform polarization",
                    "effect": "Decreases probability. Reports of one-sided political culture and moderation controversies may limit Bluesky's appeal to broad audiences, capping growth and increasing churn."
                },
                {
                    "factor": "Base rates for social network hyper-growth",
                    "effect": "Strongly decreases probability. Historically, only a handful of social networks have grown from tens of millions to 100 million+ users within a year absent extraordinary external catalysts (e.g., TikTok, Instagram, Threads). Bluesky’s growth curve has slowed, not accelerated."
                },
                {
                    "factor": "Time remaining and required growth rate",
                    "effect": "Decreases probability. With approximately 3 months left, Bluesky would need to more than double its user base at a pace (~62 million net new users) that is not supported by recent trends."
                }
            ],
            "no_scenario": "Bluesky continues to grow slowly or plateaus, adding a few million users by year-end, but fails to reach 100 million. The lack of a major external shock (such as a catastrophic X failure or mass celebrity migration to Bluesky) means user growth remains organic and modest. Incumbent platforms outcompete Bluesky for mainstream users, and the platform remains a niche or secondary network.",
            "yes_scenario": "An unexpected, dramatic event (e.g., X suffers a major data breach, is shut down by regulators, or is abandoned by celebrities en masse) triggers a viral migration to Bluesky. Bluesky’s decentralized features receive sudden, widespread attention, and the platform is able to scale infrastructure and moderation rapidly. Alternatively, a high-visibility partnership or endorsement creates a new viral growth loop, propelling user numbers past 100 million within weeks.",
            "final_reasoning": "While Bluesky experienced impressive initial growth, the platform’s user base appears to have plateaued around 38 million, and recent news does not indicate a renewed surge in adoption. Two-sided market theory suggests that achieving critical mass is possible if both user and content sides are growing rapidly, but this tipping point is not evident here. The competitive landscape is fierce, with Meta’s Threads and Instagram continuing robust growth, and X, despite troubles, still holding a larger base. The absence of a major, fresh catalyst—combined with slowing growth, niche appeal, and some negative press about moderation and polarization—means Bluesky faces significant headwinds. The base rate for a platform more than doubling its user base in three months, from this stage of adoption, is extremely low. Therefore, barring an unpredictable, dramatic external shock, a 'No' outcome is much more likely.",
            "final_probability": 7
        },
        "Economics (Path Dependence)": {
            "time_to_resolution": "Approximately 3 months until January 1, 2026.",
            "perspective_relevance": "As an expert in Economics (Path Dependence), I focus on how early platform adoption, historical switching costs, network effects, and entrenched user behaviors shape the competitive landscape of social networks. Path dependence theory suggests that once a technology or platform achieves a certain scale and social lock-in, its trajectory is heavily influenced by past events and user choices, making rapid changes in user base growth challenging absent major disruptions.",
            "status_quo": "Bluesky currently has about 38 million users, with growth having slowed since its rapid post-2024 US election surge. The exodus from X (Twitter) that previously fueled Bluesky's growth appears to be stabilizing, with no new major migration events currently on the horizon.",
            "perspective_derived_factors": [
                {
                    "factor": "Network Effects and Path Dependence",
                    "effect": "Decreases probability. Platforms with established, broad user bases like Meta's apps (Instagram, WhatsApp) benefit from strong network effects that reinforce their dominance. Bluesky, despite strong early growth, faces the inertia of users' established social graphs and content habits elsewhere."
                },
                {
                    "factor": "Migration Events / Exogenous Shocks",
                    "effect": "Could increase probability if a new shock (policy change, scandal, or technical failure at X or Threads) catalyzes another mass migration. Absent such a shock, probability remains low."
                },
                {
                    "factor": "Product Differentiation and Decentralization",
                    "effect": "Slightly increases probability. Bluesky's open-source, decentralized model and unique moderation policies appeal to a niche, but have not yet demonstrated mass-market pull or retention comparable to mainstream platforms."
                },
                {
                    "factor": "Moderation Controversies and Community Management",
                    "effect": "Decreases probability. Recent moderation controversies, including handling of violent or politically charged content, risk alienating both new users and existing ones, especially if the platform acquires a reputation for being ideologically one-sided or unsafe."
                },
                {
                    "factor": "Competition from Threads and Meta",
                    "effect": "Decreases probability. Threads and Meta’s family of apps continue to scale rapidly, drawing users disaffected by X, who might otherwise have joined Bluesky. Meta’s resources and cross-promotion capabilities are formidable."
                },
                {
                    "factor": "Base Rate of Social Networks Reaching 100M Users Quickly",
                    "effect": "Decreases probability. Historically, only platforms with either massive parent company support (e.g., Threads, Instagram) or truly viral utility have reached 100M users within a year of hitting ~30M. Bluesky’s current growth curve does not match those rare breakouts."
                }
            ],
            "no_scenario": "Bluesky’s user growth continues to plateau as the post-X exodus fades, no new migration events occur, and the platform struggles to break out of its current niche. Competition from Threads and Meta draws away potential users, while moderation controversies and technical hiccups (such as partial outages) limit appeal. By end of 2025, Bluesky remains below 50 million users.",
            "yes_scenario": "A major exogenous event—such as X collapsing, a major scandal or mass deplatforming on Threads, or a global policy or privacy crisis—triggers a new wave of migration to decentralized platforms. Bluesky capitalizes with rapid feature development, effective onboarding, and positive media coverage, causing user numbers to triple in a matter of months, breaking 100M before January 2026.",
            "final_reasoning": "Bluesky’s growth narrative is classic for path-dependent tech: an initial surge fueled by a migration event, followed by plateau as network effects and switching costs reassert themselves. The absence of a new migration shock, combined with mounting competition from Meta and stabilization of Bluesky’s daily activity, makes a further near-tripling of its user base by year-end highly improbable. The base rate of platforms making this leap without a major corporate backer or viral breakthrough is extremely low. While a black-swan event could change the trajectory, currently available evidence, user stats, and historical precedents strongly favor a No outcome.",
            "final_probability": 7
        },
        "Communication Studies (Uses and Gratifications Theory)": {
            "time_to_resolution": "Just over 3 months (question resolves January 1, 2026; today is September 26, 2025)",
            "perspective_relevance": "As an expert in Communication Studies with a focus on Uses and Gratifications Theory, I analyze how users select, adopt, and remain engaged with media platforms to satisfy specific needs (e.g., information, social connection, entertainment, self-expression). This lens is crucial for understanding not just raw growth numbers, but the deeper motivations that drive or impede migration, retention, and viral growth—especially under competitive, shifting conditions in the social media ecosystem.",
            "status_quo": "Bluesky has recently surged from roughly 10 million to nearly 38 million users following the 2024 US election and policy shifts at X, but growth is now slowing. As of late September 2025, Bluesky stands at 38 million users. To reach 100 million by January 1, 2026, the platform would need to nearly triple its user base in a little over three months, a pace far beyond recent trends.",
            "perspective_derived_factors": [
                {
                    "factor": "Post-X Exodus Saturation",
                    "effect": "Decreases probability. The initial rush of users fleeing X (Twitter) post-Musk/Trump appears to have subsided. Growth is slowing despite outreach efforts, suggesting the 'flight effect' is mostly spent."
                },
                {
                    "factor": "Competing Platforms' Network Effects",
                    "effect": "Decreases probability. Threads, X, and especially Meta's platforms (Instagram, Facebook, WhatsApp) have massive entrenched user bases and continue to innovate and monetize at scale, making it hard for Bluesky to capture a broad, mainstream audience quickly."
                },
                {
                    "factor": "User Motivations and Platform Differentiation",
                    "effect": "Mixed, but mostly decreases probability. While Bluesky's decentralization and moderation policies attract a niche seeking authenticity and safety, this appeal is limited outside progressive and technical circles. Uses and Gratifications Theory suggests the majority of users prioritize network size, convenience, and content diversity, all areas where Bluesky lags."
                },
                {
                    "factor": "Retention and Engagement vs. Signups",
                    "effect": "Decreases probability. Growth in accounts does not guarantee active users. Reports suggest that while scholarly and technical engagement is high, broader mainstream interest is not, and churn may rise as migration-driven signups plateau."
                },
                {
                    "factor": "Recent Negative Publicity and Moderation Challenges",
                    "effect": "Decreases probability. Controversies around moderation, politicization, and platform outages can deter new users and damage public perception, further slowing organic adoption."
                },
                {
                    "factor": "International Expansion and Outreach",
                    "effect": "Slightly increases probability. Bluesky's recent European outreach could open new markets, but the impact so far appears modest and unlikely to drive tens of millions of new signups in the short term."
                }
            ],
            "no_scenario": "Bluesky's user growth continues to slow as the initial anti-X migration subsides. Outreach campaigns yield incremental, not exponential, gains. Competition from Threads and Meta's family of apps remains fierce, and most users find little unique value in switching. Moderation controversies and technical hiccups further limit momentum. By January 1, 2026, Bluesky has perhaps 45-50 million users—well short of 100 million.",
            "yes_scenario": "A major, sudden crisis at X or another dominant platform (e.g., catastrophic data breach, regulatory ban, or highly publicized mass exodus event) triggers another wave of migration, or Bluesky launches a viral, must-have feature or forms a high-profile partnership that dramatically boosts mainstream awareness and adoption. Influential celebrities or governments endorse Bluesky, creating network effects that push user numbers over 100 million by year's end.",
            "final_reasoning": "Base rates for new social networks reaching 100 million users in under a year are exceedingly low; even with strong recent growth, Bluesky's pace is decelerating. Uses and Gratifications Theory emphasizes that while disaffected users may sample new platforms, long-term, large-scale adoption requires persistent satisfaction of diverse, mainstream needs and robust network effects—areas where Bluesky is currently disadvantaged compared to Meta and even Threads. The migration wave from X has mostly played out, and Bluesky's remaining growth is likely to be incremental absent a major external shock. Moderation controversies and technical outages further dampen momentum. Given these factors, the scenario in which Bluesky exceeds 100 million users before 2026 is possible only with an unforeseen, dramatic catalyst. The status quo and base rates strongly favor a No outcome.",
            "final_probability": 5
        }
    },
    "deliberation_probability": [
        8,
        8,
        8,
        10,
        8,
        7,
        7,
        5
    ],
    "deliberation_mean_probability": 7.625,
    "deliberation_sd": 1.407885953173359,
    "deliberation_probability_result": 8,
    "group_results": {
        "technologyMarketAnalysisGartnerHypeCycle": {
            "forecaster_to_engage": "Communication Studies (Uses and Gratifications Theory)",
            "response_type": "defense",
            "response": "The Communication Studies (Uses and Gratifications Theory) forecast insightfully foregrounds a key barrier for Bluesky: the need for broad, sustained satisfaction of diverse mainstream user needs, not just capturing a protest-driven migration. This lens highlights a crucial distinction between transient surges and durable, mass-market adoption. While some other analyses focus more on technical or competitive landscape factors, this perspective correctly notes that large social networks only achieve explosive growth when they deliver persistent, differentiated utility to a heterogeneous user base. Bluesky's current user composition, moderation controversies, and lack of a clear, compelling mainstream value proposition make this unlikely. The relatively lower probability offered (5%) is also justified, as it reflects an even stronger commitment to the status quo bias and the rarity of such events, sharpening the argument that absent a black swan, the odds are extremely slim."
        },
        "technologyMarketAnalysisSCurveAdoptionModel": {
            "forecaster_to_engage": "Economics (Two Sided Market Theory)",
            "response_type": "defense",
            "response": "The Economics (Two Sided Market Theory) forecast offers a strong and nuanced justification for why Bluesky is unlikely to reach 100 million users in the remaining time frame. The analysis correctly emphasizes the importance of simultaneous rapid growth on both sides of the market—users and content creators—for explosive network expansion, which is not in evidence for Bluesky at this stage. It also recognizes that the competitive environment is unusually fierce, with Meta's platforms dominating and X, despite its issues, retaining a significant user base. This perspective aligns well with the S Curve Adoption Model, as both approaches stress the difficulty of reigniting exponential growth after a plateau without a major new catalyst. The forecast's explicit reference to the base rate for this level of late-stage platform growth, absent a dramatic shock, is well-grounded and realistically skeptical."
        },
        "productManagementProductMarketFitAssessment": {
            "forecaster_to_engage": "Sociology (Diffusion of Innovations)",
            "response_type": "critique",
            "response": "While the Sociology (Diffusion of Innovations) forecast appropriately emphasizes the rarity of rapid mass adoption for new social platforms and the exhaustion of the initial migration wave, it underweights product-level and competitive dynamics that are crucial for mass-market fit. The analysis frames the main barrier as the absence of a new catalyst and the exhaustion of the early adopter phase, which is accurate, but it could benefit from a more granular examination of Bluesky's product-market fit and retention mechanics, especially in comparison to successful breakout platforms like Threads. Specifically, it doesn't address how Bluesky's features, onboarding, network effects, and retention strategies might be under-optimized for mainstream appeal, or whether there is a viable path for the platform to engineer its own viral loop or differentiator. In product management terms, these are critical levers for late-stage growth, and their absence makes the 'No' outcome even more robust. The forecast would be stronger if it explicitly acknowledged these product factors rather than focusing primarily on the innovation adoption lifecycle."
        },
        "sociologyDiffusionOfInnovations": {
            "forecaster_to_engage": "Sociology (Network Effects Theory)",
            "response_type": "critique",
            "response": "The Network Effects Theory forecast correctly notes that nonlinear growth is possible but currently unsupported by Bluesky's decelerating trajectory. However, it could be strengthened by integrating the nuanced sociological insight that not all network effects are equal—especially in a polarized or ideologically clustered environment. Bluesky's network may be dense but insular, limiting its ability to achieve the kind of heterogeneous, cross-community network effects that create runaway adoption. Additionally, the forecast could have engaged more with the diffusion literature's emphasis on the importance of 'bridges'—influential users or events that connect disparate social groups—whose absence currently hampers Bluesky. By focusing mainly on quantitative growth patterns and competitive headwinds, this perspective risks underappreciating the qualitative sociological barriers to true mainstreaming, such as cultural fit, identity signaling, and social capital formation across broader publics."
        },
        "sociologyNetworkEffectsTheory": {
            "forecaster_to_engage": "Technology Market Analysis (S Curve Adoption Model)",
            "response_type": "defense",
            "response": "The S Curve Adoption Model forecast persuasively situates Bluesky's user growth within the well-established dynamics of technology adoption. It highlights the sharp inflection point following the 2024 election and the subsequent deceleration, which aligns with classic S curve theory—rapid adoption by early adopters followed by a plateau as the market saturates and the mainstream remains unconvinced. This matches the observed Bluesky data, where the current user surge was event-driven and appears unsustainable without a new, major catalyst. The forecast further strengthens its case by noting that, historically, late-stage exponential growth is exceedingly rare unless a platform can introduce a viral innovation or exploit a competitor's collapse—neither of which is evident. Thus, the S Curve Adoption Model provides a robust, empirically grounded rationale for assigning a very low probability to Bluesky reaching 100 million users by year-end."
        },
        "economicsTwoSidedMarketTheory": {
            "forecaster_to_engage": "Economics (Path Dependence)",
            "response_type": "defense",
            "response": "The Path Dependence analysis accurately highlights how Bluesky's growth trajectory is shaped by early migration shocks and the subsequent reassertion of network effects and switching costs. This perspective is particularly relevant from a two-sided market standpoint: once the initial exodus from X stabilized, Bluesky failed to develop the reinforcing loops needed to break incumbents' hold on users and content. The point that platforms without deep corporate backing or a viral breakthrough rarely escape this plateau is well-supported by two-sided market theory and historical cases. The analysis also correctly notes that, absent a major external disruption, incremental improvements or features are unlikely to produce the nonlinear user growth Bluesky needs. This reinforces the robustness of the 'No' forecast and complements the two-sided market argument by underscoring how initial conditions and missed tipping points constrain future outcomes."
        },
        "economicsPathDependence": {
            "forecaster_to_engage": "Technology Market Analysis (Gartner Hype Cycle)",
            "response_type": "defense",
            "response": "The Gartner Hype Cycle analysis robustly captures the cyclical and expectation-driven dynamics of new technology adoption, which is highly relevant to Bluesky's journey. It correctly emphasizes that, after the initial 'peak of inflated expectations' driven by the migration from X and political events, Bluesky is now experiencing the 'trough of disillusionment' as growth slows and challenges (technical, moderation, competition) become more apparent. From a path dependence perspective, the forecast's skepticism is warranted: history shows that most platforms do not emerge from this trough to achieve mass adoption unless they are able to leverage extraordinary resources or a new viral catalyst. The low probability assigned is justified by both the current plateau and the rare base rate for platforms to recover from this phase without significant external shocks. This analysis is a strong application of the hype cycle to the realities of social platform growth and aligns well with the historical inertia typical in path-dependent tech adoption."
        },
        "communicationStudiesUsesAndGratificationsTheory": {
            "forecaster_to_engage": "Product Management (Product Market Fit Assessment)",
            "response_type": "defense",
            "response": "The Product Management (Product Market Fit Assessment) forecast demonstrates a critical and often underappreciated dimension in platform growth forecasting: whether a social network has truly achieved product-market fit with a large, general audience, rather than just a motivated niche. This perspective aligns with Uses and Gratifications Theory, which holds that long-term, large-scale adoption depends on the platform's ability to satisfy a wide spectrum of user needs and to create robust retention and engagement loops. The argument that Bluesky's drivers (anti-X migration, novelty) are waning and that no evidence of a viral loop or breakthrough feature exists is compelling. The focus on retention, mainstream appeal, and the absence of a mass-market viral mechanism adds depth, reinforcing why a rapid surge to 100M users is extremely unlikely at this stage. The probability estimate is thus strongly justified."
        }
    },
    "revision_results": {
        "Technology Market Analysis (Gartner Hype Cycle)": {
            "my_phase1_final_probability": 8,
            "reasoning_for_revised_probability": "Upon reviewing the group deliberation and the forecasts of other experts from adjacent domains (notably Product Market Fit Assessment, S Curve Adoption Model, and Uses and Gratifications Theory), I find strong consensus and additional arguments reinforcing my initial view. Specifically, the Product Market Fit perspective reinforces that Bluesky lacks the viral retention loop or mass-market hook needed for late-stage exponential growth, and the Uses and Gratifications Theory further underlines the lack of mainstream utility to drive another leap in adoption. No forecaster identified any overlooked imminent catalyst, and all probabilities are tightly clustered between 5% and 10%. The Communication Studies perspective, which I defended, makes a compelling case for an even lower probability, but given a slight possibility of a black swan event, I see no justification for lowering my forecast further. Therefore, I will maintain my initial probability.",
            "revised_probability": 8
        },
        "Technology Market Analysis (S Curve Adoption Model)": {
            "my_phase1_final_probability": 8,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I find my original probability well-supported. The other forecasters' arguments—especially from Product Management (Product Market Fit Assessment), Economics (Two Sided Market Theory), and Communication Studies (Uses and Gratifications Theory)—reinforce the extremely low base rate for social networks tripling their user base at this late stage absent a unique, exogenous catalyst. The consensus across theories is that Bluesky's growth has plateaued, its network effects have not reached mainstream critical mass, and its product-market fit remains niche. No additional information suggests a higher probability, and some forecasts, notably Communication Studies, even argue for a lower probability. As such, there is no compelling reason to adjust my initial estimate.",
            "revised_probability": 8
        },
        "Product Management (Product Market Fit Assessment)": {
            "my_phase1_final_probability": 8,
            "reasoning_for_revised_probability": "After reviewing the group deliberation and comparing forecasts, my initial assessment remains well-justified. All forecasters converge on a very low probability, citing the plateauing of Bluesky's growth, the absence of a new catalyst, and the dominance of competitors with deeper pockets and stronger network effects. The Communication Studies (Uses and Gratifications Theory) perspective further reinforces the difficulty for Bluesky in delivering sustained, differentiated value to mainstream audiences, which is essential for mass adoption. My critique of the Sociology (Diffusion of Innovations) forecast led me to reaffirm the importance of product-market fit and retention mechanics—areas where Bluesky is currently underperforming. No new evidence or argument emerged that would suggest a significant probability increase. If anything, the uniformity of low probabilities across multiple analytical approaches strengthens the case for a very low estimate.",
            "revised_probability": 8
        },
        "Sociology (Diffusion of Innovations)": {
            "my_phase1_final_probability": 10,
            "reasoning_for_revised_probability": "The group deliberation reinforced and deepened the initial analysis. Other forecasters—drawing on product management, S curve adoption, and market theory—corroborated the view that late-stage, rapid growth to 100 million users is exceedingly rare without a new, major catalyst. Critiques highlighted the importance of product-market fit and retention mechanics, further reducing the plausibility of a viral resurgence. Defenses of the lowest probability forecasts underscored the absence of broad, mainstream utility and persistent user gratification needed for mass adoption. The critiques of network effects theory (including my own) emphasized that Bluesky's growth is likely insular, lacking the sociological 'bridges' necessary for mainstreaming. As such, the base rate and current trajectory remain decisive, and if anything, the collective analysis suggests an even stronger status quo bias. However, since my initial forecast already reflected a low probability (10%), and new arguments, while reinforcing, do not introduce a fundamentally new risk or catalyst, I see no compelling reason to lower it further. I will maintain my probability at 10%.",
            "revised_probability": 10
        },
        "Sociology (Network Effects Theory)": {
            "my_phase1_final_probability": 8,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, there is a clear, broad consensus across multiple analytic frameworks—market analysis, product fit, network effects, innovation diffusion, and uses-and-gratifications—that Bluesky's growth has plateaued and that a further tripling of users in three months is historically unprecedented without an extraordinary external catalyst. No new evidence or argument emerged that would materially increase the probability of explosive growth; if anything, critiques and defenses further highlight the qualitative and product-level barriers to mainstream adoption. The lowest forecast in the group is 5%, suggesting my original estimate was already appropriately aligned with expert consensus and base rates. There is no compelling reason to adjust the probability upward or downward.",
            "revised_probability": 8
        },
        "Economics (Two Sided Market Theory)": {
            "my_phase1_final_probability": 7,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, my initial estimate remains strongly supported by both the qualitative and quantitative arguments presented by other experts. All forecasts, regardless of disciplinary lens, converge on the extremely low base rate of late-stage exponential growth for social platforms without a new, dramatic catalyst. The deliberation surfaced no overlooked positive indicators for Bluesky; instead, it reinforced the assessment that the platform is now in a plateau phase, with both network effects and path dependence working against rapid further adoption. Critiques highlighted the lack of mass-market product fit and the insularity of Bluesky's current network, diminishing the likelihood of a viral resurgence. With only about 3 months remaining and no evidence of a forthcoming exogenous shock or breakthrough innovation, the probability of reaching 100 million users before the end of 2025 may even be slightly lower than my original estimate.",
            "revised_probability": 6
        },
        "Economics (Path Dependence)": {
            "my_phase1_final_probability": 7,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I see strong convergence across methodologies—including S Curve Adoption, Gartner Hype Cycle, Two-Sided Market Theory, and Diffusion of Innovations—on the rarity of late-stage viral user growth absent a new exogenous shock. No additional evidence or argument was presented suggesting a plausible catalyst or viral loop that could plausibly drive Bluesky from 38M to 100M users in the remaining three months. If anything, several perspectives (e.g., Uses and Gratifications, Network Effects Theory) reinforce the view that Bluesky's growth is plateauing due to both sociological and product-market fit limitations. The base rate for a decentralized, non-corporate-backed social network achieving such a leap is near-zero barring a black swan event. Thus, I see no compelling reason to adjust my probability upward or downward, and the weight of evidence remains overwhelmingly in favor of a 'No' outcome.",
            "revised_probability": 7
        },
        "Communication Studies (Uses and Gratifications Theory)": {
            "my_phase1_final_probability": 5,
            "reasoning_for_revised_probability": "The group deliberation corroborates and reinforces the core logic of my initial forecast. All forecasters, using different disciplinary lenses (technology adoption curves, product management, economics, sociology), converge on the extremely low base rate for social platforms tripling their user base at this late stage without a new, powerful catalyst. No forecaster presented a plausible scenario or new evidence that would increase the likelihood of Bluesky reaching 100 million users by the end of 2025. If anything, the discussion emphasized additional structural barriers (such as product-market fit, network effects saturation, and the absence of viral growth mechanisms) that validate and strengthen the initial pessimism. Thus, I see no reason to revise my forecast upward or downward. The most accurate probability remains 5%.",
            "revised_probability": 5
        }
    },
    "revision_probability": [
        8,
        8,
        8,
        10,
        8,
        6,
        7,
        5
    ],
    "revision_mean_probability": 7.5,
    "revision_sd": 1.5118578920369088,
    "revision_probability_result": 8,
    "question_details": {
        "id": 38931,
        "title": "Will Bluesky reach 100 million users before the end of 2025?",
        "created_at": "2025-08-31T05:09:36.326911Z",
        "open_time": "2025-09-25T07:09:09Z",
        "cp_reveal_time": "2025-09-25T08:39:09Z",
        "spot_scoring_time": "2025-09-25T08:39:09Z",
        "scheduled_resolve_time": "2025-12-31T22:59:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-09-25T08:39:09Z",
        "actual_close_time": "2025-09-25T08:39:09Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "This question is synced with an identical question on Metaculus. The original question opened on 2025-02-27 12:57:00 and can be found [here](https://www.metaculus.com/questions/35563). This question will resolve to the same value as the synced question. The original question's background info at this time is below. \n\nBluesky is a decentralized social network, initially incubated by Twitter co-founder Jack Dorsey. Its goal is to provide an open alternative to traditional social media platforms.\n\n Bluesky has surpassed 32 million users, according to [ <u>Jazco's Bluesky Stats</u> ](https://bsky.jazco.dev/stats), experiencing massive growth since its public launch in February 2024. This surge is partly attributed to users leaving X (Twitter) following changes implemented by Elon Musk; and also to Donald Trump's re-election in November 2024. Reaching 100 million users by the end of the year would represent a significant milestone.\n\n`{\"format\":\"metac_closes_in_period\",\"info\":{\"post_id\":35563,\"question_id\":35014}}`",
        "resolution_criteria": "This question will be resolved as **Yes** if, by January 1st, 2026, Bluesky's user count reaches 100 million or more, according to [ <u>Jazco's Bluesky Stats</u> ](https://bsky.jazco.dev/stats) or another credible source. If the reported number is below 100 million, the question will be resolved as **No**.",
        "fine_print": "* If Jazco's Bluesky Stats stops reporting this number and no other credible sources can be found, this question will be **voided**",
        "post_id": 39554,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Instagram Monthly Active Users Exceed 30 Billion, Monetization Potential Strong**\nMeta’s flagship app Instagram has surpassed 30 billion monthly active users (MAU), a milestone that Meta CEO Mark Zuckerberg confirmed in a statement quoted in the article: 'Instagram monthly active users have reached 30 billion.' The company first reported 20 billion MAU in October 2022, and within less than three years hit the new benchmark. Zuckerberg also noted that Facebook’s MAU exceeded 30 billion in January and WhatsApp’s MAU surpassed 30 billion in April. Meta acquired Instagram in 2012 for US$1 billion, a move that was initially questioned because Instagram was then a low‑profit photo‑sharing platform. Since then, Instagram has grown into a diversified social‑media ecosystem, serving as a key platform for e‑commerce, advertising, and content creation. Analysts project that by 2025 Instagram will contribute more than half of Meta’s U.S. advertising revenue. Instagram launched the short‑video feature Reels in 2020 to compete with TikTok and YouTube Shorts, boosting user engagement. The most followed individual on Instagram is football star Cristiano Ronaldo, with 6.6 billion followers, followed by Lionel Messi with 5 billion. Meta’s July 2025 earnings report highlighted stronger-than‑expected results, attributing growth to AI‑driven advertising efficiencies. The Meta family of apps (Facebook, Instagram, WhatsApp, etc.) reported a cumulative 34.8 billion daily active users, an 11 % year‑over‑year increase in ad impressions, and a 9 % rise in average ad price.\nOriginal language: zh\nPublish date: September 25, 2025 04:00 AM\nSource:[TechNews 科技新報 | 市場和業內人士關心的趨勢、內幕與新聞](https://technews.tw/2025/09/25/instagram-surpasses-3-billion-monthly-active-users/)\n\n**Instagram Reaches 3 Billion Monthly Active Users**\nMeta’s Instagram platform has surpassed 3 billion monthly active users, according to CEO Mark Zuckerberg and Instagram head Adam Mosseri, as announced on September 24 2025. This milestone matches other Meta networks such as Facebook and WhatsApp, which already had 3 billion users. The last time Instagram reported user numbers was in 2022, when it reached 2 billion. In April 2024 Meta announced it would stop publishing monthly or daily user metrics, instead releasing quarterly figures to investors. Mosseri thanked users and said the platform will continue to focus on three core pillars: Reels, DMs, and recommendations. He added, 'Se você olhar para os últimos anos, quase todo o nosso crescimento foi impulsionado por DMs, Reels e recomendações [...] Por isso, continuaremos a focar nesses produtos e reorientar o aplicativo mais para DMs, Reels e recomendações nos próximos meses.' The company plans to introduce new features such as a Reels pop‑up mode and the ability to attach links to Reels posts. Source: TecMundo.\nOriginal language: pt\nPublish date: September 24, 2025 07:30 PM\nSource:[TecMundo](https://www.tecmundo.com.br/internet/407310-instagram-bate-3-bilhoes-de-usuarios-ativos-por-mes.htm)\n\n**What is Bluesky? Everything to know about the X competitor.**\nBluesky, a decentralized social network launched by former Twitter CEO Jack Dorsey, has grown to over 30 million users by February 2025, driven by policy changes at X and post‑2024 election migration. The platform uses the open‑source AT Protocol, offers a Twitter‑like interface, and is free. It has introduced features such as custom feeds, a Starter Pack, and a video tab. Bluesky has attracted high‑profile users including Alexandria Ocasio‑Cortez, Mark Cuban, and former U.S. presidents. The company has raised $15 million in Series A and is developing a subscription service, Bluesky+, while maintaining a policy of not selling user data. It has faced moderation controversies, including a 17‑fold rise in reports in 2024, and has expanded its moderation team to about 100 moderators. The platform emphasizes decentralization, allowing users to port accounts to other AT‑Protocol apps. The article presents facts and metrics without overt bias, noting that \"You'll always have the freedom to choose (and to exit) instead of being held to the whims of private companies or black box algorithms.\"\nOriginal language: en\nPublish date: September 23, 2025 09:33 PM\nSource:[TechCrunch](https://techcrunch.com/2025/09/23/what-is-bluesky-everything-to-know-about-the-x-competitor/)\n\n**Bluesky Strengthens Moderation and Expulsion Policy**\nBluesky, the social network, announced on September 19 a new set of community guidelines that strengthen its ability to expel users who violate rules and increase moderation efforts. The update is part of a broader review that began in January 2025. After the initial release, the platform collected feedback from more than 14,000 users, who offered suggestions on how the rules could affect creative expression and 'traditionally marginalized voices'. In a statement, Bluesky said, 'After considering this feedback, and returning to our experimental roots, we will focus on encouraging constructive dialogue and applying our rules against harassment and toxic content. To start, we will intensify our enforcement efforts.' A spokesperson told TechCrunch that from now on, users who break the rules will receive fewer warnings before their accounts are deactivated. The changes also clarify the permissions tied to the four core principles—Safety First, Respect for Others, Authenticity, and Rule Compliance—and provide clearer definitions to reduce vague terms. A new section dedicated to journalism, education, law, and mental‑health content was added to reduce uncertainty about how the guidelines apply in those areas. Bluesky also announced development of features such as a 'zen mode' and tips for more constructive conversations, aiming to make social media more authentic, informative and human again.\nOriginal language: pt\nPublish date: September 23, 2025 07:28 PM\nSource:[Canaltech](https://canaltech.com.br/internet/bluesky-esta-levando-mais-a-serio-ideia-de-expulsar-usuarios-e-reforca-moderacao/)\n\n**Zuckerberg Surprises the World: Instagram Reaches 3 Billion Monthly Active Users**\nMark Zuckerberg, the CEO of Meta, announced that Instagram has exceeded 3 billion monthly active users, a milestone he described as \"رائع\" (great). In a post on his official Instagram channel, he said, 'لقد بنينا مجتمعا رائعا هنا' and added, 'شكرا لكم على كونكم جزءا منه', thanking users for building the community. Instagram joined Facebook and WhatsApp as the three Meta platforms each surpassing 3 billion monthly active users. The app was founded by Kevin Systrom and Mike Krieger in 2010, acquired by Meta in 2012 for $1 billion. Instagram’s active users grew from 1 billion in 2018 to over 2 billion in October 2022, according to Zuckerberg’s earlier statements. The rapid growth was driven by features such as Reels launched in 2020, which compete with TikTok and YouTube Shorts. Experts predict that Meta will release new updates focused on innovation and security as the year ends, reinforcing Instagram’s role as a global digital community where users share billions of photos and videos daily.\nOriginal language: ar\nPublish date: September 25, 2025 05:05 AM\nSource:[صحيفة عكاظ](https://www.okaz.com.sa/variety/na/2214936)\n\n**Instagram Monthly Active Users Exceed 30 Billion, Monetization Potential Strong**\nMeta’s flagship app Instagram has surpassed 30 billion monthly active users (MAU), a milestone that Meta CEO Mark Zuckerberg confirmed in a statement quoted in the article: 'Instagram monthly active users have reached 30 billion.' The company first reported 20 billion MAU in October 2022, and within less than three years hit the new benchmark. Zuckerberg also noted that Facebook’s MAU exceeded 30 billion in January and WhatsApp’s MAU surpassed 30 billion in April. Meta acquired Instagram in 2012 for US$1 billion, a move that was initially questioned because Instagram was then a low‑profit photo‑sharing platform. Since then, Instagram has grown into a diversified social‑media ecosystem, serving as a key platform for e‑commerce, advertising, and content creation. Analysts project that by 2025 Instagram will contribute more than half of Meta’s U.S. advertising revenue. Instagram launched the short‑video feature Reels in 2020 to compete with TikTok and YouTube Shorts, boosting user engagement. The most followed individual on Instagram is football star Cristiano Ronaldo, with 6.6 billion followers, followed by Lionel Messi with 5 billion. Meta’s July 2025 earnings report highlighted stronger-than‑expected results, attributing growth to AI‑driven advertising efficiencies. The Meta family of apps (Facebook, Instagram, WhatsApp, etc.) reported a cumulative 34.8 billion daily active users, an 11 % year‑over‑year increase in ad impressions, and a 9 % rise in average ad price.\nOriginal language: zh\nPublish date: September 25, 2025 04:00 AM\nSource:[TechNews 科技新報 | 市場和業內人士關心的趨勢、內幕與新聞](https://technews.tw/2025/09/25/instagram-surpasses-3-billion-monthly-active-users/)\n\n**Instagram Monthly Active Users Reach 3 Billion, Monetization Potential High**\nMeta CEO Mark Zuckerberg announced that Instagram’s monthly active users have risen to 3 billion, surpassing the 2 billion mark reported in October 2022. In January, Zuckerberg also disclosed that Facebook’s monthly active users exceeded 3 billion, and in April he announced the same milestone for WhatsApp. Meta acquired Instagram in 2012 for $1 billion, a move that was initially questioned because the photo‑sharing platform was barely profitable. Since then, Instagram has evolved into a diversified social‑media ecosystem and a key platform for e‑commerce and advertising. Research agencies predict that in 2025 Instagram will account for more than half of Meta’s U.S. ad revenue. The platform launched short‑form video Reels in 2020 to compete with TikTok and YouTube Shorts, boosting user engagement. The most followed account on Instagram is Cristiano Ronaldo with 660 million followers, followed by Lionel Messi with 500 million. Meta’s Q4 earnings beat expectations, with the company citing AI‑driven improvements to its ad system as a major revenue driver. The Meta family—Facebook, Instagram, WhatsApp—has a combined daily active user base of 3.48 billion, with ad impressions up 11 % and average ad price up 9 % year‑over‑year. Meta has also launched a “Super Intelligence Lab” to maintain its AI leadership. The article notes that the information is for reference only and does not constitute investment advice. According to Zuckerberg, 'Instagram月活躍用戶人數已增至30億人'. Meta reported that 'Meta程式家族日活躍用戶數累計達34.8億人'.\nOriginal language: zh\nPublish date: September 25, 2025 02:25 AM\nSource:[MoneyDJ理財網](https://www.moneydj.com/kmdj/news/newsviewer.aspx?a=32bfdebc-3342-4651-bfab-381817d13c6c)\n\n**Instagram Reaches 3 Billion Monthly Active Users**\nMeta’s Instagram platform has surpassed 3 billion monthly active users, according to CEO Mark Zuckerberg and Instagram head Adam Mosseri, as announced on September 24 2025. This milestone matches other Meta networks such as Facebook and WhatsApp, which already had 3 billion users. The last time Instagram reported user numbers was in 2022, when it reached 2 billion. In April 2024 Meta announced it would stop publishing monthly or daily user metrics, instead releasing quarterly figures to investors. Mosseri thanked users and said the platform will continue to focus on three core pillars: Reels, DMs, and recommendations. He added, 'Se você olhar para os últimos anos, quase todo o nosso crescimento foi impulsionado por DMs, Reels e recomendações [...] Por isso, continuaremos a focar nesses produtos e reorientar o aplicativo mais para DMs, Reels e recomendações nos próximos meses.' The company plans to introduce new features such as a Reels pop‑up mode and the ability to attach links to Reels posts. Source: TecMundo.\nOriginal language: pt\nPublish date: September 24, 2025 07:30 PM\nSource:[TecMundo](https://www.tecmundo.com.br/internet/407310-instagram-bate-3-bilhoes-de-usuarios-ativos-por-mes.htm)\n\n**Instagram Reaches Three Billion Monthly Users, Ranking Third Worldwide After Facebook and WhatsApp**\nMeta CEO Mark Zuckerberg announced on Wednesday that Instagram has crossed the three‑billion‑monthly‑active‑users (MAU) threshold, joining Facebook and WhatsApp as the only three platforms to reach that milestone this year. The milestone was achieved less than two years after Instagram hit two billion MAU in October 2022. According to CNBC, Zuckerberg described the community as 'невероятным'. Meta announced in April 2024 that it would stop publishing separate quarterly data for daily and monthly active users for Facebook and other apps, instead reporting a combined daily active user (DAU) figure for all apps. In July, the combined DAU reached 3.48 billion, surpassing analysts’ forecast of 3.45 billion. Earlier this year, Zuckerberg said Facebook had more than three billion MAU and that WhatsApp had also crossed the three‑billion mark. The article highlights Instagram’s growth as part of Meta’s broader user‑base expansion.\nOriginal language: ru\nPublish date: September 24, 2025 05:42 PM\nSource:[3DNews - Daily Digital Digest](https://3dnews.ru/1129787/u-instagram-teper-tri-milliarda-polzovateley-v-mesyats-tretiy-v-mire-posle-facebook-i-whatsapp)\n\n**Bluesky down for some, with frozen feeds or error messages - 9to5Mac**\nBluesky, a social media platform, experienced a partial outage that began around 5am ET on September 24, 2025, according to Downdetector reports. Users reported either a frozen feed that only shows older posts or an error message stating 'some kind of issue occurred when contacting the feed server.' The company’s status page currently shows no problems, but the article notes that companies often delay acknowledging outages. The Verge’s Dominic Preston confirmed that the issue is not universal. The author of the article also reports seeing the error message themselves.\nOriginal language: en\nPublish date: September 24, 2025 12:18 PM\nSource:[9to5Mac](https://9to5mac.com/2025/09/24/bluesky-down-for-some-with-frozen-feeds-or-error-messages/)\n\n**What is Bluesky? Everything to know about the X competitor.**\nBluesky, a decentralized social network launched by former Twitter CEO Jack Dorsey, has grown to over 30 million users by February 2025, driven by policy changes at X and post‑2024 election migration. The platform uses the open‑source AT Protocol, offers a Twitter‑like interface, and is free. It has introduced features such as custom feeds, a Starter Pack, and a video tab. Bluesky has attracted high‑profile users including Alexandria Ocasio‑Cortez, Mark Cuban, and former U.S. presidents. The company has raised $15 million in Series A and is developing a subscription service, Bluesky+, while maintaining a policy of not selling user data. It has faced moderation controversies, including a 17‑fold rise in reports in 2024, and has expanded its moderation team to about 100 moderators. The platform emphasizes decentralization, allowing users to port accounts to other AT‑Protocol apps. The article presents facts and metrics without overt bias, noting that \"You'll always have the freedom to choose (and to exit) instead of being held to the whims of private companies or black box algorithms.\"\nOriginal language: en\nPublish date: September 23, 2025 09:33 PM\nSource:[TechCrunch](https://techcrunch.com/2025/09/23/what-is-bluesky-everything-to-know-about-the-x-competitor/)\n\n**Bluesky Strengthens Moderation and Expulsion Policy**\nBluesky, the social network, announced on September 19 a new set of community guidelines that strengthen its ability to expel users who violate rules and increase moderation efforts. The update is part of a broader review that began in January 2025. After the initial release, the platform collected feedback from more than 14,000 users, who offered suggestions on how the rules could affect creative expression and 'traditionally marginalized voices'. In a statement, Bluesky said, 'After considering this feedback, and returning to our experimental roots, we will focus on encouraging constructive dialogue and applying our rules against harassment and toxic content. To start, we will intensify our enforcement efforts.' A spokesperson told TechCrunch that from now on, users who break the rules will receive fewer warnings before their accounts are deactivated. The changes also clarify the permissions tied to the four core principles—Safety First, Respect for Others, Authenticity, and Rule Compliance—and provide clearer definitions to reduce vague terms. A new section dedicated to journalism, education, law, and mental‑health content was added to reduce uncertainty about how the guidelines apply in those areas. Bluesky also announced development of features such as a 'zen mode' and tips for more constructive conversations, aiming to make social media more authentic, informative and human again.\nOriginal language: pt\nPublish date: September 23, 2025 07:28 PM\nSource:[Canaltech](https://canaltech.com.br/internet/bluesky-esta-levando-mais-a-serio-ideia-de-expulsar-usuarios-e-reforca-moderacao/)\n\n**X Reports A Sharp Dip in Q2 Ad Revenue Despite Earlier Momentum**\nX, formerly Twitter, reported a 2.2% decline in ad revenue for the three months ending June 30 2025, pulling in $707 million, even though the platform still saw a roughly 20% year‑over‑year increase. The quarter‑on‑quarter drop signals a slowdown in momentum that began earlier in the year, following a surge in advertiser interest during Q1 2025 after the 2024 U.S. election. The renewed enthusiasm was not sustained, with the Q2 intake suggesting a struggle to retain ad spending. This was compounded by Elon Musk’s public fallout with then‑President Donald Trump and his subsequent announcement to ‘swear off politics,’ which dissipated some of the initial momentum. Part of X’s strategy to reduce its dependency on advertising has been to pivot toward subscription services and other non‑ad revenue streams, but these efforts have not scaled quickly enough to offset the slipping ad sales. While X Premium is bringing in some revenue, it is not at the level needed to fill the financial gap. Other initiatives, such as the ‘X Money’ payments feature, have been held up by regulatory approvals, further delaying diversification efforts. With an estimated $2.9 billion in total revenue projected for 2025 and about $1.2 billion in annual debt servicing costs, X is under intense pressure to perform. The company’s recent merger with xAI, which is reportedly burning through $1 billion per month on infrastructure, adds another layer of financial risk. Meanwhile, Meta’s Threads continues to grow, posing a significant threat to X’s mobile app user base and potentially siphoning away ad dollars. For X to navigate its financial challenges, regaining advertiser confidence will be crucial, likely depending on maintaining policy consistency and ensuring user growth in the face of stiff competition. The performance of its non‑ad revenue streams will be under scrutiny, as their success is vital for the platform’s long‑term sustainability. The outcome of X’s AI ambitions, particularly its integration with xAI, will also play a significant role in its future trajectory. Ultimately, the platform’s ability to balance its transition toward an AI‑centric model with the demands of a volatile ad market will determine its success in the coming years.\nOriginal language: en\nPublish date: September 23, 2025 09:21 AM\nSource:[TechJuice](https://www.techjuice.pk/x-reports-a-sharp-dip-in-q2-ad-revenue-despite-earlier-momentum/)\n\n**Who&#x2019;s Next? Bluesky Posters Call for Deaths of Prominent Republicans, Conservative Media Figures**\nFollowing the murder of Turning Point USA founder Charlie Kirk, users on the Bluesky app have posted calls for the deaths of several high‑profile right‑wing figures, including Elon Musk, Donald Trump, J.K. Rowling, Ben Shapiro, Matt Walsh and Michael Knowles. Screenshots show threats ranging from violent language to explicit suggestions of who should be targeted next. BlueSky, which has about 1.5 million daily users, issued warnings on Thursday that such posts violated its community guidelines, which prohibit 'encouragement of violence against individuals, groups, institutions or the general public' and 'wishes of harm directed at a specific person or group.' The platform, founded by former Twitter CEO Jack Dorsey, has become a sanctuary for progressives after Musk's overhaul of Twitter as X and Trump's 2024 victory. Other right‑wing influencers—Chaya Raichik, Andy Ngo, Christopher Rufo and Benny Johnson—have also been targeted. Earlier this summer, far‑left extremists on BlueSky had posted threats against federal officers and sought personal information about their families. The New York Post confirmed that some of the violent posts were removed by Thursday evening. In response, other platforms such as Meta, YouTube, Discord and Reddit have flagged graphic content and removed posts celebrating Kirk's death or restricted them from younger users. The article questions why these platforms should be allowed to tolerate open calls for literal bloodshed when Parler was shut down for Q‑related election‑denial posts.\nOriginal language: en\nPublish date: September 13, 2025 01:11 PM\nSource:[Donald J. Trump](https://freerepublic.com/focus/f-chat/4340181/posts)\n\n**Liberal Bluesky issues warning following Charlie Kirk's assassination**\nBluesky, a social‑media platform that launched in 2023, warned its 38 million users that it will remove posts or ban anyone who celebrates the assassination of conservative commentator Charlie Kirk, who was shot dead at Utah Valley University on 11 September 2025. In a post on its Safety account, Bluesky said, 'Glorifying violence or harm violates Bluesky's Community Guidelines. We review reports and take action on content that celebrates harm against anyone.' It added, 'Violence has no place in healthy public discourse, and we're committed to fostering healthy, open conversations.' The platform stated that any user who violates this policy could have their account suspended or removed. Other platforms—Meta, YouTube, Reddit, Discord—also condemned posts about the shooting, and MSNBC fired a political analyst for remarks made after the incident. Bluesky was founded as a side project of Twitter in 2019, became independent in 2021, and launched publicly in 2023 after Elon Musk bought Twitter for $44 billion in late 2022. The article notes that the platform gained two million new users after Musk joined the Trump administration in November 2024. Charlie Kirk, founder of Turning Point USA, was 31 when he was killed 20 minutes into his 'American Comeback' event. The university hosting the event said it would uphold First Amendment rights. The article also reports that Meta spokesperson Francis Brennan said the platform would remove graphic content and add warning labels, Reddit spokesperson Gina Antonini said its rules prohibit encouraging or glorifying violence, and YouTube spokesperson Jack Malon expressed condolences and said it was monitoring for graphic videos.\nOriginal language: en\nPublish date: September 11, 2025 03:02 PM\nSource:[Daily Mail Online](https://www.dailymail.co.uk/sciencetech/article-15088505/Bluesky-warning-Charlie-Kirk-assassination.html)\n\n**Bluesky Seeks Its Place After Surfing Elon Musk’s 'Flight Effect': 'The Exodus Is Over'**\nBluesky, the Twitter‑alternative platform, has experienced a rapid user‑growth surge in the fall of 2024. According to a simple web page maintained by developer Jaz, the platform’s registered users increased from 6.18 million 90 days ago to 10.85 million 30 days ago, and is projected to reach 15 million tomorrow. Jaz posted the figures on the site, stating, 'Hace 90 días Bluesky tenía 6,18 millones de usuarios. Hace 30 días Bluesky tenía 10,85 millones de usuarios. Mañana Bluesky tendrá 15 de millones de usuarios. Esto es absolutamente increíble, gracias a todos por creer en nosotros.' The article describes the growth as an \"explosion\" that broke the platform’s previous niche‑social‑network status, noting that the numbers have been widely shared across social media. A new user added, 'Mientras no lo vendáis a un multimillonario egocéntrico, seguiré aquí,' expressing loyalty to the platform’s current direction.\nOriginal language: es\nPublish date: September 01, 2025 08:53 PM\nSource:[eldiario.es](https://www.eldiario.es/tecnologia/bluesky-busca-sitio-surfear-efecto-huida-elon-musk-exodo-terminado_1_12564026.html)\n\n**Scientists Leaving Elon Musk's X are Driving Growth on Bluesky: Study**\nA study by the University of Sheffield and Renmin University of China – still awaiting peer review – reports that scientific activity on Bluesky has surged since November 2024, coinciding with a broader migration away from X. The analysis covered more than 2.6 million Bluesky posts that reference scholarly content between January 2023 and July 2025. In October 2024 there were roughly 10 000 posts, 3 200 users and 6 500 referenced articles; by November those numbers jumped to 239 000 posts, 35 000 users and 54 000 articles, peaking in January 2025 at 324 000 posts by 45 000 users referencing 71 000 unique articles. Activity has since stabilized with a slight decline. \"The stabilization of posts, users and referenced articles suggests that Bluesky has already established itself as a credible and lasting platform for science communication, rather than a short‑lived trend,\" said Er‑Te Zheng, a Ph.D. student at Sheffield, via email. The study also found that 48 % of scholarly posts received at least 10 likes and 34 % were reposted at least 10 times, compared with only 3.9 %‑7.5 % of X posts receiving more than 10 likes and 1.4 %‑4.4 % receiving 10 reposts or more. In terms of originality, only 6.3 % of Bluesky posts contained merely a research‑paper title, whereas on X title‑replication rates range from 11.8 % to 92.4 % across disciplines. Bluesky, with more than 38 million users, remains far smaller than X, which Elon Musk claimed had about 600 million monthly active users as of May 2024. Nonetheless, a January poll by Nature found that more than half of 5 300 respondents – most scientists – had left X, citing dissatisfaction with Musk’s leadership and relaxed content moderation. \"This suggests that Bluesky users participate more actively and with greater originality in interactions around scholarly articles,\" Zheng added. The study highlights Bluesky’s decentralized, open‑source network and its growing niche as a platform for deeper, more original scientific conversations than X.\nOriginal language: en\nPublish date: August 29, 2025 06:17 PM\nSource:[Observer](https://observer.com/2025/08/bluesky-x-science-engagement/)\n\n**Bluesky’s European Outreach Campaign to Boost Growth**\nBluesky, a decentralized social network founded by Twitter co‑founder Jack Dorsey and now led by Jay Graeber, saw its user base jump from about 10 million to nearly 38 million after the 2024 U.S. presidential election. Growth has since slowed, prompting the company to launch a European outreach tour in August. Rose Wang, Bluesky’s director of operations, acted as a marketing liaison to city halls across the continent. On 16 January 2025, the Paris City Hall announced it had left Elon Musk’s platform X, a move that Bluesky framed as a signal of shared values: 'Venir à Paris est un signal que nous envoyons.' Wang highlighted that Bluesky offers higher engagement rates than larger platforms and positions itself as a democratic space that prohibits hate speech, harassment and misinformation: 'L'application est une comme une société démocratique.' The campaign aims to position Bluesky as a tool for reconnecting municipalities and citizens, though uptake remains limited in some areas, such as Poitiers, which reportedly has only 311 residents. The article notes a wave of criticism but does not elaborate.\nOriginal language: fr\nPublish date: August 29, 2025 03:28 PM\nSource:[LesEchos.fr](https://www.lesechos.fr/tech-medias/medias/loperation-de-seduction-du-reseau-social-bluesky-en-europe-pour-relancer-sa-croissance-2183506)\n\n**X, Threads, and Bluesky: The Battle for Social Media Supremacy**\nTwitter, now known as X, has seen a significant decline in active users, with a 15.2% decrease from last year, while Threads, a new social media platform launched by Meta, has seen a 127.8% increase in active users. According to TechCrunch, Threads had 111.5 million active users in June 2025, while X had 132 million. However, X still has a larger user base, with 145.8 million desktop users, compared to Threads' 690,000 desktop users. Bluesky, a social media platform launched by Twitter's co-founder Jack Dorsey, has also seen significant growth, with a 372.5% increase in active users, but still lags behind X and Threads in terms of user base. Meta's Mark Zuckerberg is reportedly targeting X's users with his aggressive hiring strategies, and it seems that he is slowly but surely gaining ground on Elon Musk, X's CEO.\nOriginal language: ja\nPublish date: July 09, 2025 12:30 PM\nSource:[GIZMODO JAPAN（ギズモード・ジャパン）](https://www.gizmodo.jp/2025/07/mark-zuckerberg-is-slowly-winning-his-cage-match-with-elon-musk.html)\n\n**Bluesky Introduces New Update with Enhanced Notification Controls**\nBluesky, a decentralized social media app founded by Jack Dorsey, reached its peak in popularity last year with over 20 million active users. This was due to the controversy surrounding Elon Musk's X (formerly Twitter) platform, which was experiencing changes in content moderation and privacy policies. Bluesky added a feature to combat identity theft and maintained its popularity, reaching over 30 million users, with 18-24 year olds being the most active users, according to Statista. To attract more users, Bluesky has released a new update with 'Activity Notifications' that allows users to control which notifications they receive. This feature enables users to activate a bell icon on a user's profile, receiving only new post and response notifications. Additionally, the update has expanded granular controls to decide which notifications to receive, such as likes, new followers, or other activities, and from whom. The simplified 'priority notifications' option has been integrated into the new configuration, and Bluesky will now notify users if someone likes or re-posts their content, according to The Verge.\nOriginal language: es\nPublish date: July 08, 2025 11:35 AM\nSource:[20 minutos](https://www.20minutos.es/tecnologia/aplicaciones/bluesky-adios-notificaciones-molestas-nueva-actualizacion-5729338/)\n\n**Threads Closes Gap with X in Daily Active Users, Bluesky Grows Rapidly**\nInstagram Threads is closing the gap with X (formerly Twitter) in terms of daily active users, according to Similarweb data. In June 2025, Threads had 115.1 million daily active users, up 127.8% from the same period last year. X had 132 million daily active users, but this is a 15.2% decrease from the same period last year. Decentralized social network Bluesky is also growing rapidly, with a 372.5% increase in daily active users over the past year, but its audience is still relatively small, with 4.1 million daily active users. Bluesky's growth was fueled by users leaving X in protest of Elon Musk's association with Donald Trump, but the platform has since become criticized for being one-sidedly liberal, leading some users to return to Threads. Despite its potential, the competition is currently between Threads and X, with Threads being the main competitor to X for advertising budgets on mobile devices. However, on desktop, X has a significant advantage, with 145.8 million daily visits in June 2025, compared to Threads' 6.9 million. Bluesky is also growing in this segment, with 5.3 million daily visits. In the US, the situation is mixed, with Threads closing the gap with X on mobile devices, but X dominating on desktop. 'It's not just about the protest traffic, but about the interest in the technological approach: an open, customizable social network,' said analysts. 'Those who come only because it's 'not X' may quickly leave if the platform doesn't meet their expectations. Instead, the technical community may stay and support the development of the ecosystem.'\nOriginal language: ru\nPublish date: July 08, 2025 06:39 AM\nSource:[ITC.ua](https://itc.ua/news/threads-dogonyaet-x-na-smartfonah-audytoryy-pochty-sravnyalys/)\n\n**Threads Closes Gap with X in Mobile Users, But Still Trails on Web**\nMark Zuckerberg's social media platform, Threads, has reached 1.151 billion daily active users (DAU) on mobile, just 15 million short of Elon Musk's X (formerly Twitter). This is a significant increase from last year, with Threads' DAU growing by 127.8% and X's DAU decreasing by 15.2%. In the US, Threads has 153 million daily mobile users, just behind X's 229 million. The gap between the two platforms has narrowed since Musk's close relationship with Donald Trump sparked a mass exodus of users from X. Threads is a text-based social media platform launched by Meta, the parent company of Facebook and Instagram, in response to X. While X still dominates on the web, with 145.8 million daily web visitors, Threads has 6.9 million, a 20-fold difference. However, Threads has 3.5 billion global monthly active users (MAU), compared to X's 6 billion, according to Musk's claim last year. Another decentralized network, Bluesky, has gained attention as a potential alternative to X, with 410 million global mobile app users and 240 million in the US, significantly ahead of Threads.\nOriginal language: ko\nPublish date: July 07, 2025 10:57 PM\nSource:[인터넷뉴스 한경닷컴](https://www.hankyung.com/article/2025070837007)\n\n",
    "date": "2025-09-26T01:08:12.895102",
    "summary": "All forecasting experts converge on a low probability that Bluesky will reach 100 million users before the end of 2025. Experts from technology adoption (Gartner Hype Cycle, S-Curve), product management, sociology, economics, and communication studies cite the same core dynamics: Bluesky’s explosive growth following the post-2024-election exodus from X (Twitter) has sharply decelerated, with the user base plateauing around 38 million as of late September 2025. Absent a dramatic, exogenous event—such as a major crisis or collapse at X or Threads, or a viral celebrity-driven migration—the current trend suggests a plateau, with further growth expected to be incremental at best. Key risks and barriers identified include fierce competition from Meta’s Threads, entrenched user bases and network effects on competing platforms, limited Bluesky resources, recent moderation controversies, polarization, and a value proposition still largely attractive only to a niche audience. While some experts allow for a slim possibility that a sudden, unforeseen shock could trigger another viral surge, this is not seen as the base case. Historical adoption rates of comparable social platforms, challenges in crossing from early adopters to mass market, and the daunting requirement of tripling user count in three months reinforce the consensus: the probability of Bluesky hitting 100 million users before the end of 2025 is assessed between 5% and 10%, with no expert rating it higher.",
    "forecasters": [
        "Technology Market Analysis (Gartner Hype Cycle)",
        "Technology Market Analysis (S Curve Adoption Model)",
        "Product Management (Product Market Fit Assessment)",
        "Sociology (Diffusion of Innovations)",
        "Sociology (Network Effects Theory)",
        "Economics (Two Sided Market Theory)",
        "Economics (Path Dependence)",
        "Communication Studies (Uses and Gratifications Theory)"
    ]
}