{
    "deliberation_results": {
        "GamingRegulation (AmericanGamingAssociationStandards)": {
            "time_to_resolution": "About 2.5 months (question resolves on December 31, 2025; today's date is October 17, 2025)",
            "perspective_relevance": "As an expert in Gaming Regulation and American Gaming Association Standards, my perspective is critical for evaluating the interplay between federal (CFTC) and state-level gaming/gambling regulation, understanding how prediction markets are classified, and how regulatory approval is typically granted or contested. Familiarity with licensing, compliance, and the nuances of 'real-money' market definitions is central to accurately forecasting changes in legal status for Polymarket and Manifold.",
            "status_quo": "Polymarket was previously barred from operating in the US, but has recently acquired a CFTC-licensed exchange (QCX) and received a CFTC no-action letter, paving the way for a US relaunch in October 2025. Manifold operates with play money and has not secured explicit regulatory approval for real-money operations. There is substantial opposition from state regulators, but federal CFTC licenses provide a path to legality on the federal level.",
            "perspective_derived_factors": [
                {
                    "factor": "CFTC Regulatory Approval",
                    "effect": "Strongly increases probability. Polymarket has acquired a CFTC-licensed designated contract market via QCEX and received a CFTC no-action letter, which is the clearest federal signal of regulatory approval for real-money prediction markets under federal commodity law. This is the critical regulatory hurdle for federal legality."
                },
                {
                    "factor": "State-Level Legal Challenges",
                    "effect": "Decreases probability. Multiple states (e.g., Nevada, New Jersey, Ohio, Massachusetts) have issued cease-and-desist orders or are litigating the right to prohibit or regulate event-based contracts as gambling. Even with federal CFTC licensing, states may block or restrict operations, and state-level legal battles may not be resolved in 2025."
                },
                {
                    "factor": "Industry Precedent and Base Rates",
                    "effect": "Moderately increases probability. Kalshi, a CFTC-licensed prediction market, is operating in the US (albeit amidst legal disputes with some states). The base rate for new prediction markets achieving federal approval is low, but the recent Polymarket approval is a significant precedent."
                },
                {
                    "factor": "Political and Institutional Pushback",
                    "effect": "Decreases probability. The American Gaming Association and state gaming authorities are lobbying against prediction markets, viewing them as threats to state-regulated gambling. Senators have demanded CFTC justification for permitting cross-state operations, and pending federal legislation (RFIA) could create new regulatory requirements or delays."
                },
                {
                    "factor": "Explicit 'Change in Law or Policy' Requirement",
                    "effect": "Increases probability. The CFTC's issuance of a no-action letter and Polymarket's acquisition of a DCM license constitute a public change in federal policy, meeting the question's fine print if Polymarket actually launches real-money markets for US users."
                },
                {
                    "factor": "Operational Timelines and Legal Uncertainty",
                    "effect": "Decreases probability. Polymarket's relaunch timeline is for October 2025, leaving little margin for error; unresolved state legal challenges or new injunctions could delay or limit operations to the point where 'legal in at least one state' is ambiguous."
                },
                {
                    "factor": "Manifold's Status",
                    "effect": "Neutral to slightly decreasing. There is no evidence Manifold will launch or receive real-money approval in 2025; the focus is on Polymarket."
                }
            ],
            "no_scenario": "Despite Polymarket's CFTC license and no-action letter, ongoing state-level legal battles (e.g., injunctions, successful state lawsuits, or additional regulatory crackdowns) prevent Polymarket from legally offering real-money betting in any US state by the end of 2025. Alternatively, the company delays or limits US operations due to regulatory uncertainty, or federal approval is somehow rescinded or found insufficient for state compliance. Manifold does not receive approval or launch real-money betting.",
            "yes_scenario": "Polymarket successfully relaunches in the US in October 2025 using its CFTC-licensed DCM and no-action letter. At least one US state (even if not all) recognizes this federal approval as sufficient for legal operation, and Polymarket actively offers real-money prediction markets to US users before December 31, 2025. This public change in policy and law meets the question's fine print. State-level challenges either fail, are not enforced, or do not prevent operation in at least one jurisdiction. Manifold remains irrelevant.",
            "final_reasoning": "The most recent news indicates Polymarket has acquired a CFTC-licensed designated contract market and secured a no-action letter, which together represent a significant, public change in federal regulatory policy. The company has announced plans to relaunch for US users in October 2025. This is the first time Polymarket will operate with explicit federal approval. The main remaining obstacle is state-level legal resistance, but there is strong precedent (Kalshi) that CFTC licensing can allow operation in at least some states, even amidst ongoing litigation. The fine print requires legality in at least one state—not universal legality—meaning that if Polymarket is able to launch in any compliant jurisdiction, the question resolves Yes. Manifold is extremely unlikely to be relevant. The risk of a last-minute injunction or unresolved lawsuits creates some uncertainty, but the status quo is already shifting rapidly toward legality, and the CFTC's actions are a strong signal. Given all this, and the very recent, well-documented regulatory shift, the probability is high, but not absolute—there is still some chance of state-level action blocking all operations or of unforeseen delays. I estimate the chance that real-money betting on Polymarket becomes legal in at least one US state (as per the fine print) by the end of 2025 at 86%.",
            "final_probability": 86
        },
        "GamingRegulation (StateGamingControlCompliance)": {
            "time_to_resolution": "Approximately 2.5 months until December 31, 2025.",
            "perspective_relevance": "As an expert in Gaming Regulation and State Gaming Control Compliance, I have deep knowledge of how both federal and state regulatory frameworks interact and evolve when it comes to gambling, prediction markets, and new financial products. I can assess not only the legal status quo but also the likelihood and sequencing of regulatory approvals, compliance challenges, and the interplay between federal authorities (CFTC) and state-level gaming commissions. This expertise is directly relevant, as the question hinges on whether Polymarket or Manifold will be able to legally offer real-money betting in at least one US state, with an explicit requirement for a public change in law or government policy.",
            "status_quo": "Until recently, Polymarket was banned from serving US users after a 2022 CFTC action, and Manifold only offered play-money. Kalshi operates federally under CFTC regulation but faces ongoing state-level challenges. The status quo is that real-money betting on Polymarket and Manifold is not legally available to US users; any change would require regulatory action or a successful legal challenge.",
            "perspective_derived_factors": [
                {
                    "factor": "CFTC Regulatory Action and No-Action Letter",
                    "effect": "Strongly increases probability. Polymarket has reportedly acquired a Designated Contract Market (DCM) license via QCEX and has received a CFTC no-action letter that is widely interpreted as explicit regulatory approval to operate in the US with real-money markets. This is a clear, public change in federal policy."
                },
                {
                    "factor": "Federal vs. State Jurisdiction",
                    "effect": "Somewhat decreases probability. Even with CFTC approval, many states, especially those with strong gaming commissions (NV, NJ, MA, OH, etc.), are issuing cease-and-desist orders and asserting jurisdiction over any real-money event betting. Legal battles are ongoing, and some states may block Polymarket or Kalshi from operating within their borders, though federal courts have sometimes sided with the CFTC."
                },
                {
                    "factor": "Legal Precedent and Lawsuits",
                    "effect": "Slightly increases probability. Kalshi recently won lawsuits in NV and NJ affirming the right to operate under federal law, and Polymarket’s acquisition of a CFTC-regulated exchange (QCEX) gives it a legal path to entry. Court momentum is shifting toward federal preemption for at least some contract types."
                },
                {
                    "factor": "Explicit Resolution Criteria",
                    "effect": "Strongly increases probability. The fine print requires a public change in law or policy, including CFTC no-action letters, and only one state must allow legal operation. News reports indicate both the no-action letter and the acquisition/licensure are public and formal."
                },
                {
                    "factor": "Political and Regulatory Pushback",
                    "effect": "Somewhat decreases probability. State and tribal authorities, as well as some US Senators, are pushing back aggressively, requesting CFTC justification and threatening legal challenges. The RFIA (crypto bill) and litigation could delay or complicate full rollout, and state-level blockades could persist through year's end."
                },
                {
                    "factor": "Market and Institutional Momentum",
                    "effect": "Moderately increases probability. ICE’s $2B investment, Polymarket’s high-profile partnerships, and the fact that they are already planning a US relaunch for October 2025 suggest that the companies believe their legal basis is solid."
                }
            ],
            "no_scenario": "Despite federal approval, state regulators (e.g., NV, NJ, OH, MA) block Polymarket or Manifold from operating, either through injunctions, enforcement actions, or adverse court rulings. The companies delay or limit their US launch, or restrict offerings in a way that does not meet the fine print (e.g., only play-money or no fiat/crypto in, or only offering markets in non-qualifying states). Alternatively, last-minute regulatory or legal challenges reverse or stall the CFTC approval before the end of 2025.",
            "yes_scenario": "Polymarket, leveraging its acquisition of QCEX and CFTC no-action letter, launches real-money prediction markets in at least one US state before the end of 2025. Even if some states prohibit access, at least one state allows legal operation, and there is a clear, public green light (e.g., CFTC public letter, Polymarket relaunch, and at least one state not actively blocking). The relaunch occurs as planned in October 2025, and users in at least one state can legally deposit and withdraw fiat or crypto for real-money betting on Polymarket (or, less likely, Manifold).",
            "final_reasoning": "The base rate for new legal gambling or prediction markets is low, but the news contains unusually strong signals of a regulatory inflection. Polymarket’s acquisition of a DCM license and CFTC no-action letter are both explicit, public regulatory changes that seem to fulfill the question’s resolution criteria. Kalshi’s court wins suggest that, at least in some states, federal preemption is winning out, and even if some states continue to block, the fine print requires only a single state to allow legal operation. State-level resistance remains a real threat, but the planned October 2025 relaunch, ICE investment, and explicit statements in the news about Polymarket’s US return make a Yes outcome highly probable unless a court or regulator blocks it in the next 2.5 months. The biggest risk is a last-minute adverse legal action or a technicality that prevents true real-money betting. But as of mid-October 2025, the balance of evidence points strongly toward at least one state permitting legal real-money Polymarket betting before year-end.",
            "final_probability": 85
        },
        "USLegislativeAnalysis (LegislativeProcessUS)": {
            "time_to_resolution": "Approximately 2.5 months (until December 31, 2025)",
            "perspective_relevance": "As an expert in US legislative analysis, I bring a nuanced understanding of regulatory processes, the interaction of federal and state authorities, and the role of agencies like the CFTC. My expertise allows me to weigh the impact of recent legal developments, enforcement actions, and the likelihood of further regulatory or legislative movement within the very short remaining timeline for 2025.",
            "status_quo": "Polymarket and Manifold have not been legally accessible to US users for real-money betting. Kalshi is the only CFTC-approved real-money prediction market, and Polymarket was previously fined and had to block US users. Manifold operates play-money markets only. Until recently, Polymarket was not legal in the US for real-money use.",
            "perspective_derived_factors": [
                {
                    "factor": "CFTC Approval and Licensing",
                    "effect": "Strongly increases probability. Polymarket acquired QCEX (a CFTC-licensed exchange) and has received a CFTC no-action letter, explicitly allowing it to operate as a designated contract market for certain contracts. This directly addresses the legal bar that previously excluded it from US markets."
                },
                {
                    "factor": "Explicit Regulatory Action",
                    "effect": "Strongly increases probability. The news states Polymarket received regulatory approval and plans to launch for US users in October 2025, with a designated license. The no-action letter and acquisition are public changes in government policy, satisfying the question's fine print."
                },
                {
                    "factor": "State vs. Federal Preemption and Active Litigation",
                    "effect": "Slightly decreases probability. Some states (e.g., Nevada, Ohio, Massachusetts) are issuing cease-and-desist orders or litigating against prediction markets, arguing these violate state gambling laws. However, recent court victories for Kalshi (federally regulated) in Nevada and New Jersey suggest that CFTC designation may preempt state-level bans for federally regulated event contracts—at least for now."
                },
                {
                    "factor": "Scope of Approval and Market Types",
                    "effect": "Slightly decreases probability. Polymarket's current US relaunch appears limited to 'four self-certified contract types.' If these do not include the full range of markets (e.g., sports, politics), or if some contracts are not approved, legal real-money betting could remain restricted to a subset of Polymarket's offerings. However, the fine print only requires legality for some real-money markets, not all."
                },
                {
                    "factor": "Manifold’s Status",
                    "effect": "Neutral to slightly negative. There is no evidence Manifold has received any regulatory approval or is imminently launching a real-money product in the US. Polymarket is the primary focus."
                },
                {
                    "factor": "Potential for Sudden Legal Reversals or State Injunctions",
                    "effect": "Slightly decreases probability. The legal landscape is contentious, with state regulators and lawmakers pushing back, but there is no clear evidence of an imminent ban or reversal at the federal level for Polymarket before year-end."
                },
                {
                    "factor": "Base Rates and Status Quo Bias",
                    "effect": "Normally would decrease probability, as the legal environment for new forms of online gambling is slow to change. However, the explicit and recent CFTC action represents a meaningful break from the historic status quo."
                }
            ],
            "no_scenario": "Despite the CFTC approval and intended October 2025 launch, a state or federal court issues an injunction halting Polymarket’s real-money operations before they actually open to US residents, or a critical regulatory reversal takes place. Alternatively, Polymarket’s US launch is delayed until 2026 due to implementation, legal, or technical barriers, or its offering is so restricted (e.g., no real-money markets or no fiat/crypto redemption) that it fails to meet the fine print criteria before Dec 31, 2025.",
            "yes_scenario": "Polymarket completes its acquisition of QCEX, receives the CFTC no-action letter, and launches a US-facing platform in October 2025, offering at least some real-money markets (e.g., using USDC or fiat) legally to US users in at least one state before the end of 2025. There is no successful legal challenge or injunction before year-end, and the operation is publicly acknowledged as legal by both the company and relevant regulators.",
            "final_reasoning": "The news presents strong, recent evidence that Polymarket is about to (re)launch legal real-money prediction markets in the US following CFTC approval and acquisition of a licensed exchange. This constitutes a clear 'public change in law or government policy' required by the fine print. While there is some risk posed by ongoing state-level pushback and potential lawsuits, recent precedents (Kalshi winning in Nevada and New Jersey) suggest that federal approval currently trumps state-level objections for event contracts. The time remaining in 2025 is short, but Polymarket’s relaunch is explicitly described as coming in October. The only significant risk would be an unforeseen injunction, regulatory reversal, or technical delay, but there is no current evidence of these outcomes being imminent or likely. Manifold is not a factor. Given the explicit regulatory green light and imminent launch, the probability is very high, though not 100% due to nonzero risk of legal or operational setbacks.",
            "final_probability": 93
        },
        "USLegislativeAnalysis (FinancialTechnologyPolicy)": {
            "time_to_resolution": "Approximately 2.5 months (until December 31, 2025)",
            "perspective_relevance": "As an expert in US legislative analysis with a focus on financial technology policy, I bring deep knowledge of the interplay between federal and state regulation, the operations of the CFTC, legal precedents for prediction markets, and the nuances of real-money versus play-money constructs. My expertise in interpreting regulatory signals, legal filings, and agency actions is highly relevant to an outcome dependent on both the legal status and regulatory clarity for Polymarket and Manifold in the US.",
            "status_quo": "As of early 2025, real-money betting on Polymarket and Manifold was not legal in the US. Polymarket had been barred by the CFTC in 2022, and Manifold only offered play-money betting. Kalshi was the only CFTC-regulated real-money prediction market, and significant legal uncertainty persisted around state-level and federal authority.",
            "perspective_derived_factors": [
                {
                    "factor": "Polymarket's acquisition of a CFTC-regulated exchange and receipt of a CFTC no-action letter",
                    "effect": "Strongly increases probability; the CFTC no-action letter and acquisition of QCX (a DCM) provide clear regulatory cover at the federal level for Polymarket to operate legally for real-money prediction markets, at least for certain contract types."
                },
                {
                    "factor": "State-level resistance and ongoing legal battles",
                    "effect": "Moderately decreases probability; multiple states (e.g., Nevada, Ohio, New Jersey) have issued cease-and-desist orders against prediction markets, and legal battles are ongoing about whether CFTC oversight preempts state gambling law. While some courts have sided with federally regulated exchanges, uncertainty persists, especially for sports and possibly political contracts."
                },
                {
                    "factor": "Polymarket's US relaunch and ICE investment",
                    "effect": "Increases probability; the platform's announced relaunch for US users in October 2025 with licensed contracts and a $2B investment from ICE indicate strong institutional confidence and operational momentum, making a regulated launch likely."
                },
                {
                    "factor": "Manifold's current operational status",
                    "effect": "Neutral; there is no evidence Manifold has acquired a derivatives license or federal regulatory approval to operate with real money in the US. Its play-money/sweepcash workaround does not meet the resolution criteria."
                },
                {
                    "factor": "Federal-state regulatory preemption precedent (Kalshi lawsuits)",
                    "effect": "Slightly increases probability; Kalshi has recently won federal lawsuits in Nevada and New Jersey, setting positive precedent for federal preemption of state gambling law for CFTC-regulated event contracts. This may help Polymarket defend against state-level challenges."
                },
                {
                    "factor": "Regulatory and political headwinds (Senate/Congress attention, ethics scandals)",
                    "effect": "Slightly decreases probability; while Polymarket has regulatory cover, the Nobel Prize insider trading scandal and political scrutiny (letters from Senators to the CFTC, ongoing debates on jurisdiction) could slow or complicate the expansion, though not necessarily block it."
                },
                {
                    "factor": "Resolution criteria specificity (at least one state, public regulatory change)",
                    "effect": "Increases probability; only one state needs to allow legal operation, and the acquisition of a CFTC-regulated exchange and a no-action letter constitute the kind of public regulatory change required by the question."
                }
            ],
            "no_scenario": "Despite the CFTC's no-action letter and acquisition of a DCM, state-level regulators in all relevant states successfully block or delay Polymarket's real-money operations through injunctions or new legislation, or the CFTC reverses or limits its permission before Polymarket can launch. Alternatively, Polymarket fails to operationalize its US relaunch by the end of 2025, or only launches in a way that does not meet the resolution's fiat-on/fiat-off criteria. Manifold does not secure any real-money regulatory approval.",
            "yes_scenario": "Polymarket, via its acquisition of QCX and receipt of a CFTC no-action letter, relaunches for US users in October 2025 with at least one real-money contract type (e.g., non-sports, non-political events) that can be legally accessed by users in at least one US state, using USDC or another fiat-equivalent. There is a clear, public regulatory change (the no-action letter and acquisition) and at least one state does not successfully block access. Manifold does not launch a real-money market, but Polymarket's success is sufficient for a YES resolution.",
            "final_reasoning": "The critical base rate is that almost no prediction markets have achieved legal, federally regulated, real-money operation in the US—Kalshi is the rare exception. The status quo heavily favored illegality. However, the unique developments in 2025—Polymarket's acquisition of a CFTC-regulated DCM, receipt of a no-action letter, and announced US relaunch—represent a decisive regulatory shift at the federal level, which is the key threshold for legal operation. While state-level resistance continues, recent federal court wins by Kalshi, and the fact that only one state needs to allow access, make a complete blockade unlikely. Manifold is irrelevant to the YES case. The key uncertainty is whether state-level litigation or regulatory backlash could delay or prevent Polymarket's launch by December 31, 2025. With the launch planned for October and no evidence of a nationwide state blockade, the probability that Polymarket will be able to offer at least one real-money market legally in at least one state in 2025 is very high, though not certain. Taking into account the (diminishing) risk of state-level injunctions, last-minute regulatory reversals, or operational delays, the probability is strongly in the 85-95% range. I select 92% to reflect high confidence but nonzero tail risk.",
            "final_probability": 92
        },
        "Law (USFederalGamblingLaw)": {
            "time_to_resolution": "Approximately 2.5 months (until December 31, 2025)",
            "perspective_relevance": "As an expert in US federal gambling law, I am able to closely analyze distinctions between federal and state regulatory authority, the meaning and legal force of CFTC no-action letters and licenses, recent court decisions, and how the interplay of laws, agency actions, and political pressure shapes the legal environment for prediction markets. I am also able to distinguish between true legal changes versus operational risk-taking by platforms, which is critical for this question’s resolution.",
            "status_quo": "Until recently, real-money betting on Polymarket and Manifold was illegal for US users, with Polymarket blocked by the CFTC since 2022 and Manifold only operating with play money. Kalshi was previously the only large-scale CFTC-regulated real-money prediction market accessible to US users.",
            "perspective_derived_factors": [
                {
                    "factor": "Polymarket's CFTC No-Action Letter and DCM License via Acquisition",
                    "effect": "Strongly increases probability. Multiple articles confirm Polymarket acquired QCEX, a CFTC-regulated exchange, and received a no-action letter, which is considered a public change in government policy under the question’s resolution criteria. This provides a legal basis for resuming operations in the US, at least for some contract types."
                },
                {
                    "factor": "State-Federal Preemption and Ongoing Litigation",
                    "effect": "Slightly decreases probability. States like Nevada, New Jersey, and Ohio have challenged federal preemption, issuing cease-and-desist orders and initiating lawsuits to block CFTC-regulated markets from operating in their states. However, Kalshi’s recent court victories in Nevada and New Jersey affirming federal preemption are a strong precedent for Polymarket to rely upon, although some states continue to contest this."
                },
                {
                    "factor": "Explicit Public Announcements and Planned US Relaunch",
                    "effect": "Strongly increases probability. News reports state Polymarket is planning a US relaunch with real-money trading in October 2025, with four self-certified contract types. The CFTC no-action letter, the acquisition, and the announced relaunch are all public actions supporting a legal return."
                },
                {
                    "factor": "Manifold's Regulatory Status",
                    "effect": "Neutral to slightly negative. There is no evidence Manifold has secured any federal or state-level license or no-action relief, and it continues to operate in a play-money mode. The focus is thus on Polymarket."
                },
                {
                    "factor": "Nature of Contracts Allowed and Regulatory Scope",
                    "effect": "Slightly decreases probability. While Polymarket has secured approval for some 'self-certified' contract types, there could be regulatory limitations or future litigation over which contracts are permissible (e.g., sports or political markets). However, the resolution only requires any real-money market to be legal in at least one state, not all or most."
                },
                {
                    "factor": "Political and Regulatory Risk Before Year-End",
                    "effect": "Slightly decreases probability. Despite apparent regulatory approval, state pushback and the potential for political intervention remain, especially given the controversy over insider trading and state gaming regulators’ resistance. However, the timeframe left in 2025 is short, and a public CFTC action has already occurred."
                }
            ],
            "no_scenario": "Despite CFTC approval and Polymarket’s planned relaunch, one or more successful legal or regulatory actions by state authorities, or a reversal or stay by the CFTC or a federal court, prevent Polymarket from actually offering real-money betting to US users in any state before the year ends. Alternatively, Polymarket’s relaunch is delayed or limited to non-real-money contracts, or the CFTC’s no-action letter is rescinded or found insufficient to constitute a true change in government policy.",
            "yes_scenario": "Polymarket, having acquired a CFTC-regulated exchange and received a no-action letter, publicly launches real-money markets accessible to US users, and at least one real-money contract is offered and accepted from US residents before the end of 2025, with the legal basis being the CFTC’s public regulatory action. Even if some states continue to challenge or block access, the existence of a legal pathway in at least one state suffices for a Yes resolution.",
            "final_reasoning": "The recent news provides clear, concrete evidence that Polymarket has achieved a major regulatory breakthrough: acquisition of a CFTC-licensed exchange (QCEX) and receipt of a CFTC no-action letter, both of which are recognized as public changes in government policy per the question’s fine print. Polymarket has announced a US relaunch with real-money markets in October 2025, and the media coverage unambiguously frames this as a legal return, not merely a risk-based operational decision. While state-level resistance persists and some litigation is ongoing, Kalshi’s recent federal court victories in Nevada and New Jersey support the legal theory of federal preemption for CFTC-regulated markets. The only substantial risks are a rapid reversal by CFTC, successful emergency state/federal court actions, or an operational delay that pushes the relaunch past December 2025. However, with only 2.5 months left in the year and the relaunch imminent, these risks are modest. Manifold remains play-money only and is irrelevant to the forecast. The base rate for new legal prediction markets is low, but the decisive regulatory action by the CFTC marks a break from the status quo, and the strong investor and institutional backing further lowers the odds of reversal. Thus, the probability of a Yes outcome is very high, but not quite 100% due to lingering state and timing risks.",
            "final_probability": 95
        },
        "Law (StateGamblingLegislation)": {
            "time_to_resolution": "Approximately 2.5 months (until December 31, 2025)",
            "perspective_relevance": "As an expert in State Gambling Legislation, I can critically assess the intersection of federal and state law, regulatory actions, and the specific mechanisms (such as CFTC no-action letters, state attorney general actions, and court decisions) that determine the legality of real-money betting platforms like Polymarket and Manifold. My expertise enables me to evaluate the likelihood that a public, durable legal or regulatory change will make real-money betting on these platforms legal in at least one US state by the end of 2025, in compliance with the resolution criteria.",
            "status_quo": "Polymarket and Manifold are currently not legally permitted to offer real-money betting to US users. Polymarket was fined and blocked from US operations in 2022, but recent news indicates Polymarket has acquired a CFTC-licensed exchange (QCEX), received a CFTC no-action letter, and is preparing to relaunch for US users in late 2025. However, state-level legal obstacles remain, and Manifold continues to operate with play money only.",
            "perspective_derived_factors": [
                {
                    "factor": "Polymarket acquisition of QCEX and CFTC no-action letter",
                    "effect": "Strongly increases probability, as it provides a credible federal legal avenue for Polymarket to operate real-money markets in the US."
                },
                {
                    "factor": "Federal preemption versus state gambling laws",
                    "effect": "Decreases probability, as ongoing state-level legal conflicts (cease-and-desist orders, lawsuits in Nevada, New Jersey, Ohio, and opposition from state regulators) may block or delay Polymarket’s legal operations even with CFTC approval."
                },
                {
                    "factor": "Explicit fine print requiring a public change in law or policy",
                    "effect": "Increases probability, as the CFTC’s public no-action letter and Polymarket’s acquisition of a DCM license constitute public regulatory actions. However, state-level acceptance is also required in at least one state."
                },
                {
                    "factor": "Precedent set by Kalshi’s operations and lawsuits",
                    "effect": "Somewhat increases probability, as Kalshi has successfully operated under federal regulation despite state-level opposition and has won recent lawsuits affirming federal jurisdiction, suggesting a path forward for Polymarket."
                },
                {
                    "factor": "Manifold’s status and lack of real-money operations",
                    "effect": "Decreases probability, as there is no evidence Manifold is close to securing regulatory approval or launching real-money betting in 2025."
                },
                {
                    "factor": "Time constraints and ongoing state litigation",
                    "effect": "Decreases probability, as lawsuits and regulatory clarification requests (e.g., senators demanding CFTC answers by Oct 30, 2025) introduce risks that state-level acceptance will not be timely or universal."
                },
                {
                    "factor": "Market demand and high-profile endorsements",
                    "effect": "Slightly increases probability, as institutional adoption (ICE investment), public endorsements, and market momentum may incentivize speedy regulatory resolution."
                }
            ],
            "no_scenario": "Despite Polymarket’s CFTC no-action letter and DCM license, one or more state authorities (e.g., Nevada, Massachusetts, Ohio) successfully block or delay Polymarket’s operations through court injunctions or regulatory actions, with no US state publicly confirming that real-money Polymarket or Manifold betting is legal before the end of 2025. Alternatively, Polymarket’s US relaunch is delayed past December 31, 2025 due to unresolved litigation or regulatory uncertainty.",
            "yes_scenario": "Polymarket completes its acquisition of QCEX, receives a CFTC no-action letter, and publicly relaunches for US users with real-money markets before the end of 2025. At least one state (potentially Texas or another permissive jurisdiction) either explicitly allows Polymarket’s operation or does not challenge its legality, and there is a public, durable legal/regulatory action (e.g., no-action letter, state court ruling, or AG statement) establishing real-money betting on Polymarket as legal in that state. This satisfies the fine print’s requirement of a public change in law or policy.",
            "final_reasoning": "The most relevant fact is that Polymarket has acquired a CFTC-licensed exchange (QCEX), received a CFTC no-action letter, and is preparing a US relaunch in October 2025. This is a substantial public change in federal regulatory status and likely satisfies the fine print requirement for a public change in law or policy—at least at the federal level. However, the status quo for real-money prediction markets in the US is shaped by both federal CFTC authority and state-level gambling regulation. Recent news shows active state resistance (cease-and-desist orders, litigation in multiple states), but Kalshi has won some lawsuits affirming its right to operate under federal preemption. The fine print requires that real-money betting on Polymarket or Manifold be legal in at least one US state, with a public legal or regulatory action. It does not require universal state acceptance or the absence of legal challenges elsewhere. Given Polymarket’s DCM license, CFTC no-action letter, and announced October 2025 US relaunch, the probability is now above 75%. However, the ongoing legal uncertainty at the state level, the possibility of injunctive relief, and the short timeline (2.5 months) make this outcome less than a lock. The most likely scenario is that at least one state will not take action to block Polymarket’s relaunch, and the CFTC no-action letter plus the DCM license will be sufficient for Metaculus to resolve this as Yes. There remains a significant risk of last-minute legal entanglements or delays, hence I stop short of 100%.",
            "final_probability": 85
        },
        "PoliticalScience (RegulatoryPolitics)": {
            "time_to_resolution": "Approximately 2.5 months (question resolves at the end of 2025; today is October 17, 2025).",
            "perspective_relevance": "As an expert in regulatory politics, particularly in U.S. financial and gambling regulation, I bring an understanding of the interplay between federal agencies (like the CFTC), state-level gambling authorities, and legislative processes. I can assess the likelihood of regulatory approvals, legal challenges, and the political/institutional momentum for or against the legalization of real-money prediction markets such as Polymarket and Manifold.",
            "status_quo": "Until recently, both Polymarket and Manifold were not legally allowed to offer real-money betting to U.S. users—Polymarket was fined and blocked from U.S. access by the CFTC in 2022, and Manifold has remained play-money only. Kalshi is the only major platform operating under explicit CFTC approval. State-level regulators largely view such markets as gambling.",
            "perspective_derived_factors": [
                {
                    "factor": "Polymarket acquisition of a CFTC-licensed exchange and receipt of a no-action letter",
                    "effect": "Greatly increases the probability, since a public change in regulatory policy (CFTC approval through a no-action letter and acquisition of QCEX) meets the question's criteria for a legal, real-money relaunch in the U.S."
                },
                {
                    "factor": "Ongoing state-level resistance and legal ambiguity",
                    "effect": "Decreases the probability, as some states (e.g., Nevada, Massachusetts, Ohio) are actively litigating federal preemption and issuing cease-and-desist orders, which could delay or restrict operations in certain jurisdictions or result in court stays."
                },
                {
                    "factor": "Federal courts affirming CFTC preemption over state gambling law (Kalshi lawsuits in Nevada and New Jersey)",
                    "effect": "Increases the probability, as recent legal victories for Kalshi suggest that federal regulatory approval can override state-level gambling objections, at least in some states."
                },
                {
                    "factor": "Explicit statements of intent and scheduled relaunches",
                    "effect": "Increases the probability: Polymarket has publicly announced an October 2025 U.S. relaunch with real-money markets, backed by institutional partners (ICE), which would likely not occur without legal clearance."
                },
                {
                    "factor": "Manifold’s status and lack of clear regulatory engagement",
                    "effect": "Neutral to slightly negative: While Manifold is not currently real-money and hasn’t featured in regulatory headlines, the focus for 2025 is overwhelmingly on Polymarket’s regulatory progress."
                },
                {
                    "factor": "Political/regulatory backlash and high-profile scandals (e.g., Nobel Prize betting controversy)",
                    "effect": "Slightly decreases the probability of full-scale acceptance, but does not negate that regulatory approval has occurred, especially if limited to certain contract types."
                },
                {
                    "factor": "Requirement for 'public change in law or policy'",
                    "effect": "Increases the probability, since the CFTC’s no-action letter and Polymarket’s acquisition of a DCM license constitute explicit, public regulatory actions, satisfying the resolution requirement."
                }
            ],
            "no_scenario": "Despite the CFTC’s no-action letter and Polymarket’s planned relaunch, a successful state-level legal challenge (e.g., an injunction from a state court or federal appellate stay) blocks all real-money prediction market activity in the U.S. before year-end, or the CFTC reverses its position in response to Congressional or legal pressure, resulting in Polymarket postponing its U.S. launch or restricting access to only non-real-money markets.",
            "yes_scenario": "Polymarket relaunches real-money markets for U.S. users in October 2025, following its acquisition of QCEX and the CFTC’s no-action letter. At least one state (likely more) either explicitly allows, or does not interfere with, its operation. The relaunch is publicly acknowledged by the company and regulators as legal under current federal policy, thereby meeting the 'public change in law or policy' criterion. Even if some states continue to litigate, at least one state has unambiguous legality, satisfying the fine print.",
            "final_reasoning": "The regulatory landscape for prediction markets in the U.S. has shifted rapidly in late 2025. The most salient facts are: 1) Polymarket’s acquisition of a CFTC-licensed exchange (QCEX); 2) public reporting that the CFTC issued a no-action letter explicitly allowing Polymarket to operate real-money markets; 3) Polymarket’s imminent October 2025 U.S. relaunch with real-money markets and institutional backing; 4) recent federal court victories (Kalshi, Nevada/NJ) affirming federal preemption over state gambling law, at least for CFTC-regulated entities; and 5) the question’s fine print requires only one state to have legal operation following a public change in law or policy. While ongoing legal challenges and regulatory backlash (especially at the state level) create some risk of disruption, these are unlikely to overturn the CFTC’s federal authority, especially with precedent now in Kalshi’s favor. Manifold is a non-factor for real-money in this time frame. The only plausible 'No' scenario is an immediate, sweeping legal injunction or reversal, which appears unlikely given the recent public moves and scheduled relaunch. Therefore, the base rate for prediction markets to get regulatory approval in the U.S. has historically been very low, but the status quo has shifted decisively in 2025 due to explicit public action from the federal regulator. Given these developments and the resolution criteria, the probability of a Yes outcome is extremely high, though not absolutely certain.",
            "final_probability": 95
        },
        "PoliticalScience (PolicyChangeTheory)": {
            "time_to_resolution": "Approximately 2.5 months (until December 31, 2025)",
            "perspective_relevance": "As a political scientist with expertise in Policy Change Theory, I am positioned to analyze the interplay of regulatory inertia, interest group pressure, institutional path dependence, and punctuated equilibrium in U.S. regulatory change. This expertise is particularly relevant to forecasting legal and policy shifts in emergent, controversial domains like prediction markets, which straddle financial, gambling, and tech regulation. I can assess the likelihood of rapid versus incremental policy change, the influence of recent legal and regulatory events, and the odds that temporary regulatory authorizations become robust, durable permissions.",
            "status_quo": "As of early 2025, real-money betting on Polymarket and Manifold was illegal for U.S. residents; Polymarket was barred from the U.S. by CFTC action in 2022, and Manifold did not accept real money. Legal prediction markets (e.g., Kalshi) operated under strict CFTC regulation with ongoing state and federal tensions.",
            "perspective_derived_factors": [
                {
                    "factor": "CFTC Regulatory Action and No-Action Letters",
                    "effect": "Strongly increases probability. Recent news confirms Polymarket acquired a CFTC-regulated exchange (QCEX), received a no-action letter, and is preparing a U.S. relaunch in October 2025. This is a concrete, public regulatory change."
                },
                {
                    "factor": "State vs Federal Regulatory Conflict",
                    "effect": "Slightly decreases probability. Despite CFTC approval, multiple states (e.g., Nevada, Ohio, Massachusetts) are pursuing or maintaining legal action to block prediction markets, including issuing cease-and-desist orders. State gaming authorities are actively fighting federal preemption."
                },
                {
                    "factor": "Legal Precedent and Court Rulings",
                    "effect": "Moderately increases probability. Kalshi recently won lawsuits in Nevada and New Jersey affirming the right to operate under federal rules, but other states have ongoing, unresolved injunctions. This suggests a trend toward federal preemption, but not yet universal."
                },
                {
                    "factor": "Explicit Change in Law or Policy (Resolution Criteria)",
                    "effect": "Strongly increases probability. The fine print requires a public change in law/policy, which appears to have occurred via CFTC action and Polymarket’s acquisition of a DCM (Designated Contract Market) license, with a public relaunch planned for October 2025."
                },
                {
                    "factor": "Political Timing and Legislative Gridlock",
                    "effect": "Slightly decreases probability. The Senate RFIA crypto proposal is delayed, midterm elections loom, and legislative changes face headwinds. However, for resolution, regulatory (not legislative) change suffices."
                },
                {
                    "factor": "Interest Group Pressure (State Regulators, Casino Lobby, Gaming Association)",
                    "effect": "Moderately decreases probability. State authorities and casino lobbies are vocally opposed, pressuring the CFTC and pursuing state-level legal action. This creates legal uncertainty and could trigger new court injunctions before year-end."
                },
                {
                    "factor": "Precedent of Kalshi’s Federal Approval",
                    "effect": "Moderately increases probability. Kalshi’s sustained operation under CFTC regulation, even amid state pushback and legal challenges, sets precedent for Polymarket or Manifold to operate legally in at least some U.S. jurisdictions."
                },
                {
                    "factor": "Manifold’s Status",
                    "effect": "Neutral to slightly negative. There is no evidence Manifold has obtained regulatory approval or plans to offer real-money betting in 2025; the focus is entirely on Polymarket."
                }
            ],
            "no_scenario": "Despite Polymarket’s acquisition of a licensed exchange and CFTC no-action letter, one or more court injunctions or new regulatory actions from state authorities (e.g., a federal court upholds state-level bans, or a broad injunction is issued before December 31) block Polymarket’s ability to offer real-money markets to any U.S. residents before year's end. Alternatively, the planned October relaunch is delayed, or Polymarket restricts access to all U.S. states in response to legal threats, so no U.S. resident can legally bet with real money by December 31, 2025.",
            "yes_scenario": "Polymarket, having acquired QCEX and received a CFTC no-action letter, launches real-money markets for U.S. users in at least one state before December 31, 2025. Despite ongoing state-level legal battles, at least one state (likely Texas or similar) does not block access, and no new federal injunction invalidates the CFTC’s policy. Polymarket is able to publicly, legally offer real-money betting to U.S. residents—fulfilling the resolution criteria.",
            "final_reasoning": "The base rate for rapid policy change in U.S. financial/gambling regulation is low, but not negligible when (a) strong federal regulatory action occurs, and (b) a major platform obtains a CFTC license. News indicates that Polymarket, after a 2022 ban, has acquired a CFTC-regulated exchange (QCEX), received a no-action letter, and is publicly planning a U.S. relaunch with real money (USDC) in October 2025. This is a clear public change in federal policy/law, which meets the spirit and letter of the resolution criteria. However, there is significant, active resistance from state regulators and legal threats from the casino lobby. Multiple states have issued cease-and-desist orders against Kalshi and are likely to do so for Polymarket, but Kalshi recently prevailed in two states, and there is no evidence of a nationwide injunction or reversal of the CFTC’s policy. The fine print requires legality in at least one U.S. state (not all), and a public change in law/policy (not just a company’s internal risk tolerance). As of mid-October, there is no sign that the relaunch will be blocked nationwide before year-end, though legal battles may continue into 2026. The sharpest risk is a late-breaking injunction or a broad, preemptive court order, but such developments typically take months and have not materialized yet. Thus, there is a high, but not absolute, likelihood that Polymarket will be legally available for real-money betting to U.S. residents in at least one state before December 31, 2025.",
            "final_probability": 85
        },
        "Economics (BehavioralRegulationEconomics)": {
            "time_to_resolution": "Approximately 2.5 months (question resolves on Dec 31, 2025; today is Oct 17, 2025)",
            "perspective_relevance": "As an expert in Behavioral Regulation Economics, I focus on the interplay between market design, regulatory incentives, historical precedent for legalization, and the behavioral responses of regulators and market participants. My expertise allows me to dissect the incentives and frictions that drive regulatory change, the typical pace of regulatory risk tolerance, and how economic and political actors respond to disruptive financial technologies. This perspective is critical for understanding whether the combination of federal and state-level forces is likely to result in a public, legal real-money launch for platforms like Polymarket or Manifold in 2025.",
            "status_quo": "Prediction markets using real money, such as Polymarket and Manifold, are currently not legal for U.S. users. Kalshi is the only notable federally regulated (CFTC-approved) prediction market, but state-level legal challenges persist for sports and event betting. The default outcome is that no change occurs and Polymarket/Manifold remain unavailable to U.S. users for real-money betting; regulatory inertia is strong, and the U.S. is historically slow to legalize new gambling-like financial products.",
            "perspective_derived_factors": [
                {
                    "factor": "Federal Regulatory Breakthroughs",
                    "effect": "Strongly increases probability; Polymarket's acquisition of QCEX and receipt of a CFTC no-action letter, plus a designated contract market license, suggests a concrete regulatory path for legal operation in at least one state. This is a significant shift, as the CFTC is the key federal gatekeeper."
                },
                {
                    "factor": "State Regulatory Resistance",
                    "effect": "Moderately decreases probability; Despite federal authorization, multiple states (e.g., Nevada, New Jersey, Ohio) are actively challenging prediction markets’ legal status, especially for sports outcomes, with legal battles ongoing. State-level gambling regulation remains a major friction point."
                },
                {
                    "factor": "Political Economy and Industry Lobbying",
                    "effect": "Slightly decreases probability; Casino and lottery interests are lobbying hard against prediction markets, framing them as 'free riders.' The American Gaming Association is vociferously opposed. Such lobbying can slow or block implementation even after federal approval."
                },
                {
                    "factor": "Public Change in Law or Policy",
                    "effect": "Strongly increases probability; The fine print requires a clear public regulatory change—like a court decision, new law, or no-action letter. Polymarket’s acquisition and CFTC license, paired with a public plan to relaunch for U.S. users in October 2025, provides strong evidence that this resolution criterion may be met."
                },
                {
                    "factor": "Behavioral Inertia and Implementation Lag",
                    "effect": "Moderately decreases probability; Even with regulatory approval, platforms may face delays in implementation, legal challenges, or operational risk aversion. The status quo is sticky, and actual U.S. user onboarding with real money may slip into 2026."
                },
                {
                    "factor": "Manifold’s Regulatory Position",
                    "effect": "Neutral to slightly negative; There is no evidence of imminent regulatory change for Manifold. All movement is centered on Polymarket."
                }
            ],
            "no_scenario": "Despite Polymarket’s new CFTC license and no-action letter, state-level legal challenges result in injunctions that prevent any real-money launch in any state in 2025. Alternatively, operational or legal risk aversion causes Polymarket to delay onboarding U.S. users until 2026, or the requisite public regulatory action is ambiguous or insufficiently clear for Metaculus to resolve as Yes.",
            "yes_scenario": "Polymarket, having acquired QCEX and received a CFTC no-action letter and designated contract market license, publicly announces and executes a legal real-money launch for U.S. users in at least one state in 2025. There is a clear, documented change in law or policy (e.g., CFTC approval, court decision, or new legislation) that satisfies the question’s fine print. U.S. users are able to deposit and withdraw real money (fiat or USDC) for prediction markets on Polymarket before year-end.",
            "final_reasoning": "The base rate for U.S. legalization of real-money prediction markets is low, and the status quo has been persistent due to complex federal/state regulatory overlap and strong anti-gambling sentiment among some policymakers. However, the news flow offers strong evidence of a pivotal regulatory breakthrough: Polymarket has acquired a CFTC-licensed exchange (QCEX), received a CFTC no-action letter, and plans a U.S. relaunch in October 2025 with four contract types. This satisfies the fine print’s requirement for a public change in law or policy. While state-level resistance is nontrivial, recent federal court victories for prediction markets (Kalshi in Nevada and New Jersey) show a growing legal precedent for federal preemption, at least for non-sports event contracts. There is a risk that ongoing state-level legal actions could delay or block full access, but the question only requires legality in at least one state and a clear public regulatory action. Manifold is unlikely to be relevant, as there is no evidence of regulatory progress. The main residual risk is that operational, legal, or political complications delay the U.S. launch or that the regulatory action is deemed ambiguous. However, the weight of the evidence supports a high probability that Polymarket will offer legal real-money markets to U.S. users in 2025, meeting the resolution criteria.",
            "final_probability": 85
        },
        "Economics (PublicChoiceTheory)": {
            "time_to_resolution": "Approximately 2.5 months (until December 31, 2025)",
            "perspective_relevance": "As an expert in Public Choice Theory, I analyze how regulatory outcomes are shaped by the incentives, constraints, and interactions of regulators, industry stakeholders, politicians, and interest groups. This perspective is highly relevant because prediction market legalization hinges not just on technical compliance or market demand, but on the interplay between regulatory agencies (like the CFTC), state-level gambling regulators, federal and state politicians, and powerful industry and anti-gambling lobbies. The theory highlights status quo bias, bureaucratic risk aversion, the influence of concentrated interests (e.g., existing gambling operators), and the path-dependent nature of regulatory change.",
            "status_quo": "Prediction markets using real money (Polymarket, Manifold) are illegal for US users except for rare federally regulated exceptions (e.g., Kalshi, with limited contract types). Most states treat such platforms as illegal gambling unless specifically authorized. The CFTC and state regulators have historically been hostile or highly cautious, and meaningful legal acceptance has required explicit regulatory or legislative action.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent CFTC no-action letter and Polymarket acquisition of a federally licensed exchange (QCEX)",
                    "effect": "Strongly increases probability. The CFTC has explicitly issued a no-action letter in response to Polymarket's acquisition, and Polymarket is preparing a US relaunch with self-certified contracts. This is a public, formal regulatory action meeting the question's criteria for a \"change in law or policy\"."
                },
                {
                    "factor": "State-level resistance and ongoing legal battles",
                    "effect": "Moderately decreases probability. Despite federal approval, several states (e.g., Nevada, New Jersey, Ohio) are actively fighting to exclude prediction markets, issuing cease-and-desist orders and pursuing litigation. The interplay between federal preemption (CFTC authority) and state gambling law remains unresolved in courts, and some states are likely to continue legal challenges or block access."
                },
                {
                    "factor": "Political controversy and lobbying from entrenched gambling interests",
                    "effect": "Slightly decreases probability. Casinos and state-regulated gambling operators (and their associations) are lobbying aggressively against prediction markets, framing them as \"free riders\" that bypass existing gambling controls. This creates political risk, especially in a pre-midterm cycle."
                },
                {
                    "factor": "Public, high-profile institutional endorsements and partnerships (ICE, MetaMask, X, etc.)",
                    "effect": "Moderately increases probability. Major Wall Street players and tech firms are now invested and publicly supporting prediction markets, indicating a shift in legitimacy and providing political cover for regulators to allow these platforms."
                },
                {
                    "factor": "Base rates of regulatory inertia and status quo bias",
                    "effect": "Slightly decreases probability. Historically, rapid legal change is rare, even when industry and technology advance quickly. Regulatory adoption or reversal often lags demand and innovation by several years, especially in contentious areas like gambling/finance."
                },
                {
                    "factor": "Recent, public regulatory actions clearly meeting criteria",
                    "effect": "Strongly increases probability. The news explicitly states Polymarket has gained a designated contract market license and a CFTC no-action letter, paving the way for a US relaunch in October 2025 with real-money contracts. This is a public regulatory change, not merely a business decision."
                }
            ],
            "no_scenario": "Despite the CFTC's no-action letter and Polymarket's acquisition of a federal license, state-level legal challenges persist, and no US state allows Polymarket or Manifold to operate by the end of 2025. Court injunctions or state-level enforcement actions block access in all states, or the platforms delay their relaunch due to regulatory uncertainty, so there is no clear, public legal change enabling real-money betting during 2025.",
            "yes_scenario": "Polymarket, after acquiring QCEX and securing a CFTC no-action letter, publicly launches real-money prediction markets for US users in at least one state (even if some states continue to resist). This relaunch is widely covered, the regulatory action is public, and the platform allows legal fiat exchanges. The formal CFTC action, together with the platform's relaunch, constitutes a public change in law or government policy as defined by the resolution criteria.",
            "final_reasoning": "The public choice lens highlights that regulatory outcomes are shaped primarily by the incentives and constraints of regulators and interest groups. The single most important development is that Polymarket has acquired a CFTC-licensed exchange (QCEX) and has received a CFTC no-action letter, with explicit plans to relaunch for US users in October 2025. This is a public, formal change in regulatory policy, going beyond prior informal tolerance. Although state-level resistance remains and legal battles are ongoing, the question only requires legality in at least one US state and a public regulatory change. Federal preemption, as seen with Kalshi, sometimes overrides state objections (with courts recently ruling in Kalshi's favor in Nevada and New Jersey). Furthermore, the status quo is shifting rapidly, with major institutional investors and integration with high-profile tech platforms (ICE, MetaMask, X) increasing political cover for regulatory acceptance. While ongoing state-level pushback and lawsuits could still delay or cloud the issue, the overwhelming weight of recent news is that a qualifying legal/public regulatory change has already occurred or is imminent. Therefore, the probability of a 'Yes' outcome is very high, though not 100% due to potential last-minute legal obstacles or enforcement challenges.",
            "final_probability": 93
        }
    },
    "deliberation_probability": [
        86,
        85,
        93,
        92,
        95,
        85,
        95,
        85,
        85,
        93
    ],
    "deliberation_mean_probability": 89.4,
    "deliberation_sd": 4.526465385804788,
    "deliberation_probability_result": 89,
    "group_results": {
        "gamingregulationAmericangamingassociationstandards": {
            "forecaster_to_engage": "Law (StateGamblingLegislation)",
            "response_type": "critique",
            "response": "While the analysis accurately notes that state-level legal uncertainty and the short timeline introduce significant risk, it may overstate the likelihood of a last-minute state-level injunction or legal technicality blocking Polymarket in all jurisdictions. The news flow shows that federal preemption has recently been upheld in key cases (Kalshi in Nevada and New Jersey), and the regulatory threshold for the question is met if just one state allows legal operation. Furthermore, the CFTC's explicit no-action letter and DCM licensure for Polymarket—accompanied by a planned October US relaunch—represent a public, formal change in policy. Historically, once a federal regulator has taken such an explicit, public position, the odds of a total reversal within a two-month window are low, especially given the operational and legal momentum and the presence of major institutional investors. Therefore, while state-level resistance is real, the probability may be understated given the strong recent precedent for federal preemption and the question's relatively low bar (legality in one state)."
        },
        "gamingregulationStategamingcontrolcompliance": {
            "forecaster_to_engage": "USLegislativeAnalysis (FinancialTechnologyPolicy)",
            "response_type": "defense",
            "response": "This forecast correctly emphasizes the decisive importance of the CFTC no-action letter and Polymarket's acquisition of a federally regulated DCM as public changes in law or policy. From a state gaming control compliance perspective, the argument is further strengthened by the fine print: only one state needs to allow legal operation, and the recent court wins by Kalshi against state-level challenges indicate that a total, coordinated state-level blockade is unlikely. The acknowledgment of residual risk from last-minute litigation or regulatory reversals is appropriate, but the probability is well-calibrated given the operational momentum, investor confidence, and explicit federal regulatory endorsement. The selection of 92% reflects high—but not absolute—confidence, which is justified with the available evidence."
        },
        "uslegislativeanalysisLegislativeprocessus": {
            "forecaster_to_engage": "PoliticalScience (PolicyChangeTheory)",
            "response_type": "critique",
            "response": "While the analysis rightly highlights the base rate of slow regulatory change and the significance of the CFTC's recent actions, it could underweight the practical force of recent legal precedents affirming federal preemption in this domain. As a US legislative expert, I would stress that courts have already sided with federally regulated prediction markets in Nevada and New Jersey, making it less likely that state-level resistance will result in a complete nationwide blockade within 2025. Additionally, the forecast could put more weight on the operational and political momentum generated by major institutional investors and public endorsements. The risk of a late-breaking injunction is real but not as high as implied, especially given the explicit, formal regulatory steps already taken. Thus, the forecast's probability, while reasonably high, could be more assertive given the current legal and regulatory environment."
        },
        "uslegislativeanalysisFinancialtechnologypolicy": {
            "forecaster_to_engage": "GamingRegulation (StateGamingControlCompliance)",
            "response_type": "defense",
            "response": "This forecast appropriately recognizes that the acquisition of a DCM license and CFTC no-action letter for Polymarket are explicit, public changes in regulatory status—meeting the critical requirement for a 'Yes' outcome. The forecaster accurately weighs the persistent but diminishing risk from state-level resistance and acknowledges that only one state needs to allow legal operation for the question to resolve positively. From a US financial technology policy perspective, this balance is correct: while state pushback could delay or complicate launches in some jurisdictions, the federal regulatory momentum and operational plans for an October 2025 relaunch make it highly likely that at least one state will allow legal real-money betting on Polymarket. The probability estimate (85%) is well-calibrated, showing prudent caution but also reflecting the decisive regulatory shift at the federal level."
        },
        "lawUsfederalgamblinglaw": {
            "forecaster_to_engage": "PoliticalScience (RegulatoryPolitics)",
            "response_type": "defense",
            "response": "This forecast correctly identifies that the decisive legal shift is the CFTC’s no-action letter and Polymarket’s acquisition of a DCM license, which constitute the kind of public regulatory change required for this question’s resolution. The analysis effectively integrates the precedent set by Kalshi’s federal court wins, which support the conclusion that state-level challenges are unlikely to result in a total blockade in all states, especially given the relatively short time window remaining in 2025. The emphasis on the question’s low threshold—legality in any one state—is especially apt, as is the recognition that Manifold is not a relevant factor. The 95% probability is justified based on the explicit regulatory steps, imminent relaunch, and operational/institutional momentum. While there is always some risk of last-minute legal action or reversal, the assessment appropriately weighs this as a low-probability tail risk, leading to a well-supported, assertive forecast."
        },
        "lawStategamblinglegislation": {
            "forecaster_to_engage": "Economics (BehavioralRegulationEconomics)",
            "response_type": "defense",
            "response": "This forecast rightly recognizes that, despite a historically low base rate for new legal prediction markets in the US, the 2025 developments around Polymarket are exceptional. The acquisition of a CFTC-licensed exchange, a public no-action letter, and an imminent US relaunch are explicit, documented regulatory changes that satisfy the question’s fine print. From the perspective of state gambling law, the forecast’s emphasis on recent federal court victories for Kalshi in Nevada and New Jersey is particularly salient: these cases suggest federal preemption is likely to carry the day in at least some jurisdictions, making a complete state-level blockade less probable. The analysis is also accurate in noting that only one state’s legality is required for a Yes resolution, and that state-level resistance, while real, is unlikely to completely derail the process in the short time left. The identified risk of operational or legal delays is well-calibrated, and the probability estimate (85%) reflects a sound balance between regulatory progress and residual uncertainty."
        },
        "politicalscienceRegulatorypolitics": {
            "forecaster_to_engage": "USLegislativeAnalysis (LegislativeProcessUS)",
            "response_type": "defense",
            "response": "This forecast is strong in its weighting of recent, concrete regulatory changes—namely, Polymarket's CFTC no-action letter and acquisition of a licensed exchange—and its recognition that these satisfy the 'public change in law or policy' requirement. The analysis appropriately incorporates the significance of federal court victories (Kalshi) in establishing preemption over state-level resistance, and correctly highlights the short time frame and operational momentum. From a regulatory politics perspective, the acknowledgment of nonzero risk due to possible injunctions or delays is prudent, but the forecast doesn't overstate it. The probability chosen (93%) is assertive but not reckless, reflecting both the base rate shift and the remaining, if diminished, tail risks. The reasoning is coherent and grounded in both regulatory precedent and current events."
        },
        "politicalsciencePolicychangetheory": {
            "forecaster_to_engage": "Economics (PublicChoiceTheory)",
            "response_type": "critique",
            "response": "While the forecast insightfully highlights the impact of institutional incentives and the influence of major investors and tech partnerships on regulatory momentum, it may slightly underplay the persistent legal and political risks from state-level actors. The argument assumes that federal preemption—demonstrated by Kalshi's recent wins—will reliably override state resistance everywhere, but the news details ongoing and unresolved lawsuits in several states, with new cease-and-desist orders, and explicit requests from senators for CFTC justification. Public choice theory would also predict that entrenched interests (casinos, state lotteries, gaming commissions) may deploy last-minute political or legal tools to delay or muddy implementation, especially in the face of high-profile, controversial launches. The forecast could strengthen its analysis by acknowledging that, despite federal regulatory action and institutional support, state-level actors retain significant veto power that historically slows or fragments implementation, particularly in newly regulated gambling-like industries. Thus, an assertive probability above 90% may be slightly optimistic given the timeline and remaining sources of state-level risk."
        },
        "economicsBehavioralregulationeconomics": {
            "forecaster_to_engage": "GamingRegulation (AmericanGamingAssociationStandards)",
            "response_type": "defense",
            "response": "This forecast is compelling in its attention to both the explicit regulatory shift (CFTC no-action letter, DCM license, and Polymarket's announced relaunch) and the historical pattern of regulatory inertia in US gambling markets. The analysis correctly highlights that the requirement for only a single state to permit legal operation is a low bar, and recent federal preemption victories make a total state blockade unlikely. Importantly, the argument recognizes that the operational and legal momentum—bolstered by institutional investment and public endorsements—further reduces the risk of an abrupt reversal. The cautious note about last-minute injunctions is warranted, but the probability is appropriately assertive, given the public, formal regulatory changes and the short window left in 2025. The forecast demonstrates a balanced, well-calibrated assessment from a gaming regulation perspective."
        },
        "economicsPublicchoicetheory": {
            "forecaster_to_engage": "PoliticalScience (PolicyChangeTheory)",
            "response_type": "critique",
            "response": "Your forecast astutely acknowledges the historical base rate for slow regulatory change and the importance of public, formal regulatory action. However, from a Public Choice Theory standpoint, it slightly underestimates the self-reinforcing effect of institutional momentum and the political cost of reversal once major stakeholders (ICE, X, MetaMask, high-profile investors) have publicly committed, and the CFTC has acted. While you are correct to note that state-level actors may still deploy resistance, recent federal preemption victories (Kalshi in Nevada and New Jersey) signal that the window for successful broad state obstruction within the 2025 timeline is closing rapidly. Public choice logic suggests that, with federal regulators, large financial interests, and technology platforms now aligned, the capacity and willingness of state actors to unilaterally block all access is sharply diminished—especially given the low bar of needing just one compliant state. Thus, the tail risk is real but increasingly marginal, and a slightly more assertive probability may be warranted."
        }
    },
    "revision_results": {
        "GamingRegulation (AmericanGamingAssociationStandards)": {
            "my_phase1_final_probability": 86,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, particularly the legal and legislative perspectives, I see a consistent, strong consensus: the CFTC no-action letter and acquisition of a DCM license by Polymarket represent a decisive public change in federal regulatory policy. The main risk remains state-level legal action, but recent federal court precedents (Kalshi in Nevada/NJ) and the question's low bar (legal in just one state) decrease the likelihood of a total nationwide block. The risks of operational or legal delays in the very short remaining timeframe (2.5 months) are real but not large enough to justify a major adjustment downward. However, seeing most other well-argued forecasts cluster slightly higher (92–95%), and considering my critique that state-level resistance is unlikely to create a total block on legality, I will modestly increase my probability. I now assess the chance at 91%, reflecting that federal regulatory changes are usually sticky and the operational launch is imminent, but leaving room for nonzero last-minute legal or technical setbacks.",
            "revised_probability": 91
        },
        "GamingRegulation (StateGamingControlCompliance)": {
            "my_phase1_final_probability": 85,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, particularly the critique of the degree of risk posed by state-level legal action and the defense of high probabilities based on federal preemption and explicit regulatory action, I find that my original probability was slightly conservative. The consensus among experts from legal, legislative, and regulatory perspectives is that the explicit CFTC no-action letter and DCM licensure constitute a decisive, public regulatory change. The recent federal court victories for Kalshi further reduce the likelihood of a complete state-level blockade, and the fine print only requires legality in one state. The probability of a last-minute, nationwide reversal or operational failure before year-end is extremely low given the legal and operational momentum. Given these factors and the short time window, I am raising my probability to better reflect the strength of the evidence and consensus.",
            "revised_probability": 90
        },
        "USLegislativeAnalysis (LegislativeProcessUS)": {
            "my_phase1_final_probability": 93,
            "reasoning_for_revised_probability": "Having reviewed the group deliberation, I find strong consensus among experts across legal, regulatory, and political science perspectives that the decisive regulatory hurdle—CFTC licensure and no-action letter—has been cleared, and that recent federal court decisions (especially in Nevada and New Jersey) further diminish the odds of a comprehensive state-level blockade by year-end. The group discussion also reinforced that the question's threshold is relatively low: legality in just one state following a public change in law or policy. While state-level pushback and the short timeline still introduce some risk, the shared view is that operational, legal, and institutional momentum make a last-minute reversal or nationwide injunction increasingly unlikely. My critique of a slightly more cautious forecast suggested I may be underweighting the force of federal preemption and recent legal victories. Given this, I am incrementally increasing my probability to better reflect the now even narrower band of plausible 'No' scenarios.",
            "revised_probability": 95
        },
        "USLegislativeAnalysis (FinancialTechnologyPolicy)": {
            "my_phase1_final_probability": 92,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, my confidence in the original probability is reinforced rather than diminished. Multiple forecasters across legal, regulatory, and political science domains independently converged on a high likelihood, all citing the decisive importance of the CFTC's no-action letter, Polymarket's DCM acquisition, and the October 2025 relaunch. Importantly, both defenses and critiques highlighted that, while state-level resistance is nontrivial, federal preemption has recently prevailed in key legal cases. The resolution criteria require only one state to allow operation following a public regulatory change, and there is no indication of a nationwide injunction or coordinated state-level blockade materializing within the remaining timeframe. The critique of the risk of last-minute legal action is well-taken, but the operational, legal, and investor momentum, along with explicit regulatory action, makes a complete reversal highly unlikely. Manifold remains a non-factor. Thus, my Phase 1 forecast remains well-calibrated and appropriate.",
            "revised_probability": 92
        },
        "Law (USFederalGamblingLaw)": {
            "my_phase1_final_probability": 95,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I find my initial reasoning remains strongly supported. Multiple forecasters across policy, legal, regulatory, and economic domains converge on the decisive importance of Polymarket's acquisition of a CFTC-licensed exchange and receipt of a no-action letter as explicit public changes in federal regulatory policy. There is broad consensus that the bar for resolution is legality in any one state, and recent federal court precedents (Kalshi) further reduce the risk of a total state-level blockade. The remaining risks—last-minute litigation, regulatory reversal, or operational delay—are consistently characterized as low-probability tail events. The group slightly underweights these risks in some cases, but overall the consensus justifies a very high, but not absolute, probability. Therefore, I will not revise my probability, as 95% remains the most justified estimate given all evidence and arguments.",
            "revised_probability": 95
        },
        "Law (StateGamblingLegislation)": {
            "my_phase1_final_probability": 85,
            "reasoning_for_revised_probability": "Group deliberation strengthened my initial assessment that the legal and regulatory environment has shifted decisively in favor of a Yes outcome, with most experts converging on 85-95%, some going even higher. Critiques of my original forecast argue that I may have slightly overstated the risk of a last-minute, blanket state-level injunction preventing Polymarket from legally operating in at least one state, given recent court precedents for federal preemption and the explicit, public nature of the CFTC actions. Defenses of similar forecasts reaffirm that the regulatory threshold for a Yes is already met or will be upon relaunch, and that state-level resistance is unlikely to result in a total, immediate blockade. Given this, and the operational/institutional momentum, I am persuaded to increase my estimate moderately—recognizing that while some residual legal/timing risk remains, it is smaller than I initially weighted.",
            "revised_probability": 90
        },
        "PoliticalScience (RegulatoryPolitics)": {
            "my_phase1_final_probability": 95,
            "reasoning_for_revised_probability": "The group deliberation reinforced my initial assessment that the regulatory threshold for a 'Yes' resolution has been met, given Polymarket's acquisition of a CFTC-licensed exchange and public no-action letter, with imminent plans for a US relaunch. Other forecasters with expertise in state gaming law, regulatory compliance, and legislative analysis largely converged in the high 85-95% range, citing similar reasoning about the sufficiency of federal action and the low likelihood of a total state-level blockade within the year. Critiques focused on whether the risk of a last-minute injunction or reversal was understated or overstated, but no new evidence emerged suggesting a significant increase in that risk. The group consensus and strong legal and operational momentum support maintaining a very high probability. Therefore, I see no compelling basis to revise my forecast.",
            "revised_probability": 95
        },
        "PoliticalScience (PolicyChangeTheory)": {
            "my_phase1_final_probability": 85,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I note that nearly all expert forecasters—across legal, political, economic, and regulatory domains—converge on a high probability for Yes, typically in the 85–95% range. The strongest arguments for an even higher probability emphasize the explicit, public, and recent nature of the CFTC's no-action letter and DCM license for Polymarket, the announced October 2025 relaunch, increasing legal precedent for federal preemption (Kalshi wins), and the resolution criteria's low bar (legality in just one state). Critiques of my initial caution suggest that the likelihood of a last-minute, nationwide state-level injunction or operational delay is lower than I initially weighted, given both the short timeline and the operational momentum. The risk from state-level resistance remains nonzero but is less acute given recent court decisions and the practical difficulties of organizing a total blockade before year-end. Given this, I am persuaded to raise my probability to align more closely with assertive, well-justified peer forecasts.",
            "revised_probability": 92
        },
        "Economics (BehavioralRegulationEconomics)": {
            "my_phase1_final_probability": 85,
            "reasoning_for_revised_probability": "The group deliberation reinforced my initial reasoning, with nearly all forecasters converging on a high probability (85-95%) and citing the same critical regulatory milestones: Polymarket’s CFTC no-action letter, DCM acquisition, and imminent US relaunch. Arguments critiquing caution regarding state-level resistance (notably from the GamingRegulation/AmericanGamingAssociationStandards perspective) made a strong case that, given federal preemption precedents and the low bar of legality in any one state, the risk of a full nationwide legal blockade within the remainder of 2025 is even lower than I initially weighted. The consensus is that the regulatory and operational evidence for a 'Yes' is overwhelming, with only minor tail risks (e.g., a sudden injunction or technical delay). To better reflect the recent, decisive public regulatory changes and operational momentum, I am increasing my probability slightly.",
            "revised_probability": 90
        },
        "Economics (PublicChoiceTheory)": {
            "my_phase1_final_probability": 93,
            "reasoning_for_revised_probability": "The group deliberation largely validated my initial assessment: nearly all forecasters, across legal, regulatory, and economic specialties, converged on a very high probability (85–95%) for a Yes outcome, emphasizing the decisive nature of the CFTC's no-action letter, Polymarket's DCM license, and imminent relaunch. Critiques centered on whether state-level resistance could still present material tail risk, but consensus held that federal preemption plus the low bar of 'at least one state' makes a total blockade unlikely. My own critique and others' feedback highlighted that, while state-level legal action persists, the likelihood of it derailing all access before year-end is increasingly remote. Conversely, some forecasters slightly underweighted the latent power of entrenched state interests, but not enough to justify a material reduction. Given the extraordinary institutional and regulatory momentum—and the public, formal change in federal policy—my confidence is reinforced. I see no compelling reason to move outside my original 93%, which is already highly assertive yet allows for nonzero last-minute delay risk.",
            "revised_probability": 93
        }
    },
    "revision_probability": [
        91,
        90,
        95,
        92,
        95,
        90,
        95,
        92,
        90,
        93
    ],
    "revision_mean_probability": 92.3,
    "revision_sd": 2.1108186931983415,
    "revision_probability_result": 92,
    "question_details": {
        "id": 38762,
        "title": "Will real-money betting on Polymarket or Manifold become legal in the United States in 2025?",
        "created_at": "2025-08-31T05:07:39.122180Z",
        "open_time": "2025-10-16T03:29:00Z",
        "cp_reveal_time": "2025-10-16T04:59:00Z",
        "spot_scoring_time": "2025-10-16T04:59:00Z",
        "scheduled_resolve_time": "2026-01-01T10:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-10-16T04:59:00Z",
        "actual_close_time": "2025-10-16T04:59:00Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "This question is synced with an identical question on Metaculus. The original question opened on 2025-01-10 20:43:00 and can be found [here](https://www.metaculus.com/questions/31340). This question will resolve to the same value as the synced question. The original question's background info at this time is below. \n\n[Prediction markets](https://en.wikipedia.org/wiki/Prediction_market) are exchange-traded markets established for trading bets in the outcome of various events. These could range from the [winner of the US presidential election](https://polymarket.com/event/presidential-election-winner-2024) to [bird flu being designated a pandemic](https://kalshi.com/markets/kxnewoutbreakph5n1/new-bird-flu-pandemic) or [an AI winning the International Mathematical Olympiad](https://manifold.markets/Austin/will-an-ai-get-gold-on-any-internat). Similar to Metaculus, prediction markets harness the wisdom of the crowds to provide [accurate](https://www.astralcodexten.com/p/prediction-market-faq) probabilistic estimates for future events.\n\nPrediction markets are tightly controlled in the US, with very few of them (e.g., [Kalshi](https://kalshi.com/)) being approved by the CFTC. The largest prediction market as of the writing of this question, [Polymarket](https://en.wikipedia.org/wiki/Polymarket) was fined by the CTFC in 2022 and stopped offering access to US customers. Another large prediction market, [Manifold](https://manifold.markets/) allows users to bet almost exclusively using play money.\n\n`{\"format\":\"metac_closes_in_period\",\"info\":{\"post_id\":31340,\"question_id\":30969}}`",
        "resolution_criteria": "This question will resolve as **Yes** if, in the calendar year 2025, Polymarket or Manifold can legally offer markets in the United States using real money.",
        "fine_print": "* This has to be legal in at least one US state.\n* A public change in law or government policy must occur for this to resolve as **Yes**, which could include but is not limited to court decisions, public CFTC [<u>no-action letters</u>](https://www.cftc.gov/LawRegulation/CFTCStaffLetters/index.htm), executive orders, or new laws. For example, if Manifold or Polymarket were to decide to accept risk under the status quo, satisfying the other criteria with no preceding change in law or government policy, that would not be sufficient. In the event the circumstances are unclear Metaculus may resolve the question as **ambiguous**.\n* For the purposes of this question, real money includes anything that can be legally exchanged for fiat currency. For example, if Polymarket launched \"Polymarket chips\" that one could at any point legally both buy and sell using USD and it was legal to bet on Polymarket using those chips, this question would resolve as **Yes** (in the same way that gambling in a casino with chips is gambling with real money). Similarly any legal cryptocurrencies or crypto tokens (e.g., USDC) would resolve this question as **Yes**.\n* If Polymarket or Manifold markets operate using a custom currency (e.g., Manifold sweepcash), to resolve as **Yes** they have to explicitly state that users can exchange fiat currency for the custom currency and vice versa. Manifold's workaround that gives \"free\" sweepcash for mana purchases does not suffice to resolve this question as **Yes**.&#x20;\n* Polymarket or Manifold restricting withdrawals only to money that has been previously traded would *not* prevent this question from resolving as **Yes**. A restriction that would allow only money that has been won from a market resolution to be withdrawn, however, *would* prevent this question from resolving as **Yes**.",
        "post_id": 39385,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**What are Prediction Markets? The Future of Real-time Trading and Forecasting**\nPolymarket, a decentralized prediction market platform built on the Polygon blockchain, has gained significant attention from Wall Street following a US$2 billion investment by Intercontinental Exchange (ICE), the parent company of the New York Stock Exchange. The partnership positions ICE as a global distributor of Polymarket’s event-driven data, providing institutional clients with real-time market sentiment indicators. ICE and Polymarket also plan to collaborate on tokenization initiatives integrating prediction market data with DeFi technologies. Polymarket operates on a non-custodial, trustless model using smart contracts and the USDC stablecoin, enabling transparent, censorship-resistant trading on real-world events. Its popularity surged during the 2024 US presidential election cycle, with daily trading volumes spiking during key events like the June 2024 presidential debate and the assassination attempt on Donald Trump. By early September 2024, the presidential winner market alone processed hundreds of millions in trading volume. The platform also saw viral engagement from pop culture events, such as Taylor Swift’s engagement to Travis Kelce. Despite a 2022 CFTC enforcement action that led to blocking US users and a US$1.4 million penalty, Polymarket regained regulatory approval after acquiring QCX for US$112 million in Q3 2025, securing a designated contract market license. It now plans to relaunch for US users in October 2025 with four self-certified contract types. While Polymarket is decentralized and international, its main competitor Kalshi, a regulated centralized exchange based in the US, surpassed it in trading volume and market share by September 2025, holding 66% of the global market. Kalshi’s growth is driven by its compliance with US regulations and its focus on real-money contracts. Both platforms are expanding through strategic partnerships—Elon Musk and Donald Trump Jr. have endorsed Polymarket, with X naming it its official prediction market partner in June 2025, and MetaMask planning native integration in 2025. The ICE-Polymarket deal marks a pivotal moment for decentralized forecasting, signaling institutional adoption and the potential integration of real-time event data into mainstream financial strategy.\nOriginal language: en\nPublish date: October 15, 2025 09:22 PM\nSource:[NASDAQ Stock Market](https://www.nasdaq.com/articles/what-are-prediction-markets-future-real-time-trading-and-forecasting)\n\n**Prediction markets grow as alternative to casinos**\nPrediction markets have surged in popularity in recent years, challenging traditional casinos amid declining tourism in Las Vegas. Kalshi, one of the two largest players alongside Polymarket, operates under federal regulation by the Commodity Futures Trading Commission (CFTC), allowing it to bypass state-level gambling authorities—even in states where sports betting is illegal. Kalshi recently won two lawsuits in Nevada and New Jersey, affirming its right to operate outside state regulation. The company has a $5 billion valuation, up from $2 billion just three months prior, while Polymarket has grown eightfold since a $1 billion valuation in August. Total trades on Kalshi reached $300 million last year, with projections of over $50 billion in trading volume by 2025. The American Gaming Association, led by CEO Bill Miller, criticizes prediction markets as 'free riders' undermining state-regulated gambling, and companies like Kalshi were excluded from the G2E gaming conference. Despite legal uncertainty, prediction markets are gaining credibility: during the 2024 U.S. presidential election, Kalshi projected Donald Trump with over 60% odds, outperforming split polls. Wayne Winegarden, a senior fellow at the Pacific Research Institute, argues that prediction markets offer greater accuracy than traditional polls and give participants 'skin in the game.' Donald Trump Jr. has become an adviser to both Kalshi and Polymarket following his father’s 2024 election victory.\nOriginal language: en\nPublish date: October 15, 2025 06:15 PM\nSource:[The Center Square: Nevada](https://www.thecentersquare.com/nevada/article_86022fcb-434e-4240-bbce-4641cc7b84e2.html?a)\n\n**Potential Nobel Peace Prize Betting Scandal: Norway Investigates Suspicious Polymarket Activity - Brave New Coin**\nNorwegian authorities are investigating suspicious activity on the crypto prediction platform Polymarket, where three accounts—'dirtycup', '6741', and 'GayPride'—placed large bets on Venezuelan opposition leader María Corina Machado winning the 2025 Nobel Peace Prize, earning combined profits of approximately $90,000. The bets were placed hours before the official announcement on October 10, 2025, with Machado’s odds on Polymarket surging from 3.6% to over 70% within hours. The accounts were newly created with no prior trading history, raising concerns about information leaks. Kristian Berg Harpviken, director of the Norwegian Nobel Institute, stated that espionage is 'highly likely' the cause, rather than an internal leak, noting that the Nobel Committee’s selection process involves only five members and is kept secret for decades. Nobel Committee Chairman Jørgen Watne Frydnes affirmed there has never been a confirmed leak in the prize’s history. The incident occurred amid Polymarket’s $2 billion investment by Intercontinental Exchange, valuing the platform at $9 billion, and its return to U.S. markets after a 2022 $1.4 million fine for operating without registration. Polymarket’s terms do not prohibit insider trading, creating a regulatory blind spot. The platform processed over $6 billion in trades in the first half of 2025 and has drawn scrutiny for predicting high-stakes events with unusual accuracy. The Nobel Peace Prize market alone saw $21.4 million in trading volume from July to October 2025. With competitors like Kalshi capturing over 60% of the global prediction market share and $50 billion in annual volume, the industry is growing rapidly. The case marks the first known instance of a blockchain-based prediction market potentially exposing confidential information from a major international institution, raising urgent questions about information security, regulatory oversight, and the ethics of prediction markets. Machado, 58, was awarded the prize for her work promoting democracy in Venezuela, having founded Súmate in 2002 and enduring threats while living in hiding after being barred from the 2024 presidential election. The Norwegian Nobel Institute continues its internal review and plans to strengthen security, though it maintains external espionage is more probable than an internal breach. Neither Polymarket nor the Nobel Institute has issued detailed public statements, and attempts to contact the traders have failed.\nOriginal language: en\nPublish date: October 14, 2025 09:20 PM\nSource:[Brave New Coin](https://bravenewcoin.com/insights/potential-nobel-peace-prize-betting-scandal-norway-investigates-suspicious-polymarket-activity)\n\n**Kalshi and Polymarket valuations exceed $5bn and $8bn**\nPrediction markets Kalshi and Polymarket have achieved valuations of $5 billion and $8 billion, respectively, driven by strong investor confidence despite ongoing regulatory challenges. Kalshi, which is regulated by the U.S. Commodity Futures Trading Commission (CFTC), announced a global expansion to over 140 countries, excluding Bulgaria, France, Poland, Russia, Ukraine, the UK, Australia, and Canada. This move creates a unified global liquidity pool, a unique feature distinguishing it from fragmented regional platforms. Kalshi raised $300 million in a Series D round led by Andreessen Horowitz and Sequoia Capital, with its founders emphasizing compliance and licensure as key to building trust. Polymarket, after exiting the U.S. in 2022 due to CFTC settlement, has since re-entered via acquisition and secured a $2 billion investment from Intercontinental Exchange (ICE), boosting its valuation to $8 billion. The partnership enables ICE to distribute Polymarket’s event-driven data and collaborate on blockchain initiatives. Both platforms face scrutiny over ethical concerns, such as a spike in bets on Maria Corina Machado winning the Nobel Peace Prize, prompting an official investigation and speculation of data leaks. Regulatory environments remain inconsistent: some countries classify prediction markets as gambling, while others treat them as financial instruments. Despite this, platforms see global growth potential, with Allwyn (UK Lottery operator) acquiring PrizePicks to expand into the U.S. predictions market. Kalshi asserts that 'events don't stop at borders, and now, neither does trading on them,' highlighting the cross-border relevance of prediction markets for elections, central bank decisions, sports, and climate events.\nOriginal language: en\nPublish date: October 14, 2025 07:00 AM\nSource:[SBC News](https://sbcnews.co.uk/featurednews/2025/10/14/kalshi-polymarket-growth/)\n\n**Senate Dems submit crypto market structure proposal, world ends**\nSenate Democrats have submitted the Responsible Financial Innovation Act (RFIA), a comprehensive proposal aimed at regulating the crypto market structure, which has sparked strong reactions from the crypto industry and state gaming regulators. The RFIA builds on the CLARITY Act but introduces significant changes, including requiring 'front-end providers' to implement Know Your Customer (KYC) protocols and granting the Treasury Department authority to regulate individuals with 'sufficient influence' in decentralized finance (DeFi) protocols—defined at Treasury’s discretion. The proposal has drawn opposition from banks and DeFi advocates, particularly over concerns about 'yield-bearing' stablecoins, with Senator Elizabeth Warren and others pushing for legislative action. Meanwhile, Coinbase has limited USDC rewards, secured New York staking approval, and is preparing to launch its Base token, with staking now legal in all but four U.S. states (California, New Jersey, Maryland, and Wisconsin). In a related development, MetaMask’s integration with Polymarket—allowing users to trade in sports, crypto, and politics within the platform—has angered state gaming regulators, especially as Polymarket and rival Kalshi operate in states where online sports betting is illegal. Nevada regulators issued a cease-and-desist order against Kalshi, which is licensed by the Commodity Futures Trading Commission (CFTC), prompting a preliminary injunction and ongoing legal battles. Other states have followed suit with similar orders, some favoring Kalshi, others not. U.S. senators have written to CFTC acting chair Caroline Pham, demanding clarification on why the CFTC permits such cross-state prediction market operations, arguing it undermines state and tribal authority over sports betting. The senators have requested a response by October 30, 2025. The legislative process faces delays, with Senator Steil warning that approaching the 2026 midterm elections could make passage increasingly difficult. The debate reflects deep divisions over regulatory authority, innovation, and jurisdiction in the evolving digital asset landscape.\nOriginal language: en\nPublish date: October 10, 2025 11:00 AM\nSource:[coingeek.com](https://coingeek.com/senate-dems-submit-crypto-market-structure-proposal-world-ends/)\n\n**What are Prediction Markets? The Future of Real-time Trading and Forecasting**\nPolymarket, a decentralized prediction market platform built on the Polygon blockchain, has gained significant attention from Wall Street following a US$2 billion investment by Intercontinental Exchange (ICE), the parent company of the New York Stock Exchange. The partnership positions ICE as a global distributor of Polymarket’s event-driven data, providing institutional clients with real-time market sentiment indicators. ICE and Polymarket also plan to collaborate on tokenization initiatives integrating prediction market data with DeFi technologies. Polymarket operates on a non-custodial, trustless model using smart contracts and the USDC stablecoin, enabling transparent, censorship-resistant trading on real-world events. Its popularity surged during the 2024 US presidential election cycle, with daily trading volumes spiking during key events like the June 2024 presidential debate and the assassination attempt on Donald Trump. By early September 2024, the presidential winner market alone processed hundreds of millions in trading volume. The platform also saw viral engagement from pop culture events, such as Taylor Swift’s engagement to Travis Kelce. Despite a 2022 CFTC enforcement action that led to blocking US users and a US$1.4 million penalty, Polymarket regained regulatory approval after acquiring QCX for US$112 million in Q3 2025, securing a designated contract market license. It now plans to relaunch for US users in October 2025 with four self-certified contract types. While Polymarket is decentralized and international, its main competitor Kalshi, a regulated centralized exchange based in the US, surpassed it in trading volume and market share by September 2025, holding 66% of the global market. Kalshi’s growth is driven by its compliance with US regulations and its focus on real-money contracts. Both platforms are expanding through strategic partnerships—Elon Musk and Donald Trump Jr. have endorsed Polymarket, with X naming it its official prediction market partner in June 2025, and MetaMask planning native integration in 2025. The ICE-Polymarket deal marks a pivotal moment for decentralized forecasting, signaling institutional adoption and the potential integration of real-time event data into mainstream financial strategy.\nOriginal language: en\nPublish date: October 15, 2025 09:22 PM\nSource:[NASDAQ Stock Market](https://www.nasdaq.com/articles/what-are-prediction-markets-future-real-time-trading-and-forecasting)\n\n**Prediction markets grow as alternative to casinos**\nPrediction markets have surged in popularity in recent years, challenging traditional casinos amid declining tourism in Las Vegas. Kalshi, one of the two largest players alongside Polymarket, operates under federal regulation by the Commodity Futures Trading Commission (CFTC), allowing it to bypass state-level gambling authorities—even in states where sports betting is illegal. Kalshi recently won two lawsuits in Nevada and New Jersey, affirming its right to operate outside state regulation. The company has a $5 billion valuation, up from $2 billion just three months prior, while Polymarket has grown eightfold since a $1 billion valuation in August. Total trades on Kalshi reached $300 million last year, with projections of over $50 billion in trading volume by 2025. The American Gaming Association, led by CEO Bill Miller, criticizes prediction markets as 'free riders' undermining state-regulated gambling, and companies like Kalshi were excluded from the G2E gaming conference. Despite legal uncertainty, prediction markets are gaining credibility: during the 2024 U.S. presidential election, Kalshi projected Donald Trump with over 60% odds, outperforming split polls. Wayne Winegarden, a senior fellow at the Pacific Research Institute, argues that prediction markets offer greater accuracy than traditional polls and give participants 'skin in the game.' Donald Trump Jr. has become an adviser to both Kalshi and Polymarket following his father’s 2024 election victory.\nOriginal language: en\nPublish date: October 15, 2025 06:15 PM\nSource:[The Center Square: Nevada](https://www.thecentersquare.com/nevada/article_86022fcb-434e-4240-bbce-4641cc7b84e2.html?a)\n\n**Pyth Network and Kalshi to Enable Real-Time Prediction Market Data Onchain**\nPyth Network has partnered with Kalshi, a U.S. federally regulated event-exchange platform, to deliver real-time prediction market data onchain across more than 100 blockchains, marking the first large-scale onchain streaming of regulated event data. This integration enables web3 developers, institutions, and decentralized protocols to build applications using real-time probabilities of future outcomes in areas such as politics, economics, sports, crypto, and culture. Kalshi, regulated by the CFTC, provides credibility, oversight, and scale, positioning event-driven data as a foundational component of DeFi. The collaboration follows Kalshi’s expansion to 140 countries and a $300 million funding round at a $5 billion valuation. Mike Cahill, CEO of Douro Labs and Pyth contributor, noted that prediction markets have become powerful tools for translating expectations into real-time prices, especially during high-profile events like the 2024 U.S. presidential election. Live Kalshi markets are now accessible via Pyth, with 0xUltra stating that oracles are the first step in bringing Kalshi onchain, enabling builders to implement their ideas on the 'world computer.' This development follows Pyth’s launch of Pyth Pro, a subscription service for institutional-grade market data, and a partnership with Blue Ocean Technologies to deliver SEC-registered U.S. equity pricing during critical after-hours trading via Blue Ocean ATS.\nOriginal language: en\nPublish date: October 15, 2025 02:37 AM\nSource:[Crowdfund Insider](https://www.crowdfundinsider.com/2025/10/254542-pyth-network-and-kalshi-to-enable-real-time-prediction-market-data-onchain/)\n\n**Potential Nobel Peace Prize Betting Scandal: Norway Investigates Suspicious Polymarket Activity - Brave New Coin**\nNorwegian authorities are investigating suspicious activity on the crypto prediction platform Polymarket, where three accounts—'dirtycup', '6741', and 'GayPride'—placed large bets on Venezuelan opposition leader María Corina Machado winning the 2025 Nobel Peace Prize, earning combined profits of approximately $90,000. The bets were placed hours before the official announcement on October 10, 2025, with Machado’s odds on Polymarket surging from 3.6% to over 70% within hours. The accounts were newly created with no prior trading history, raising concerns about information leaks. Kristian Berg Harpviken, director of the Norwegian Nobel Institute, stated that espionage is 'highly likely' the cause, rather than an internal leak, noting that the Nobel Committee’s selection process involves only five members and is kept secret for decades. Nobel Committee Chairman Jørgen Watne Frydnes affirmed there has never been a confirmed leak in the prize’s history. The incident occurred amid Polymarket’s $2 billion investment by Intercontinental Exchange, valuing the platform at $9 billion, and its return to U.S. markets after a 2022 $1.4 million fine for operating without registration. Polymarket’s terms do not prohibit insider trading, creating a regulatory blind spot. The platform processed over $6 billion in trades in the first half of 2025 and has drawn scrutiny for predicting high-stakes events with unusual accuracy. The Nobel Peace Prize market alone saw $21.4 million in trading volume from July to October 2025. With competitors like Kalshi capturing over 60% of the global prediction market share and $50 billion in annual volume, the industry is growing rapidly. The case marks the first known instance of a blockchain-based prediction market potentially exposing confidential information from a major international institution, raising urgent questions about information security, regulatory oversight, and the ethics of prediction markets. Machado, 58, was awarded the prize for her work promoting democracy in Venezuela, having founded Súmate in 2002 and enduring threats while living in hiding after being barred from the 2024 presidential election. The Norwegian Nobel Institute continues its internal review and plans to strengthen security, though it maintains external espionage is more probable than an internal breach. Neither Polymarket nor the Nobel Institute has issued detailed public statements, and attempts to contact the traders have failed.\nOriginal language: en\nPublish date: October 14, 2025 09:20 PM\nSource:[Brave New Coin](https://bravenewcoin.com/insights/potential-nobel-peace-prize-betting-scandal-norway-investigates-suspicious-polymarket-activity)\n\n**Massachusetts Responds After Robinhood Requests Injunction**\nThe state of Massachusetts has formally opposed Robinhood's motion for a preliminary injunction seeking to block enforcement of its state gambling laws. Robinhood argues that its event-based trading platform, which includes sports outcome contracts, falls under federal commodities law and should be exempt from state regulation. Massachusetts rejected this claim, calling Robinhood's reasoning 'smoke and mirrors' and citing federal court rulings that affirm state authority over gambling regulation. The state referenced a prior case involving Crypto.com, which was barred from offering sports bets in Nevada, and emphasized that states retain the right to independently define gambling, despite Robinhood's assertion that federal law preempts state rules. A similar legal conflict is unfolding in Ohio, where Kalshi has sued the Ohio Casino Control Commission and state attorney general, claiming that Ohio's cease-and-desist actions and warnings to licensed sportsbooks unlawfully blocked its access to users and partners. Kalshi contends its markets are federally regulated by the Commodity Futures Trading Commission (CFTC) and seeks an injunction before October 20 to halt further enforcement. Ohio officials maintain that only licensed operators may conduct sports wagering in the state. Separately, the Massachusetts Gaming Commission (MGC) fined DraftKings $450,000 in August for accepting 1,160 unlawful credit card bets totaling over $83,000 between March 2023 and February 2024. The violations, affecting 218 customers and 242 deposits, were attributed to systemic failures in communication and coordination among DraftKings’ compliance, licensing, and product teams, despite the company’s voluntary disclosure.\nOriginal language: en\nPublish date: October 14, 2025 02:14 PM\nSource:[Covers.com](https://www.covers.com/industry/massachusetts-responds-after-robinhood-requests-injunction-oct-14-2025)\n\n**Investigation Launched into Polymarket Betting on 2025 Nobel Peace Prize Winner**\nNorwegian authorities have launched an investigation into betting activities on the prediction platform Polymarket related to the 2025 Nobel Peace Prize winner, María Corina Machado, amid concerns of potential espionage. Data from Polymarket revealed that a user named 'dirtycup' earned over $30,000 from bets totaling approximately $70,000 on Machado. Three accounts collectively made around $90,000 in profits from similar wagers. The Norwegian Nobel Institute, which supports the Nobel Committee, is examining reports that betting volumes surged sharply before the announcement, raising suspicions of insider information being exploited. Machado, recognized for her democratic advocacy in Venezuela, previously praised Bitcoin (BTC) as a 'lifesaver' during hyperinflation, enabling citizens to protect wealth and fund escapes. Polymarket, launched in 2020, allows users to bet on diverse events, including Nobel Prizes and music sales. Last week, Intercontinental Exchange (ICE), the parent company of the New York Stock Exchange, invested $2 billion in Polymarket, signaling major growth. The U.S. Commodity Futures Trading Commission (CFTC) issued a no-action letter, allowing Polymarket to operate without mandatory data reporting, effectively granting regulatory approval for its U.S. launch. Shayne Coplan, Polymarket’s CEO, reportedly became a billionaire following the ICE investment. The platform has also gained cultural attention, being parodied in the TV series South Park, which humorously depicted prediction markets and U.S. regulatory oversight—ironically, some of its fictional predictions were later listed on Polymarket.\nOriginal language: de\nPublish date: October 14, 2025 02:08 PM\nSource:[Cointelegraph](https://de.cointelegraph.com/news/wetten-friedensnobelpreis-untersuchung-polymarket)\n\n**The Silent Gold Rush of Polymarket: How Sharp Traders Achieve Risk-Free Profits**\nOn Polymarket, sophisticated traders are generating risk-free profits by exploiting pricing inefficiencies through arbitrage strategies, capitalizing on fleeting market imbalances. The platform’s decentralized prediction market enables risk-free gains when the sum of outcome probabilities falls below $1.00—such as a total of $0.995 across four possible results—allowing traders to buy all outcomes and guarantee a 0.5% profit upon resolution. This strategy, though small in percentage, becomes highly lucrative at scale: a trader investing $10,000 and executing dozens of such trades daily could achieve substantial annual returns. These opportunities, lasting only seconds, are now dominated by automated bots running on the Polygon network, which scan thousands of markets in real time to exploit discrepancies. Another strategy, 'Endgame Sweep,' involves buying near-certain outcomes (priced between $0.95 and $0.99) and waiting for final resolution, relying on the principle that time trades for certainty. However, even this strategy carries 'black swan' risks, such as last-minute reversals due to legal challenges, sports errors, or misinformation. Despite the appearance of fairness, the market is heavily skewed: data from BlockBeats shows only 0.51% of users earn over $1,000, and just 1.74% of trades exceed $50,000 in volume. The vast majority of traders lose money, while a small, technologically advanced minority—using code, speed, and low-latency systems—capture the bulk of profits. These arbitrageurs also serve a vital market-making function by reducing spreads and improving liquidity, with one estimate suggesting they earned over $20 million in the past year. As Polymarket expands—with a 4% yield offer for the 2028 U.S. election market and speculation about an IPO or token airdrop—opportunities for arbitrage are expected to grow, though the playing field remains tilted toward high-frequency, algorithmic traders. As Jeremy Whittaker noted on Medium, 'Arbitrage on Polymarket isn’t gambling—it’s technique. You’re not betting on the outcome. You’re betting on inefficiency.'\nOriginal language: vi\nPublish date: October 14, 2025 09:35 AM\nSource:[BeInCrypto - Vietnam](https://vn.beincrypto.com/polymarket-arbitrage-risk-free-profit/)\n\n**Kalshi Partners with Pyth Network for Blockchain Integration as Prediction Markets Boom**\nKalshi raised $300 million at a $5 billion valuation in a funding round led by Sequoia Capital and Andreessen Horowitz, with additional participation from Paradigm and Coinbase, bringing its total funding to $485 million. The company, a CFTC-regulated Designated Contract Market, announced a strategic partnership with Pyth Network to stream real-time prediction market data—covering events such as the New York City Mayor Election, F1 Drivers Champion, MLB Champion, and Federal Reserve rate cut predictions—across more than 100 blockchains. This marks the first large-scale integration of regulated prediction market data into blockchain ecosystems. Kalshi captured 60% of the combined $1.44 billion trading volume in September, reversing earlier dominance by competitor Polymarket, which raised $2 billion at a $9 billion valuation from Intercontinental Exchange (ICE). Polymarket operates fully on-chain with all positions publicly visible. Kalshi’s growth is attributed to its partnership with Robinhood, which granted access to a large retail user base. The platform plans to expand to 140 countries and has enlisted Donald Trump Jr. as a strategic adviser. The integration enables developers to build decentralized finance (DeFi) applications, derivatives, and governance systems using verifiable, market-priced probabilities. Regulatory scrutiny remains high, particularly regarding political betting, as both platforms’ expansion will be closely monitored by policymakers.\nOriginal language: en\nPublish date: October 14, 2025 08:45 AM\nSource:[CoinCentral](https://coincentral.com/kalshi-partners-with-pyth-network-for-blockchain-integration-as-prediction-markets-boom/)\n\n**Kalshi and Polymarket valuations exceed $5bn and $8bn**\nPrediction markets Kalshi and Polymarket have achieved valuations of $5 billion and $8 billion, respectively, driven by strong investor confidence despite ongoing regulatory challenges. Kalshi, which is regulated by the U.S. Commodity Futures Trading Commission (CFTC), announced a global expansion to over 140 countries, excluding Bulgaria, France, Poland, Russia, Ukraine, the UK, Australia, and Canada. This move creates a unified global liquidity pool, a unique feature distinguishing it from fragmented regional platforms. Kalshi raised $300 million in a Series D round led by Andreessen Horowitz and Sequoia Capital, with its founders emphasizing compliance and licensure as key to building trust. Polymarket, after exiting the U.S. in 2022 due to CFTC settlement, has since re-entered via acquisition and secured a $2 billion investment from Intercontinental Exchange (ICE), boosting its valuation to $8 billion. The partnership enables ICE to distribute Polymarket’s event-driven data and collaborate on blockchain initiatives. Both platforms face scrutiny over ethical concerns, such as a spike in bets on Maria Corina Machado winning the Nobel Peace Prize, prompting an official investigation and speculation of data leaks. Regulatory environments remain inconsistent: some countries classify prediction markets as gambling, while others treat them as financial instruments. Despite this, platforms see global growth potential, with Allwyn (UK Lottery operator) acquiring PrizePicks to expand into the U.S. predictions market. Kalshi asserts that 'events don't stop at borders, and now, neither does trading on them,' highlighting the cross-border relevance of prediction markets for elections, central bank decisions, sports, and climate events.\nOriginal language: en\nPublish date: October 14, 2025 07:00 AM\nSource:[SBC News](https://sbcnews.co.uk/featurednews/2025/10/14/kalshi-polymarket-growth/)\n\n**Nobel Committee Investigates Potential Leak After Polymarket Predicts 2025 Peace Prize Winner Hours Ahead of Announcement**\nThe Nobel Committee is investigating a potential leak after Polymarket, a prediction market platform, accurately predicted María Corina Machado as the winner of the 2025 Nobel Peace Prize hours before the official announcement. According to Erik Aasheim, spokesperson for the Nobel Institute, a mysterious user with the username '6741' placed large bets on Machado’s victory approximately 12 hours before the announcement, when she was considered an unlikely contender. Within two hours, the market probability for Machado rose from 5% to nearly 70%, driven by this user’s activity on a newly created account. '6741' reportedly earned over $50,000 in profits. Another user, 'GayPride', began placing large bets after public attention grew, ultimately winning more than $85,000. The event raised concerns about insider information, especially given the timing—just after midnight in Oslo—coinciding with the surge in betting activity. Polymarket, which operates offshore and is technically prohibited for U.S. users, does not ban insider trading, so no legal violation may have occurred. The platform, founded five years ago by Shayne Coplan, has faced regulatory scrutiny, including a 2022 settlement with the U.S. Commodity Futures Trading Commission (CFTC), leading to the blocking of American users. However, in September, Cryptopolitan reported that Polymarket acquired a licensed CFTC exchange, signaling plans to re-enter the U.S. market. The event gained attention due to Donald Trump’s public campaign for Machado, turning the prize into a trending topic and boosting participation on prediction markets. The Intercontinental Exchange (ICE) announced plans to invest $2 billion in Polymarket, valuing it at $8 billion, highlighting the growing prominence of prediction markets. Harvard economist Jason Furman commented on the incident on Bluesky, sharing a screenshot of the Polymarket page and stating he now has an answer to questions about insider trading in prediction markets. Economists remain divided on whether insider use improves market accuracy or constitutes unfair manipulation. Polymarket has previously correctly predicted major events, including Trump’s second election victory and Taylor Swift’s engagement. The platform is also expanding into U.S. sports betting, competing with established operators like DraftKings and FanDuel through its subsidiary Kalshi.\nOriginal language: en-US\nPublish date: October 11, 2025 04:15 AM\nSource:[Cryptopolitan - Spanish](https://www.cryptopolitan.com/es/nobel-investigates-itself-over-polymarket/)\n\n**Nobel Committee Investigates Possible Leak After Polymarket Accurately Predicts 2025 Peace Prize Winner**\nThe Nobel Committee is investigating a potential leak after Polymarket, a prediction market platform, accurately predicted María Corina Machado as the winner of the 2025 Nobel Peace Prize hours before the official announcement. According to Erik Aasheim, a spokesperson for the Nobel Institute in Norway, suspicious betting activity began just after midnight in Oslo, raising concerns of insider information. A trader using the pseudonym '6741' placed large bets on Machado’s victory about 12 hours before the announcement, when she was considered an unlikely candidate. Within two hours, the trader’s activity caused market volatility, increasing Machado’s odds from 5% to nearly 70%. The trader exited with over $50,000 in profit from a newly created account. Another user, 'GayPride', also profited over $85,000 after noticing the initial surge. Neither Polymarket nor the Nobel Institute responded to media inquiries, and The Wall Street Journal was unable to contact '6741'. Polymarket operates offshore and is technically prohibited for U.S. users, meaning it does not enforce rules against insider trading. Even if a Nobel insider leaked the result, it may not violate U.S. law. Harvard economist Jason Furman commented online, saying he now has a real-world example of insider trading in prediction markets. The prize attracted heightened attention due to Donald Trump’s public campaign for Machado, boosting interest in prediction markets. The Intercontinental Exchange announced plans to invest $2 billion in Polymarket, valuing it at $8 billion. Founded five years ago by the enigmatic Shayne Coplan, Polymarket faced regulatory issues with the CFTC in 2022, leading to a ban on U.S. users. The platform gained popularity for accurately predicting events like Trump’s second election win and Taylor Swift’s engagement. In September, Polymarket acquired a small CFTC-licensed exchange, signaling a potential return to the U.S. market. Economists remain divided on whether insider trading improves market accuracy or constitutes unfair manipulation. Polymarket’s future growth may lie in sports betting, with Kalshi already offering markets on football, basketball, and other pro sports, challenging established platforms like DraftKings and FanDuel.\nOriginal language: en-US\nPublish date: October 11, 2025 04:15 AM\nSource:[Cryptopolitan - Portuguese](https://www.cryptopolitan.com/pt/nobel-investigates-itself-over-polymarket/)\n\n**Senate Dems submit crypto market structure proposal, world ends**\nSenate Democrats have submitted the Responsible Financial Innovation Act (RFIA), a comprehensive proposal aimed at regulating the crypto market structure, which has sparked strong reactions from the crypto industry and state gaming regulators. The RFIA builds on the CLARITY Act but introduces significant changes, including requiring 'front-end providers' to implement Know Your Customer (KYC) protocols and granting the Treasury Department authority to regulate individuals with 'sufficient influence' in decentralized finance (DeFi) protocols—defined at Treasury’s discretion. The proposal has drawn opposition from banks and DeFi advocates, particularly over concerns about 'yield-bearing' stablecoins, with Senator Elizabeth Warren and others pushing for legislative action. Meanwhile, Coinbase has limited USDC rewards, secured New York staking approval, and is preparing to launch its Base token, with staking now legal in all but four U.S. states (California, New Jersey, Maryland, and Wisconsin). In a related development, MetaMask’s integration with Polymarket—allowing users to trade in sports, crypto, and politics within the platform—has angered state gaming regulators, especially as Polymarket and rival Kalshi operate in states where online sports betting is illegal. Nevada regulators issued a cease-and-desist order against Kalshi, which is licensed by the Commodity Futures Trading Commission (CFTC), prompting a preliminary injunction and ongoing legal battles. Other states have followed suit with similar orders, some favoring Kalshi, others not. U.S. senators have written to CFTC acting chair Caroline Pham, demanding clarification on why the CFTC permits such cross-state prediction market operations, arguing it undermines state and tribal authority over sports betting. The senators have requested a response by October 30, 2025. The legislative process faces delays, with Senator Steil warning that approaching the 2026 midterm elections could make passage increasingly difficult. The debate reflects deep divisions over regulatory authority, innovation, and jurisdiction in the evolving digital asset landscape.\nOriginal language: en\nPublish date: October 10, 2025 11:00 AM\nSource:[coingeek.com](https://coingeek.com/senate-dems-submit-crypto-market-structure-proposal-world-ends/)\n\n**How Polymarket Works: The Prediction Market Betting on Real-World Events**\nPolymarket is a prediction market platform that allows users to bet on real-world future events, such as U.S. presidential election outcomes or the next country to leave the European Union. Operating with cryptocurrency—specifically the USDC stablecoin—the platform functions like a futures exchange where users buy and sell 'yes' or 'no' shares representing possible outcomes. The price of each share, ranging from US$0.01 to US$0.99, reflects the market's collective probability of an event occurring; for example, a 'yes' share priced at US$0.70 implies a 70% probability of the event happening. If the event occurs, the share is worth US$1, yielding a US$0.30 profit per share. If not, the share becomes worthless. The platform leverages the 'wisdom of crowds' to generate real-time predictions. It recently attracted investment from Intercontinental Exchange (ICE), the parent company of the New York Stock Exchange, signaling growing interest from traditional finance. However, regulatory challenges persist—particularly in the U.S., where the Commodity Futures Trading Commission (CFTC) has raised concerns about its similarity to illegal binary options contracts. Users face significant risks, including cryptocurrency volatility, lack of investor protection, and personal responsibility for wallet security. Access requires a crypto wallet (e.g., MetaMask) and familiarity with USDC transactions, making it accessible but complex for non-technical users. Despite its risks, Polymarket is viewed as a powerful tool for aggregating information and improving forecasting accuracy in areas ranging from politics to business.\nOriginal language: pt\nPublish date: October 09, 2025 09:37 PM\nSource:[Jornal Estado de Minas | Not�cias Online](https://www.em.com.br/economia/2025/10/7266933-como-funciona-o-polymarket-a-bolsa-de-apostas-em-acontecimentos.html)\n\n**Prediction markets: What they are and how they work**\nPrediction markets are financial exchanges where individuals can bet on the outcomes of future events by purchasing binary contracts that pay out if the predicted outcome occurs. These markets operate on the principle of the 'wisdom of the crowd' with financial stakes, as described by Leo Chan, CEO of Sportstensor, who emphasizes that the intent is information exchange rather than gambling. Contracts typically pay $1 if correct and cost less based on perceived odds—e.g., a $0.80 'yes' contract implies an 80% expected probability. The Commodity Futures Trading Commission (CFTC) regulates real-money prediction markets in the U.S., and platforms like Polymarket and Robinhood offer access to users, though Polymarket was previously fined $1.4 million and ceased U.S. operations in 2022 under CFTC pressure. Polymarket regained CFTC approval to relaunch in the U.S. in September 2025 and acquired QCEX, a licensed derivatives exchange. Risks include financial loss, market manipulation by well-funded market makers, and legal uncertainty—especially for sporting event contracts, with ongoing cases against Kalshi. Experts are divided on whether prediction markets constitute gambling: Chan argues they are information markets, while Daniel O'Boyle views them as gambling due to financial stakes. Users can trade contracts in real time, adjusting positions as odds shift based on new information or market activity.\nOriginal language: en\nPublish date: October 07, 2025 01:00 PM\nSource:[Yahoo! Finance](https://finance.yahoo.com/personal-finance/investing/article/prediction-markets-130052682.html)\n\n**Investors are betting big on 'prediction markets' Kalshi and Polymarket -- will the gamble pay off? | Fortune**\nThe Fortune article tracks the rapid rise of prediction‑market platforms Kalshi and Polymarket, noting that they attracted more than $1 billion in monthly wagers and drew over 35 million visitors this summer, while each now enjoys a \"unicorn\" valuation of $1 billion or more.  During the 2020‑2024 U.S. presidential election, the two sites collectively handled more than $3 billion in bets, producing forecasts that outperformed many traditional polls.  Investors have poured hundreds of millions of dollars into the firms: Polymarket raised $200 million in a June 2024 round led by Peter Thiel’s Founders Fund, and Kalshi raised $185 million in the same month, valuing it at $2 billion.  The piece highlights both the promise and the peril of the industry.  Sequoia venture capitalist Alfred Lin describes the markets to Fortune as \"basically truth machines,\" while Kalshi co‑founder Tarek Mansour explains that the markets work because they are a market‑based mechanism that provides the wisdom of the crowds and because participants have real money on the line.  Critics, however, argue that the platforms are essentially gambling sites.  The article recounts several controversies: accusations of \"assassination markets,\" a CFTC consent decree that barred Polymarket from operating in the U.S., allegations of wash trading, a federal raid on Polymarket founder Shayne Coplan’s apartment, and a Kalshi‑led social‑media campaign that used influencers to comment on the raid.  Legal challenges remain, including the question of whether prediction markets can be distinguished from gambling under state law.  The article concludes that the sector’s future hinges on sustaining interest beyond election cycles and on building a critical mass of liquidity and accurate predictions.\n\nKey metrics and quotes:  • $3 billion in bets during the 2020‑2024 election;  • $1 billion in monthly wagers;  • 35 million visitors this summer;  • $200 million investment for Polymarket;  • $185 million investment for Kalshi;  • \"basically truth machines\" – Alfred Lin;  • \"They're a market‑based mechanism, so you get the wisdom of the crowds\" – Tarek Mansour.\nOriginal language: en\nPublish date: September 29, 2025 09:31 AM\nSource:[Fortune](https://fortune.com/article/prediction-markets-kalshi-polymarket-election-trump-harris/)\n\n**Trump’s Family Drives Boom in Future‑Event Betting Markets**\nThe article reports that the future‑event betting market, led by platforms Kalshi and Polymarket, has experienced an unprecedented boom, moving more than 1.3 billion dollars each month and attracting valuations up to 9 000 million dollars, according to the source.  The platforms allow users to buy ‘yes’ or ‘no’ shares on events, with prices reflecting perceived probabilities; a 25‑cent share implies a 25 % chance of the event occurring.  Kalshi is the first platform authorised by the Commodity Futures Trading Commission (CFTC) to trade event contracts, while Polymarket operates on a blockchain‑based, decentralised model.  Both platforms have attracted high‑profile investors such as Peter Thiel, Vitalik Buterin, Joe Gebbia and Thomas Peterffy, and have been promoted by the Trump family.  Donald Trump Jr. joined Kalshi as a strategic adviser in January 2024 and invested in Polymarket in August 2024, becoming a member of its advisory board.  The article cites a quote from founder Tarek Mansour: 'Muchas de las operaciones de trading corrientes ya están basadas en la opinión de los inversores de lo que pueda pasar. Así que pensamos: '¿y por qué no les damos la opción de invertir directamente en esos eventos?''.  It also quotes the CEO’s statement: 'Queremos construir el mercado comercial más grande del planeta'.  The piece notes that Kalshi won a federal court case in September 2024 that allowed it to offer presidential‑election contracts, after a year‑long legal battle with the CFTC.  Despite federal approval, seven states—including Nevada and New Jersey—have sent cease‑and‑desist letters alleging that sports‑event contracts are illegal bets.  The article concludes with a criticism from Democrat Congresswoman Dina Titus: 'Esa agencia está en ruinas. No hay ninguna supervisión real'.  The tone is largely explanatory, presenting facts, metrics and direct quotes without overt editorialising.\nOriginal language: es\nPublish date: September 21, 2025 03:00 AM\nSource:[El Confidencial](https://www.elconfidencial.com/tecnologia/2025-09-21/kalshi-polymarket-apuestas-eventos-futuros-trump_4212526/)\n\n**Sports Prediction Site Polymarket Nearing Return to U.S.**\nA 'no-action' letter from the U.S. Commodity Futures Trading Commission (CFTC) indicates that Polymarket, the world’s largest prediction market, could soon resume operations in the United States. The letter, issued in response to a request from QCEX – an exchange Polymarket acquired in July – was described by CEO Shayne Coplan on X as a 'green light to go live' and prompted him to tell followers to 'stay tuned.' Polymarket had been barred from serving U.S. customers since early 2022 after a settlement with the CFTC for offering off‑exchange event‑based binary options contracts without the required designation as a designated contract market or registration as a swap execution facility. Despite the ban, the company has operated offshore, attracting hundreds of millions of dollars in bets worldwide, including on sporting events. The potential return would position Polymarket as a major competitor to existing CFTC‑regulated entities such as Kalshi, Robinhood, and Underdog, as well as state‑regulated online sports betting sites. The combination of the QCEX acquisition, the addition of Donald Trump Jr. as an adviser, and the CFTC no‑action letter sets the stage for Polymarket to legally operate as a prediction market in the U.S.\nOriginal language: en\nPublish date: September 03, 2025 05:44 PM\nSource:[Covers.com](https://www.covers.com/industry/sports-prediction-site-polymarket-nearing-return-to-usa-sept-3-2025)\n\n**Polymarket Reportedly Targets Fall U.S. Launch, Football Trading**\nPolymarket, a crypto‑based prediction‑market platform, is preparing a fall 2025 launch in the United States after a three‑year hiatus. The company is advertising on Meta‑owned Facebook and Instagram, and one ad targets Texas residents with a promotion for 'legal football trading', a feature that would compete with established sportsbooks such as FanDuel and DraftKings and with other prediction markets like Kalshi. The NFL remains the most popular betting sport, generating billions of dollars in wagers during the second half of the year. Sports betting is legal in 38 U.S. states, with Missouri set to bring the total to 39 when wagering begins on Dec. 1. Flutter, owner of FanDuel, has said that prediction markets have not affected its sportsbook in jurisdictions where it operates. Kalshi has offered 'Yes' and 'No' contracts on game outcomes since the Super Bowl in February, and has recently added NFL and college‑football markets with spreads and totals. FanDuel announced a partnership with CME Group that will allow it to offer financial prediction markets to its customers, though it has not indicated plans to offer sports‑outcome contracts. Polymarket, which was blocked from offering event trading in 2022 by the CFTC, acquired the federally regulated derivatives exchange QCEX for $112 million in July, potentially enabling it to introduce sports contracts in the U.S. market. SimilarWeb data from May 2025 show the platform had 15.9 million visits, surpassing FanDuel and DraftKings, and it boasts a 94 % accuracy rate in forecasting. Founded in 2020, Polymarket raised $200 million earlier this year, pushing its valuation above $1 billion. During the 2024 U.S. presidential election, more than $3 billion in contracts were traded on the site. The company now faces a controversial landscape, as Kalshi, which gained traction during last year’s election after a court ruling, is embroiled in legal disputes with several states over sports‑outcome contracts.\nOriginal language: en\nPublish date: August 21, 2025 08:00 PM\nSource:[Covers.com](https://www.covers.com/industry/report-polymarket-targets-fall-us-launch-football-trading-aug-21-2025)\n\n",
    "date": "2025-10-17T01:06:49.348716",
    "summary": "Across all expert analyses, there is a clear consensus that the probability of real-money betting on Polymarket or Manifold becoming legal in the United States before the end of 2025 is very high—typically estimated in the 85-95% range. Experts highlight recent major developments: Polymarket has acquired a CFTC-licensed exchange (QCEX) and has been issued a CFTC no-action letter, both constituting a public and explicit regulatory shift at the federal level. This regulatory action is viewed as directly satisfying the question’s resolution criteria, provided Polymarket actually launches real-money markets for U.S. users in at least one state.\n\nDespite this, several experts caution that state-level legal obstacles remain significant. Multiple states (e.g., Nevada, Ohio, New Jersey, Massachusetts) have issued cease-and-desist orders or are litigating the legality of such platforms under state gambling laws. However, recent court decisions (notably in favor of Kalshi) have affirmed federal CFTC preemption over state bans in some jurisdictions, providing a promising precedent for Polymarket.\n\nManifold is consistently dismissed as irrelevant to the outcome due to its lack of federal regulatory approval or any imminent real-money launch—Polymarket is the sole focus of expected regulatory change for 2025.\n\nThe main risks outlined for a 'No' outcome include: last-minute state or federal injunctions blocking all real-money operations, operational or regulatory delays pushing any U.S. launch into 2026, or an ambiguous regulatory situation that prevents Metaculus from resolving the question as Yes. Experts, however, generally regard these risks as modest given the strong, explicit federal actions and the imminent (October 2025) relaunch plan by Polymarket.\n\nIn summary, experts agree that due to the CFTC no-action letter, a designated contract market license, public plans to relaunch with real-money markets, and the explicit requirement for legalization in only one state, the question will almost certainly resolve 'Yes'—absent an exceptional, last-minute legal or regulatory disruption.",
    "forecasters": [
        "GamingRegulation (AmericanGamingAssociationStandards)",
        "GamingRegulation (StateGamingControlCompliance)",
        "USLegislativeAnalysis (LegislativeProcessUS)",
        "USLegislativeAnalysis (FinancialTechnologyPolicy)",
        "Law (USFederalGamblingLaw)",
        "Law (StateGamblingLegislation)",
        "PoliticalScience (RegulatoryPolitics)",
        "PoliticalScience (PolicyChangeTheory)",
        "Economics (BehavioralRegulationEconomics)",
        "Economics (PublicChoiceTheory)"
    ]
}