{
    "deliberation_results": {
        "Nuclear Policy (NonProliferation Treaty Regime)": {
            "time_to_resolution": "Approximately 54 days (until December 31, 2025)",
            "perspective_relevance": "As an expert in Nuclear Policy and the Nonproliferation Treaty (NPT) regime, I bring a deep understanding of the legal, diplomatic, and technical frameworks that govern Iran's obligations to the IAEA, as well as the historical patterns of Iranian-IAEA interaction—especially in crisis and post-crisis settings. I can assess the impact of international pressure, sanctions, and military action on Iranian nuclear transparency, and weigh the likelihood of rapid diplomatic shifts under acute security and political incentives/disincentives.",
            "status_quo": "Iran is currently NOT allowing the IAEA to inspect its stockpile of enriched uranium at the bombed sites (Fordow, Natanz, Isfahan), having suspended cooperation and recently voided an agreement to resume access, despite calls from the IAEA and Western powers.",
            "perspective_derived_factors": [
                {
                    "factor": "Iranian Strategic Incentives (Security and Leverage)",
                    "effect": "Decreases probability. Iran’s leadership sees its stockpile and opacity as strategic leverage, especially after military attacks. The risk of further strikes or harsher sanctions could, paradoxically, entrench this stance until Iran believes it has extracted enough concessions or guarantees."
                },
                {
                    "factor": "Time Pressure and Diplomatic Urgency",
                    "effect": "Slightly increases probability. The presence of a ticking clock (with less than two months left) and ongoing diplomatic channels (e.g., China urging talks, some dialogue with the IAEA) could, in theory, prompt a sudden tactical shift if Iran perceives a tangible benefit. However, this is outweighed by current mistrust and lack of progress."
                },
                {
                    "factor": "International Sanctions and Isolation",
                    "effect": "Slightly increases probability. The snapback of UN sanctions and threat of further isolation are strong incentives for Iran to demonstrate some compliance, but recent Iranian statements suggest they see continued resistance as a source of domestic legitimacy and regional defiance—thus, this only modestly raises the chance of a breakthrough."
                },
                {
                    "factor": "Technical and Physical Obstacles at Sites",
                    "effect": "Neutral to slightly decreases probability. The uranium is reportedly under rubble in bombed-out facilities, complicating both access and the optics of cooperation. Iran could use the excuse of site conditions to delay or deny meaningful inspection, even if a nominal agreement is reached."
                },
                {
                    "factor": "Historical Base Rate of Iranian Reversal under Crisis",
                    "effect": "Decreases probability. Historically, Iran has rarely made abrupt, high-stakes reversals on nuclear transparency within short timeframes after escalations, especially when parliamentary mandates bar cooperation and the regime perceives external threats."
                },
                {
                    "factor": "Risk of Further Israeli/US Strikes if No Progress",
                    "effect": "Increases probability, but only marginally. The explicit threat of renewed military action could drive a tactical, face-saving agreement, but so far, Iranian officials have signaled resolve and not capitulation under duress."
                },
                {
                    "factor": "Internal Iranian Politics and Parliament’s Role",
                    "effect": "Decreases probability. The recent overwhelming parliamentary vote to suspend cooperation, and the framing of IAEA as complicit with Israeli/US action, makes a public about-face very politically costly in the short term."
                },
                {
                    "factor": "IAEA Flexibility and Potential for Partial Access",
                    "effect": "Slightly increases probability. If the IAEA is willing to accept a limited or staged access framework (perhaps a symbolic visit or technical survey), Iran could grant such access to defuse immediate pressure while minimizing substantive transparency. However, current signs suggest even this is unlikely before 2026."
                }
            ],
            "no_scenario": "Iran maintains its current posture, refusing IAEA access to Fordow, Natanz, and Isfahan on grounds of security, sanctions, and national dignity. Parliamentary and Supreme National Security Council resistance remains strong. No new incentive or crisis tips the balance before the end of 2025. The uranium remains under rubble, with the IAEA restricted to satellite monitoring and denied entry. No public agreement is announced before January 1, 2026.",
            "yes_scenario": "Iran, under acute pressure from renewed sanctions (or the credible threat of additional Israeli/US military action), and/or as part of a broader diplomatic maneuver (possibly mediated by China or Russia), agrees to a limited resumption of IAEA inspections at the bombed sites. This is announced as a face-saving gesture—perhaps with caveats about security, technical limitations, or partial access. The announcement is made before January 1, 2026, and the IAEA is publicly granted at least nominal inspection rights.",
            "final_reasoning": "The base rate for Iran making a rapid, public reversal on IAEA access shortly after a major military confrontation—especially with parliamentary opposition and nationalistic sentiment running high—is low. The current diplomatic trend is negative: a September deal to restore inspections was voided; Iranian officials repeatedly state the uranium is 'under rubble' and that no inspections are planned; international sanctions have been snapped back; and the IAEA has not been referred to the Security Council, reducing immediate procedural pressure. While there are external incentives (sanctions, risk of further strikes) and some potential for a last-minute tactical maneuver, Iran’s leadership appears to be prioritizing resistance and strategic ambiguity over transparency. The technical condition of the sites provides a plausible excuse for continued delay, even if Iran wished to appear cooperative. A nominal or partial agreement is possible, but less likely given the short time frame and current adversarial climate. My expertise leads me to weight the status quo and historical inertia heavily, with only a modest probability of a tactical pivot.",
            "final_probability": 15
        },
        "Nuclear Policy (IAEA Safeguards System)": {
            "time_to_resolution": "Approximately 54 days (until January 1, 2026)",
            "perspective_relevance": "As an expert in Nuclear Policy with a focus on the IAEA Safeguards System, I bring a detailed understanding of the technical, legal, and geopolitical mechanisms governing nuclear inspections, nonproliferation treaty obligations, and the interaction between crisis diplomacy and technical verification. This context is essential for interpreting the likelihood and modalities of Iran granting IAEA access after a major military strike and subsequent diplomatic breakdown.",
            "status_quo": "Iran is currently denying IAEA inspectors access to the critical uranium stockpile sites (Fordow, Natanz, Isfahan). Despite repeated IAEA requests and international pressure, no new agreement is in place as of November 7, 2025. Iran claims the material is 'under rubble,' and blames external aggression and sanctions snapback for suspending cooperation.",
            "perspective_derived_factors": [
                {
                    "factor": "Short time window and current impasse",
                    "effect": "Decreases probability. With less than two months left and no signs of imminent breakthrough, the time constraint is severe. Historically, even when major agreements are reached, implementation (especially physical inspections) takes weeks to months."
                },
                {
                    "factor": "Recent collapse of the September 9, 2025 IAEA-Iran deal",
                    "effect": "Decreases probability. The abrogation of the inspection agreement (October 20) demonstrates the fragility of diplomatic progress, especially when tied to new sanctions or perceived Western hostility."
                },
                {
                    "factor": "Legal and political ramifications of NPT and snapback sanctions",
                    "effect": "Decreases probability. Iran has not withdrawn from the NPT but argues that snapback sanctions and Western actions void its obligations to cooperate fully. The Iranian parliament's overwhelming vote to suspend cooperation signals deep institutional resistance."
                },
                {
                    "factor": "Security and technical complications after airstrikes",
                    "effect": "Decreases probability. The uranium is reportedly 'under rubble' in damaged, possibly hazardous facilities. Even if Iran agreed in principle, technical preparations for safe IAEA access would require significant time and coordination."
                },
                {
                    "factor": "Threat of further Israeli or US military action",
                    "effect": "Mixed. On one hand, the risk of additional strikes might pressure Iran to show some transparency to avoid escalation. On the other, it incentivizes Iran to maintain ambiguity for deterrence, and to avoid appearing weak domestically."
                },
                {
                    "factor": "International diplomatic incentives and Chinese/Russian mediation",
                    "effect": "Slightly increases probability. While the West’s leverage is limited, China and Russia are urging Iran to resume talks. If new mediation efforts gain traction, a symbolic or partial access agreement could be possible, but this seems unlikely within the remaining window."
                },
                {
                    "factor": "Iran’s domestic political climate and recent anti-IAEA rhetoric",
                    "effect": "Decreases probability. Iranian officials are aggressively critical of the IAEA, accusing it of enabling attacks and acting as a Western tool. Domestic politics penalize any perceived capitulation, especially so soon after a major conflict."
                },
                {
                    "factor": "Base rate: historical frequency of rapid restoration of full-scope IAEA inspections after breakdown",
                    "effect": "Decreases probability. Historically, after major inspection breakdowns (e.g., North Korea, Iraq, previous Iranian crises), restoration of full IAEA access is rare within a few months and typically only after extended negotiation and/or regime change."
                }
            ],
            "no_scenario": "Iran maintains its current stance, citing security concerns, sanctions, and national sovereignty. No new access agreement is announced before January 1, 2026, despite ongoing international diplomatic efforts. Inspections remain limited to non-sensitive sites like Bushehr. IAEA continues to warn and report, but Iran does not grant access to Fordow, Natanz, or Isfahan stockpiles.",
            "yes_scenario": "A sudden diplomatic breakthrough occurs, possibly mediated by China or Russia, or spurred by the threat of imminent military escalation or further economic collapse. Iran publicly announces a limited, face-saving agreement to let the IAEA access the stockpiles at the bombed sites before the New Year, possibly under strict conditions and with heavy security, in exchange for some Western or Chinese/Russian concession.",
            "final_reasoning": "The base rate for restoration of IAEA access after trust breakdowns and military conflict is extremely low within a short window. All observable indicators—parliamentary votes, public statements, collapse of recent agreements, and persistent anti-IAEA rhetoric—point toward institutional and political resistance in Iran. Security and technical obstacles further decrease the odds of a quick turnaround. While diplomatic incentives exist, and a crisis could force a last-minute gesture, current evidence does not support a high likelihood. The status quo is entrenched, and the time window is rapidly closing.",
            "final_probability": 10
        },
        "Diplomacy (Track Two Diplomacy)": {
            "time_to_resolution": "Approximately 8 weeks (until January 1, 2026)",
            "perspective_relevance": "As an expert in Track Two Diplomacy, I bring a nuanced understanding of unofficial and semi-official backchannel negotiations, confidence-building measures, and the ways non-governmental actors, mediators, and external stakeholders influence crisis management in international nuclear disputes. This perspective is crucial in evaluating the likelihood of Iran allowing IAEA inspections, as much of the progress (or lack thereof) will hinge not just on official positions, but on informal dialogue, pressure from third parties, and the internal-external signaling taking place beneath the surface.",
            "status_quo": "Iran is currently not allowing IAEA access to its enriched uranium stockpile at the bombed sites (Fordow, Natanz, Isfahan); all formal cooperation frameworks have been suspended or voided after the September-October 2025 diplomatic breakdown. Inspections have been denied despite repeated IAEA and Western pressure.",
            "perspective_derived_factors": [
                {
                    "factor": "Recency and severity of military strikes",
                    "effect": "Decreases probability. Iran is still in a post-conflict defensive posture, perceiving the IAEA as complicit with hostile Western/Israeli actions. Nationalist sentiment is high, and there is little domestic incentive for a rapid policy reversal."
                },
                {
                    "factor": "International diplomatic pressure and snapback sanctions",
                    "effect": "Slightly increases probability. The reimposition of UN sanctions and the threat of further Western economic and political isolation create some incentive for Iran to offer limited concessions, especially if economic conditions deteriorate."
                },
                {
                    "factor": "Track Two/Backchannel negotiations",
                    "effect": "Marginally increases probability. There is some potential for behind-the-scenes bargaining, especially involving Russia, China, or neutral states (Egypt, Switzerland) that could broker an inspection-for-concession arrangement even without formal US-Iran dialogue. However, these efforts require time and trust, both of which are currently in short supply."
                },
                {
                    "factor": "Security concerns and site integrity",
                    "effect": "Decreases probability. Iran claims the uranium is 'under rubble' and that recovery or inspection would risk further exposure to attack, sabotage, or intelligence gathering. Iran is likely to use security justifications to deny access and delay any inspection pending infrastructure repairs."
                },
                {
                    "factor": "Domestic political calculations in Iran",
                    "effect": "Decreases probability. The government faces pressure from hardliners and public opinion not to 'capitulate' to Western/IAEA demands soon after a military humiliation. Any agreement would likely be denounced as weakness unless it brings immediate, tangible benefits."
                },
                {
                    "factor": "Potential for further Israeli/US military action",
                    "effect": "Mixed. The risk of further military escalation if the IAEA remains locked out creates a theoretical incentive to allow inspections, but also makes Iran more defensive and less willing to appear vulnerable."
                },
                {
                    "factor": "IAEA's own posture and willingness to compromise",
                    "effect": "Marginally increases probability. The IAEA has, in the past, accepted phased or partial access, or inspections with significant delays, provided there is some movement towards transparency. This flexibility could enable a last-minute, face-saving inspection announcement by Iran."
                }
            ],
            "no_scenario": "Despite persistent international and IAEA pressure, Iran maintains its position that security and sovereignty concerns preclude any inspection of the bombed sites before January 1, 2026. Domestic politics, lack of trust, and the absence of attractive incentives or credible guarantees prevent any breakthrough. Iran continues to stonewall, arguing that the uranium is inaccessible and that inspection would only occur after site repairs and new security assurances, which are not forthcoming within the timeframe. Snapback sanctions remain in place and Russia/China do not exert enough leverage to change Iran's calculus on inspections. The year ends with the status quo intact.",
            "yes_scenario": "A backchannel breakthrough occurs—perhaps facilitated by a neutral third party (e.g., Egypt, Oman, Switzerland, or China)—whereby Iran receives a face-saving, limited concession in exchange for a tightly controlled, one-off IAEA inspection of the bombed sites to verify the presence and status of the uranium stockpile. This is announced in late December 2025 as a gesture to avoid further escalation or in exchange for an incremental sanctions relief, humanitarian aid package, or security guarantee. The agreement is narrow in scope (e.g., a single visit, restricted team, or limited access), but sufficient to meet the resolution criteria.",
            "final_reasoning": "The base rate for Iran rapidly resuming intrusive nuclear inspections after a major diplomatic and military crisis is low—historically, such concessions have taken months to years, not weeks, and have typically followed either a change in leadership, a major economic crisis, or substantial third-party mediation. The status quo is strongly against rapid inspection: Iran has formally voided the September agreement, expelled IAEA inspectors from all but Bushehr, and is facing rising domestic and regional insecurity. Track Two efforts, while ongoing, have limited time to achieve a breakthrough, and the Iranian leadership is unlikely to risk domestic backlash without clear, immediate gains. However, the risk of renewed Israeli/US action and the pressure from China/Russia to stabilize the situation, plus the IAEA’s willingness to accept partial or delayed access, keep a narrow window open for a last-minute, face-saving deal. Given the short time frame (8 weeks), entrenched distrust, and the lack of visible progress in the official or Track Two channels as of early November, the probability of a Yes outcome is low but not negligible—there is a small chance of a narrow, symbolic inspection agreement emerging under strong external pressure or as a crisis-averting gesture.",
            "final_probability": 15
        },
        "Diplomacy (International Negotiation Practice)": {
            "time_to_resolution": "Approximately 54 days (until January 1, 2026)",
            "perspective_relevance": "As an expert in international negotiation and diplomatic crisis management, my perspective is directly relevant. I understand the incentives, signaling strategies, and red lines that states employ during high-stakes nuclear standoffs, especially under external pressure, sanctions, and military threat. I can assess the likelihood of tactical concessions (such as allowing inspections) as part of broader negotiation tactics, and the conditions under which such moves are made or withheld.",
            "status_quo": "Iran is currently denying IAEA access to its key sites—Fordow, Natanz, and Isfahan—where the enriched uranium stockpile is believed to be buried under rubble post-strikes. Suspended cooperation is Iran’s default, with only minimal engagement and public rhetoric critical of the IAEA.",
            "perspective_derived_factors": [
                {
                    "factor": "Iran's Domestic Political Incentives",
                    "effect": "Decreases probability. After a humiliating attack and parliamentary vote to suspend IAEA cooperation, nationalist sentiment and regime legitimacy are tied to resisting perceived Western pressure. Rapid reversal risks political backlash."
                },
                {
                    "factor": "International Diplomatic Pressure and Sanctions",
                    "effect": "Increases probability slightly. The re-imposition of UN sanctions and the threat of further isolation put economic and diplomatic pressure on Iran, creating some incentive to partially restore cooperation if it can be cast as a sovereign decision."
                },
                {
                    "factor": "Security Concerns—Risk of Further Strikes",
                    "effect": "Mixed effect. Heightened risk of renewed Israeli or US strikes if uranium’s fate remains unclear incentivizes Iran to reduce ambiguity, but only if it can do so without appearing weak. However, the risk of inspectors revealing vulnerabilities also deters access."
                },
                {
                    "factor": "Negotiation Leverage and Timing",
                    "effect": "Decreases probability. Iran is likely to view inspections as a potent bargaining chip, to be traded only for significant concessions (e.g., sanctions relief, security guarantees), not unilaterally or under duress—especially with only weeks left in the year."
                },
                {
                    "factor": "Physical and Technical Constraints",
                    "effect": "Slightly decreases probability. The uranium is reportedly under rubble; recovery or safe inspection may not be feasible on short notice, giving Iran a plausible technical rationale for continued delay."
                },
                {
                    "factor": "Precedent and Base Rate",
                    "effect": "Decreases probability. Historically, post-crisis Iranian cooperation with the IAEA is slow—often requiring months of negotiation, external incentives, and face-saving measures. Last-minute, pre-deadline breakthroughs are rare."
                }
            ],
            "no_scenario": "Iran maintains its current stance, citing security concerns, nationalist sentiment, and technical obstacles. Despite ongoing international pressure and warnings from the IAEA, Tehran insists that inspections will not resume unless sanctions are lifted and security guarantees are provided—a process unlikely to be resolved in a matter of weeks. The uranium remains under rubble, and the IAEA is denied access until at least early 2026.",
            "yes_scenario": "A rapid escalation—such as credible intelligence of imminent Israeli or US military action, or a sudden severe economic shock from sanctions—forces Iran’s Supreme National Security Council to authorize limited IAEA access as a de-escalatory gesture. Inspections are permitted under tightly controlled circumstances, possibly with public framing that the access is temporary, partial, or conditional, but still sufficient to meet the resolution criteria (an agreement is announced before January 1, 2026).",
            "final_reasoning": "The base rate for Iran making rapid, unconditional concessions under pressure is low, especially on nuclear transparency. The domestic political climate is hostile to cooperation, and the regime has already set a precedent of suspending access after military attacks and international censure. While the risk of renewed strikes or deepening sanctions might push Iran toward tactical engagement, the time window is short and Tehran will be reluctant to appear as if it is capitulating under duress. The technical challenge of accessing uranium under rubble provides further plausible deniability for delay. Unless there is a dramatic shift—such as a backchannel US-Iran deal or an imminent threat of force—I assess that the probability of Iran announcing an agreement to allow IAEA inspections before January 1, 2026, is low but not zero. There is some incentive for a last-minute diplomatic gesture, but history and current signals point to continued defiance.",
            "final_probability": 15
        },
        "International Relations (Realism)": {
            "time_to_resolution": "Approximately 7 weeks (until January 1, 2026)",
            "perspective_relevance": "As an expert in International Relations (Realism), my analysis emphasizes the primacy of state interests, security dilemmas, balance-of-power dynamics, and the enduring logic of self-help in an anarchic international system. Realist theory expects states to act in ways that maximize regime survival, national security, and their relative power, often at the expense of international norms or agreements when these conflict with core interests. This perspective is particularly salient when forecasting Iran’s behavior under acute external threat, following direct military strikes, and in the context of ongoing great power competition.",
            "status_quo": "Iran is currently denying the IAEA access to its key enriched uranium stockpiles at Fordow, Natanz, and Isfahan, despite past frameworks for cooperation. Iran’s parliament has suspended cooperation, and recent attempts to revive inspections have failed, with Iranian officials stating no inspections are presently on the agenda.",
            "perspective_derived_factors": [
                {
                    "factor": "Regime Security and Deterrence Posture",
                    "effect": "Decreases probability. After foreign military strikes, Iran’s leadership is under acute security pressure, incentivized to maximize leverage, avoid transparency, and deter further attacks by maintaining ambiguity about its nuclear capabilities."
                },
                {
                    "factor": "International Sanctions and Great Power Pressures",
                    "effect": "Marginally increases probability. Reimposed UN sanctions and European pressure could make partial, symbolic cooperation attractive if Iran calculates that economic or diplomatic concessions might be gained, especially if Russia or China lean on Tehran to avoid escalation."
                },
                {
                    "factor": "Military Threat from Israel and the US",
                    "effect": "Decreases probability. The credible threat of further strikes if ambiguity persists might paradoxically harden Iran’s position, as acquiescence under duress could be seen as weakness, undermining deterrence and regime legitimacy."
                },
                {
                    "factor": "Domestic Political Dynamics",
                    "effect": "Decreases probability. The Iranian parliament overwhelmingly voted to suspend cooperation, indicating strong elite consensus against inspections and high domestic political costs for any reversal before perceived security assurances."
                },
                {
                    "factor": "Technical and Logistical Constraints",
                    "effect": "Marginally decreases probability. The uranium is physically buried under rubble in damaged, possibly unstable facilities, complicating any safe, timely inspection even if political will existed."
                },
                {
                    "factor": "Window for Tactical Concessions",
                    "effect": "Marginally increases probability. If Iran perceives a rapidly closing window to extract diplomatic concessions or forestall additional attacks, it might make a last-minute, tightly controlled inspection offer—possibly under a new, more restrictive framework."
                }
            ],
            "no_scenario": "Iran maintains its hardline position, citing national security and the threat of further military action. It continues to deny IAEA access to bombed sites, arguing that the uranium is inaccessible or unsafe due to rubble and that the IAEA’s recent actions have forfeited its impartiality. Domestic political consensus and regime security concerns override external pressure, and no agreement is announced by January 1, 2026.",
            "yes_scenario": "Facing escalating economic and diplomatic costs, mounting pressure from Europe, China, and Russia, and credible threats of renewed military action, Iran’s Supreme National Security Council authorizes a narrowly defined inspection agreement with the IAEA. The deal is announced in late December 2025, allowing limited, one-time access to verify uranium stockpiles at the bombed sites, possibly under heavy Iranian supervision and with major caveats.",
            "final_reasoning": "The status quo is Iran refusing IAEA access, justified internally by regime security and externally by perceived bias and the aftermath of military attacks. Recent history shows Iran only makes concessions when pressure is overwhelming and the regime can extract tangible benefits or avoid existential risks. The short time to resolution, deep mutual distrust, physical obstacles, and the high political costs of apparent capitulation all favor continued non-cooperation. While some international and technical incentives exist, they are weak relative to overwhelming regime survival imperatives, especially given the recent parliamentary consensus and heightened threat environment. Base rates for rapid Iranian transparency after kinetic conflict are very low. The only plausible path to a Yes outcome is a last-minute tactical concession—unlikely, but not impossible if regime survival calculus shifts. Given all factors, the probability is low but not zero.",
            "final_probability": 15
        },
        "International Relations (Liberal Institutionalism)": {
            "time_to_resolution": "Approximately 54 days (until January 1, 2026)",
            "perspective_relevance": "As an expert in International Relations (Liberal Institutionalism), my analysis emphasizes the role of international institutions (like the IAEA), regimes (NPT), norms, and the incentives states face in cooperating with multilateral organizations. Liberal institutionalism suggests that sustained cooperation, even among adversaries, is possible if institutions provide credible commitments, transparency, and mutual benefits. The institutional context, economic incentives (sanctions), and international diplomatic pressures are central to my forecast.",
            "status_quo": "Iran has suspended cooperation with the IAEA at the key bombed nuclear sites (Fordow, Natanz, Isfahan), has not allowed IAEA inspections of its 60% enriched uranium stockpile since the June 2025 war, and recently declared the September inspection agreement void after the snapback of UN sanctions. While there have been some inspections elsewhere, the relevant sites remain off-limits.",
            "perspective_derived_factors": [
                {
                    "factor": "UN and multilateral sanctions ('snapback' mechanism reimposed in September 2025)",
                    "effect": "Decreases probability. Iran has historically responded to increased sanctions with defiance and reduced transparency, especially when it perceives sanctions as unjust or politically motivated."
                },
                {
                    "factor": "Security dilemma and recent military strikes",
                    "effect": "Decreases probability. Following direct US and Israeli attacks, Iran views cooperation as a security risk and a possible prelude to further targeting; access to sites is now seen as leverage or a liability."
                },
                {
                    "factor": "International diplomatic pressure (IAEA, EU, China, Russia)",
                    "effect": "Slightly increases probability. While Iran is resistant to Western pressure, it sometimes accommodates international concerns to avoid complete isolation—especially when China and Russia urge dialogue."
                },
                {
                    "factor": "Domestic politics and nationalist sentiment in Iran",
                    "effect": "Decreases probability. The Iranian parliament overwhelmingly voted to suspend cooperation, and public discourse frames IAEA cooperation as capitulation after military humiliation."
                },
                {
                    "factor": "Possibility of further military escalation by Israel/US if IAEA is denied access",
                    "effect": "Slightly increases probability. Fear of renewed strikes could incentivize a tactical, limited inspection agreement as a de-escalatory gesture if credible threats are made."
                },
                {
                    "factor": "Institutional stickiness: Iran's continued NPT membership and past behavior",
                    "effect": "Slightly increases probability. Iran has not withdrawn from the NPT, and historically (even after crises), has returned to partial cooperation to retain some international legitimacy."
                },
                {
                    "factor": "Damage to nuclear facilities and technical feasibility",
                    "effect": "Neutral to slightly decreases probability. Iran claims material is 'under rubble' and inaccessible. Even if this is partly true, Iran may use it as a pretext to deny IAEA access until it has either recovered the uranium or determined its own next steps."
                }
            ],
            "no_scenario": "Iran maintains its hardline position, arguing that inspections are impossible due to the physical state of the sites and that any agreement is void as long as sanctions remain. The Supreme National Security Council refuses to authorize IAEA access, citing security and sovereignty. International pressure, including threats of renewed strikes or further sanctions, is insufficient to change Tehran's calculus before January 1, 2026. Iran may signal limited willingness to negotiate but insists on sanctions relief or Western concessions first, which are not forthcoming in time.",
            "yes_scenario": "Facing credible threats of renewed Israeli/US military action, significant diplomatic pressure from China and Russia, and/or a tactical calculation that limited IAEA access could forestall further escalation or open the door to sanctions relief, Iran's Supreme National Security Council authorizes a last-minute, face-saving agreement for the IAEA to inspect the stockpile at the bombed sites. The agreement is tightly controlled, possibly limited in scope, but is publicly announced before the deadline.",
            "final_reasoning": "The balance of evidence strongly favors a 'No' outcome, given the recent cancellation of the September deal, the reimposition of UN sanctions, hardening of Iranian domestic politics, and the direct linkage Iran has made between sanctions and suspension of IAEA cooperation. The institutional logic of liberal institutionalism suggests that renewed cooperation is possible if the institutional incentives change (e.g., if sanctions are credibly suspended or if Iran faces a dire threat), but the short time frame (less than two months), combined with the lack of meaningful progress since the September breakdown, makes a reversal unlikely. Past crises show Iran usually waits for a diplomatic opening or clear concession before resuming cooperation, which does not appear imminent. However, the risk of further military escalation or a sudden diplomatic breakthrough is not zero—thus, the probability should not be at the absolute minimum. A base rate for similar cases (post-crisis, pre-deadline, with hardline domestic sentiment and no sanctions relief) would be well below 20%. Given all factors, a probability of 13% most accurately reflects the chance of an announced inspection agreement before January 1, 2026.",
            "final_probability": 13
        },
        "International Relations (Constructivism)": {
            "time_to_resolution": "Approximately 54 days (until January 1, 2026)",
            "perspective_relevance": "As an expert in International Relations (Constructivism), I emphasize the role of norms, identities, and perceptions in shaping state behavior. Constructivism focuses on how Iran's self-conception as a sovereign, embattled state, its identity vis-à-vis the West, and the social meaning attached to IAEA inspections and nuclear sovereignty inform its choices. The interplay of external pressures, international norms (NPT obligations), and domestic identity discourses are central to assessing the likelihood of Iran allowing IAEA inspections.",
            "status_quo": "Iran is currently denying IAEA access to its main stockpile of enriched uranium at Fordow, Natanz, and Isfahan. A September 2025 deal to resume inspections was voided in October after the European powers triggered the 'snapback' mechanism, reinstating UN sanctions. Iran now conditions cooperation on the lifting of sanctions and security guarantees, and has entrenched its narrative of resistance and victimhood.",
            "perspective_derived_factors": [
                {
                    "factor": "National Identity and Sovereignty",
                    "effect": "Decreases probability. Iran's leadership frames inspections as infringements on sovereignty, especially after being attacked. Allowing access without major concessions would be domestically unpopular and contradict the regime's self-image as a defender of national pride."
                },
                {
                    "factor": "International Norms and Reputation",
                    "effect": "Increases probability. Iran's continued NPT membership and rhetorical commitment to peaceful nuclear energy create some incentive to avoid complete isolation or a 'North Korea' scenario. The regime is sensitive to being labeled an outlaw or pariah state, which may nudge it toward last-minute symbolic cooperation."
                },
                {
                    "factor": "Escalatory Pressures and Security Dilemma",
                    "effect": "Decreases probability. After recent airstrikes and perceived Western betrayal (sanctions snapback), Iran is likely to prioritize security and deterrence over transparency, fearing that cooperation will embolden further attacks or pressure."
                },
                {
                    "factor": "Conditional Bargaining and Instrumentalization of Inspections",
                    "effect": "Slightly increases probability. Iran has shown willingness to use inspections as bargaining chips in the past, signaling openness to compromise if it can extract concrete benefits (e.g., partial sanctions relief or security guarantees)."
                },
                {
                    "factor": "Domestic Political Constraints and Hardliner Influence",
                    "effect": "Decreases probability. The Iranian parliament overwhelmingly voted to suspend cooperation, and anti-Western sentiment is high after the war and renewed sanctions. The regime risks internal backlash if it appears to capitulate."
                },
                {
                    "factor": "External Mediation and Great Power Influence (China/Russia)",
                    "effect": "Marginally increases probability. Iran’s ties to China and Russia may encourage a face-saving way to resume symbolic cooperation, but only if mediated by these powers and coupled with tangible incentives."
                }
            ],
            "no_scenario": "Iran maintains its position that inspections are suspended until sanctions are lifted and security is guaranteed. The regime continues to deny IAEA access, citing national security and the destruction of facilities as justification. Domestic hardliners prevail, and the Supreme National Security Council blocks any deal, while Iran leverages ambiguity to avoid further escalation but without conceding on inspections. The IAEA raises the issue but Iran holds firm, betting that the West will not escalate further before 2026.",
            "yes_scenario": "Faced with mounting economic pressure from renewed sanctions, quiet mediation by China or Russia, and the threat of further Israeli or US strikes, Iran agrees in late December to a limited, face-saving deal that allows the IAEA to inspect uranium stockpiles at the bombed sites. This is framed domestically as a temporary, conditional measure to de-escalate and protect Iran’s national interest, with assurances of no further Western escalation or some small economic concession.",
            "final_reasoning": "The base rate for Iran permitting IAEA inspections under acute crisis and sanctions pressure is low, particularly when the regime perceives itself as under attack and betrayed by Western powers. Constructivist analysis highlights that Iran's identity as a defiant, sovereign actor and the social meaning of inspections as humiliation or submission make rapid reversal unlikely. The repeated invocation of Iran's NPT obligations and the desire to avoid pariah status provide some incentive for a last-minute symbolic concession, but the domestic political climate and security dilemma sharply constrain flexibility. Recent history (post-2019) shows Iran sometimes agrees to limited, last-minute access when facing existential pressure, but only if such moves can be spun as protecting dignity or extracting concessions. With less than two months left, the current trajectory is one of stalemate, with only a small window for a symbolic, partial agreement under mediation. Absent a major new crisis or diplomatic breakthrough, the most likely outcome is continued denial of access until 2026. However, given the international pressure and Iran's rhetorical commitment to the NPT, a nontrivial chance (but still below even odds) remains for a late, partial yes.",
            "final_probability": 25
        },
        "Security Studies (Nuclear Nonproliferation Theory)": {
            "time_to_resolution": "Approximately 55 days (until January 1, 2026)",
            "perspective_relevance": "As a Security Studies (Nuclear Nonproliferation Theory) expert, I bring a deep understanding of the technical, legal, and political dynamics of IAEA safeguards, state compliance behavior, and crisis bargaining under nuclear shadow. I can contextualize Iran’s past behavior, the role of international and domestic incentives, and the risk calculus in permitting or denying inspections, especially after military strikes and amid snapback sanctions.",
            "status_quo": "Iran is not allowing IAEA access to inspect its stockpile of enriched uranium at Fordow, Natanz, and Isfahan. Despite a brief agreement in September, as of late October and early November, Iran has formally suspended cooperation and access remains denied.",
            "perspective_derived_factors": [
                {
                    "factor": "Recency and scale of military strikes",
                    "effect": "Decreases probability. The June 2025 attacks by Israel and the US severely damaged Iran’s nuclear facilities and hardened Tehran’s perception of the IAEA as complicit with adversaries. This makes voluntary transparency less likely in the short term, as Iran views inspections as enabling targeting or further attacks."
                },
                {
                    "factor": "Reimposed UN sanctions and snapback mechanism",
                    "effect": "Decreases probability. The reimposition of sanctions by the EU3 and the UN, as well as the termination of the September 2025 IAEA inspection deal in response, has escalated diplomatic confrontation. Iran has a recent record of making inspections contingent on sanctions relief, which is not forthcoming."
                },
                {
                    "factor": "Base rate of state compliance after military strikes and under sanctions",
                    "effect": "Decreases probability. Historically, states that have suffered military attacks on their nuclear infrastructure (e.g., Iraq 1981, Syria 2007) have not responded with rapid new transparency. Iran’s pattern post-Stuxnet, Natanz 2020 sabotage, and now the 2025 strikes is to restrict, not expand, IAEA access."
                },
                {
                    "factor": "Iran’s domestic political incentives and narrative",
                    "effect": "Decreases probability. Iranian leaders face strong domestic pressure not to appear weak after the strikes and to resist Western demands, especially with parliamentary votes endorsing suspension of IAEA cooperation."
                },
                {
                    "factor": "Risk of renewed Israeli or US strikes if opacity persists",
                    "effect": "Slightly increases probability. There is a credible threat that continued opacity could trigger further attacks, which may incentivize Iran to offer symbolic cooperation to stave off new strikes. However, Iran may gamble that military risk is currently low with the stockpile buried and access technically difficult."
                },
                {
                    "factor": "International mediation and crisis diplomacy (China, Russia)",
                    "effect": "Slightly increases probability. China and Russia are incentivized to avoid escalation and may pressure Iran to show minimal compliance to prevent a broader crisis. However, their leverage is limited as they oppose Western sanctions and may shield Iran diplomatically."
                },
                {
                    "factor": "Technical barriers to inspection (stockpile under rubble, facility damage)",
                    "effect": "Decreases probability. Even if there were a diplomatic breakthrough, actual physical access is complicated by the fact that the uranium is buried under rubble, making inspections difficult to implement before January 1."
                }
            ],
            "no_scenario": "Iran maintains current policy, citing security, sovereignty, and retaliatory logic post-strikes. No new agreement is announced before January 1, 2026, and the IAEA has no physical access to the uranium stockpiles at Fordow, Natanz, or Isfahan. Continued diplomatic posturing and potential for indirect talks, but no breakthrough. Iran may allow access to less sensitive sites (e.g., Bushehr), but not to the sites with the 60% enriched uranium.",
            "yes_scenario": "A major diplomatic crisis or credible threat of further military action, likely spurred by new intelligence or a US/Israeli ultimatum, compels Iran to announce a limited agreement permitting IAEA access to the stockpiles for a one-time or symbolic inspection. Alternatively, Chinese or Russian mediation results in a face-saving deal for Iran, enabling minimal IAEA access to the sites before January 1, 2026—though the actual inspection may be partial or highly constrained.",
            "final_reasoning": "The base rate for rapid restoration of IAEA access after military strikes and amid major-power sanctions is extremely low. The status quo is durable: Iran’s domestic politics, the technical complications of buried stockpiles, and hardened diplomatic positions all point toward ongoing denial of access. While the risk of further Israeli or US military action creates some incentive for symbolic compliance, there is little evidence Iran is preparing to announce a new deal or that the West is offering the kind of incentives (sanctions relief, security guarantees) that might trigger a reversal. The only plausible path to a Yes outcome is a sudden crisis or diplomatic breakthrough, but current signals (October/November 2025) are of hardening, not thawing, positions. Given the short window to January 1, 2026, and the slow pace of past Iran-IAEA negotiations, the probability of a Yes outcome is very low.",
            "final_probability": 8
        },
        "Security Studies (Security Dilemma)": {
            "time_to_resolution": "Approximately 54 days (until January 1, 2026)",
            "perspective_relevance": "As a security studies expert specializing in the security dilemma, I focus on how mutual suspicion, escalatory spirals, signaling, and the interplay of security assurances and threats drive state behavior—especially in nuclear contexts. This perspective is highly relevant here because Iran’s nuclear transparency is shaped by both perceived threats (recent military attacks, sanctions snapback) and incentives (deterring further strikes, seeking relief from isolation) as well as the risks of appearing weak or inviting further coercion.",
            "status_quo": "Iran has suspended IAEA access to its principal enriched uranium stockpiles at Fordow, Natanz, and Isfahan following military strikes and the snapback of UN sanctions. Iran’s position is that the uranium is 'buried under rubble,' and cooperation with the IAEA remains halted. The IAEA has repeatedly requested access, but as of the latest reporting, Iran has not agreed to resume inspections at these sites.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent military strikes and sanctions snapback",
                    "effect": "Decreases probability. Iran feels under siege, sees IAEA inspections as leverage, and is wary of further concessions without reciprocal de-escalation. Security dilemma logic suggests increased mistrust and reduced transparency when threatened."
                },
                {
                    "factor": "Risk of renewed Israeli/US military action if uranium status remains unclear",
                    "effect": "Increases probability. If Iran assesses the threat of further strikes as acute, it may consider limited transparency to reduce escalation risks, especially if it believes it can do so without appearing to capitulate."
                },
                {
                    "factor": "Iranian domestic politics and anti-Western hardline stance post-strikes",
                    "effect": "Decreases probability. The government has won support for defiance, and reversing course risks domestic backlash or appearing weak to rivals and the public."
                },
                {
                    "factor": "International diplomatic pressure (EU, China, Russia)",
                    "effect": "Marginally increases probability. While China and Russia continue engagement, the EU’s snapback and Western unity mean diplomatic carrots are limited, but not absent. If Russia/China broker a face-saving formula, Iran may acquiesce."
                },
                {
                    "factor": "Technical reality: Uranium is physically inaccessible or risky to recover",
                    "effect": "Decreases probability. Iran can plausibly claim it cannot allow inspections for safety/technical reasons, buying time and avoiding a direct 'no.'"
                },
                {
                    "factor": "Precedent: Post-crisis nuclear access agreements (e.g., North Korea, Iraq)",
                    "effect": "Decreases probability. Most states in similar situations have delayed or denied access unless offered significant incentives or security guarantees."
                },
                {
                    "factor": "Short time window (less than two months to deadline)",
                    "effect": "Decreases probability. Diplomatic moves tend to be slow, and there is no sign of breakthrough talks or incentives."
                }
            ],
            "no_scenario": "Iran continues to block IAEA inspectors from Fordow, Natanz, and Isfahan, citing safety, sovereignty, or lack of trust due to snapback sanctions and recent attacks. The Supreme National Security Council refuses to approve inspections, perhaps offering to discuss access after further guarantees or post-2026. Iran may allow some access to non-bombed sites or offer technical reports but withholds direct inspection of the stockpiles.",
            "yes_scenario": "Facing credible threats of further military action or mounting diplomatic isolation (including pressure from China/Russia), Iran’s Supreme National Security Council authorizes a limited, highly controlled IAEA inspection at one or more bombed sites—perhaps without allowing free access, but enough to announce an agreement before the deadline. This would be framed domestically as a sovereign decision to avert war, not as bowing to Western demands.",
            "final_reasoning": "The base rate for rapid post-crisis nuclear access agreements is low, especially when the targeted state faces simultaneous military threats, sanctions, and domestic hardline pressure. The security dilemma is acute: Iran is incentivized to withhold cooperation as leverage, fearing that transparency could be exploited or that inspections would be used to justify further coercion. The technical reality (uranium under rubble) provides a plausible pretext for continued denial. While the threat of renewed strikes could prompt a last-minute change, there is currently no evidence of imminent escalation or a new deal in the works. The September attempt at a deal quickly collapsed, and the short timeline until 2026 makes a breakthrough unlikely. Thus, while not impossible, the probability of Iran announcing an agreement to allow IAEA inspections of its enriched uranium stockpiles at the key sites before January 1, 2026, is low.",
            "final_probability": 13
        },
        "Middle East Studies (Regional Security Complex Theory)": {
            "time_to_resolution": "Approximately 8 weeks (until January 1, 2026).",
            "perspective_relevance": "My expertise in Middle East Studies with a focus on Regional Security Complex Theory (RSCT) is directly relevant, as Iran's nuclear program sits at the core of the region's security interdependence. RSCT emphasizes the interconnectedness of regional actors, threat perceptions, alliance patterns, and the role of external powers, all of which shape Iran's calculations regarding nuclear transparency and cooperation with the IAEA.",
            "status_quo": "Iran is currently denying the IAEA access to inspect its stockpile of enriched uranium at Fordow, Natanz, and Isfahan. Cooperation agreements have repeatedly been voided or suspended in response to renewed sanctions (snapback mechanism) and military actions. Unless a significant shift occurs, Iran will continue to block inspections before 2026.",
            "perspective_derived_factors": [
                {
                    "factor": "Regional Security Dilemma and Threat Perceptions",
                    "effect": "Decreases probability. Iran perceives existential threats from Israel and the U.S.; after direct attacks on its nuclear infrastructure, Tehran is incentivized to limit transparency to preserve strategic ambiguity and deterrence."
                },
                {
                    "factor": "External Pressure and the Sanctions Regime",
                    "effect": "Slightly increases probability. The threat of additional sanctions or military strikes could push Iran toward limited, tactical concessions if it perceives economic or existential costs as intolerable."
                },
                {
                    "factor": "Internal Iranian Political Calculus and Elite Factionalism",
                    "effect": "Decreases probability. Hardliners, emboldened by the attacks and Western pressure, are unlikely to risk perceived humiliation or strategic vulnerability by allowing access unless they secure significant reciprocal gains."
                },
                {
                    "factor": "IAEA Leverage and International Diplomacy",
                    "effect": "Marginally increases probability. Continued diplomatic engagement, especially with mediation by China, Russia, or neutral actors (e.g., Egypt, as in the September talks), could enable a face-saving mechanism for partial or symbolic access."
                },
                {
                    "factor": "Technical and Logistical Realities at the Bombed Sites",
                    "effect": "Decreases probability. The uranium is reportedly 'under rubble,' complicating or delaying any practical inspection, even if an agreement were reached."
                },
                {
                    "factor": "Regional Security Complex Ripple Effects",
                    "effect": "Decreases probability. The risk of new Israeli strikes or further U.S. intervention if Iran appears to be stalling on transparency may reinforce Iranian intransigence, at least until after the New Year or until a new diplomatic opening."
                }
            ],
            "no_scenario": "The current stalemate persists: Iran continues to deny the IAEA access to the bombed sites, citing national security, the presence of military activities, and the invalidation of prior agreements in response to snapback sanctions and Western pressure. Internal politics and elite consensus favor resistance over engagement, and the technical situation (uranium under rubble, damaged facilities) provides plausible deniability. No breakthrough in diplomacy occurs before January 1, 2026.",
            "yes_scenario": "A crisis point is reached—either due to imminent new sanctions, credible threats of renewed Israeli or U.S. military action, or successful mediation by Russia, China, or regional powers (e.g., Egypt). Under acute pressure, Iran calculates that limited, controlled IAEA access (possibly with many caveats and restrictions) to the bombed sites is preferable to escalation or further isolation. An agreement is publicly announced before the 2026 deadline, even if actual inspections are symbolic or tightly managed.",
            "final_reasoning": "The base rate for rapid restoration of full IAEA access after military escalation and the imposition of new sanctions is very low, especially in the context of the regional security complex, where trust is at its nadir and incentives for transparency are minimal absent major reciprocal concessions. The repeated pattern in 2025 of Iran agreeing to, then voiding, inspection deals in response to hostile actions or sanctions, fits the RSCT prediction of a security dilemma spiral. Technical and logistical obstacles (uranium under rubble, facility damage) further complicate any rapid inspection. While extreme external pressure or a diplomatic breakthrough could force a tactical shift, the time frame to January 1, 2026 is very short—less than 2 months. Thus, while a 'Yes' outcome is not impossible if there is a crisis or major diplomatic intervention, the status quo and regional dynamics heavily favor a 'No' resolution.",
            "final_probability": 15
        }
    },
    "deliberation_probability": [
        15,
        10,
        15,
        15,
        15,
        13,
        25,
        8,
        13,
        15
    ],
    "deliberation_mean_probability": 14.4,
    "deliberation_sd": 4.4522154285504,
    "deliberation_probability_result": 14,
    "group_results": {
        "nuclearPolicyNonproliferationTreatyRegime": {
            "forecaster_to_engage": "International Relations (Constructivism)",
            "response_type": "critique",
            "response": "While the constructivist forecaster correctly highlights the importance of Iran's self-image, national identity, and the social meaning of inspections, their probability of 25% appears too high given the empirical base rate and current trajectory. The argument that Iran's rhetorical commitment to the NPT and aversion to pariah status could yield a last-minute, symbolic concession is plausible in abstract terms, but recent Iranian actions and statements—specifically, the parliamentary vote, cancellation of the September agreement, and repeated justification of non-cooperation as a response to 'humiliation'—suggest that identity-based narratives are reinforcing defiance, not facilitating compromise. The constructivist analysis underestimates how regime security and political cost calculations (often highlighted by realism and regime-type theories) override even identity-based incentives in a short time window. Furthermore, the technical excuse of uranium being 'under rubble' allows Iran to maintain NPT rhetorical compliance without substantive transparency, making a symbolic gesture less likely to materialize as a formal, announced agreement. Thus, while a nonzero chance remains, the upward deviation to 25% is not sufficiently justified by either current signals or historical precedent."
        },
        "nuclearPolicyIaeaSafeguardsSystem": {
            "forecaster_to_engage": "International Relations (Liberal Institutionalism)",
            "response_type": "defense",
            "response": "The liberal institutionalist's probability of 13% is well justified given the interplay between institutional incentives and the current hardening of positions on both sides. Their reasoning accurately notes that Iran’s cooperation with the IAEA is deeply contingent on shifts in institutional incentives, such as credible sanctions relief or a security guarantee—neither of which are evident in the short time frame before January 1, 2026. The forecast correctly emphasizes the importance of the September deal’s collapse, the linkage of inspections to external sanctions, and the historical tendency for Iran to require a significant diplomatic opening before resuming meaningful transparency. The analysis also properly calibrates for the small but non-zero chance of a last-minute crisis compelling Iran to act, which preserves analytical humility without overestimating the likelihood. Overall, the forecast is rigorous, grounded in both base rates and current signals, and avoids the pitfalls of both excessive pessimism and unwarranted optimism."
        },
        "diplomacyTrackTwoDiplomacy": {
            "forecaster_to_engage": "Security Studies (Security Dilemma)",
            "response_type": "defense",
            "response": "The Security Dilemma analysis is particularly strong in highlighting how Iran’s acute sense of vulnerability after recent military strikes drives its unwillingness to permit inspections. The emphasis on the plausible pretext provided by technical obstacles (i.e., uranium under rubble) is especially compelling from a Track Two diplomacy perspective, as these justifications are frequently used as face-saving devices in backchannel exchanges. The forecast rightly recognizes that transparency is viewed as a liability in Tehran’s current threat environment, and that any agreement would require either a dramatic shift in threat perception or a compelling incentive, neither of which is visible. By situating Iran’s behavior within the classic security dilemma spiral, the forecaster gives due weight to entrenched mistrust and the feedback loop of mutual suspicion, which is often overlooked by more institutionally or normatively oriented analyses. The probability assigned is appropriately low, and the reasoning is consistent with both historical precedent and present dynamics."
        },
        "diplomacyInternationalNegotiationPractice": {
            "forecaster_to_engage": "International Relations (Realism)",
            "response_type": "defense",
            "response": "The Realist analysis accurately captures the core dynamics at play—especially Iran’s overriding concern for regime survival and the high political costs of perceived capitulation. From the perspective of international negotiation practice, realism’s focus on concrete power calculations and survival imperatives is highly relevant: in the aftermath of military strikes and with domestic consensus against cooperation, the base rate for sudden, meaningful concessions is extremely low. The Realist forecaster also properly notes that only overwhelming pressure or existential threat would prompt a tactical reversal, which aligns with the observed pattern in high-stakes nuclear negotiations. Furthermore, the forecast’s recognition of the short time frame and entrenched status quo reflects a disciplined weighting of inertia and path dependence, both crucial in diplomatic forecasting. The assigned probability is thus well-calibrated and the reasoning robust, providing a strong model for scenario analysis under acute crisis conditions."
        },
        "internationalRelationsRealism": {
            "forecaster_to_engage": "Middle East Studies (Regional Security Complex Theory)",
            "response_type": "critique",
            "response": "While the Regional Security Complex Theory (RSCT) forecaster rightly identifies the compounded regional mistrust and the role of reciprocal threat spirals, their scenario slightly underplays the role of extra-regional powers and the possibility of coercive leverage by global actors. From a Realist perspective, the regional security complex is deeply embedded within the broader structure of inter-state power politics; thus, the direct interests and interventions of the US, Russia, and China can at times override or puncture regional inertia, especially if a last-minute, great power-brokered face-saving deal becomes necessary to prevent further escalation. Additionally, the RSCT account could give more weight to the possibility that Iran, facing the risk of a new round of strikes or a dramatic diplomatic move by a major power, might make a tactical and symbolic inspection concession. While the base rate remains low and the forecasted probability is reasonable, the analysis would be strengthened by a clearer integration of global power dynamics alongside regional ones, as these may be decisive in the narrow window before 2026."
        },
        "internationalRelationsLiberalInstitutionalism": {
            "forecaster_to_engage": "Nuclear Policy (NonProliferation Treaty Regime)",
            "response_type": "defense",
            "response": "This forecast stands out for its disciplined weighting of the status quo and base rate, especially in the context of recent parliamentary and public opposition in Iran. The forecaster’s focus on the adverse impact of sanctions snapback, domestic political resistance, and the regime’s use of technical obstacles as plausible deniability aligns closely with the institutional logic of liberal institutionalism. Their caution against overestimating the potential for a last-minute tactical maneuver is justified by both historical precedent and the short time frame. Furthermore, the acknowledgment that the technical excuse of uranium being 'under rubble' enables Iran to rhetorically comply with NPT obligations without substantive transparency is a crucial insight. The probability assigned is appropriately low, reflecting both the inertia of the current diplomatic impasse and the possibility—but not likelihood—of external pressure forcing a symbolic gesture."
        },
        "internationalRelationsConstructivism": {
            "forecaster_to_engage": "Diplomacy (Track Two Diplomacy)",
            "response_type": "critique",
            "response": "The Track Two Diplomacy forecast offers a nuanced view of the informal channels and mediation efforts that sometimes lead to surprise diplomatic breakthroughs. However, from a constructivist perspective, the analysis could better foreground the ideational and identity-based obstacles that make even small, symbolic gestures hazardous for the Iranian regime at this moment. While Track Two efforts do, in rare cases, produce late-stage deals, the Iranian state’s current narrative—rooted in resistance, victimhood, and distrust after perceived Western betrayal—means that any such deal must overcome more than just practical or diplomatic hurdles; it must reconcile with dominant narratives that frame inspections as capitulation and humiliation. The forecast underplays how these constructed meanings can harden positions and raise the political cost of compromise, even for face-saving gestures. Therefore, while the probability assigned is reasonable, the analysis would be strengthened by a deeper exploration of the domestic narrative constraints and the role of national identity in shaping what is diplomatically feasible within the short time frame."
        },
        "securityStudiesNuclearNonproliferationTheory": {
            "forecaster_to_engage": "Nuclear Policy (IAEA Safeguards System)",
            "response_type": "defense",
            "response": "The IAEA Safeguards System forecaster provides a well-calibrated estimate that closely matches the empirical base rate for restoration of inspections under acute crisis and trust breakdown. Their analysis is grounded in the realities of both institutional process and political inertia: parliamentary votes, public rhetoric, and technical obstacles are all correctly identified as reinforcing the status quo. The forecast is particularly strong in distinguishing between the existence of diplomatic incentives (which are necessary but not sufficient) and the lack of observable momentum toward an actual agreement. The low probability assigned is therefore justified by the historical record—wherein states rarely restore intrusive access in the wake of military attacks and sanctions without significant, protracted negotiation. This approach also avoids wishful thinking about 'symbolic' or partial deals, recognizing that even minimal inspection agreements require political groundwork that is currently absent. Overall, this is a rigorous and status-quo-weighted forecast that other forecasters should take as a benchmark for disciplined, base rate-driven estimation in the nuclear nonproliferation context."
        },
        "securityStudiesSecurityDilemma": {
            "forecaster_to_engage": "Diplomacy (International Negotiation Practice)",
            "response_type": "defense",
            "response": "The International Negotiation Practice analysis is notably strong in its attention to sequencing, signaling, and the time constraints inherent in high-stakes diplomacy. From a security dilemma perspective, this forecaster’s emphasis on the short window, the lack of credible incentives, and the regime’s reluctance to appear as capitulating under pressure is well-founded. Their assessment that technical obstacles provide plausible deniability for delay is consistent with how states under acute threat use ambiguity to maintain leverage and avoid escalation. Moreover, the recognition that only a dramatic shift—such as a credible threat of force or a backchannel breakthrough—would alter the current trajectory aligns with both negotiation theory and empirical base rates in nuclear crises. This forecast is appropriately cautious, avoiding both false precision and unwarranted optimism, and its probability estimate reflects the durable incentives for non-cooperation under the present security environment."
        },
        "middleEastStudiesRegionalSecurityComplexTheory": {
            "forecaster_to_engage": "International Relations (Constructivism)",
            "response_type": "critique",
            "response": "The constructivist approach appropriately highlights the importance of identity and norm-driven narratives in shaping Iranian state behavior, but the assigned probability of 25% for a 'Yes' outcome appears overly optimistic given the current strategic context. While identity factors and rhetorical commitment to the NPT can sometimes motivate symbolic gestures, the empirical record—especially in the wake of direct kinetic conflict and sanctions snapback—shows that such narratives are typically employed to justify resistance, not compromise, in the short term. The domestic political context is highly charged, with hardline actors dominating and recent parliamentary actions reinforcing defiance as a matter of both national pride and regime survival. Moreover, the technical excuse that uranium is 'under rubble' allows Iran to publicly maintain its NPT posture without conceding substantive transparency or inspection. While a last-minute, symbolic deal cannot be completely excluded, the magnitude of regime security concerns and the lack of visible diplomatic momentum make a probability in the 10-15% range far more consistent with historical precedent and the current signals. The analysis would be more robust if it better integrated the constraining effects of regime survival imperatives and the instrumental use of identity in posturing rather than genuine flexibility."
        }
    },
    "revision_results": {
        "Nuclear Policy (NonProliferation Treaty Regime)": {
            "my_phase1_final_probability": 15,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I see broad consensus among domain experts (NPT regime, IAEA safeguards, diplomacy, security studies, regional theory) that the base rate for a rapid Iranian reversal is very low, and that the current signals—voided deals, parliamentary opposition, technical pretexts, and hardened domestic politics—point toward continued non-cooperation. The one somewhat higher probability (Constructivism, 25%) was critiqued as overestimating the effect of identity and rhetorical incentives in the face of regime security calculations and recent behavior. No compelling new argument or evidence emerged to suggest a significant increase or decrease in the likelihood of a last-minute inspection agreement being announced before 2026. The outside chance of a tactical, symbolic gesture remains, but the short time frame and status quo inertia dominate. Therefore, I see no justification to change my original estimate.",
            "revised_probability": 15
        },
        "Nuclear Policy (IAEA Safeguards System)": {
            "my_phase1_final_probability": 10,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, particularly the critique of the constructivist's higher probability and the defense of the liberal institutionalist's estimate, I find additional support for my initial assessment. The consensus across relevant expert perspectives (NPT regime, realism, liberal institutionalism, security studies, and regional security complex theory) is that the probability is low—generally clustered between 8% and 15%. The main arguments remain: the short timeframe, collapse of prior agreements, hardened domestic and institutional resistance in Iran, and the lack of visible diplomatic momentum or meaningful incentives for rapid reversal. The technical and rhetorical pretexts for delay ('under rubble') further diminish the plausibility of a Yes outcome. The only scenario for reversal—an abrupt external crisis or major diplomatic breakthrough—remains speculative and unsupported by current signals. Therefore, I see no compelling reason to revise my probability, which is consistent with the modal expert view.",
            "revised_probability": 10
        },
        "Diplomacy (Track Two Diplomacy)": {
            "my_phase1_final_probability": 15,
            "reasoning_for_revised_probability": "Upon reviewing the group deliberation, my original probability of 15% remains well-supported. The consensus among forecasters from diverse perspectives (NPT, IAEA Safeguards, Realism, Regional Security Complex, Liberal Institutionalism, and Security Dilemma) converges on a low but nonzero likelihood, typically in the 8–15% range, with only the Constructivist forecaster going notably higher at 25%. Critiques of the higher estimate are persuasive: identity and norm-based incentives are currently overshadowed by immediate regime security concerns, adversarial domestic politics, and plausible technical pretexts for delay. The Security Dilemma and Liberal Institutionalist perspectives reinforce my view that while Track Two diplomacy and crisis-averting gestures are theoretically possible, there is scant evidence of imminent breakthrough, and the technical and political obstacles are formidable. The time window is very short, and recent history shows that even partial or face-saving agreements require more groundwork than is currently visible. Thus, my initial probability remains appropriate and requires no adjustment.",
            "revised_probability": 15
        },
        "Diplomacy (International Negotiation Practice)": {
            "my_phase1_final_probability": 15,
            "reasoning_for_revised_probability": "Reviewing the group deliberation, there is a notable consensus across disciplines—especially from Realism, Liberal Institutionalism, Security Dilemma, and Track Two Diplomacy—that the probability of Iran agreeing to IAEA inspections at the key sites before January 1, 2026, remains low. The strongest arguments reinforce points I previously weighted: regime survival, domestic political cost, and the durability of the status quo after military escalation. The only upward deviation came from Constructivism (25%), but this was persuasively critiqued as insufficiently grounded in current Iranian behavior and the available technical/political excuses for delay. No new evidence or argument emerged to justify a higher probability, and the group consensus trends toward the lower end of the spectrum (8-15%), with 10-15% being the modal cluster. Given this, I see no compelling reason to revise my initial probability upward or downward. The status quo remains entrenched, and the short time frame works against the likelihood of a breakthrough.",
            "revised_probability": 15
        },
        "International Relations (Realism)": {
            "my_phase1_final_probability": 15,
            "reasoning_for_revised_probability": "Group deliberation reinforced the low likelihood of a Yes outcome: nearly all forecasters, regardless of paradigm, converge on a probability in the low-to-mid teens, citing the entrenched status quo, acute regime security concerns, and the technical/political obstacles to rapid inspection. Even those emphasizing norms (Constructivism) or institutional incentives (Liberal Institutionalism) assign only a modest nonzero chance, mainly for a last-minute, crisis-driven tactical gesture. Critiques highlighted that the narrow time window and current hardline domestic and regional environment leave little room for a meaningful shift. The possibility of external great power intervention or a sudden tactical pivot remains, but the base rate and signals to date do not justify a higher probability. Thus, my initial estimate remains well-calibrated.",
            "revised_probability": 15
        },
        "International Relations (Liberal Institutionalism)": {
            "my_phase1_final_probability": 13,
            "reasoning_for_revised_probability": "Reviewing the group deliberation, there is a strong consensus among forecasters with diverse perspectives (Nuclear Policy, Realism, Track Two Diplomacy, Security Dilemma, Regional Security Complex) that the base rate for a rapid, formal Iranian reversal on IAEA access is extremely low given the current domestic, regional, and international environment. The only outlier, Constructivism, offered a higher probability (25%) by emphasizing identity and symbolic incentives, but this was effectively critiqued for overestimating the likelihood of a last-minute, face-saving gesture in the absence of credible shifts in incentive structures or external pressure. The dominant factors—hardened domestic politics, plausible technical pretext for delay, collapse of the September deal, and linkage to sanctions—remain determinative. No new information from deliberation suggests a change in institutional incentives or diplomatic dynamics that would warrant moving the probability meaningfully up or down. Therefore, I maintain my initial probability, as it is well-supported by both my own reasoning and group consensus.",
            "revised_probability": 13
        },
        "International Relations (Constructivism)": {
            "my_phase1_final_probability": 25,
            "reasoning_for_revised_probability": "The group deliberation reinforced the strength of the status quo and the empirical base rate: nearly all experts, whether drawing on NPT regime experience, security dilemma logic, negotiation practice, or regional systems theory, assign a probability in the low teens—typically between 10% and 15%. Critiques of my initial forecast highlighted that, while identity and rhetorical incentives for a symbolic concession exist, these are currently overwhelmed by domestic political costs, the technical plausibility of continued non-cooperation (uranium under rubble), and a hardened narrative of resistance. The consensus is that the window for even a face-saving, partial agreement is extremely narrow, and that the regime’s identity narrative presently reinforces intransigence rather than flexibility. Therefore, while not dropping to the absolute minimum due to the persistent incentive to avoid pariah status, I am lowering my probability to align more closely with the modal group assessment and historical precedent.",
            "revised_probability": 15
        },
        "Security Studies (Nuclear Nonproliferation Theory)": {
            "my_phase1_final_probability": 8,
            "reasoning_for_revised_probability": "The group deliberation reinforced my initial assessment that the base rate for rapid restoration of IAEA inspections in Iran after military strikes and renewed sanctions is extremely low. Nearly all forecasters from diverse backgrounds converged on a low-probability outcome, typically in the 10-15% range, with detailed arguments about the status quo, domestic resistance, technical pretexts, and the lack of diplomatic movement. The one higher estimate (25%, Constructivism) was widely critiqued as overestimating the chance of a symbolic gesture, with strong consensus that current identity narratives in Iran reinforce, rather than undermine, defiance. No new information emerged to suggest a shift toward a Yes scenario, and the group’s disciplined emphasis on inertia, base rate logic, and technical obstacles further validated my initial low estimate. Therefore, I maintain my original forecast, as the evidence overwhelmingly supports a continued status quo.",
            "revised_probability": 8
        },
        "Security Studies (Security Dilemma)": {
            "my_phase1_final_probability": 13,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, including defenses and critiques across related disciplines, my initial assessment is reinforced. Other forecasters using both institutionalist and realist frameworks converge on a base rate in the 10-15% range, citing the status quo, technical and political obstacles, and the lack of incentives or diplomatic momentum. No compelling new evidence or strong counter-argument emerged to justify a higher probability; if anything, the consensus and cross-disciplinary reasoning highlight the robustness of a low-probability forecast. The only slightly higher estimate (Constructivism at 25%) was critiqued as overestimating the likelihood of a symbolic gesture, given the domestic narrative constraints in Iran. Thus, the probability remains best placed at 13%.",
            "revised_probability": 13
        },
        "Middle East Studies (Regional Security Complex Theory)": {
            "my_phase1_final_probability": 15,
            "reasoning_for_revised_probability": "After reviewing other forecasters' analyses and the group deliberation, I find broad consensus that the probability of Iran announcing an agreement to allow IAEA inspections before January 1, 2026, is low. The main area of debate centers on whether the probability should be in the 10-15% range or slightly higher (as suggested by Constructivism at 25%). The critiques—particularly of the Constructivist view—highlight that, while identity and narrative factors might sometimes enable symbolic gestures, in this acute security dilemma the effect is to reinforce non-cooperation. The technical excuse of uranium 'under rubble' and the hardened domestic political context further support a low-probability estimate. No new arguments emerged that would justify a significant upward or downward revision; if anything, the group’s emphasis on the status quo, technical-pretext durability, and lack of external leverage slightly strengthens the case for keeping the estimate toward the lower end of my range. However, I also recognize the need for analytical humility given the risk of late-stage crisis-driven diplomacy, so I will maintain my original probability.",
            "revised_probability": 15
        }
    },
    "revision_probability": [
        15,
        10,
        15,
        15,
        15,
        13,
        15,
        8,
        13,
        15
    ],
    "revision_mean_probability": 13.4,
    "revision_sd": 2.503331114069145,
    "revision_probability_result": 13,
    "question_details": {
        "id": 40193,
        "title": "Will Iran allow the IAEA to inspect its stockpile of enriched uranium before 2026?",
        "created_at": "2025-11-05T19:20:33.417844Z",
        "open_time": "2025-11-06T15:30:00Z",
        "cp_reveal_time": "2025-11-06T17:00:00Z",
        "spot_scoring_time": "2025-11-06T17:00:00Z",
        "scheduled_resolve_time": "2026-01-01T01:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-11-06T17:00:00Z",
        "actual_close_time": "2025-11-06T17:00:00Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "A [brief, 12-day war](https://en.wikipedia.org/wiki/Iran%E2%80%93Israel_war) between Iran and Israel in June 2025 ended when American B-2 bombers dropped several [GBU-57](https://en.wikipedia.org/wiki/GBU-57A/B_MOP) 30,000-pound bunker-buster bombs on Iran's nuclear facilities in Natanz, Fordow, and Isfahan. On June 25, a day after the ceasefire began, Iranian lawmakers [overwhelmingly voted](https://www.rferl.org/a/iran-parliament-suspend-iaea-cooperation-nuclear/33454363.html) to suspend Iran's cooperation with the International Atomic Energy Agency (IAEA).\n\nOn September 9, 2025, Iran and the IAEA [announced](https://www.reuters.com/world/middle-east/iran-iaea-announce-agreement-resuming-nuclear-inspections-2025-09-09/) a deal to resume inspections at the bombed nuclear sites. But more recently, on October 20, [Reuters reported](https://www.reuters.com/world/middle-east/iran-says-cooperation-deal-with-un-nuclear-watchdog-is-void-2025-10-20/) that the deal had been scrapped. The IAEA [estimates](https://www.fdd.org/analysis/2025/10/20/iaea-chief-assesses-irans-enriched-uranium-stockpile-remains-inside-sites-destroyed-by-israel-and-u-s/) that Iran has 400 kilograms of 60% enriched uranium stockpiled at the bombed nuclear facilities.\n\n`{\"format\":\"metac_reveal_and_close_in_period\",\"info\":{\"post_id\":40437,\"question_id\":40007}}`",
        "resolution_criteria": "The question will resolve as **Yes** if, before January 1, 2026, Iran announces an agreement to allow the IAEA to inspect its stockpiles of enriched uranium at the Fordow, Natanz, and Isfahan nuclear sites.",
        "fine_print": "",
        "post_id": 40604,
        "aggregations": {
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**IAEA Inspectors Denied Access to Bombarded Iranian Nuclear Sites Amid Rising Tensions**\nAccording to a Financial Times (FT) article, the International Atomic Energy Agency (IAEA) has been denied access to nuclear facilities in Fordo, Natanz, and Isfahan in Iran—sites reportedly bombed by the United States—despite approximately ten IAEA inspections conducted in Iran since its conflict with Israel in June 2024. IAEA Director General Rafael Grossi confirmed that movement near uranium enrichment sites was observed in October 2024, but emphasized this does not indicate active enrichment. Iran's Foreign Ministry spokesperson Esmaeil Baghaei stated that Grossi is 'fully aware' of the peaceful nature of Iran's nuclear program and should refrain from 'unfounded opinions.' Iranian officials previously accused the IAEA of justifying Israel’s attacks, which began the day after the IAEA Board of Governors declared Iran in violation of its non-proliferation obligations. Grossi told FT that while the IAEA seeks to understand Iran’s 'difficult' circumstances, Iran must still comply with its safeguards obligations. He warned that if Iran is treated as exempt due to war, the IAEA would lose all visual access to materials. Grossi also highlighted the unresolved fate of 408 kilograms of uranium enriched nearly to weapons-grade levels. The FT notes experts fear Israel may launch further attacks if concerns over high-enriched uranium stocks are not addressed and if no progress is made on a nuclear deal between Washington and Tehran.\nOriginal language: ru\nPublish date: November 05, 2025 05:31 PM\nSource:[НОВОСТИ Mail.Ru](https://news.mail.ru/politics/68597023/)\n\n**Grossi Urges Iran to Avoid 'Confrontation' with the West Over Nuclear Program**\nRafael Grossi, Director General of the International Atomic Energy Agency (IAEA), warned Iran that its membership in the Non-Proliferation Treaty (NPT) is conditional upon fulfilling its commitments, urging improved cooperation with IAEA inspectors to avoid confrontation with the West. In an interview with the Financial Times, Grossi revealed that the IAEA conducted approximately 12 inspections since the outbreak of the Iran-Israel war in June 2024 but was denied access to key nuclear sites, including Fordo, Natanz, and Isfahan—sites previously targeted in U.S. airstrikes. He emphasized that the attacks caused significant damage and that the fate of 408 kilograms of uranium enriched close to weapons-grade remains unclear, heightening the urgency for resumed inspections. Grossi stated, 'Iran cannot claim membership in the NPT while failing to meet its obligations,' and stressed that the IAEA seeks to manage its 'volatile' relationship with Tehran through understanding and restraint, but cannot accept war as a justification for evading responsibilities. In response, Iranian Foreign Ministry spokesperson Ismail Baghaei asserted that the IAEA 'understands the peaceful nature of Iran’s nuclear program' and urged it to avoid 'statements not grounded in reality.' Foreign Minister Abbas Araghchi claimed Iran’s enriched uranium stockpile is 'buried under rubble' and reiterated Iran’s refusal to negotiate with the U.S. on 'zero enrichment' or its missile program, though it remains open to fair nuclear talks based on 'mutual benefit.' Following the 12-day conflict, Iran suspended cooperation with the IAEA, prompting analysts and diplomats to warn that continued uncertainty over the enriched uranium could lead Israel to launch new strikes, especially amid stalled U.S.-Iran negotiations. Observers stress that resolving the crisis requires full access for international inspectors, clarification on the fate of the enriched uranium, and genuine political will to restart dialogue. China’s Foreign Minister Wang Yi, in a phone call with Araghchi, urged resumption of nuclear talks, commended Iran’s reaffirmation of the peaceful nature of its program, and affirmed support for its right to peaceful nuclear energy, calling for all parties to maintain communication channels. This follows the UN’s reinstatement of nuclear-related sanctions in September 2024 after the UK, France, and Germany activated the 'snapback mechanism' over alleged violations of the 2015 nuclear deal. The June 2024 attacks on Iran’s nuclear facilities by the U.S. and Israel have severely strained relations between Tehran and the IAEA.\nOriginal language: ar\nPublish date: November 05, 2025 04:39 PM\nSource:[صحيفة الشرق الأوسط](https://aawsat.com/node/5205452)\n\n**Grossi Warns: Iran Still Holds All Enriched Uranium After Recent Nuclear Strikes**\nRafael Grossi, Director General of the International Atomic Energy Agency (IAEA), warned on Wednesday, November 5, 2025, that tensions between Iran and Western countries persist due to Iran's lack of cooperation in inspections of its nuclear facilities. According to Grossi, Iran has not allowed IAEA inspectors access to its most critical sites since the recent Israeli and American strikes. He stated that Iran still retains nearly its entire stockpile of enriched uranium, despite damage to nuclear facilities during the brief conflict with Israel in June 2025. The targeted facilities include Fordo, Natanz, and Isfahan. Grossi emphasized that the fate of approximately 408 kilograms of uranium close to weapons-grade use remains unknown, heightening the urgency for resumed inspections. The IAEA has conducted around 12 inspection visits since the attacks but has been denied access to key sites. Grossi noted that relations with Tehran are managed through efforts to reach understanding, but require greater Iranian commitment to transparency. This information was reported by 'Al-Bawaba' news portal.\nOriginal language: ar\nPublish date: November 05, 2025 02:15 PM\nSource:[بوابة اخبار اليوم](https://m.akhbarelyom.com/news/NewDetails/4719682/1/%D8%AC%D8%B1%D9%88%D8%B3%D9%8A-%D9%8A%D8%AD%D8%B0%D8%B1-%D8%A5%D9%8A%D8%B1%D8%A7%D9%86-%D9%85%D8%A7-%D8%B2%D8%A7%D9%84%D8%AA-%D8%AA%D8%AD%D8%AA%D9%81%D8%B8-%D8%A8%D9%83%D9%84-%D8%A7%D9%84%D9%8A%D9%88%D8%B1)\n\n**IAEA Urges Iran for Substantial Improvement in Cooperation with Inspectors**\nRafael Grossi, Director General of the International Atomic Energy Agency (IAEA), urged Iran to make a 'substantial improvement' in its cooperation with UN international inspectors, warning that escalating tensions with the West could have serious consequences. Despite nearly 12 inspections conducted by the IAEA in Iran since the conflict with Israel in June 2024, access has been denied to key nuclear sites including Fordo, Natanz, and Isfahan—locations previously targeted by U.S. strikes. Grossi emphasized that the fate of 408 kilograms of uranium enriched to levels near weapons-grade remains unclear, creating an 'increasing sense of urgency' to resume inspections, stating, 'We really need to restart inspection activities.' The IAEA relies on satellite imagery to monitor sites damaged by airstrikes. While Grossi stated that referring Iran to the UN Security Council is not currently necessary, he stressed that cooperation must improve significantly. Iran suspended its cooperation with the IAEA following the war and has faced strong criticism from Iranian officials toward both the agency and Grossi. In response, European powers invoked the 'snapback mechanism' at the UN, demanding the reimposition of international sanctions due to Iran’s lack of cooperation. The European countries called for Iran to resume talks with the U.S., fully cooperate with the IAEA, and clarify the status of its high-enriched uranium stockpile. Iran’s Foreign Ministry spokesperson, Ismail Baghaei, criticized the 'contradictory statements' from IAEA officials, saying they would not serve cooperation. Iran asserts its right to uranium enrichment under the Non-Proliferation Treaty and claims it will not abandon enrichment but is open to discussing potential restrictions. The IAEA previously reported unverified movements at inaccessible nuclear sites and emphasized the need to confirm that enriched uranium has not been diverted for military use. Grossi told the Financial Times that 'the damage was severe, but our available assessment indicates that most, if not all, of the uranium enriched to 60 percent—along with material enriched to 20%, 5%, and 2%—remains present,' adding, 'The material is still there, and although we do not attribute any final purpose to it, the mere availability of highly enriched uranium, approaching weapons-grade, is a source of concern.'\nOriginal language: ar\nPublish date: November 05, 2025 02:04 PM\nSource:[اليوم السابع](https://m2.youm7.com/story/2025/11/5/%D9%88%D9%83%D8%A7%D9%84%D8%A9-%D8%A7%D9%84%D8%B7%D8%A7%D9%82%D8%A9-%D8%A7%D9%84%D8%B0%D8%B1%D9%8A%D8%A9-%D8%AA%D8%AF%D8%B9%D9%88-%D8%A5%D9%8A%D8%B1%D8%A7%D9%86-%D8%A5%D9%84%D9%89-%D8%AA%D8%AD%D8%B3%D9%8A%D9%86-%D8%AC%D9%88%D9%87%D8%B1%D9%8A-%D9%81%D9%8A-%D8%A7%D9%84%D8%AA%D8%B9%D8%A7%D9%88%D9%86/7185700)\n\n**IAEA urges Iran to step up cooperation**\nThe International Atomic Energy Agency (IAEA) chief, Rafael Grossi, urged Iran to 'seriously improve' its cooperation with UN nuclear inspectors to prevent escalating tensions with the West, according to a November 5, 2025 report by The Express Tribune citing the Financial Times. Grossi stated that despite approximately a dozen inspections conducted in Iran since hostilities with Israel began in June 2025, access to key nuclear facilities—including Fordow, Natanz, and Isfahan—had not been granted, facilities that were previously bombed by the United States. In October 2025, Grossi reported detecting movement near Iran’s enriched uranium stockpile but clarified that this did not indicate active enrichment. Iranian Foreign Ministry spokesperson Esmaeil Baghaei responded by asserting that Grossi was 'fully aware of the peaceful nature' of Iran’s nuclear program and criticized him for expressing 'unfounded opinions.' Iranian officials have accused the IAEA of providing a pretext for Israel’s military actions, which commenced the day after the IAEA board voted to declare Iran in violation of its obligations under the Nuclear Non-Proliferation Treaty.\nOriginal language: en\nPublish date: November 05, 2025 09:04 PM\nSource:[The Express Tribune](https://tribune.com.pk/story/2576081/iaea-urges-iran-to-step-up-cooperation)\n\n**IAEA Inspectors Denied Access to Bombarded Iranian Nuclear Sites Amid Rising Tensions**\nAccording to a Financial Times (FT) article, the International Atomic Energy Agency (IAEA) has been denied access to nuclear facilities in Fordo, Natanz, and Isfahan in Iran—sites reportedly bombed by the United States—despite approximately ten IAEA inspections conducted in Iran since its conflict with Israel in June 2024. IAEA Director General Rafael Grossi confirmed that movement near uranium enrichment sites was observed in October 2024, but emphasized this does not indicate active enrichment. Iran's Foreign Ministry spokesperson Esmaeil Baghaei stated that Grossi is 'fully aware' of the peaceful nature of Iran's nuclear program and should refrain from 'unfounded opinions.' Iranian officials previously accused the IAEA of justifying Israel’s attacks, which began the day after the IAEA Board of Governors declared Iran in violation of its non-proliferation obligations. Grossi told FT that while the IAEA seeks to understand Iran’s 'difficult' circumstances, Iran must still comply with its safeguards obligations. He warned that if Iran is treated as exempt due to war, the IAEA would lose all visual access to materials. Grossi also highlighted the unresolved fate of 408 kilograms of uranium enriched nearly to weapons-grade levels. The FT notes experts fear Israel may launch further attacks if concerns over high-enriched uranium stocks are not addressed and if no progress is made on a nuclear deal between Washington and Tehran.\nOriginal language: ru\nPublish date: November 05, 2025 05:31 PM\nSource:[НОВОСТИ Mail.Ru](https://news.mail.ru/politics/68597023/)\n\n**Grossi Urges Iran to Avoid 'Confrontation' with the West Over Nuclear Program**\nRafael Grossi, Director General of the International Atomic Energy Agency (IAEA), warned Iran that its membership in the Non-Proliferation Treaty (NPT) is conditional upon fulfilling its commitments, urging improved cooperation with IAEA inspectors to avoid confrontation with the West. In an interview with the Financial Times, Grossi revealed that the IAEA conducted approximately 12 inspections since the outbreak of the Iran-Israel war in June 2024 but was denied access to key nuclear sites, including Fordo, Natanz, and Isfahan—sites previously targeted in U.S. airstrikes. He emphasized that the attacks caused significant damage and that the fate of 408 kilograms of uranium enriched close to weapons-grade remains unclear, heightening the urgency for resumed inspections. Grossi stated, 'Iran cannot claim membership in the NPT while failing to meet its obligations,' and stressed that the IAEA seeks to manage its 'volatile' relationship with Tehran through understanding and restraint, but cannot accept war as a justification for evading responsibilities. In response, Iranian Foreign Ministry spokesperson Ismail Baghaei asserted that the IAEA 'understands the peaceful nature of Iran’s nuclear program' and urged it to avoid 'statements not grounded in reality.' Foreign Minister Abbas Araghchi claimed Iran’s enriched uranium stockpile is 'buried under rubble' and reiterated Iran’s refusal to negotiate with the U.S. on 'zero enrichment' or its missile program, though it remains open to fair nuclear talks based on 'mutual benefit.' Following the 12-day conflict, Iran suspended cooperation with the IAEA, prompting analysts and diplomats to warn that continued uncertainty over the enriched uranium could lead Israel to launch new strikes, especially amid stalled U.S.-Iran negotiations. Observers stress that resolving the crisis requires full access for international inspectors, clarification on the fate of the enriched uranium, and genuine political will to restart dialogue. China’s Foreign Minister Wang Yi, in a phone call with Araghchi, urged resumption of nuclear talks, commended Iran’s reaffirmation of the peaceful nature of its program, and affirmed support for its right to peaceful nuclear energy, calling for all parties to maintain communication channels. This follows the UN’s reinstatement of nuclear-related sanctions in September 2024 after the UK, France, and Germany activated the 'snapback mechanism' over alleged violations of the 2015 nuclear deal. The June 2024 attacks on Iran’s nuclear facilities by the U.S. and Israel have severely strained relations between Tehran and the IAEA.\nOriginal language: ar\nPublish date: November 05, 2025 04:39 PM\nSource:[صحيفة الشرق الأوسط](https://aawsat.com/node/5205452)\n\n**IAEA chief urges Iran to restore nuclear transparency**\nIAEA Director General Rafael Grossi urged Iran to enhance cooperation with UN nuclear inspectors to prevent escalation with Western powers. Following a 12-day conflict with Israel in June 2024, which included US airstrikes on Iran’s Fordow, Natanz, and Isfahan nuclear sites, Iran has limited engagement with the IAEA. Iranian officials claim the damaged facilities can no longer be monitored under previous inspection frameworks and argue that IAEA reports contributed to the conflict. Although a new cooperation framework was signed in Cairo shortly after the war, Iran withdrew in September 2024 after France, Germany, and the UK activated the sanctions snapback mechanism. Since the war, the IAEA has conducted around a dozen inspections, but access to sensitive nuclear sites remains blocked—only the Bushehr nuclear power plant has been visited, where inspectors observed a routine fuel replacement. Iran has not formally withdrawn from the Nuclear Non-Proliferation Treaty (NPT), but Grossi warned that the status of 408kg of uranium enriched close to weapons-grade levels remains unclear. He stated, 'We should have already resumed the inspection work,' and cautioned that failing to meet NPT obligations cannot be justified by wartime circumstances. Grossi emphasized that even without a declared purpose, highly enriched uranium at 60%, 20%, 5%, and 2% levels poses a serious proliferation risk. He noted that current assessments indicate most or all of this material remains on site, but stressed that cooperation must improve significantly to avoid further diplomatic fallout. While referral to the UN Security Council is currently unnecessary, Grossi warned that continued non-compliance could lead to such action. Iranian Foreign Ministry spokesperson Esmaeil Baghaei responded on November 4, 2025, stating that 'contradictory remarks' by IAEA officials hinder constructive engagement.\nOriginal language: en\nPublish date: November 05, 2025 03:36 PM\nSource:[bne IntelliNews](https://www.intellinews.com/iaea-chief-urges-iran-to-restore-nuclear-transparency-409853/)\n\n**Grossi Warns: Iran Still Holds All Enriched Uranium After Recent Nuclear Strikes**\nRafael Grossi, Director General of the International Atomic Energy Agency (IAEA), warned on Wednesday, November 5, 2025, that tensions between Iran and Western countries persist due to Iran's lack of cooperation in inspections of its nuclear facilities. According to Grossi, Iran has not allowed IAEA inspectors access to its most critical sites since the recent Israeli and American strikes. He stated that Iran still retains nearly its entire stockpile of enriched uranium, despite damage to nuclear facilities during the brief conflict with Israel in June 2025. The targeted facilities include Fordo, Natanz, and Isfahan. Grossi emphasized that the fate of approximately 408 kilograms of uranium close to weapons-grade use remains unknown, heightening the urgency for resumed inspections. The IAEA has conducted around 12 inspection visits since the attacks but has been denied access to key sites. Grossi noted that relations with Tehran are managed through efforts to reach understanding, but require greater Iranian commitment to transparency. This information was reported by 'Al-Bawaba' news portal.\nOriginal language: ar\nPublish date: November 05, 2025 02:15 PM\nSource:[بوابة اخبار اليوم](https://m.akhbarelyom.com/news/NewDetails/4719682/1/%D8%AC%D8%B1%D9%88%D8%B3%D9%8A-%D9%8A%D8%AD%D8%B0%D8%B1-%D8%A5%D9%8A%D8%B1%D8%A7%D9%86-%D9%85%D8%A7-%D8%B2%D8%A7%D9%84%D8%AA-%D8%AA%D8%AD%D8%AA%D9%81%D8%B8-%D8%A8%D9%83%D9%84-%D8%A7%D9%84%D9%8A%D9%88%D8%B1)\n\n**IAEA Urges Iran for Substantial Improvement in Cooperation with Inspectors**\nRafael Grossi, Director General of the International Atomic Energy Agency (IAEA), urged Iran to make a 'substantial improvement' in its cooperation with UN international inspectors, warning that escalating tensions with the West could have serious consequences. Despite nearly 12 inspections conducted by the IAEA in Iran since the conflict with Israel in June 2024, access has been denied to key nuclear sites including Fordo, Natanz, and Isfahan—locations previously targeted by U.S. strikes. Grossi emphasized that the fate of 408 kilograms of uranium enriched to levels near weapons-grade remains unclear, creating an 'increasing sense of urgency' to resume inspections, stating, 'We really need to restart inspection activities.' The IAEA relies on satellite imagery to monitor sites damaged by airstrikes. While Grossi stated that referring Iran to the UN Security Council is not currently necessary, he stressed that cooperation must improve significantly. Iran suspended its cooperation with the IAEA following the war and has faced strong criticism from Iranian officials toward both the agency and Grossi. In response, European powers invoked the 'snapback mechanism' at the UN, demanding the reimposition of international sanctions due to Iran’s lack of cooperation. The European countries called for Iran to resume talks with the U.S., fully cooperate with the IAEA, and clarify the status of its high-enriched uranium stockpile. Iran’s Foreign Ministry spokesperson, Ismail Baghaei, criticized the 'contradictory statements' from IAEA officials, saying they would not serve cooperation. Iran asserts its right to uranium enrichment under the Non-Proliferation Treaty and claims it will not abandon enrichment but is open to discussing potential restrictions. The IAEA previously reported unverified movements at inaccessible nuclear sites and emphasized the need to confirm that enriched uranium has not been diverted for military use. Grossi told the Financial Times that 'the damage was severe, but our available assessment indicates that most, if not all, of the uranium enriched to 60 percent—along with material enriched to 20%, 5%, and 2%—remains present,' adding, 'The material is still there, and although we do not attribute any final purpose to it, the mere availability of highly enriched uranium, approaching weapons-grade, is a source of concern.'\nOriginal language: ar\nPublish date: November 05, 2025 02:04 PM\nSource:[اليوم السابع](https://m2.youm7.com/story/2025/11/5/%D9%88%D9%83%D8%A7%D9%84%D8%A9-%D8%A7%D9%84%D8%B7%D8%A7%D9%82%D8%A9-%D8%A7%D9%84%D8%B0%D8%B1%D9%8A%D8%A9-%D8%AA%D8%AF%D8%B9%D9%88-%D8%A5%D9%8A%D8%B1%D8%A7%D9%86-%D8%A5%D9%84%D9%89-%D8%AA%D8%AD%D8%B3%D9%8A%D9%86-%D8%AC%D9%88%D9%87%D8%B1%D9%8A-%D9%81%D9%8A-%D8%A7%D9%84%D8%AA%D8%B9%D8%A7%D9%88%D9%86/7185700)\n\n**Iran: Enriched Uranium Remains Under Ruins of Nuclear Facilities**\nIran's Foreign Minister Abbas Araghchi stated in a televised interview with Al Jazeera, published on his Telegram channel on November 2, 2025, that the 400 kilograms of uranium enriched to 60%—which disappeared after U.S. strikes on three major Iranian nuclear facilities—remain 'where they were before the attacks.' He emphasized that most of the material is located underground and that Iran has no intention of retrieving it until 'necessary conditions' are met. Araghchi acknowledged uncertainty about how much of the 400 kg survived the attacks, noting that the damage to the facilities, including buildings, equipment, and machinery, was 'significant.' However, he asserted that Iran's uranium enrichment technology remains intact and that 'our will has not disappeared, even after this.' The U.S. joined Israel in the conflict after Israel launched a large-scale attack on Iran on June 13, 2025, targeting nuclear and military sites. The U.S. conducted strikes on facilities in Fordo, Natanz, and Isfahan. A ceasefire agreement between Israel and Iran took effect on June 24, 2025. While Israel aimed to prevent Iran from developing a nuclear weapon—denied by Tehran—the U.S. intelligence found no evidence of such a program. U.S. President Donald Trump claimed the Iranian nuclear program was 'completely destroyed.' However, the International Atomic Energy Agency (IAEA) confirmed it cannot track the 400 kg of enriched uranium and its director, Rafael Grossi, stated in late June 2025 that Iran could resume enrichment within months. In response to U.S. calls for renewed negotiations, Araghchi said Iran might consider a 'reasonable, balanced, and fair' proposal but reiterated that it would not abandon uranium enrichment.\nOriginal language: ru\nPublish date: November 03, 2025 12:20 PM\nSource:[Deutsche Welle](https://www.dw.com/ru/glava-mid-irana-obogasennyj-uran-nahoditsa-pod-ruinami-adernyh-obektov/a-74597484)\n\n**U.N. Watchdog Agency Detects Nuclear Activity in Iran**\nRafael Grossi, Director of the International Atomic Energy Agency (IAEA), reported on October 31, 2025, that suspicious activity has been detected at Iran's bombed-out nuclear sites—Fordow, Natanz, and Isfahan—following U.S. and Israeli airstrikes in June 2025, which destroyed the facilities after the IAEA censured Iran for violating nuclear non-proliferation obligations. Although there is no evidence that Iran has resumed uranium enrichment, the IAEA believes the 'majority' of Iran's stockpile of near-weapons-grade uranium (enriched to 60%) remains intact and likely buried in the ruins of the destroyed sites. Grossi emphasized that the agency is currently inspecting in Iran but not at all required sites, with ongoing discussions to resume access to Natanz, Fordow, and Isfahan. He noted that while industrial activity is observed at the sites, it does not indicate enrichment work. Grossi stressed the importance of verifying the location and status of the enriched uranium to prevent diversion. He warned that if Iran could resume enrichment from 60% to weapons-grade, it could produce up to ten nuclear warheads. Additionally, European intelligence reports indicate Iran imported 2,000 tons of sodium perchlorate from China—a key component for solid-fuel ballistic missiles—though U.N. sanctions do not explicitly prohibit such imports. Jeffrey Lewis, director of the East Asia Nonproliferation Program, noted that this quantity could fuel around 500 missiles, suggesting Iran is replenishing depleted stockpiles after prior production levels of about 200 missiles per month.\nOriginal language: en\nPublish date: October 31, 2025 11:44 PM\nSource:[Breitbart](https://www.breitbart.com/middle-east/2025/10/31/u-n-nuclear-watchdog-detects-nuclear-activity-in-iran/)\n\n**IAEA: Iran Has Not Resumed Enrichment, But Activity Detected Near Uranium Stockpile**\nAccording to Rafael Grossi, head of the International Atomic Energy Agency (IAEA), Iran has not resumed uranium enrichment since the outbreak of the war with Israel in June 2024. However, IAEA inspectors have observed activity near facilities storing Iran's 60% enriched uranium stockpile. Grossi previously stated on October 18, 2024, that most of Iran's 60% enriched uranium remained in nuclear facilities in Isfahan, Fordo, and Natanz. These sites were targeted in Israel's 'Rising Lion' operation, which triggered the brief conflict, followed by U.S. strikes using bunker-busting bombs. Grossi confirmed that the facilities were severely damaged but the uranium stock itself was largely unaffected. A leaked IAEA report from September 2024 indicated Iran possessed 440 kilograms of enriched uranium by June 2024; Grossi now estimates this stock at approximately 400 kilograms. Access to the uranium will depend on Iran's willingness to cooperate. Grossi questioned whether the IAEA would be allowed to access the material, whether Iran would retain it, reduce enrichment levels again, or transfer it abroad, emphasizing that dialogue could prevent another round of airstrikes. Iran severed ties with the IAEA after the Israeli and U.S. strikes, then restored relations under a new framework allowing IAEA inspectors to enter nuclear sites only with approval from Iranian security agencies. However, Iranian Foreign Minister Abbas Araghchi announced this month that the agreement is no longer valid due to the activation of the European Union's 'trigger mechanism'.\nOriginal language: ar\nPublish date: October 29, 2025 07:35 PM\nSource:[Albawaba](https://www.albawabhnews.com/5285607)\n\n**UN Nuclear Chief Says Iran Isn't Actively Enriching Uranium but Movement Detected Near Stockpile**\nRafael Mariano Grossi, Director General of the International Atomic Energy Agency (IAEA), stated during an interview at UN headquarters on October 29, 2025, that Iran is not currently actively enriching uranium, though recent satellite imagery has detected movement around storage sites holding previously enriched uranium. Grossi emphasized that uranium enriched to 60%—which could enable Iran to produce up to 10 nuclear bombs if weaponized—remains in Iran, and the IAEA needs physical access to verify its status and prevent diversion. Despite a recent agreement signed in Cairo to resume cooperation, including inspections, implementation has not yet occurred. The agreement followed Iran’s suspension of cooperation after the June 2025 12-day war with Israel, during which the US conducted strikes on Iranian nuclear sites, including the Fordo facility. Preliminary US intelligence indicated the strikes only delayed Iran’s program by a few months, as the underground infrastructure at Fordo remained intact. The IAEA board had previously censured Iran for noncooperation—the first such action in 20 years—prompting Iran to accuse the agency of aiding Israel and the US, leading to threats against Grossi, who now receives protection from Austria’s Cobra unit. Grossi confirmed that inspectors are currently inside Iran and he maintains 'constant contact' with Foreign Minister Abbas Araghchi, though he stressed that cooperation is not at the required level and that the situation is neither fully denied nor fully compliant. Additionally, UN sanctions have been reimposed under the 'snapback' mechanism due to Iran’s noncompliance, further straining relations. Grossi confirmed there is no active enrichment operation at the Isfahan site as of October 29, 2025.\nOriginal language: en\nPublish date: October 29, 2025 06:10 PM\nSource:[Asharq Al-Awsat English](https://english.aawsat.com/node/5202964)\n\n**U.N. atomic watchdog chief said Iran's enriched uranium still under rubble from air attacks**\nAccording to Rafael Grossi, Director General of the International Atomic Energy Agency (IAEA), most of Iran's stockpile of highly enriched uranium—approximately 400 kilograms enriched to 60% (just below weapons-grade)—remains buried under rubble at nuclear facilities in Isfahan, Natanz, and Fordo following Israeli and U.S. airstrikes during a 12-day conflict in June 2025. Grossi stated that while the damage was severe, Iran's technical capabilities, including its centrifuges, remain intact and can be rebuilt. The IAEA confirmed no evidence that Iran intends to build a nuclear bomb, but acknowledged Iran possesses enough enriched uranium for at least 10 nuclear bombs. Satellite imagery from late September and early October indicates recent activity at two of the three tunnel entrances at the Isfahan complex, suggesting preparations for controlled access and enhanced protection against future strikes, according to the Institute for Science and International Security (ISIS). ISIS also noted that the U.S. and Israel have not publicly detailed the extent of damage at Isfahan, unlike the Fordo site. The think tank speculated that advanced Joint Multiple Effects Warhead System warheads may have been used on Tomahawk missiles, enhancing bunker-busting capability. Andrea Stricker of the Foundation for Defense of Democracies said Iran would risk military retaliation if it attempted to recover the buried uranium. Iranian Foreign Minister Abbas Araghchi stated that Iran will not return to nuclear negotiations with the U.S. under the Trump administration, citing 'excessive demands' and Washington's 'overreach' as reasons for the collapse of prior talks. Iran claims its restrictions on IAEA inspections are due to security concerns, which Grossi acknowledged. Grossi praised Iran's decision not to withdraw from the Non-Proliferation Treaty or become a pariah state like North Korea, but warned that failure of diplomacy could lead to renewed military action.\nOriginal language: en\nPublish date: October 23, 2025 04:06 PM\nSource:[Washington Times](https://www.washingtontimes.com/news/2025/oct/23/un-atomic-watchdog-chief-said-irans-enriched-uranium-still-rubble-air/)\n\n**U.N. Nuclear Watchdog Estimates Most of Iran's Uranium Is Intact**\nRafael Grossi, Director-General of the International Atomic Energy Agency (IAEA), stated on October 21, 2025, that the IAEA believes 'the majority' of Iran's stockpile of near-weapons-grade uranium—approximately 400 kilograms enriched to 60% purity—survived U.S. and Israeli airstrikes in June 2025 targeting Iran’s primary nuclear facilities at Isfahan, Fordow, and Natanz. Iranian officials, including Foreign Minister Abbas Araghchi, confirmed that most of the enriched uranium remains buried in the rubble of these sites. The IAEA has requested access to the uranium but has received limited cooperation from Iran. Satellite imagery analyzed by the Institute for Science and International Security (ISIS) indicates Iran is beginning to excavate tunnels at the Isfahan complex, though the activity appears focused on securing access and reinforcing entrances rather than immediately recovering uranium. FDD non-proliferation expert Andrea Striker noted that while Iran’s ability to enrich the 60% uranium to weapons-grade levels has been disrupted, any recovery effort would risk further military action by the U.S. and Israel. On October 21, 2025, Ali Larijani, Secretary of Iran’s Supreme National Security Council, announced Iran had canceled its inspection agreement with the IAEA, ending all cooperation with the agency. Larijani cited the European signatories (France, Germany, and the UK) invoking the 'snapback' mechanism in August 2025—triggered by Iran’s alleged JCPOA violations—as justification, calling the move a 'wrongdoing' and claiming Iran had met all obligations for the past 10 years. The U.N. Security Council imposed snapback sanctions in September 2025, a move endorsed by the U.S. but opposed by China and Russia, which continue to engage with Iran despite the sanctions.\nOriginal language: en\nPublish date: October 21, 2025 07:51 PM\nSource:[Breitbart](https://www.breitbart.com/middle-east/2025/10/21/u-n-nuclear-watchdog-estimates-most-of-irans-uranium-is-intact-but-blocked-from-verifying/)\n\n**IAEA chief Rafael Grossi: Iranian enriched uranium stockpile in bombed sites unharmed by US-Israeli airstrikes**\nIAEA Director Rafael Grossi stated in an interview with the Swiss daily Neue Zürcher Zeitung that Iran's stockpile of highly enriched uranium, estimated at approximately 400kg prior to the June 2024 airstrikes, remained largely intact despite Israeli and U.S. military strikes on key nuclear facilities in Isfahan, Fordo, Natanz, Arak, Tehran, Karaj, and the SPND headquarters. Grossi confirmed that the majority of the uranium is still located in these facilities, which were heavily damaged but partially underground, making access dependent on Iran's full cooperation—only likely if Iran perceives a national interest. The strikes, conducted by the Israeli Defense Forces using F-15, F-16, and F-35 aircraft, along with drones and precision-guided missiles, and later joined by the U.S. Air Force deploying GBU-57 bunker buster bombs and Tomahawk cruise missiles, caused extensive destruction to smaller sites but failed to significantly damage the deeper, fortified storage areas. Iran's uranium enrichment level has reached 60.8%, nearing the 90% threshold needed for weapons-grade material. Grossi emphasized that concerns over Iran's nuclear ambitions remain unaddressed, especially after the 2015 nuclear deal's termination, the reimposition of international sanctions, and Iran's subsequent freedom to pursue weapons-grade enrichment. He expressed encouragement over U.S. President Donald Trump's recent remarks in the Knesset advocating for diplomacy, stating that while past military actions cannot be undone, renewed dialogue could prevent further conflict. Iran's Foreign Minister Abbass Araghchi confirmed that much of the stockpile remains undamaged beneath rubble, though the IAEA has lost pre-strike knowledge of its condition. The Atomic Energy Organisation of Iran (AEOI) is currently assessing recovery methods, focusing on safety, container volatility, and technological feasibility. The IAEA has not yet regained access to the sites.\nOriginal language: en\nPublish date: October 20, 2025 01:13 PM\nSource:[http://www.uniindia.com/fadnavis-orders-probe-into-mumbai-pub-fire/states/news/1090400.html](http://uniindia.com/~/iaea-chief-rafael-grossi-iranian-enriched-uranium-stockpile-in-bombed-sites-unharmed-by-us-israeli-airstrikes/World/news/3616902.html)\n\n**UN nuclear watchdog believes most of Iran's enriched uranium unharmed by war with Israel**\nThe International Atomic Energy Agency (IAEA), led by Director Rafael Grossi, stated that most of Iran's enriched uranium—estimated at approximately 400 kilograms of 60% enriched uranium—remained intact following the 12-day conflict with Israel in June 2025. This assessment is based on a confidential IAEA report showing that Iran possessed 440.9 kilograms (972 pounds) of 60% enriched uranium as of June 13, 2025. Grossi confirmed that the uranium is still located in Iran’s damaged nuclear facilities, including Isfahan, Natanz, and Fordo, which were heavily struck by both Israel and the United States during the conflict. Despite the extensive damage, the IAEA has not been granted access to these sites due to Iran’s suspension of cooperation, which followed the agency’s failure to condemn the Israeli strikes. Iran now requires approval from its security body before allowing inspections, under a new cooperation framework. Grossi emphasized that Iran remains a party to the Nuclear Non-Proliferation Treaty and has not withdrawn from negotiations, urging a return to diplomatic talks to prevent further military escalation. Iran’s foreign minister, Abbas Araghchi, confirmed that enriched material remains 'under the rubble' of the attacked sites. While Iran denies seeking nuclear weapons, it has enriched uranium to levels with no peaceful use, obstructed inspections, and expanded its ballistic missile program, with evidence suggesting it had advanced toward weaponization prior to the June 13 attack.\nOriginal language: en\nPublish date: October 20, 2025 03:15 AM\nSource:[The Times of Israel](https://www.timesofisrael.com/un-nuclear-watchdog-believes-most-of-irans-enriched-uranium-unharmed-by-war-with-israel/)\n\n**Tehran Approves Resumption of Cooperation with IAEA**\nTehran’s Supreme National Security Council (SNSC) announced that its nuclear committee approved earlier signed agreements to resume cooperation with the International Atomic Energy Agency (IAEA). The document, signed on 9 September in Cairo by IAEA Director‑General Rafael Grossi and Iranian Foreign Minister Abbas Arakchi, will be contingent on safeguarding Iranian nuclear sites. The IAEA states that if any hostile actions against Iran or its nuclear facilities occur, including the reinstatement of previously suspended UN Security Council resolutions, the agreements will be suspended, as the document notes: 'В случае любых враждебных действий против Ирана и ее ядерных объектов, включая восстановление ранее прекращенных резолюций Совета Безопасности ООН, реализация этих договоренностей будет приостановлена'. Resuming inspections could help Iran avoid new economic sanctions imposed by Germany, the United Kingdom, France, the United States, China and Russia. In 2015 the three European states and the US, China and Russia signed the Joint Comprehensive Plan of Action (JCPOA) to prevent Iran from developing nuclear weapons. In 2018 the Trump administration unilaterally withdrew and imposed sanctions. Since then Tehran has gradually abandoned its obligations and resumed uranium enrichment, reportedly exceeding the JCPOA limit fourfold, a claim Iran denies. Cooperation with the IAEA was suspended after a 12‑day war in June 2025 when Israel and the US struck Iranian nuclear sites in Fordo, Natanz and Isfahan. IAEA inspectors were expelled on 2 July by President Masoud Peshgheian. In June 2025 Israel launched a massive attack on Iran, supported by the US, targeting mainly nuclear and military sites; Iran responded with missile and drone strikes. Rafael Grossi has repeatedly urged Tehran to allow inspections of the three damaged sites to assess damage and enriched uranium stockpiles, but the Iranian government has repeatedly refused.\nOriginal language: ru\nPublish date: September 14, 2025 12:06 PM\nSource:[Deutsche Welle](https://www.dw.com/ru/iran-odobril-soglasenie-o-vozobnovlenii-sotrudnicestva-s-magate/a-73989436)\n\n**Iran says enriched nuclear material 'under rubble' of facilities hit during Israel war | News**\nIran’s Foreign Minister Abbas Araghchi said that enriched nuclear material remains \"under the rubble\" of facilities damaged in the 12‑day war with Israel. He stated, \"All of our material is… under the rubble of the bombed facilities,\" and that the Atomic Energy Organization is assessing the stockpile. The new cooperation framework with the IAEA, agreed on Tuesday, allows UN inspectors only after approval by the Supreme National Security Council and distinguishes between attacked sites and unharmed ones such as the Bushehr reactor. Araghchi added, \"No inspections are currently on the agenda,\" and that the agreement would be \"no longer be valid\" if sanctions return. IAEA chief Rafael Grossi said the agreement covers all facilities and outlines inspection procedures. The agency reported that Iran held 440.9 kg of uranium enriched to up to 60 % as of 13 June, a level close to the ~90 % needed for weapons. Western countries have accused Iran of pursuing a nuclear weapon, a claim Tehran denies. In August Britain, France and Germany re‑imposed UN sanctions, which Iran calls illegal, and warned that the IAEA agreement would be voided if sanctions resume.\nOriginal language: en\nPublish date: September 12, 2025 03:20 AM\nSource:[Bangladesh Sangbad Sangstha (BSS)](https://www.bssnews.net/news/310949)\n\n**Iran’s Uranium Stockpile Still in Ruins of Targeted Facilities**\nIran’s Foreign Minister Abbas Iracagi said on Thursday that the country’s stock of enriched uranium remains in the wreckage of nuclear facilities that were bombed during the recent war with Israel, which the United States participated in. He explained that the Iranian Atomic Energy Organization is assessing the extent of damage and the possibility of accessing the material, in preparation for a report to the Supreme National Security Council. This comes amid growing concern in Western countries and the International Atomic Energy Agency (IAEA) about the fate of Iran’s enriched uranium after three nuclear sites were targeted in June. Tehran had suspended cooperation with the IAEA after the war but signed a new agreement on Tuesday with IAEA Director General Rafael Grossi to resume cooperation. Iracagi said the agreement gives the IAEA the right to inspect 'provided it obtains approval from the Supreme National Security Council', noting that inspectors currently cannot access some of the facilities that were bombed, while the agreement excludes facilities that have not been touched, such as the Bushehr nuclear plant. Grossi announced that the new cooperation framework covers 'all nuclear facilities and infrastructure in Iran', stressing that resuming inspections is essential for the stability of Iran’s nuclear file.\nOriginal language: ar\nPublish date: September 12, 2025 01:07 AM\nSource:[Albawaba](https://www.albawabhnews.com/5261350)\n\n**Iran enters new nuclear pact with UN for site inspection 3 months after Israel-US strike**\nOn September 11 2025, Iranian and United Nations negotiators announced an agreement to resume IAEA inspections of Iranian nuclear sites, following a Cairo meeting between IAEA head Rafael Grossi and Iran's foreign minister Abbas Araghchi. Grossi said the sides had agreed 'on practical modalities to resume inspection activities in Iran', marking a key step toward restoring oversight after Tehran halted cooperation three months earlier during the 12‑day war with Israel and subsequent US‑backed Israeli strikes on sites such as Natanz. The deal, brokered with Egyptian mediation, outlines procedures for inspection and notification and addresses facilities struck in June. Iran had halted inspections after the attacks, which involved heavy bunker‑busting bombs, and had amassed more than 880 pounds of highly enriched uranium, enough to produce multiple weapons if further processed. Western diplomats say the agreement may help avert a new sanctions crisis, as Britain, France and Germany had threatened to activate the 2015 nuclear accord's 'snapback' mechanism. Iranian officials, including spokesman Esmaeil Baghaei, view the pact as necessary amid the 'new situation' created by the attacks, but warned it could be voided if facilities were attacked again or if UN Security Council resolutions were reinstated. The IAEA remains concerned about Iran's growing stockpile, and the agreement provides a fragile pathway back to limited transparency, though experts note it may not resolve deeper disputes over enrichment limits or the legacy of the 2015 accord.\nOriginal language: en\nPublish date: September 11, 2025 03:05 AM\nSource:[Firstpost](https://www.firstpost.com/world/iran-nuclear-weapons-iran-israel-war-iaea-abbas-araghchi-13932576.html)\n\n**Iran Increased Near-Weapons-Grade Uranium Stockpile Ahead Of Israel Strike, Says IAEA**\nThe International Atomic Energy Agency (IAEA) released a confidential report indicating that Iran had increased its stockpile of uranium enriched to near weapons‑grade levels just before Israel’s airstrike campaign on June 13, 2025. The report, circulated among IAEA member states and obtained by the Associated Press, covers Iran’s nuclear activities between May 17 and June 12, 2025. It states that as of June 13, Iran possessed 440.9 kilograms (972 pounds) of uranium enriched up to 60 % purity, an increase of 32.3 kilograms (71.2 pounds) since the previous report in May. The IAEA emphasised that this data is 'based on the information provided by Iran, agency verification activities between the above provided dates, and estimates based on the past operation of the relevant facilities.' Enrichment to 60 % brings Iran alarmingly close to weapons‑grade uranium, which requires 90 % purity; experts note that approximately 42 kilograms of 60 % enriched uranium, if further enriched, could be enough to produce one atomic bomb. The report also notes that no agreement has been reached with Iran to resume inspections at nuclear sites damaged during Israeli and U.S. airstrikes in June, leaving the extent of the damage uncertain. Israel has justified its targeted strikes on Iranian military and nuclear facilities by arguing it cannot allow Tehran to develop nuclear weapons. Israeli officials have expressed growing alarm over Iran’s nuclear progress, while Iran insists its program is entirely peaceful and for civilian purposes. On June 22, the U.S. joined the offensive, deploying bunker‑buster bombs against suspected Iranian nuclear sites. In response, Iran’s newly elected president, Masoud Pezeshkian, signed a law on July 2, passed by the Iranian Parliament, suspending all cooperation with the IAEA. Since then, the only site the IAEA has accessed is the Bushehr Nuclear Power Plant, where inspectors observed a fuel replacement procedure on August 27 and 28. The IAEA expressed alarm in its report, stating inspectors have not been able to verify Iran’s near bomb‑grade uranium stockpile for over two and a half months, calling it 'a matter of serious concern.' Iran remains legally obligated to cooperate with the IAEA under the Treaty on the Non‑Proliferation of Nuclear Weapons (NPT).\nOriginal language: en\nPublish date: September 03, 2025 08:38 PM\nSource:[News18](https://www.news18.com/world/iran-increased-near-weapons-grade-uranium-stockpile-ahead-of-israel-strike-says-iaea-ws-l-9547861.html)\n\n",
    "date": "2025-11-07T01:14:54.660272",
    "summary": "All forecasting experts agree that, as of early November 2025, Iran is not allowing IAEA inspectors access to its stockpile of enriched uranium at the Fordow, Natanz, and Isfahan sites, and has recently moved further from cooperation following military strikes and the snapback of UN sanctions. Across diverse perspectives—nuclear policy, diplomacy, international relations theory, security studies, and Middle East regional analysis—the consensus is that the base rate for rapid restoration of IAEA inspections after major crisis is very low. Experts highlight that the short time window (less than two months), Iran’s domestic hardline politics, the technical obstacles at the bombed sites, and the regime’s need to maintain deterrence and resist perceived humiliation all strongly decrease the probability of a sudden reversal. While the risk of renewed Israeli or US military action, ongoing diplomatic pressure (especially from China and Russia), and the IAEA’s willingness to accept symbolic or partial access could, in theory, prompt a last-minute face-saving agreement, most forecasters see these factors as insufficient to overcome entrenched resistance in the absence of significant new incentives or crises. Across all fields, the most common forecast is a low but non-zero chance—typically between 8% and 15%—that Iran will announce an inspection agreement before January 1, 2026, with only one (Constructivist) outlier slightly higher at 25%. The overwhelming expert judgment is that the status quo (continued denial of IAEA access before 2026) will hold unless there is an unexpected and dramatic diplomatic, military, or economic development.",
    "forecasters": [
        "Nuclear Policy (NonProliferation Treaty Regime)",
        "Nuclear Policy (IAEA Safeguards System)",
        "Diplomacy (Track Two Diplomacy)",
        "Diplomacy (International Negotiation Practice)",
        "International Relations (Realism)",
        "International Relations (Liberal Institutionalism)",
        "International Relations (Constructivism)",
        "Security Studies (Nuclear Nonproliferation Theory)",
        "Security Studies (Security Dilemma)",
        "Middle East Studies (Regional Security Complex Theory)"
    ]
}