{
    "deliberation_results": {
        "Shipping and Maritime Operations (Risk Management ISO31000)": {
            "time_to_resolution": "About 3 months (until Jan 1, 2026)",
            "perspective_relevance": "As an expert in Shipping and Maritime Operations (Risk Management ISO31000), I assess risk acceptance, mitigation, and the operational realities driving shipping company decisions, such as Maersk's. My expertise allows for a nuanced understanding of the insurance, crew safety, regulatory, and commercial drivers that determine route resumption under persistent threat conditions.",
            "status_quo": "Maersk has suspended Red Sea operations and, as of October 2025, there is no public indication that it has resumed any Red Sea transits. Attacks on commercial vessels, including recent deadly attacks, continue at a regular pace. Military escort operations have failed to guarantee safe passage. Most major carriers continue to avoid the route.",
            "perspective_derived_factors": [
                {
                    "factor": "Persistent Houthi threat and recent escalation",
                    "effect": "Decreases probability – Recent attacks (e.g., on MV Minerva Grahat, Eternity C) demonstrate Houthi capability and willingness to strike merchant vessels, including with deadly force. Their targeting criteria often include even tenuous Israeli links, and the threat remains active and credible."
                },
                {
                    "factor": "Effectiveness of naval protection and insurance market response",
                    "effect": "Decreases probability – Despite Operation Aspides and US-led efforts, multiple ships have been sunk or damaged recently. Insurance premiums remain high, with some ships reportedly denied coverage. Convoy/escort shortages result in delays and do not eliminate risk to crew or vessel."
                },
                {
                    "factor": "Maersk’s risk tolerance and duty of care (ISO31000 context)",
                    "effect": "Decreases probability – Maersk’s risk management frameworks require low residual risk to resume. With recent attacks, risk to life, asset loss, and insurance exposure remain above thresholds for resumption under best practice."
                },
                {
                    "factor": "Potential for political resolution/ceasefire in Gaza",
                    "effect": "Slightly increases probability – There are ongoing peace talks and a Trump-proposed plan with some reported Hamas acceptance. However, as of October 2025, no final settlement or sustained ceasefire has led to a material reduction in Houthi threats."
                },
                {
                    "factor": "Operational necessity and commercial pressure",
                    "effect": "Increases probability – Costs from rerouting are significant, and some shipping has increased since August 2024, but still below historical norms. If a window of reduced attacks were to open, commercial pressure would be strong to resume at least partial operations."
                },
                {
                    "factor": "Houthi targeting policy",
                    "effect": "Slightly increases probability – There is some indication that Houthis have narrowed targeting to Israeli-linked vessels. However, 'Israeli-linked' is interpreted broadly, and Maersk’s global trades and clients mean it is difficult to guarantee exclusion from targeting."
                }
            ],
            "no_scenario": "Despite international naval protection and peace talks, Houthi attacks continue sporadically or escalate further. Maersk, citing risk to crew and vessels and unable to secure adequate insurance, maintains the suspension of Red Sea transits throughout 2025.",
            "yes_scenario": "A durable ceasefire is reached in Gaza, or a robust international naval presence—significantly expanded from current levels—establishes a period of several months without major attacks on commercial shipping. Insurance becomes available at reasonable rates. Maersk resumes at least limited Red Sea operations, possibly with restrictions (e.g., convoys, select cargoes, or specific vessels), and this is publicly announced or reported by credible sources.",
            "final_reasoning": "The base rate for rapid resumption of commercial shipping after sustained maritime terror campaigns is low without a clear security or political solution. Compared to Somali piracy (where international coordination led to a dramatic drop in attacks and resumption of normal trade within 1-2 years), the Houthi threat is backed by a state actor (Iran), features advanced weaponry, and has proven resilient to current naval interventions. The last few months have seen continued, even escalating, deadly attacks—suggesting no imminent improvement. While Maersk and other operators face commercial pressures to resume, their risk tolerance (especially after losing vessels and crew) is low, and insurance markets remain highly conservative in the face of recent events. The reduction in Houthi targeting to 'Israeli-linked' vessels is not robust enough to reliably exclude Maersk ships, given the complexity of global supply chains. The ongoing peace talks are promising but have not yet produced the sustained security improvements required for Maersk to resume. Given the current risk environment, the lack of a decisive naval or political breakthrough, and the presence of recent high-profile attacks, it is unlikely—though not impossible—that Maersk will resume Red Sea shipping in 2025. A partial or very limited resumption remains possible if the situation improves rapidly in late 2025, but the window is closing.",
            "final_probability": 18
        },
        "Shipping and Maritime Operations (International Maritime Law UNCLOS)": {
            "time_to_resolution": "Approximately 3 months until January 1, 2026.",
            "perspective_relevance": "As an expert in Shipping and Maritime Operations and International Maritime Law (UNCLOS), I am equipped to assess the intersection of geopolitical risk, maritime security, shipping company risk management, and the legal framework governing freedom of navigation in the Red Sea. This enables me to evaluate the likelihood of Maersk resuming Red Sea shipping by analyzing shipping industry risk thresholds, military protection efficacy, Houthi targeting patterns, and the legal/political calculus of resuming operations under persistent threat.",
            "status_quo": "Maersk has indefinitely suspended Red Sea operations since January 2024 due to the high risk of Houthi attacks. As of October 2025, Maersk has not publicly resumed shipping in the Red Sea, and recent attacks—including the missile strike on MV Minerva Grahat—indicate ongoing, credible threats to merchant shipping. Other major carriers continue to avoid the Red Sea, and military escort missions have not fully restored confidence or safety.",
            "perspective_derived_factors": [
                {
                    "factor": "Intensity and Frequency of Houthi Attacks",
                    "effect": "Decreases probability. Despite international naval presence, Houthi attacks (including deadly incidents and ship sinkings as recently as October 2025) have continued unabated, specifically targeting vessels with actual or perceived links to Israel, but also hitting ships with only tenuous or non-existent Israeli ties. The persistence, lethality, and unpredictability of these attacks maintain high operational risk."
                },
                {
                    "factor": "Efficacy of International Naval Protection (EU Operation Aspides, US-led coalitions)",
                    "effect": "Slightly increases probability, but not enough to restore Maersk's risk tolerance. Naval escorts have protected hundreds of ships, but coverage is limited (2-3 warships on station, with requests for more) and cannot guarantee safety, as evidenced by recent attacks on unescorted vessels. The mission has been extended, but not fundamentally strengthened."
                },
                {
                    "factor": "Targeting Criteria and Houthi Intentions",
                    "effect": "Decreases probability. The Houthis have stated intent to target vessels with Israeli links, but have demonstrated broad and at times ambiguous criteria for attacks. Several attacks have been justified by the Houthis on the basis of vessels visiting or being linked—directly or indirectly—to Israel, which creates risk for all major shipping lines, including Maersk, which operates globally and cannot guarantee its ships or cargoes are immune from such designations."
                },
                {
                    "factor": "Maersk's Corporate Risk Appetite and Insurance/Legal Constraints",
                    "effect": "Decreases probability. As one of the world's largest shipping companies, Maersk's threshold for resuming operations involves not just reduced attacks, but a sustainable, insurable risk profile. Current war risk insurance premiums are prohibitively high, and many underwriters have withdrawn coverage for Red Sea transits. Maersk’s reputation and duty of care obligations to crew and cargo further lower their willingness to resume under current conditions."
                },
                {
                    "factor": "Political Momentum and Ceasefire Prospects in Gaza",
                    "effect": "Slightly increases probability, contingent on a durable ceasefire. There are signs of peace negotiations and some acceptance of Trump’s peace plan by Hamas, but attacks have continued even amidst such talks. The Houthis have explicitly linked their operations to the Gaza conflict, with statements suggesting attacks could cease if Israel ends its campaign and lifts the blockade. However, military activity and violence remain ongoing."
                },
                {
                    "factor": "Base Rate/Historical Precedent",
                    "effect": "Decreases probability. Historically, shipping companies have only resumed operations in high-risk areas following a sustained and widely recognized reduction in risk, not merely due to military escorts or temporary lulls. The Somali piracy crisis took years of coordinated effort and a clear reduction in attacks before global carriers resumed normal operations."
                }
            ],
            "no_scenario": "Maersk does not resume shipping through the Red Sea in 2025 because the frequency and severity of Houthi attacks remain high or unpredictable, insurance coverage remains unavailable or prohibitively expensive, and the international naval presence remains insufficient to guarantee safety. Even if the Israel-Hamas conflict de-escalates, ambiguity around Houthi targeting criteria and the possibility of renewed violence maintain a risk environment unacceptable for Maersk’s operations. Maersk continues rerouting vessels around the Cape of Good Hope into 2026.",
            "yes_scenario": "A durable ceasefire or peace agreement is reached in Gaza, and the Houthis announce a verifiable end to attacks on commercial shipping, possibly under international supervision or as part of a broader regional security arrangement. Reliable intelligence and a sustained period (at least several months) of no attacks or credible threats convinces Maersk’s risk managers and insurers to allow a partial or conditional resumption (e.g., for ships with no Israeli links and under escort), which Maersk publicly announces as a change in official policy.",
            "final_reasoning": "The status quo is strongly against resumption, with recent and deadly attacks, continued threats, and limited effectiveness of military protection. Maersk's risk calculus is shaped by legal, insurance, and operational realities that require more than just diplomatic progress—they require a demonstrable and sustained reduction of threat. The Houthis' targeting remains ambiguous, and recent attacks (even after some diplomatic overtures) show no sign of abating. Base rates for similar situations (e.g., Somali piracy) suggest that even after violence drops, it takes time for major shippers to resume. There is a narrow path to a Yes, but it requires a combination of diplomatic breakthroughs, Houthi de-escalation, and restoration of insurance/escort capacity, none of which are present in October 2025. Therefore, the probability that Maersk resumes shipping in the Red Sea in 2025 is very low, and I set it at 8%.",
            "final_probability": 8
        },
        "Shipping and Maritime Operations (ISPS Code Compliance)": {
            "time_to_resolution": "Less than 3 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Shipping and Maritime Operations (ISPS Code Compliance), I understand the operational, economic, regulatory, and security considerations that major shipping companies like Maersk must weigh before resuming operations in high-risk areas such as the Red Sea. My perspective uniquely blends the technical requirements for ISPS code compliance, insurance/underwriting realities, crew safety, flag state advisories, and the practicalities of risk mitigation (e.g., naval escorts, route selection), all of which are critical in shaping Maersk's decision.",
            "status_quo": "Maersk suspended Red Sea transits in January 2024 due to Houthi attacks and, as of October 2025, has not resumed. Attacks persist, with recent high-profile missile strikes and fatal ship sinkings, despite international naval protection. Maersk's official line is indefinite pause, with no public sign of imminent resumption.",
            "perspective_derived_factors": [
                {
                    "factor": "Ongoing Houthi Threat and Attack Frequency",
                    "effect": "Strongly decreases probability. Recent months have seen renewed and even intensified Houthi attacks, including deadly strikes and missile use against merchant shipping, with no sign of de-escalation. Targeting has expanded beyond strictly Israeli-linked vessels."
                },
                {
                    "factor": "International Naval Operations (EU Operation Aspides, US-led Task Forces)",
                    "effect": "Slightly increases probability, but limited. While these operations offer some protection and have escorted hundreds of vessels, their deterrent effect is limited. Attacks have occurred even on ships not requesting escort, and the scale of naval assets remains insufficient for blanket coverage."
                },
                {
                    "factor": "Insurance/Underwriting and Charterparty Restrictions",
                    "effect": "Strongly decreases probability. Insurance premiums for Red Sea transits remain extremely high, and in some cases, coverage is denied outright. Charterers and cargo owners may refuse Red Sea passage, and ISPS-compliant companies like Maersk must comply with flag state and insurer advisories."
                },
                {
                    "factor": "ISPS Code and Maritime Security Compliance",
                    "effect": "Decreases probability. ISPS requires risk assessments and adherence to flag state instructions. With recent attacks, the risk profile remains at the highest level, and flag states often advise avoidance."
                },
                {
                    "factor": "Recent Escalation and Political Signals",
                    "effect": "Decreases probability. Houthi rhetoric and actions show no sign of abating, with threats to all ships trading with Israel and actual attacks on non-Israeli vessels. Peace talks have not translated into reduced maritime risk."
                },
                {
                    "factor": "Partial Resumption/Policy Change Possibility",
                    "effect": "Slightly increases probability. The resolution allows for a 'partial resumption' to count as Yes, e.g., limited transits with heavy naval escort or only for selected ships. Maersk could, in theory, resume for a very limited number of sailings under exceptional protection."
                },
                {
                    "factor": "Historical Base Rate and Status Quo Bias",
                    "effect": "Decreases probability. Historically, shipping companies have not resumed normal operations in high-threat areas unless there is a significant, durable decrease in attacks, a credible ceasefire, or a robust international enforcement regime. No such change has occurred; if anything, the situation has worsened."
                }
            ],
            "no_scenario": "The Houthi threat remains high or escalates further, with regular attacks on commercial shipping and no credible ceasefire or maritime security breakthrough. Insurance and flag state restrictions persist. Maersk maintains its indefinite suspension, with no policy change or publicized Red Sea transits by Maersk vessels before January 1, 2026.",
            "yes_scenario": "A significant, credible de-escalation occurs—either through a sustained ceasefire, a diplomatic breakthrough, or a temporary reduction in attacks tied to a political settlement. Under heavy naval escort (e.g., EU or US task force), Maersk resumes at least partial Red Sea transits, possibly limited to certain ships or routes, and officially amends its policy to allow such sailings before the end of 2025.",
            "final_reasoning": "The security environment in the Red Sea is currently deteriorating: there have been several high-profile, deadly Houthi attacks in recent months, including the sinking of ships, crew fatalities, and attacks on non-Israeli-linked vessels. Naval protection operations are ongoing but have not eliminated the risk, and their coverage is limited by resource constraints. Insurance and compliance issues remain severe, with underwriters and flag states maintaining restrictions. While the question's resolution requires only a partial resumption (which could theoretically be triggered by a single escorted voyage), there is no credible evidence that Maersk is preparing such a policy change. Senior management's past statements suggest caution and a wait-and-see approach. The base rate for rapid resumption of shipping in high-risk war zones is low, especially absent a major shift in ground realities or a robust international enforcement mechanism. With less than three months left, it is highly unlikely that the necessary conditions for even a partial resumption will materialize. The probability of a sudden breakthrough is far outweighed by the persistence and even escalation of the threat. Therefore, the probability that Maersk will resume shipping in the Red Sea in 2025 is extremely low.",
            "final_probability": 3
        },
        "Security Risk Assessment (Maritime Threat Assessment)": {
            "time_to_resolution": "About 2 months and 3 weeks until January 1, 2026",
            "perspective_relevance": "As a Security Risk Assessment (Maritime Threat Assessment) expert, my perspective is directly relevant because the question hinges on the evolving threat environment in the Red Sea, the risk tolerance of global shipping leaders like Maersk, and the effectiveness of international naval protection efforts. My experience in analyzing maritime threats, shipping company decisions, and the interplay between geopolitical, military, and insurance considerations allows me to weigh the risk–benefit calculus Maersk faces regarding Red Sea transits.",
            "status_quo": "Maersk has suspended Red Sea shipping since early 2024 due to Houthi attacks, and as of October 2025, has not resumed operations. The Red Sea remains dangerous, with ongoing Houthi attacks on shipping, particularly vessels linked (even tenuously) to Israel. International naval operations provide limited protection, but the situation remains volatile. If nothing changes, Maersk will likely maintain its suspension through 2025.",
            "perspective_derived_factors": [
                {
                    "factor": "Persistence and Escalation of Houthi Attacks",
                    "effect": "Decreases probability. Recent news (October 2025) describes ongoing and even escalating Houthi attacks, including the sinking of ships and use of advanced missiles and drones. Attacks are not limited to Israeli-flagged vessels but extend to those with indirect ties, creating uncertainty and insurance complications for Maersk."
                },
                {
                    "factor": "Effectiveness of International Naval Protection",
                    "effect": "Marginally increases probability, but with caveats. While EU Operation Aspides and US-led coalitions have protected hundreds of vessels, their capacity is stretched and coverage is incomplete. Maersk, as a risk-averse market leader, is unlikely to resume unless protection is robust and reliable. Recent attacks on unescorted ships show gaps in protection."
                },
                {
                    "factor": "Political and Conflict Resolution Trajectory (Gaza Ceasefire and Peace Talks)",
                    "effect": "Increases probability, but only modestly. There are ongoing peace talks and the Trump plan, with some momentum toward ceasefire. Since Houthi attacks are explicitly tied to the Gaza war, a robust, durable ceasefire could prompt a reduction in attacks. However, current news suggests ceasefire is not yet durable or trusted, and attacks have continued even during negotiations."
                },
                {
                    "factor": "Maersk's Corporate Risk Appetite and Precedent",
                    "effect": "Decreases probability. Maersk suspended Red Sea operations before most other firms and has signaled a preference for safety and insurance stability over immediate cost savings. Their CEO's statements have been conservative, and unless there is a decisive improvement, they are unlikely to be an early mover in resuming Red Sea transit."
                },
                {
                    "factor": "Shipping Insurance and Crew Safety Considerations",
                    "effect": "Decreases probability. Insurance rates for Red Sea transits remain high, and recent attacks (including with casualties and kidnapping) make it difficult for Maersk to secure affordable coverage or persuade crews to accept the risk."
                },
                {
                    "factor": "Partial Resumption Threshold (Resolution Criteria)",
                    "effect": "Increases probability slightly. The question resolves 'Yes' even if Maersk resumes only partial Red Sea activity, not full pre-crisis operations, meaning a limited, highly escorted, or test run could be sufficient."
                },
                {
                    "factor": "Recent Uptick in Red Sea Shipping Activity",
                    "effect": "Increases probability slightly. There is mention of shipping through Bab-el-Mandeb increasing by 60% since August 2024, but still far below pre-crisis levels. This suggests some improvement in risk tolerance for other actors, but doesn't indicate Maersk is leading this trend."
                }
            ],
            "no_scenario": "Despite ongoing peace talks, no durable ceasefire in Gaza is achieved by the end of 2025, or even if a ceasefire is reached, Houthi attacks continue sporadically, especially on ships with any perceived Israeli links. Maersk, facing continued insurance restrictions, high risk to crews, and the threat of reputational and financial liability, does not announce any resumption (even partial) of Red Sea transits during 2025.",
            "yes_scenario": "A durable ceasefire and initial steps toward a two-state solution are implemented before the end of 2025, leading the Houthis to suspend attacks on commercial shipping (as they have previously promised in response to Gaza developments). International naval patrols are strengthened, insurance costs drop, and Maersk announces a (possibly partial or limited) resumption of service—potentially through highly escorted convoys for select cargoes or test runs by late 2025, sufficient to meet Metaculus resolution criteria.",
            "final_reasoning": "The base rate for major shipping companies resuming operations after a maritime threat is low until the threat is clearly diminished and insurance markets stabilize. The status quo is strongly against resumption: Maersk remains suspended, and attacks—including deadly ones—are ongoing as of October 2025. Peace talks could in theory change the equation, but recent escalations (missile strikes on ships and Israel, continued Houthi rhetoric, and deadly sinkings) suggest no imminent, reliable reduction in risk. International naval operations, while helpful, have not prevented recent attacks, and Maersk's risk tolerance is low. The resolution criteria allow for a 'partial' resumption, which slightly raises the probability, but the news flow and shipping industry precedent suggest that even a partial return is unlikely without a sustained drop in attacks—something not yet in evidence. The slight uptick in Red Sea traffic is encouraging but not decisive. Therefore, my estimate is that there is roughly a 20% chance that Maersk announces or is observed to resume any Red Sea shipping in 2025.",
            "final_probability": 20
        },
        "Security Risk Assessment (Critical Infrastructure Protection Standards)": {
            "time_to_resolution": "About 3 months until December 31, 2025",
            "perspective_relevance": "As an expert in Security Risk Assessment with a focus on Critical Infrastructure Protection Standards, I am trained to systematically evaluate the threat landscape, the effectiveness of mitigating measures, and the risk tolerance of major operators like Maersk. My approach weighs the base rates of resumption after similar disruptions, analyzes the robustness of multinational protective operations, and considers the incentives and risk management frameworks guiding decisions in high-stakes, high-risk commercial shipping.",
            "status_quo": "Maersk paused all Red Sea shipping indefinitely in January 2024 and, as of October 2025, has not officially resumed. The security environment remains extremely volatile, with recent deadly Houthi attacks on commercial vessels and persistent threats, although international naval operations are ongoing. There is no public statement from Maersk indicating imminent resumption.",
            "perspective_derived_factors": [
                {
                    "factor": "Persistence and severity of Houthi attacks",
                    "effect": "Decreases probability. Recent attacks (September 29, 2025) have left ships unseaworthy, with deadly outcomes and abductions. The Houthis have explicitly expanded their targeting criteria to include ships with even tenuous links to Israel. Attacks have been frequent and severe, showing no sign of abating despite international naval operations."
                },
                {
                    "factor": "International military protection efforts (Operation Aspides, Prosperity Guardian, etc.)",
                    "effect": "Slightly increases probability, but with caveats. These operations have provided direct protection and shot down drones/missiles, but their deterrence has been incomplete. The number of naval assets is limited, and some commercial ships still face delays or lack coverage, reducing shipping company confidence."
                },
                {
                    "factor": "Maersk’s risk tolerance and security compliance standards",
                    "effect": "Strongly decreases probability. As a global leader, Maersk adheres to strict duty-of-care and insurance requirements. The company’s own statements and the shipping industry’s response to prior attacks indicate that resumption would only occur if the threat is reduced to a residual, insurable level—well below current conditions."
                },
                {
                    "factor": "Base rates of shipping resumption after comparable disruptions",
                    "effect": "Decreases probability. In piracy crises (e.g., Somali piracy 2008–2013), resumption required a sustained period of reduced incidents, strong naval presence, and robust legal/international frameworks. Here, the Houthis’ capabilities and intent remain undiminished."
                },
                {
                    "factor": "Potential for rapid political/diplomatic de-escalation (Gaza ceasefire, Iran-West detente, etc.)",
                    "effect": "Slightly increases probability if a breakthrough occurs, but there is no evidence of a durable resolution as of October 2025. While peace talks are ongoing, the Houthis have linked attacks directly to the continuation of the Gaza blockade/aggression, and have reaffirmed their willingness to escalate as a negotiation lever."
                },
                {
                    "factor": "Economic and operational pressures on Maersk and global trade",
                    "effect": "Slightly increases probability. There are strong incentives for resumption, but these are likely outweighed by safety/liability concerns unless the risk environment improves significantly."
                }
            ],
            "no_scenario": "Maersk maintains its indefinite pause through the end of 2025, citing continued unacceptable risk from Houthi attacks, lack of sufficient naval protection, and insurance unavailability. The Red Sea remains a high-threat zone, with sporadic attacks and insufficient political progress toward a durable ceasefire in Gaza or a reduction in Iranian/Houthi hostility.",
            "yes_scenario": "A significant and sustained reduction in attacks is achieved—either through a robust international naval surge, a durable Gaza ceasefire, or a political settlement that removes the incentive for Houthi attacks. Maersk, following internal security assessments and insurance industry guidance, announces a partial or full resumption of Red Sea transits before the end of 2025, possibly with strict restrictions (e.g., only under naval escort, only for ships with no Israeli links, etc.).",
            "final_reasoning": "The status quo points heavily toward continued suspension by Maersk. As of October 2025, the Red Sea remains highly dangerous: recent attacks have resulted in the sinking of ships, deaths, and abductions. International naval operations have mitigated but not eliminated the threat, and the number of protected ships is still well below pre-crisis levels. Maersk, as a critical infrastructure operator and industry leader, adheres to conservative, compliance-driven risk standards. Insurance for Red Sea transits is likely either unavailable or prohibitively expensive under current conditions. Houthis have reaffirmed their intent and capability to attack shipping, and their operational tempo remains high—now including advanced missile/drone technology and a willingness to sink ships and seize crews. While ongoing peace talks could, in theory, lead to a breakthrough, there is no concrete evidence of imminent de-escalation or a durable ceasefire that would allow Maersk to justify resumption to shareholders and regulators within 2025. The base rate for rapid resumption in similar maritime crises is low, especially with a state/non-state actor with ideological motives and external support. The partial increase in shipping traffic since August 2024 is a positive sign, but the threshold for Maersk's return is likely much higher than for smaller or more risk-tolerant operators. Given all these factors, the chance that Maersk will officially resume (even partially) Red Sea shipping in 2025 is low but not zero—some black swan diplomatic breakthrough or sudden, credible reduction in threat could shift the calculation late in the year. However, as of now, the evidence points strongly toward a 'No' outcome.",
            "final_probability": 12
        },
        "International Relations (Security Dilemma Theory)": {
            "time_to_resolution": "Approximately 86 days (until December 31, 2025)",
            "perspective_relevance": "My expertise in International Relations, specifically Security Dilemma Theory, offers a framework to analyze how the actions of state and non-state actors (e.g., Houthis, Iran, Israel, US, EU) create cycles of escalation and mistrust that hinder maritime security. The security dilemma is acute in the Red Sea: defensive moves by one actor (e.g., maritime escorts, strikes on Houthis) are perceived as offensive by others, perpetuating instability. This perspective helps identify why risk aversion dominates corporate decisions and why status quo disruptions are slow to resolve.",
            "status_quo": "Maersk is not shipping through the Red Sea due to persistent Houthi attacks, with traffic well below pre-crisis levels. Major incidents have recently occurred, including fatal attacks, and no major shipping line has resumed regular transits. Military escorts are present but insufficient to guarantee safety, and the Houthis continue targeting or threatening ships linked to Israel.",
            "perspective_derived_factors": [
                {
                    "factor": "Intensity and Persistence of Houthi Attacks",
                    "effect": "Decreases probability. Recent weeks have seen deadly attacks, including the sinking of ships and crew casualties, and the Houthis claim hundreds of attacks in 2025. The targeting remains at least partially indiscriminate as the criteria for 'Israeli-linked' are broad and sometimes opaque."
                },
                {
                    "factor": "International Naval Presence and Effectiveness",
                    "effect": "Slightly increases probability. EU Operation Aspides and US-led missions have escorted hundreds of vessels, but coverage is patchy, with only 2-3 warships present at any time, leaving many ships unprotected. The missions are defensive and have not degraded Houthi capabilities sufficiently to reassure shippers."
                },
                {
                    "factor": "Security Dilemma Entrenchment",
                    "effect": "Decreases probability. Each actor's defensive measures (e.g., retaliatory strikes, naval deployments) are perceived as threats, feeding a cycle of escalation. The Houthis, backed by Iran, use maritime attacks as leverage in regional bargaining, and their actions have become a tool for Iran's broader contest with the West, not just Gaza."
                },
                {
                    "factor": "Political Developments in Gaza-Israel Conflict",
                    "effect": "Mixed. While peace talks (e.g., Trump plan, Hamas acceptance) could reduce Houthi justification, the Houthis have stated they will continue attacks unless all aggression and blockade end. Even during negotiations, attacks have persisted, and the linkage to Hamas's stance is loose."
                },
                {
                    "factor": "Maersk's Corporate Risk Tolerance and Precedent",
                    "effect": "Decreases probability. Maersk, as a global leader, is highly risk-averse due to crew safety, insurance, and reputational concerns. Its CEO previously indicated a long-term pause and has not signaled imminent resumption. Base rate: during Somali piracy, it took years of sustained, effective international action and a clear reduction in risk before major shippers returned."
                },
                {
                    "factor": "Partial vs. Full Resumption Criteria",
                    "effect": "Increases probability slightly. The fine print allows for a 'partial resumption' or an official change in Maersk policy (e.g., a limited, escorted, or trial voyage) to count as Yes. This means a small, symbolic resumption is sufficient for resolution, even if comprehensive operations are not restored."
                },
                {
                    "factor": "Recent Trends in Attacks and Shipping Volumes",
                    "effect": "Decreases probability. The summer 2025 lull is over; since July there have been renewed and increasingly lethal attacks. Shipping through Bab-el-Mandeb remains far below normal, and the insurance and operational environment are still prohibitively risky."
                }
            ],
            "no_scenario": "Houthi attacks continue or intensify, targeting ships with even tenuous links to Israel. Maersk publicly maintains its suspension, citing unmitigated security threats and high insurance costs. International naval patrols remain insufficient to guarantee safety. Even if some shippers take risks, Maersk’s risk calculus favors continued avoidance. No official Maersk policy change or confirmed transit occurs before December 31, 2025.",
            "yes_scenario": "A temporary lull or reduction in attacks occurs—potentially due to a ceasefire or progress in Gaza peace talks—lowering insurance premiums and perceived threat. Alternatively, Maersk announces a limited resumption of Red Sea transits (e.g., select escorted convoys, pilot voyages, or only for non-Israel-linked cargo), and credible reports confirm at least one Maersk vessel passes through, prompting Metaculus to resolve Yes.",
            "final_reasoning": "The base rate for rapid resumption of shipping after large-scale, politically motivated maritime attacks is low: during the Somali piracy crisis, full restoration of confidence took years and required not just military patrols but also a clear, consistent reduction in attacks. The current news cycle shows the Houthi threat is persistent, sophisticated, and increasingly deadly, with recent missile attacks, ship sinkings, and hostage-takings. The security dilemma is deeply entrenched: international naval action is not deterring the Houthis, whose incentives are both regional (Iran) and local (Gaza). Maersk, as an industry leader, is structurally risk-averse and unlikely to resume without a significant, durable reduction in risk. However, the question's resolution criteria allow for a partial, symbolic resumption to count. While a sudden, dramatic breakthrough (e.g., a lasting Israel-Hamas ceasefire and Houthi halt) is possible, the evidence as of early October 2025 strongly supports the persistence of the status quo. Therefore, I judge the probability of Maersk resuming any Red Sea shipping in 2025 as quite low, but not zero due to the partial resumption loophole.",
            "final_probability": 12
        },
        "International Relations (Maritime Security Studies)": {
            "time_to_resolution": "Approximately 3 months (until December 31, 2025)",
            "perspective_relevance": "As an expert in International Relations (Maritime Security Studies), my analysis leverages a deep understanding of the interplay between non-state actor maritime threats (Houthi), the effectiveness of multinational naval operations, insurance and risk management practices in commercial shipping, and the historical record of shipping disruptions and resumptions in high-risk waterways. This expertise is crucial for assessing both the objective risk environment and the decision-making calculus of a major carrier like Maersk.",
            "status_quo": "Maersk has paused all Red Sea shipping since January 2024 due to Houthi attacks. Despite multinational naval operations (US, EU, others), the Red Sea remains highly insecure, with continued attacks, including deadly ones, and shipping volumes remain well below pre-crisis levels. Maersk and other major carriers have shown little willingness to resume without a clear, sustained reduction in risk.",
            "perspective_derived_factors": [
                {
                    "factor": "Intensity and Frequency of Houthi Attacks",
                    "effect": "Strongly decreases probability. Recent months have seen a return to regular, deadly attacks on merchant shipping, including missile strikes on non-Israeli-flagged vessels and loss of life and ships. There is no evidence of a sustained, effective deterrence against Houthi capabilities."
                },
                {
                    "factor": "Effectiveness and Coverage of Naval Escort Operations",
                    "effect": "Slightly increases probability, but overall effect is limited. EU Operation Aspides and US-led efforts have protected hundreds of ships, but naval resources are stretched thin; escort delays and coverage gaps persist. Maersk and other major lines may still judge the risk as unacceptable, especially with deadly attacks continuing despite escorts."
                },
                {
                    "factor": "Political-Military Developments in Israel-Gaza and Yemen",
                    "effect": "Decreases probability. While there are ongoing peace talks, the Houthi leadership has explicitly tied their attacks to the status of Gaza. No ceasefire or political breakthrough has yet translated into a durable reduction in attacks, and the Houthis have demonstrated willingness to rapidly escalate when negotiations stall or violence resumes."
                },
                {
                    "factor": "Maersk Corporate Risk Appetite and Insurance Constraints",
                    "effect": "Strongly decreases probability. Maersk, as a flagship global carrier, faces not only financial but reputational and crew safety risks. Insurance premiums are likely unaffordable or unavailable for Red Sea transits under current risk levels, and Maersk is incentivized to wait for clear, sustained reduction in attacks or credible guarantees before resuming."
                },
                {
                    "factor": "Historical Base Rate of Shipping Resumption after Severe Maritime Threats",
                    "effect": "Decreases probability. Past crises (e.g., Somali piracy) show that major carriers are slow to resume after severe, deadly attacks, generally requiring months of demonstrated safety or political breakthrough. The current situation is arguably more severe, with state-backed, missile-capable non-state actors."
                },
                {
                    "factor": "Recent News of Ongoing Attacks (e.g., October 2025 missile strike on MV Minerva Grahat)",
                    "effect": "Strongly decreases probability. The fact that attacks continue as of October 2025, with no sign of abatement, suggests no imminent shift to a safer environment."
                },
                {
                    "factor": "Partial Resumption Threshold for Resolution",
                    "effect": "Slightly increases probability. The question will resolve YES even for partial or limited resumption, not just a full-scale return. If Maersk announces even a pilot or test run, or ships traverse under heavily armed escort, this would be sufficient. However, current risk levels make even limited resumption unlikely barring a dramatic, positive shift."
                }
            ],
            "no_scenario": "Despite ongoing diplomatic efforts, Houthi attacks continue or escalate, with further loss of ships and crew lives. Naval escorts are insufficient to guarantee safety. Insurers refuse to underwrite Red Sea transits for Maersk. Maersk maintains its suspension policy, citing unacceptable risk, and does not resume any Red Sea crossings before January 1, 2026.",
            "yes_scenario": "A diplomatic breakthrough or enforced ceasefire in Gaza leads to a durable, sustained reduction in Houthi attacks by late 2025. Under pressure from shippers and with improved naval escort coordination, Maersk cautiously announces a partial resumption (e.g., test voyages under escort, or limited service for non-Israeli-linked cargo), which is publicized and meets Metaculus's criteria before year-end.",
            "final_reasoning": "Given the available evidence and historical base rates, the balance of factors strongly favors a NO outcome. The resumption threshold is relatively low, but the operational and reputational risks to Maersk remain prohibitive as long as attacks continue, insurance is unavailable, and naval protection is patchy. The ongoing missile strikes as of October 2025, some resulting in ships being sunk and crew deaths, underscore the severity of the threat. Political progress remains fragile, and the Houthi leadership has indicated attacks will persist as long as Gaza remains under siege. While a late-breaking deal or dramatic reduction in attacks could change the calculus, there is no such trend visible as of now. Thus, the likelihood of Maersk resuming *any* shipping in the Red Sea in 2025 is low, but not zero due to the possibility of a sudden diplomatic breakthrough.",
            "final_probability": 13
        },
        "Political Science (Conflict Resolution Theory)": {
            "time_to_resolution": "Approximately 3 months (question closes December 31, 2025; today is October 7, 2025)",
            "perspective_relevance": "As an expert in Political Science with a focus on Conflict Resolution Theory, my perspective is crucial for understanding how ongoing and emerging patterns of violence, negotiation, and third-party intervention shape corporate risk assessments and decisions. I analyze how ceasefires, diplomatic progress, and security guarantees influence the stability of maritime trade and the willingness of companies like Maersk to resume operations.",
            "status_quo": "Maersk has not resumed shipping in the Red Sea as of October 2025, maintaining its indefinite suspension due to ongoing Houthi attacks and regional instability. Major attacks on commercial shipping have persisted through September/October 2025, with multinational naval operations unable to fully secure the route.",
            "perspective_derived_factors": [
                {
                    "factor": "Persistence of Houthi Attacks",
                    "effect": "Decreases probability. Despite international naval patrols, there have been recent, deadly, and highly publicized Houthi attacks (e.g., on the MV Minerva Grahat and other vessels in late September 2025), including the sinking of ships and loss of life. Maersk is highly risk-averse regarding crew safety and insurance costs."
                },
                {
                    "factor": "Scope of International Naval Protection",
                    "effect": "Slightly increases probability. EU Operation Aspides and other escorts have protected hundreds of vessels, but coverage is thin (2-3 ships at a time) and not guaranteed. Naval presence is necessary but not sufficient for insurers and Maersk’s confidence."
                },
                {
                    "factor": "Narrowing of Houthi Targeting Criteria",
                    "effect": "Slightly increases probability. Some sources (Admiral Gribaris, June 2025) claim Houthis are now mostly targeting Israeli-linked ships. However, recent attacks suggest the definition of 'Israeli-linked' is broad and ambiguous, and misidentification or overreach could still impact non-Israeli shipping."
                },
                {
                    "factor": "Diplomatic/Conflict Resolution Trends",
                    "effect": "Mixed. Peace talks around Gaza and the Trump plan have gained momentum, but Houthi missile/drone attacks on Israel continue, indicating that spoilers remain active. Historical base rates for rapid de-escalation in proxy conflicts are low."
                },
                {
                    "factor": "Maersk’s Corporate Risk Calculus and Precedent",
                    "effect": "Decreases probability. Maersk is a bellwether for industry caution, typically among the last to resume operations after sustained attacks. Past behavior during the Somali piracy crisis shows Maersk only resumed full operations after a statistically significant, sustained reduction in attacks and credible security guarantees."
                },
                {
                    "factor": "Partial Resumption Possibility",
                    "effect": "Slightly increases probability. The question resolves YES even on partial or limited resumption, not requiring a full-scale return. Maersk could resume select, escorted convoys or limited Red Sea transits if conditions improve marginally."
                },
                {
                    "factor": "Insurance and Reinsurance Market Behavior",
                    "effect": "Decreases probability. Insurance for Red Sea transits remains expensive or unavailable for unescorted passage; underwriters respond to recent attacks with conservatism, increasing cost and decreasing willingness to resume."
                }
            ],
            "no_scenario": "Despite ongoing international naval patrols and diplomatic progress in Gaza, Houthi attacks persist or recur sporadically, causing intermittent but high-impact losses (more ships attacked, crew casualties, or kidnappings). Maersk, citing unacceptable risk and lack of reliable insurance, maintains its suspension policy through 2025, with only minor players or state-escorted convoys daring the passage. Official Maersk policy remains unchanged until after January 1, 2026.",
            "yes_scenario": "A durable ceasefire takes hold in Gaza and/or a successful international diplomatic agreement (potentially including Iran) leads to a sharp, sustained reduction in Houthi attacks. Under mounting commercial and diplomatic pressure, and with insurance rates falling after several months without incident, Maersk announces a partial resumption—perhaps limited to certain ship types, escorted convoys, or non-Israeli linked cargos—before the end of 2025, representing a policy shift.",
            "final_reasoning": "The base rate for rapid resumption of major shipping through conflict-prone maritime chokepoints after sustained, politically motivated attacks is low—especially when the violence is driven by a combination of local and regional actors (Houthis with Iranian backing) and the international response remains fragmented and defensive. As of early October 2025, Houthi attacks continue to be frequent, deadly, and unpredictable, with no clear evidence that either naval patrols or diplomatic efforts have decisively shifted the security calculus. Maersk’s corporate risk culture, insurance market trends, and the ambiguous targeting criteria used by the Houthis all weigh against a rapid return. However, the possibility of a limited, partial resumption (e.g., a single trial convoy with naval escort) cannot be entirely ruled out, especially if the Gaza ceasefire solidifies and diplomatic momentum accelerates. Nonetheless, the most likely scenario—supported by historical precedent and the slow-moving nature of such security crises—is that Maersk will not resume Red Sea shipping (even partially) before the end of 2025.",
            "final_probability": 22
        },
        "Political Science (Regime Stability Analysis)": {
            "time_to_resolution": "Approximately 2 months and 3 weeks (until Jan 1, 2026)",
            "perspective_relevance": "As an expert in regime stability and political risk analysis, I focus on how the interplay of non-state armed actors (Houthis), international military coalitions, and regional state interests affect the operational risk environment for multinational corporations such as Maersk. I emphasize base rates of prolonged maritime insecurity, state/non-state actor bargaining, and the inertia of risk-averse corporate decision-making under persistent instability.",
            "status_quo": "Maersk has not resumed Red Sea shipping as of October 2025. The company paused all operations in January 2024 and, despite periods of reduced Houthi attacks, has not announced any partial or full resumption. The risk environment remains volatile, with recent (October 2025) missile attacks by Houthis on commercial vessels and ongoing threats to shipping.",
            "perspective_derived_factors": [
                {
                    "factor": "Persistence and Adaptability of Houthi Threat",
                    "effect": "Decreases probability. Despite international naval operations, Houthis have demonstrated both persistence and adaptability, regularly resuming attacks after short pauses, and showing capacity to escalate or de-escalate according to regional events and Iranian interests. Their operational tempo is closely tied to developments in Gaza/Israel, which remain unresolved."
                },
                {
                    "factor": "Inadequacy of International Naval Protection",
                    "effect": "Decreases probability. EU Operation Aspides and US-led coalitions have been unable to guarantee security, as highlighted by recent successful and deadly attacks. Coverage is thin; companies face delays for escorts and risk insurance remains high."
                },
                {
                    "factor": "Corporate Risk Aversion and Insurance Constraints",
                    "effect": "Decreases probability. Major shipping lines like Maersk are highly risk-averse, especially after attacks resulting in loss of life and ship sinkings. Insurance premiums are exorbitant or coverage denied for the Red Sea, deterring resumption even when attacks temporarily lull."
                },
                {
                    "factor": "Linkage to Israel-Gaza Conflict and Negotiations",
                    "effect": "Decreases probability. Houthi attacks are explicitly framed as leverage against Israel due to Gaza. Even as ceasefire talks progress, actual cessation of hostilities and sustained reduction of Houthi attacks is not yet achieved, and ties to Iranian strategy mean the situation is unlikely to stabilize rapidly."
                },
                {
                    "factor": "Partial Resumptions and Public Relations",
                    "effect": "Slightly increases probability. The resolution criteria allow for a 'partial resumption' or policy announcement to count as Yes. Maersk could, in theory, resume limited or trial passages with heavy escort if insurance becomes available, or if political pressure mounts for symbolic resumption. However, there is no sign of such a move in the current environment."
                },
                {
                    "factor": "Base rates of shipping resumption after piracy/insurgency",
                    "effect": "Decreases probability. Historical base rates (e.g., Somali piracy) show that major shippers only resume normal operations after a prolonged period of security and a clear, enforced reduction in risk. As of now, that is not the case in the Red Sea."
                },
                {
                    "factor": "Recent escalation (October 2025)",
                    "effect": "Strongly decreases probability. The most recent news includes a deadly Houthi missile attack on a Dutch-flagged merchant vessel as well as ongoing missile launches at Israel. This demonstrates that the risk is not only persistent but currently elevated."
                }
            ],
            "no_scenario": "Houthi attacks and threats remain frequent through December 2025, with continued successful attacks on commercial shipping despite international naval patrols. Insurance for Red Sea transit is unavailable or unaffordable. Maersk management, prioritizing crew safety and liability risk, makes no announcement regarding resumption, or explicitly states that Red Sea routes remain closed through year-end.",
            "yes_scenario": "A substantial, credible and sustained ceasefire is reached in Gaza, leading to a public, durable cessation of Houthi attacks on shipping, with insurance companies reinstating coverage for Red Sea transits. In response to either improved security or political/economic pressure, Maersk announces a limited resumption (e.g., a few escorted trial sailings) before the end of 2025. Alternatively, Maersk adjusts policy to allow ships through with specific, narrow criteria (e.g., only if under military escort), which Metaculus judges as a change in official policy.",
            "final_reasoning": "The current risk environment is highly unfavorable for Maersk to resume Red Sea shipping. Houthi attacks have not only continued but escalated in October 2025, including deadly missile strikes on commercial vessels. International naval efforts, while extensive, are insufficient to guarantee safety or to cover the volume of traffic needed for commercial viability. Insurance remains a major constraint, with some ships being denied coverage outright. Historically, shipping resumption after insurgent or pirate threats only occurs after a long period of demonstrable security, which is not the case here. While the resolution criteria allow for a partial or symbolic resumption to count, there is no evidence of Maersk preparing for even a limited return. Barring a rapid and unlikely breakthrough in Gaza negotiations and Houthi de-escalation, the most likely scenario is continued suspension. Therefore, assigning a probability that reflects a strong status quo bias, the negative impact of the latest escalation, and the low base rate of rapid shipping resumption, I assess the chance Maersk will resume shipping in the Red Sea in 2025 at 10%.",
            "final_probability": 10
        },
        "Regional Studies Middle East (Gulf Security Complex)": {
            "time_to_resolution": "Approximately 3 months, until December 31, 2025.",
            "perspective_relevance": "As an expert in Middle East Regional Studies and the Gulf Security Complex, I bring direct insight into the interplay between regional security actors (Houthis, Iran, GCC, Israel), global shipping companies, and the limitations of international naval operations in the Red Sea. I can assess escalation dynamics, deterrence, and corporate risk calculus in the context of persistent asymmetric threats and shifting regional alliances.",
            "status_quo": "Maersk has indefinitely suspended Red Sea shipping due to persistent Houthi attacks, with no significant improvement in the security environment. Military escorts and international operations have not restored safety or confidence for broad commercial resumption. The default is continued suspension.",
            "perspective_derived_factors": [
                {
                    "factor": "Continued Houthi Attacks and Capabilities",
                    "effect": "Decreases probability. News as of October 2025 shows the Houthis continue to launch hypersonic missiles at Israel and attack commercial ships (e.g., Dutch-flagged vessel on Sept 30, 2025), targeting not only Israeli-linked but also Western shipping. Attacks are deadly and sophisticated, and the Houthi leadership is explicit about using maritime disruption as leverage."
                },
                {
                    "factor": "International Naval Protection and Its Limits",
                    "effect": "Slightly increases probability, but not decisively. EU Operation Aspides and US-led coalitions have protected hundreds of ships, but coverage is limited, and Maersk paused shipping despite these efforts. Escorts are few, delays are long, and recent attacks occurred on ships without requested protection, exposing operational gaps."
                },
                {
                    "factor": "Selective Targeting by Houthis",
                    "effect": "Increases probability for non-Israeli-linked ships, but only moderately. As of mid-2025, Houthis claim to focus on Israeli-linked ships, but the targeting criteria are ambiguous, and Western and Greek ships have been hit. Maersk's global fleet and complex ownership structures mean risk of misidentification remains high."
                },
                {
                    "factor": "Regional and Political Developments (Gaza Ceasefire and Diplomatic Initiatives)",
                    "effect": "Potentially increases probability if a lasting ceasefire and a diplomatic breakthrough occur. However, as of October 2025, peace negotiations are ongoing but fragile. The Houthis publicly tie Red Sea attacks to the Gaza situation, and escalation continues despite talks."
                },
                {
                    "factor": "Maersk’s Corporate Risk Tolerance and Public Statements",
                    "effect": "Decreases probability. Maersk's CEO has stated no expectation of resumption before 'well into 2025.' The company faces legal and reputational risks in case of an incident, and recent deadly attacks make insurance and crew safety paramount."
                },
                {
                    "factor": "Base Rate of Shipping Resumptions After Militant Maritime Campaigns",
                    "effect": "Decreases probability. Historical base rate of resumption within one year after persistent asymmetric maritime threats (see Somali piracy, Strait of Hormuz incidents) is low unless there is a clear, durable improvement in security or a comprehensive international intervention."
                },
                {
                    "factor": "Partial vs. Full Resumption (Resolution Criteria)",
                    "effect": "Increases probability somewhat. The question resolves YES even for a partial or limited resumption, e.g., a single Maersk ship traversing the Red Sea under new security protocols."
                }
            ],
            "no_scenario": "Despite ongoing diplomatic efforts, the Houthi campaign in the Red Sea persists through the end of 2025, with intermittent but high-profile attacks on commercial vessels. Maersk maintains its suspension, citing persistent risks, insurance challenges, and lack of confidence in naval protection. There is no official announcement or credible report of Maersk ships resuming Red Sea passage before January 1, 2026.",
            "yes_scenario": "A significant breakthrough in Israel-Hamas-Gaza negotiations leads to a durable ceasefire, reducing the political incentive for Houthi attacks. The US/EU/GCC significantly increase naval escorts and protection, or Maersk quietly resumes limited Red Sea transits under strict security arrangements, perhaps for non-Israeli-linked cargo, and this is publicly acknowledged or credibly reported. Even one such voyage would trigger a YES.",
            "final_reasoning": "The base rate for shipping resumption in active conflict zones is low, especially absent a decisive security improvement or political breakthrough. The recent news (October 2025) shows the Houthi threat remains acute, with sophisticated attacks and explicit threats to shipping. While international naval operations offer some protection, their limited capacity and the persistence of attacks undermine confidence. Maersk’s own risk calculus, shaped by deadly incidents and insurance concerns, strongly favors continued suspension. The only plausible path to resumption is a diplomatic breakthrough leading to a sustainable Gaza ceasefire and a public or partial Maersk return, possibly with high-profile naval protection. However, the likelihood of this occurring and being announced before the end of 2025 remains low. The question’s broad resolution criteria (allowing partial resumption) do increase the probability slightly, but not enough to outweigh the prevailing risks. I estimate the probability that Maersk will officially or credibly be reported as resuming (even partially) Red Sea shipping in 2025 at 20%.",
            "final_probability": 20
        }
    },
    "deliberation_probability": [
        18,
        8,
        3,
        20,
        12,
        12,
        13,
        22,
        10,
        20
    ],
    "deliberation_mean_probability": 13.8,
    "deliberation_sd": 6.0882400303098,
    "deliberation_probability_result": 14,
    "group_results": {
        "shippingAndMaritimeOperationsRiskManagementIso31000": {
            "forecaster_to_engage": "Shipping and Maritime Operations (ISPS Code Compliance)",
            "response_type": "critique",
            "response": "Your extremely low probability (3%) is well-argued from the standpoint of current ISPS Code compliance realities and the severity of recent attacks. However, from a risk management and industry precedent perspective, your assessment may underweight the possibility of a very limited, symbolic, or exceptional Maersk passage triggering a Yes resolution. The question’s resolution criteria explicitly allow a partial resumption—including an official policy change or even credible reporting of a single escorted transit—which could occur rapidly if there is a diplomatic breakthrough in Gaza or a sudden, high-profile shift in Houthi posture. While unlikely, this path is not vanishingly rare in the history of high-profile shipping suspensions, especially given the commercial and political incentives for even a token resumption. Thus, a probability closer to 10–20% better reflects the structural possibility of a last-minute, partial policy shift—something not precluded by the data, even if still improbable."
        },
        "shippingAndMaritimeOperationsInternationalMaritimeLawUnclos": {
            "forecaster_to_engage": "Security Risk Assessment (Maritime Threat Assessment)",
            "response_type": "critique",
            "response": "Your probability of 20% appears somewhat optimistic given the persistent escalation in Houthi attacks and the lack of evidence for imminent, durable de-escalation. While you correctly note the partial resumption loophole in the resolution criteria, the shipping industry’s risk calculations—especially for a major player like Maersk—are constrained by insurance, flag state, and reputational concerns, not just operational risk. The continuing attacks (including recent high-profile sinkings and deadly incidents) have, if anything, hardened these constraints. Moreover, the news shows no trend toward a sustainable reduction in threat or a political breakthrough robust enough to shift insurance and legal frameworks before year-end. Base rates for resumption in comparably high-risk maritime environments are lower than your estimate suggests, especially with a quasi-state actor backed by Iran and ambiguous targeting policies. I contend the probability is better reflected in the single-digit to low-teens range, barring a truly extraordinary and rapid diplomatic shift."
        },
        "shippingAndMaritimeOperationsIspsCodeCompliance": {
            "forecaster_to_engage": "Political Science (Conflict Resolution Theory)",
            "response_type": "defense",
            "response": "Your reasoning acknowledges both the low base rate for rapid shipping resumption in active conflict zones and the non-zero probability created by the possibility of a partial, symbolic return under the resolution criteria. This balanced approach is a strength: it avoids both the overconfidence of a near-zero probability and the unwarranted optimism of a double-digit probability in the absence of concrete diplomatic progress or a dramatic reduction in risk. Your recognition of Maersk’s conservative risk culture, combined with the status quo bias and slow-moving nature of such crises, aligns well with ISPS Code compliance logic and industry precedent. The small window for a sudden, partial return is correctly weighted as a possibility, not a likelihood. This nuanced forecast is therefore defensible from an operational and compliance standpoint."
        },
        "securityRiskAssessmentMaritimeThreatAssessment": {
            "forecaster_to_engage": "Regional Studies Middle East (Gulf Security Complex)",
            "response_type": "defense",
            "response": "Your probability estimate (20%) is well-calibrated given the operational and political realities. You appropriately emphasize the importance of both security trends and the partial resumption threshold in Metaculus's resolution criteria. The recognition that a diplomatic breakthrough or rapid, symbolic resumption remains structurally possible—despite the persistent high threat—is a crucial distinction that some lower-probability forecasters overlook. Your analysis reflects a sophisticated understanding of regional dynamics, Maersk's risk calculus, and the incentives for even a modest policy shift late in the year. This balanced approach is justified by both historical precedent and the unique configuration of current regional and industry pressures."
        },
        "securityRiskAssessmentCriticalInfrastructureProtectionStandards": {
            "forecaster_to_engage": "International Relations (Security Dilemma Theory)",
            "response_type": "defense",
            "response": "Your reasoning is strong in highlighting the entrenched nature of the security dilemma in the Red Sea. By tracing the persistence of Houthi attacks to deeper regional dynamics and the lack of effective deterrence from international naval action, you accurately capture why the threat environment remains prohibitive for a risk-averse, compliance-driven operator like Maersk. You also correctly note that the resolution criteria allow for a partial or symbolic resumption, supporting a low but nonzero probability. This approach is well-aligned with security risk assessment standards, which prioritize demonstrated, durable threat reduction over temporary or cosmetic improvements. Your probability (12%) reflects the structural possibility of a late-breaking shift, while giving proper weight to the prevailing, slow-changing status quo. This nuanced calibration is a strength."
        },
        "internationalRelationsSecurityDilemmaTheory": {
            "forecaster_to_engage": "International Relations (Maritime Security Studies)",
            "response_type": "defense",
            "response": "Your reasoning closely aligns with Security Dilemma Theory in recognizing the persistent, self-reinforcing nature of maritime insecurity in the Red Sea. You underscore that operational and reputational risks for Maersk are prohibitive as long as attacks and insurance constraints continue, even though the resolution threshold is low. This is compelling: the industry rarely resumes even limited operations absent a demonstrable, sustained decrease in risk. Your mention of the possibility of a sudden diplomatic breakthrough—while assigning it only a low probability—demonstrates prudent scenario planning without succumbing to optimism bias. By integrating both historical precedent and the unique configuration of the current crisis, your probability (13%) is well-calibrated. This approach is especially strong in its careful weighting of structural incentives, the slow-moving nature of security dilemmas, and the partial resumption caveat."
        },
        "internationalRelationsMaritimeSecurityStudies": {
            "forecaster_to_engage": "Shipping and Maritime Operations (International Maritime Law UNCLOS)",
            "response_type": "defense",
            "response": "Your emphasis on the legal, insurance, and operational realities constraining Maersk’s risk calculus is particularly strong. By noting that base rates for shipping resumption after pirate or insurgent attacks are low even after violence subsides, you underscore the importance of not only objective threat reduction but also the perception of safety, regulatory requirements, and industry-wide practices. The focus on ambiguity in Houthi targeting—and its impact on insurance and compliance—effectively supports the argument that even a limited or partial resumption is unlikely unless there is a clear, durable improvement in the security environment. Your probability (8%) may be on the lower end, but it is justified given the recent spike in attacks and the absence of robust signals for imminent change. This rigor in marrying legal/insurance considerations with operational realities is a notable strength."
        },
        "politicalScienceConflictResolutionTheory": {
            "forecaster_to_engage": "Shipping and Maritime Operations (ISPS Code Compliance)",
            "response_type": "critique",
            "response": "Your extremely low probability (3%) is well-supported by current shipping security standards and the severity of ongoing attacks, yet it may understate the structural possibility—given the question's resolution criteria—that even a single symbolic or exceptional Maersk transit could trigger a Yes. While the likelihood of a full or routine resumption is indeed extremely low, the industry and political incentives for a token, highly publicized partial return (perhaps under heavy naval escort or in the context of a sudden diplomatic breakthrough) are not zero. Historical precedents for risk-averse carriers show rare but real instances of such symbolic returns in response to external pressure or shifting diplomatic winds, especially under commercial or political urgency. A probability closer to 10–20% would better account for these outlier but plausible scenarios allowed by the resolution wording."
        },
        "politicalScienceRegimeStabilityAnalysis": {
            "forecaster_to_engage": "Shipping and Maritime Operations (Risk Management ISO31000)",
            "response_type": "defense",
            "response": "Your reasoning is robust in its recognition of both industry base rates and structural incentives for symbolic resumption. You appropriately note that, while the persistent threat environment makes a full operational return unlikely, the possibility of a token or partial resumption—triggered by a diplomatic breakthrough or shifting commercial/political incentives—cannot be dismissed. This nuance is often missed by those focusing solely on the operational threat. By placing your probability in the low double digits (18%), you capture the non-zero likelihood introduced by the resolution’s partial resumption clause, while still giving proper weight to the status quo and recent escalation. This calibrated approach is especially compelling from a regime stability analysis perspective, as it accounts for both the inertia of risk-averse corporate decision-making and the possibility of last-minute policy shifts under extraordinary circumstances."
        },
        "regionalStudiesMiddleEastGulfSecurityComplex": {
            "forecaster_to_engage": "Shipping and Maritime Operations (ISPS Code Compliance)",
            "response_type": "critique",
            "response": "Your probability of 3% is highly defensible from a strict compliance and operational risk perspective, given the current threat environment and absence of concrete evidence for a Maersk policy shift. However, it may not sufficiently account for two factors: (1) The explicit Metaculus resolution criteria, which would allow even a single, exceptional, heavily escorted Maersk transit to resolve the question Yes; and (2) the history of rare but real token resumptions by major operators in high-risk regions, sometimes prompted by political or commercial pressure rather than clear, durable improvements in the security environment. These scenarios are improbable, but not vanishingly so, especially given the incentives for stakeholders to demonstrate reopening or progress if diplomatic talks advance. A slightly higher probability (in the 10–20% range) would better reflect these structural possibilities, even if the modal outcome remains continued suspension."
        }
    },
    "revision_results": {
        "Shipping and Maritime Operations (Risk Management ISO31000)": {
            "my_phase1_final_probability": 18,
            "reasoning_for_revised_probability": "The group deliberation reinforced the consensus that the risk environment remains highly unfavorable for Maersk's resumption of Red Sea operations in 2025. Most forecasters, drawing from diverse but adjacent expertise (maritime law, political science, regional studies), placed probabilities in the 8–22% range, with strong arguments emphasizing the persistent and even escalating threat, continued lack of effective naval protection, and the insurance/operational constraints on Maersk. Notably, the very low probabilities (3–8%) may underweight the possibility of a partial or symbolic resumption (as per the broad resolution criteria), while the higher end (20–22%) may slightly overstate the likelihood of a dramatic late-year diplomatic breakthrough or risk recalibration. My original probability (18%) remains well-calibrated in the context of these arguments, balancing the strong status quo bias and the nonzero chance of a minimal, symbolic policy shift.",
            "revised_probability": 18
        },
        "Shipping and Maritime Operations (International Maritime Law UNCLOS)": {
            "my_phase1_final_probability": 8,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, my initial forecast stands up well in terms of the balance of risk, legal, and operational realities. However, the critique of the extremely low probability presented by ISPS Code Compliance—highlighting the possibility of a sudden, symbolic, or limited resumption due to political incentives and the broad resolution criteria—warrants a slight upward revision. The group consensus clusters around 10–20%, with most experts emphasizing the low but non-zero chance of a last-minute, partial resumption (e.g., a single Maersk vessel under escort, or an official announcement timed to a diplomatic breakthrough). The current environment remains highly dangerous, but given the explicit resolution criteria and plausible scenarios for an exceptional resumption, I am revising my probability slightly upward to 12%.",
            "revised_probability": 12
        },
        "Shipping and Maritime Operations (ISPS Code Compliance)": {
            "my_phase1_final_probability": 3,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I see that most expert forecasters converge on a low probability, typically in the single digits to low 20s, citing the status quo of severe threat, insurance/flag/ISPS constraints, and the lack of a credible, durable diplomatic breakthrough. Critiques of my initial 3% center on whether I may be underweighting the 'partial resumption' loophole, i.e., the possibility of a last-minute, highly limited or symbolic Maersk passage or policy shift, which could technically resolve the question as Yes. While this is possible, I maintain that the probability of Maersk making even a partial, policy-changing move in the current environment—given corporate risk aversion, insurance, and compliance pressures—remains extremely low. I acknowledge there is a nonzero chance of a sudden, symbolic resumption if there is a dramatic late-year breakthrough. However, given the persistent (even escalating) attacks, and the lack of any signal from Maersk or the maritime insurance sector of pending change, I still judge the probability to be very low. To acknowledge the group’s valid critique and slightly increase for the 'black swan' partial-resumption scenario, I will revise my probability upward, but remain in single digits.",
            "revised_probability": 6
        },
        "Security Risk Assessment (Maritime Threat Assessment)": {
            "my_phase1_final_probability": 20,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I find that most expert forecasters converge on a low probability (generally single digits to low 20s), with strong arguments for a persistent status quo—ongoing, severe Houthi attacks, insurance and compliance obstacles, and Maersk’s conservative risk posture. Critiques of higher probabilities (including my own 20%) note that the base rate for resumption in actively hostile, state-backed maritime threat environments is even lower than for piracy or non-state risks, and the absence of a visible trend toward de-escalation or a robust diplomatic breakthrough. However, defenses of the 20% estimate (and similar) emphasize the resolution criteria’s allowance for a very limited or symbolic resumption, and the structural possibility—however remote—of a sudden policy shift if circumstances change. Given the continued low base rate, hardened insurance/legal constraints, and status quo bias, but also the real (if narrow) partial-resumption loophole, I judge that my initial estimate was at the high end of the defensible range. The group consensus and the weight of current evidence support a modest downward revision. I now set my probability at 15%.",
            "revised_probability": 15
        },
        "Security Risk Assessment (Critical Infrastructure Protection Standards)": {
            "my_phase1_final_probability": 12,
            "reasoning_for_revised_probability": "Upon review, the group deliberation confirms the general consensus that the probability of Maersk resuming shipping in the Red Sea in 2025 is low but not zero, mainly due to the persistence and escalation of Houthi attacks, the lack of robust and reliable international protection, and the high bar Maersk sets for operational risk. The critiques and defenses highlight a narrow but real possibility for a partial or symbolic resumption if a diplomatic breakthrough or sudden risk reduction occurs late in the year, as allowed by the resolution criteria. Some forecasters suggest even lower probabilities (single digits), but others defend a slightly higher probability (up to 20%) to allow for black swan events or last-minute partial returns. My original estimate (12%) is well-aligned with this range and reflects the prevailing risk environment, the operational and reputational constraints facing Maersk, and the partial resumption loophole. There is no compelling new evidence to justify a significant move up or down; thus, I maintain my original probability.",
            "revised_probability": 12
        },
        "International Relations (Security Dilemma Theory)": {
            "my_phase1_final_probability": 12,
            "reasoning_for_revised_probability": "Group deliberation reinforced my original analysis, with a strong consensus around low single- to low-double-digit probabilities. The partial resumption clause remains the only significant path to a Yes, and while a few forecasters argued for probabilities at the upper end of this range (around 20%), the most compelling arguments—especially from compliance, legal, and political science perspectives—consistently emphasized the slow-moving, deeply entrenched security dilemma and the lack of imminent diplomatic or operational breakthroughs. Critiques of lower or higher probabilities converged on the same structural logic: only a black swan diplomatic event or a symbolic, last-minute Maersk operation could trigger a Yes, and the base rates for such a rapid shift are exceedingly low. As a result, I see no compelling reason to raise or lower my initial estimate. My forecast remains well-calibrated at 12%.",
            "revised_probability": 12
        },
        "International Relations (Maritime Security Studies)": {
            "my_phase1_final_probability": 13,
            "reasoning_for_revised_probability": "After reviewing group deliberation, my original probability (13%) remains well-calibrated. Nearly all expert forecasters converge on low, but nonzero probabilities (generally 3–22%), citing the persistent and even escalating Houthi threat, lack of effective deterrence or diplomatic breakthrough, and Maersk's highly conservative risk posture. The arguments for even lower probabilities (e.g., 3–8%) are strong regarding insurance and compliance realities, while those for higher ones (18–22%) emphasize the possibility of a symbolic, partial resumption if a late diplomatic breakthrough occurs. However, the operational, reputational, and insurance constraints for Maersk are severe, and recent deadly attacks make even a limited resumption highly unlikely. Given the resolution criteria allow for partial resumption, and considering the structural possibility of a last-minute shift, a probability in the low teens is most defensible. No new evidence compels a material upward or downward revision; thus, I maintain my forecast.",
            "revised_probability": 13
        },
        "Political Science (Conflict Resolution Theory)": {
            "my_phase1_final_probability": 22,
            "reasoning_for_revised_probability": "The group deliberation reinforced my conclusion that the base rate for rapid resumption of Maersk shipping in the Red Sea is low, given the persistence and escalation of Houthi attacks and the lack of a durable political breakthrough. Several forecasters with deep domain expertise in maritime law, risk management, and security assessment converged on low probabilities (mostly in the 8-20% range), citing the same constraints: insurance, ambiguous Houthi targeting, lack of demonstrable sustained security improvement, and Maersk's conservative risk culture. However, critique of extremely low probabilities (e.g., 3%) highlighted that the resolution criteria allow a partial or symbolic resumption to count, and that a last-minute, exceptional, or politically-driven resumption is possible, albeit unlikely. This supports my view that the probability should not be in the very low single digits, but also should not be overly optimistic. Thus, my initial estimate of 22% remains reasonable, capturing both the dominance of the status quo and the nonzero chance of a sudden partial resumption. No significant new evidence or argument emerged in deliberation to justify a material upward or downward revision.",
            "revised_probability": 22
        },
        "Political Science (Regime Stability Analysis)": {
            "my_phase1_final_probability": 10,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I note that nearly all domain experts converge on a low probability (3–22%), with most estimates clustering between 8% and 20%. Critiques of the lowest probabilities (e.g., 3%) highlight that the resolution criteria—allowing even a single, partial, or symbolic Maersk transit to trigger a Yes—create a structural possibility for last-minute, token resumption under commercial or political pressure, especially if there is an unexpected diplomatic breakthrough. However, the consensus remains that the operational, insurance, and reputational constraints are severe and the recent escalation in Houthi attacks reduces the likelihood of even a partial resumption. My original assessment (10%) is well-aligned with this consensus: it gives significant weight to the status quo and the high risk environment, while not entirely dismissing the outlier scenario of a symbolic return. Therefore, I see no compelling reason to revise my probability.",
            "revised_probability": 10
        },
        "Regional Studies Middle East (Gulf Security Complex)": {
            "my_phase1_final_probability": 20,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I see a strong convergence among subject-matter experts around a low (but nonzero) probability, generally within the 8–22% range. The critiques of very low probabilities (e.g., 3%) highlight that the Metaculus resolution criteria lower the threshold for a Yes to even a single, symbolic, or exceptional Maersk transit. Defenses of probabilities in the low teens emphasize that, barring a dramatic diplomatic breakthrough, the industry base rate for resuming operations in high-threat environments is very low—even for partial resumption. My original estimate already accounted for both the persistent high threat (keeping the probability low) and the resolution’s permissiveness (precluding a near-zero estimate). No new argument or evidence from the group deliberation justifies a significant revision: the consensus supports my reasoning that, although the modal outcome is continued suspension, the tail risk of a token resumption remains. Therefore, I will maintain my probability at 20%.",
            "revised_probability": 20
        }
    },
    "revision_probability": [
        18,
        12,
        6,
        15,
        12,
        12,
        13,
        22,
        10,
        20
    ],
    "revision_mean_probability": 14.0,
    "revision_sd": 4.83045891539648,
    "revision_probability_result": 14,
    "question_details": {
        "id": 38977,
        "title": "Will Maersk resume shipping in the Red Sea in 2025?",
        "created_at": "2025-08-31T06:17:51.009911Z",
        "open_time": "2025-10-06T11:12:54Z",
        "cp_reveal_time": "2025-10-06T12:42:54Z",
        "spot_scoring_time": "2025-10-06T12:42:54Z",
        "scheduled_resolve_time": "2026-01-01T10:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-10-06T12:42:54Z",
        "actual_close_time": "2025-10-06T12:42:54Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "This question is synced with an identical question on Metaculus. The original question opened on 2025-01-10 20:41:00 and can be found [here](https://www.metaculus.com/questions/31277). This question will resolve to the same value as the synced question. The original question's background info at this time is below. \n\nAfter the [2023 Israeli invasion of Gaza](https://en.wikipedia.org/wiki/Israeli_invasion_of_the_Gaza_Strip), the [Houthis](https://en.wikipedia.org/wiki/Houthi_movement) started attacking vessels going through the Red Sea, particularly those crossing [Bab el Mandeb](https://en.wikipedia.org/wiki/Bab-el-Mandeb), in support of Hamas. Until March 2024, the Houthis [had attacked](https://en.wikipedia.org/wiki/Red_Sea_crisis) more than 60 vessels, leading to a significant reduction in trading volume going through the Red Sea. Despite military operations from both [the US](https://en.wikipedia.org/wiki/Operation_Prosperity_Guardian) and [the EU](https://en.wikipedia.org/wiki/Operation_Aspides), trading volumes have remained low. Specifically, Maersk [paused shipping indefinitely](https://www.foxbusiness.com/markets/maersk-pauses-shipping-operations-red-sea-indefinitely-weekend-houthi-attack) in January 2024, with its CEO saying that they don't expect to resume until [well into 2025](https://www.thetimes.com/business-money/companies/article/maersk-not-expecting-to-resume-suez-route-this-year-g0mmr98nn).\n\n`{\"format\":\"metac_closes_in_period\",\"info\":{\"post_id\":31277,\"question_id\":30920}}`",
        "resolution_criteria": "This question will resolve as **Yes** if Maersk announces or [credible sources](https://www.metaculus.com/faq/#definitions) report that shipping through the Red Sea has resumed before January 1, 2026.",
        "fine_print": "* An announcement of a partial resumption of Red Sea activity will resolve this question as **Yes**. Reports of Maersk ships traveling the Red Sea will also resolve the question as **Yes** if, in the judgment of Metaculus, the event represents a change to official Maersk policy, allowing its ships to travel through the Red Sea.\n* Reports that this will happen at some point in the future will only resolve this question as **Yes** if that point is within the calendar year 2025 *and* that date is reached without a significant change in plans.",
        "post_id": 39600,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Ships Adorned with Free Horizons: The Global Impact of the Sumud Fleet**\nThe Sumud Fleet, named after the Arabic word 'ṣumud' meaning 'determination' or 'resilience,' has gained global attention. Launched in July 2025 by the Freedom Flotilla Coalition and organizations such as Global Movement and Maghreb Sumud Fleet during the Gaza conflict, the fleet comprises over 50 ships from more than 44 countries, making it the largest civilian-led convoy in history. The initiative stems from Israel's longstanding maritime blockade of the Gaza Strip since Hamas took control in 2007. Between 2008 and 2016, only 5 out of 31 aid ships attempting to break the blockade reached Gaza. The first Gaza Freedom Flotilla in 2010 was intercepted by Israeli forces, resulting in the deaths of 10 activists and dozens injured—an event that drew international condemnation. Subsequent attempts in 2011, 2015, 2016, 2018, and 2025 were similarly thwarted. In March 2024 to July 2024, a temporary sea corridor was opened between Cyprus and Gaza under the Safeena Operation, used by cargo vessels and the U.S. military. In March 2025, Israel imposed a three-month full blockade; in May, a flotilla was attacked by drones, and in June and July, other convoys were intercepted. The humanitarian campaign, led by the IHH Humanitarian Relief Foundation and supported by groups like Free Gaza Movement and Viva Palestina, began in 2010 to deliver aid and draw global attention to the humanitarian crisis in Gaza. The campaign, with the slogan 'Our route is Palestine, our cargo is freedom,' attracted thousands of civil society organizations and activists worldwide. Supplies including medicine, medical equipment, cement, iron, toys, playground equipment, and school materials were loaded onto ships such as Defne Y, Gaza 1, and Mavi Marmara, departing from Istanbul on May 22, 2010. The Mavi Marmara, escorted by a farewell ceremony at Sarayburnu Port and carrying 560 passengers from 32 countries and various faiths—including 50 foreign journalists—sailed from Antalya Port on May 28, 2010. It joined five other ships in international waters off Cyprus, forming a flotilla bound for Gaza. On the night of May 30–31, 2010, Israeli forces sent threatening radio messages and launched air and sea harassment. Israeli commandos, using helicopters and Zodiac boats, attacked the fleet, deploying smoke and sound bombs before opening fire indiscriminately. Nine Turkish aid volunteers were killed, over 50 injured, and one, Uğur Süleyman Söylemez, died four years later, raising the death toll to 10. Despite failing to reach Gaza, the flotilla succeeded in capturing global attention, symbolizing resistance and hope. The article concludes by quoting a poem by Yahya Kemal, affirming that these 'ships adorned with free horizons' will, as before, bring freedom to the people of Palestine and Gaza, and that this movement will inspire future generations of heroes.\nOriginal language: tr\nPublish date: October 06, 2025 12:30 AM\nSource:[Yeni Akit Gazetesi](https://www.yeniakit.com.tr/yazarlar/ahmet-talib-celen/hur-ufuklarda-donanmis-iki-yuz-pare-gemi-50363.html)\n\n**Houthi Missile Attack Leaves Merchant Ship Unseaworthy; EU-Led Rescue Operation Successfully Evacuates Crew**\nOn October 5, 2025, the official X account of the EU's 'Aspides Operation' released footage of a rescue mission following a missile attack on the Dutch-flagged merchant vessel 'MV Minerva Grahat' on September 30, 2025. The ship, located 128 nautical miles southeast of Aden Port, Yemen, was struck by a ballistic missile-like object on September 29, 2025, according to the EU. The vessel, which had not requested protection from EU warships, caught fire and became unseaworthy. Upon receiving a distress call from the captain, the EU naval task force dispatched a rescue team and successfully evacuated 19 crew members—comprising Russians, Ukrainians, Filipinos, and Sri Lankans—two of whom were seriously injured. The operation involved naval vessels and aircraft from the Italian and Greek navies. The Houthi rebels claimed responsibility on October 1, stating the ship was targeted because it was classified as a vessel prohibited from entering ports in 'occupied Palestine'—a designation tied to their solidarity with Hamas. The Houthis have been attacking ships they believe are linked to Israel, including those with only tenuous ties, prompting the EU, the United States, the United Kingdom, and India to deploy warships to escort merchant vessels in the Red Sea and the Gulf of Aden.\nOriginal language: ja\nPublish date: October 05, 2025 09:12 PM\nSource:[乗りものニュース](https://trafficnews.jp/post/592178)\n\n**EU-GCC: Opening speech by High Representative Kaja Kallas at the High-Level Forum on Regional Security and Cooperation**\nAt the High-Level Forum on Regional Security and Cooperation, High Representative Kaja Kallas delivered an opening speech emphasizing the need for diplomacy and cooperation between the European Union and the Gulf Cooperation Council (GCC). She highlighted three key regional challenges: Iran’s nuclear program, maritime security in the Red Sea and Gulf of Aden, and the situation in Gaza. Regarding Iran, she noted that despite intensive EU diplomatic efforts during the 30-day snapback window triggered by France, Germany, and the UK, a resolution to extend the UNSC Resolution was not achieved; as a result, the EU will re-impose all previously lifted UN and EU nuclear-related sanctions without delay, while reaffirming that diplomacy must continue. On maritime security, Kallas condemned Houthi attacks on international shipping, including the sinking of two Greek cargo ships, an attack on a tanker, and an explosion on a Dutch-flagged vessel, stressing that such acts violate freedom of navigation—a global public good. She highlighted EU Operation ASPIDES, which has protected over 560 vessels and monitored or supported another 600, with anti-air frigates deploying daily; the operation has been extended to February 2026, with further extension under consideration. She called for a coordinated regional approach, including strengthening the Yemeni Coast Guard. On Gaza, she acknowledged Qatar’s direct experience of conflict spillover, including a strike on its sovereignty, welcomed the Israeli Prime Minister’s apology, and expressed support for President Trump’s Gaza peace plan, noting Hamas’s announced acceptance. She stressed that lasting peace depends on a two-state solution and urged collective action to build on momentum from the UN General Assembly to resume political talks. Kallas concluded by affirming shared interests between the EU and GCC across multiple domains and emphasized that cooperation, not confrontation, should define international relations.\nOriginal language: en\nPublish date: October 05, 2025 07:11 PM\nSource:[Europa](https://www.eeas.europa.eu/eeas/eu-gcc-opening-speech-high-representative-kaja-kallas-high-level-forum-regional-security-and_en)\n\n**Houthi Movement Launches New Missile Strike on Jerusalem, Reaffirms Support for Hamas Amid Escalating Conflict**\nHouthi movement (Ansar Allah) reaffirmed its full support for Hamas and other Palestinian factions in their resistance against the Israeli occupation, particularly in response to the latest Trump peace plan. In a statement, the Houthi government's Ministry of Foreign Affairs declared that Palestinian resilience would force Israel to end its aggression, genocide, and the blockade of Gaza, emphasizing that Israel has failed to eliminate resistance or displace Gaza’s population. The group criticized Israel for violating agreements with Hamas and Lebanon, while praising international support for Palestine. On October 5, 2025, the Houthis announced a successful military operation using a hypersonic, multi-warhead ballistic missile named 'Palestine 2' targeting sensitive sites in occupied Jerusalem, which reportedly caused mass evacuations of Israeli civilians. The Israeli military confirmed intercepting the missile, activating air raid sirens, and closing Ben Gurion Airport. This marks the first such deep Israeli strike by the Houthis since September 29, 2024, when they conducted two prior attacks—one on Tel Aviv and another on Eilat—using hypersonic missiles and drones. Since October 2023, the Houthis have launched repeated missile and drone attacks on Israel and targeted 228 ships linked to or bound for Israel, citing solidarity with Gaza under Israeli military assault backed by the U.S. since October 7, 2023. In retaliation, Israel conducted 2,843 airstrikes and naval attacks on Houthi-controlled areas in Yemen, including a strike on a prison facility in Sana’a on September 26, 2024, killing and wounding many. Houthi officials stated that their military operations, totaling 1,679 attacks (missiles, drones, and naval vessels), serve as leverage in Palestinian negotiations. A senior Houthi political office member, Muhammad al-Bakhti, affirmed that their military actions are a tool of pressure and would be reactivated at Hamas’s request. Another official, Muhammad al-Farh, praised Hamas’s 'flexible, responsible, realistic, and implementable' response to the Trump plan. The Houthi leader, Abdul Malik al-Houthi, reported that their operations have involved 1,679 attacks and targeted 228 ships since the start of their support for Gaza.\nOriginal language: ar\nPublish date: October 05, 2025 06:28 PM\nSource:[القدس العربي](https://www.alquds.co.uk/%D8%A7%D9%84%D8%AD%D9%88%D8%AB%D9%8A%D9%88%D9%86-%D9%8A%D8%B3%D8%AA%D9%87%D8%AF%D9%81-%D9%85%D9%88%D8%A7%D9%82%D8%B9-%D8%A5%D8%B3%D8%B1%D8%A7%D8%A6%D9%8A%D9%84%D9%8A%D8%A9-%D9%88%D9%8A%D8%A4%D9%83/)\n\n**Houthi Missile Attack on Israel Amid Peace Talks for Gaza**\nOn Saturday morning, the Israel Defense Forces (IDF) intercepted a ballistic missile launched from Yemen by Houthi rebels, backed by Iran's regime, which activated air raid sirens in Jerusalem and central Israel. No casualties or material damage were reported, according to a brief IDF statement on X. The IDF urged the public to follow instructions from the Home Front Command. As a precaution, early warnings were issued across multiple regions, including parts of the West Bank. This attack follows a previous drone launch by the Houthi militia, part of a broader pattern of escalating pressure on Israel. The Houthis have targeted not only Israeli territory but also vessels linked to Israel in the Red Sea and the Gulf of Adén, in response to Israel's military campaign in Gaza following the October 7, 2023, Hamas-led attacks. These actions have forced rerouting of international shipping, increasing logistics costs and worsening the global trade crisis. International naval forces, including the U.S.-led Operation Prosperity Guardian, are actively protecting maritime traffic in the Red Sea, where several commercial ships have been sunk due to the rising hostilities. The attacks come amid ongoing peace negotiations between Israel and Hamas, with U.S. President Donald Trump proposing a peace plan that includes an initial withdrawal line in Gaza. On Saturday, Israel announced the deployment of an official delegation led by Minister Ron Dermer to Cairo for talks starting Monday, focused on Trump’s plan for Gaza’s reconstruction and future. After two years of war in Gaza, the possibility of an immediate ceasefire gained momentum following Trump’s announcement that Israel had accepted the initial withdrawal line, and he urged Hamas to accept the conditions to achieve a ceasefire, release hostages, and free prisoners.\nOriginal language: es\nPublish date: October 05, 2025 09:02 AM\nSource:[infobae](https://www.infobae.com/america/mundo/2025/10/05/mientras-avanzan-las-conversaciones-para-un-acuerdo-de-paz-en-gaza-los-huties-lanzaron-un-ataque-contra-israel/)\n\n**Flotilla: We Will Continue Sailing Toward Gaza**\nOn the evening of Wednesday, October 1, 2025, the Israeli military attacked the Global Sumud Flotilla, a peace and humanitarian mission composed of 44 vessels and over 400 activists, in international waters. The attack began around 20:00 with the interception of the flagship Alma, whose crew was arrested. By October 3, 2025, Israeli forces had intercepted 42 of the 44 ships, with the remaining vessels either delayed or captured. Morana Miljanović, the only Croatian citizen on the flotilla and captain of the vessel Shireen, described the interception as illegal and labeled it a terrorist act, stating that 'intercepting ships in international waters is illegal, amounting to the kidnapping of civilians in international waters, thus a terrorist act.' She reported that communication between ships was disrupted 50 times between Wednesday and Thursday night, with Israeli forces conducting operations into the early hours. The Shireen, which had been serving as a legal observer, changed course and arrived safely in Cyprus by October 4. One vessel, the Marinette, was intercepted on October 3. Miljanović emphasized the flotilla’s humanitarian mission, noting it carried aid to Gaza, and described the action as a collective, decolonial political statement beyond mere aid delivery. She also highlighted global mobilization efforts and confirmed a second flotilla of around ten ships was already en route to Gaza, aiming to break the blockade. Miljanović called on the Croatian government to uphold international law and cease supporting what she described as genocide, urging citizens worldwide to act collectively to resist normalization of the situation in Palestine.\nOriginal language: it\nPublish date: October 06, 2025 08:00 AM\nSource:[OBC Transeuropa](https://www.balcanicaucaso.org/aree/Croazia/Flotilla-continueremo-a-navigare-verso-Gaza-240528)\n\n**Israeli Military Says It Intercepted a Missile Launched from Yemen**\nOn October 5, 2024, the Israel Defense Forces (IDF) reported intercepting a missile launched from Yemen, prompting air defense alerts across areas including Tel Aviv. No casualties or property damage were reported. The Houthi movement in Yemen later claimed responsibility, stating it had launched a hypersonic ballistic missile targeting 'sensitive Israeli locations.' This attack occurred ahead of scheduled talks between Israel and the Palestinian Islamic Resistance Movement (Hamas) in Egypt, set for October 6, focusing on the details of a prisoner exchange under the U.S. President Donald Trump's '20-point plan.' Although Trump claimed Israel had agreed to a 'preliminary withdrawal line' in Gaza, Israel conducted airstrikes on Gaza residential buildings that day, resulting in 18 deaths. Since the outbreak of the新一轮 Israel-Palestine conflict in October 2023, the Houthi movement has attacked ships linked to Israel in the Red Sea and Arabian Sea and conducted missile and drone strikes on Israeli territory in support of Palestinians in Gaza. Israel has responded with multiple airstrikes on Houthi-controlled areas in Yemen. The Houthis reiterated that they would cease attacks on Israel only if Israel ends its military aggression and blockade of Gaza. On September 24, 2024, the Houthis launched a drone attack on Eilat, Israel’s Red Sea coastal city, injuring at least 20 people. The following day, Israel conducted a large-scale airstrike on Sana’a, the capital of Yemen, killing at least 8 and injuring 142. The information is sourced from Xinhua News Agency.\nOriginal language: zh\nPublish date: October 06, 2025 02:04 AM\nSource:[news.cn](http://www.news.cn/world/20251006/8e274d122a55405587572254a7ba13d1/c.html)\n\n**Ships Adorned with Free Horizons: The Global Impact of the Sumud Fleet**\nThe Sumud Fleet, named after the Arabic word 'ṣumud' meaning 'determination' or 'resilience,' has gained global attention. Launched in July 2025 by the Freedom Flotilla Coalition and organizations such as Global Movement and Maghreb Sumud Fleet during the Gaza conflict, the fleet comprises over 50 ships from more than 44 countries, making it the largest civilian-led convoy in history. The initiative stems from Israel's longstanding maritime blockade of the Gaza Strip since Hamas took control in 2007. Between 2008 and 2016, only 5 out of 31 aid ships attempting to break the blockade reached Gaza. The first Gaza Freedom Flotilla in 2010 was intercepted by Israeli forces, resulting in the deaths of 10 activists and dozens injured—an event that drew international condemnation. Subsequent attempts in 2011, 2015, 2016, 2018, and 2025 were similarly thwarted. In March 2024 to July 2024, a temporary sea corridor was opened between Cyprus and Gaza under the Safeena Operation, used by cargo vessels and the U.S. military. In March 2025, Israel imposed a three-month full blockade; in May, a flotilla was attacked by drones, and in June and July, other convoys were intercepted. The humanitarian campaign, led by the IHH Humanitarian Relief Foundation and supported by groups like Free Gaza Movement and Viva Palestina, began in 2010 to deliver aid and draw global attention to the humanitarian crisis in Gaza. The campaign, with the slogan 'Our route is Palestine, our cargo is freedom,' attracted thousands of civil society organizations and activists worldwide. Supplies including medicine, medical equipment, cement, iron, toys, playground equipment, and school materials were loaded onto ships such as Defne Y, Gaza 1, and Mavi Marmara, departing from Istanbul on May 22, 2010. The Mavi Marmara, escorted by a farewell ceremony at Sarayburnu Port and carrying 560 passengers from 32 countries and various faiths—including 50 foreign journalists—sailed from Antalya Port on May 28, 2010. It joined five other ships in international waters off Cyprus, forming a flotilla bound for Gaza. On the night of May 30–31, 2010, Israeli forces sent threatening radio messages and launched air and sea harassment. Israeli commandos, using helicopters and Zodiac boats, attacked the fleet, deploying smoke and sound bombs before opening fire indiscriminately. Nine Turkish aid volunteers were killed, over 50 injured, and one, Uğur Süleyman Söylemez, died four years later, raising the death toll to 10. Despite failing to reach Gaza, the flotilla succeeded in capturing global attention, symbolizing resistance and hope. The article concludes by quoting a poem by Yahya Kemal, affirming that these 'ships adorned with free horizons' will, as before, bring freedom to the people of Palestine and Gaza, and that this movement will inspire future generations of heroes.\nOriginal language: tr\nPublish date: October 06, 2025 12:30 AM\nSource:[Yeni Akit Gazetesi](https://www.yeniakit.com.tr/yazarlar/ahmet-talib-celen/hur-ufuklarda-donanmis-iki-yuz-pare-gemi-50363.html)\n\n**Yemeni Minister Al-Iryani: Houthi Attacks on Maritime Routes Reflect Iran’s Global Conflict, Not Gaza Crisis**\nYemeni Minister of Information, Culture, and Tourism, Dr. Muamar Al-Iryani, stated that recent regional developments, including events over the past 48 hours, prove that Houthi militia attacks on commercial ships and oil tankers in international maritime routes since November 2023 were not a response to the situation in Gaza as the militia claims. Instead, he asserted they are a direct reflection of Iran's broader conflict with the international community and a desperate attempt to demonstrate Iranian presence and influence in strategic sea lanes. In a tweet on X, Al-Iryani emphasized that the Houthi attack on a Dutch cargo ship in the Gulf of Aden on September 29—shortly after the activation of the European 'Zand' mechanism and the end of the nuclear deal—clearly indicates direct orders from Tehran, with the militia serving as an instrument of Iran to pressure and threaten the international community. He warned that as the Gaza war nears its end following President Donald Trump’s announced plan and increasing international pressure on Iran and its proxies, the Houthi militia will face unprecedented political exposure, confirming their actions serve only Iran’s 'Guardianship of the Jurist' project and not the interests of Yemenis. Al-Iryani concluded by calling on the international community, especially the European Union and the United Kingdom, to assume a historic responsibility by designating the Houthi militia as a terrorist group threatening regional and international security, and to take firm action to ensure the safety of maritime routes in the Red Sea, Bab al-Mandeb, and the Gulf of Aden, while supporting the legitimate Yemeni government in defending international waterways and Yemen’s sovereignty, security, and stability.\nOriginal language: ar\nPublish date: October 05, 2025 10:09 PM\nSource:[حضرموت نت | اخبار اليمن](https://7adramout.net/%D8%A7%D9%84%D9%88%D8%B2%D9%8A%D8%B1-%D8%A7%D9%84%D8%A5%D8%B1%D9%8A%D8%A7%D9%86%D9%8A-%D8%A7%D9%84%D8%A3%D8%AD%D8%AF%D8%A7%D8%AB-%D8%A7%D9%84%D8%AA%D9%8A-%D8%B4%D9%87%D8%AF%D8%AA%D9%87%D8%A7/)\n\n**Houthi Missile Attack Leaves Merchant Ship Unseaworthy; EU-Led Rescue Operation Successfully Evacuates Crew**\nOn October 5, 2025, the official X account of the EU's 'Aspides Operation' released footage of a rescue mission following a missile attack on the Dutch-flagged merchant vessel 'MV Minerva Grahat' on September 30, 2025. The ship, located 128 nautical miles southeast of Aden Port, Yemen, was struck by a ballistic missile-like object on September 29, 2025, according to the EU. The vessel, which had not requested protection from EU warships, caught fire and became unseaworthy. Upon receiving a distress call from the captain, the EU naval task force dispatched a rescue team and successfully evacuated 19 crew members—comprising Russians, Ukrainians, Filipinos, and Sri Lankans—two of whom were seriously injured. The operation involved naval vessels and aircraft from the Italian and Greek navies. The Houthi rebels claimed responsibility on October 1, stating the ship was targeted because it was classified as a vessel prohibited from entering ports in 'occupied Palestine'—a designation tied to their solidarity with Hamas. The Houthis have been attacking ships they believe are linked to Israel, including those with only tenuous ties, prompting the EU, the United States, the United Kingdom, and India to deploy warships to escort merchant vessels in the Red Sea and the Gulf of Aden.\nOriginal language: ja\nPublish date: October 05, 2025 09:12 PM\nSource:[乗りものニュース](https://trafficnews.jp/post/592178)\n\n**EU-GCC: Opening speech by High Representative Kaja Kallas at the High-Level Forum on Regional Security and Cooperation**\nAt the High-Level Forum on Regional Security and Cooperation, High Representative Kaja Kallas delivered an opening speech emphasizing the need for diplomacy and cooperation between the European Union and the Gulf Cooperation Council (GCC). She highlighted three key regional challenges: Iran’s nuclear program, maritime security in the Red Sea and Gulf of Aden, and the situation in Gaza. Regarding Iran, she noted that despite intensive EU diplomatic efforts during the 30-day snapback window triggered by France, Germany, and the UK, a resolution to extend the UNSC Resolution was not achieved; as a result, the EU will re-impose all previously lifted UN and EU nuclear-related sanctions without delay, while reaffirming that diplomacy must continue. On maritime security, Kallas condemned Houthi attacks on international shipping, including the sinking of two Greek cargo ships, an attack on a tanker, and an explosion on a Dutch-flagged vessel, stressing that such acts violate freedom of navigation—a global public good. She highlighted EU Operation ASPIDES, which has protected over 560 vessels and monitored or supported another 600, with anti-air frigates deploying daily; the operation has been extended to February 2026, with further extension under consideration. She called for a coordinated regional approach, including strengthening the Yemeni Coast Guard. On Gaza, she acknowledged Qatar’s direct experience of conflict spillover, including a strike on its sovereignty, welcomed the Israeli Prime Minister’s apology, and expressed support for President Trump’s Gaza peace plan, noting Hamas’s announced acceptance. She stressed that lasting peace depends on a two-state solution and urged collective action to build on momentum from the UN General Assembly to resume political talks. Kallas concluded by affirming shared interests between the EU and GCC across multiple domains and emphasized that cooperation, not confrontation, should define international relations.\nOriginal language: en\nPublish date: October 05, 2025 07:11 PM\nSource:[Europa](https://www.eeas.europa.eu/eeas/eu-gcc-opening-speech-high-representative-kaja-kallas-high-level-forum-regional-security-and_en)\n\n**Houthi Movement Launches New Missile Strike on Jerusalem, Reaffirms Support for Hamas Amid Escalating Conflict**\nHouthi movement (Ansar Allah) reaffirmed its full support for Hamas and other Palestinian factions in their resistance against the Israeli occupation, particularly in response to the latest Trump peace plan. In a statement, the Houthi government's Ministry of Foreign Affairs declared that Palestinian resilience would force Israel to end its aggression, genocide, and the blockade of Gaza, emphasizing that Israel has failed to eliminate resistance or displace Gaza’s population. The group criticized Israel for violating agreements with Hamas and Lebanon, while praising international support for Palestine. On October 5, 2025, the Houthis announced a successful military operation using a hypersonic, multi-warhead ballistic missile named 'Palestine 2' targeting sensitive sites in occupied Jerusalem, which reportedly caused mass evacuations of Israeli civilians. The Israeli military confirmed intercepting the missile, activating air raid sirens, and closing Ben Gurion Airport. This marks the first such deep Israeli strike by the Houthis since September 29, 2024, when they conducted two prior attacks—one on Tel Aviv and another on Eilat—using hypersonic missiles and drones. Since October 2023, the Houthis have launched repeated missile and drone attacks on Israel and targeted 228 ships linked to or bound for Israel, citing solidarity with Gaza under Israeli military assault backed by the U.S. since October 7, 2023. In retaliation, Israel conducted 2,843 airstrikes and naval attacks on Houthi-controlled areas in Yemen, including a strike on a prison facility in Sana’a on September 26, 2024, killing and wounding many. Houthi officials stated that their military operations, totaling 1,679 attacks (missiles, drones, and naval vessels), serve as leverage in Palestinian negotiations. A senior Houthi political office member, Muhammad al-Bakhti, affirmed that their military actions are a tool of pressure and would be reactivated at Hamas’s request. Another official, Muhammad al-Farh, praised Hamas’s 'flexible, responsible, realistic, and implementable' response to the Trump plan. The Houthi leader, Abdul Malik al-Houthi, reported that their operations have involved 1,679 attacks and targeted 228 ships since the start of their support for Gaza.\nOriginal language: ar\nPublish date: October 05, 2025 06:28 PM\nSource:[القدس العربي](https://www.alquds.co.uk/%D8%A7%D9%84%D8%AD%D9%88%D8%AB%D9%8A%D9%88%D9%86-%D9%8A%D8%B3%D8%AA%D9%87%D8%AF%D9%81-%D9%85%D9%88%D8%A7%D9%82%D8%B9-%D8%A5%D8%B3%D8%B1%D8%A7%D8%A6%D9%8A%D9%84%D9%8A%D8%A9-%D9%88%D9%8A%D8%A4%D9%83/)\n\n**Israel Intercepts Houthi Ballistic Missile Launched from Yemen**\nIsrael's Defense Forces (FDI) reported intercepting a ballistic missile launched from Yemen by Houthi rebels, triggering air raid sirens in Jerusalem and other central regions of Israel. No damage or casualties have been reported to date. The FDI stated they identified the missile launch from Yemen toward Israeli territory and that defense systems were working to intercept the threat, urging the public to follow instructions from the Home Front Command. As a preventive measure, the Israeli military issued an early warning that activated air defense sirens across multiple areas, including Jerusalem and southern Cisjordania. Houthi military spokesperson Yahya Sari confirmed the launch of a hypersonic, multi-warhead ballistic missile named 'Palestina 2' targeting 'sensitive objectives in the occupied Jerusalem area,' claiming the operation succeeded and caused 'millions of Zionist usurpers' to flee to shelters. Sari emphasized that attacks would continue until Israel ends its aggression against Gaza and lifts the blockade. This marks the 91st Houthi ballistic missile attack on Israel since March 18, 2024, when Israel resumed its military offensive in the Gaza Strip. The attacks have intensified since the outbreak of the current war between Israel and Hamas, following a temporary ceasefire agreement reached in January 2025. Prior to the truce, the Houthis had launched over 40 ballistic missiles and more than 100 drones and cruise missiles in support of Hamas. The FDI has maintained active defense responses to these cross-border attacks. This incident underscores the expanding scope and complexity of the conflict, now involving multiple actors and fronts beyond Israel and Palestinian territories. The Yemeni insurgents began launching drones and missiles at Israeli targets and vessels linked to Israel in the Red Sea and Gulf of Aden in response to Israel's military campaign in Gaza, which began after the October 7, 2023, attacks by Hamas and other Palestinian militias.\nOriginal language: es\nPublish date: October 05, 2025 12:58 PM\nSource:[LA TERCERA](https://www.latercera.com/mundo/noticia/israel-intercepta-un-misil-huti-procedente-de-yemen/)\n\n**Houthi Missile Attack on Israel Amid Peace Talks for Gaza**\nOn Saturday morning, the Israel Defense Forces (IDF) intercepted a ballistic missile launched from Yemen by Houthi rebels, backed by Iran's regime, which activated air raid sirens in Jerusalem and central Israel. No casualties or material damage were reported, according to a brief IDF statement on X. The IDF urged the public to follow instructions from the Home Front Command. As a precaution, early warnings were issued across multiple regions, including parts of the West Bank. This attack follows a previous drone launch by the Houthi militia, part of a broader pattern of escalating pressure on Israel. The Houthis have targeted not only Israeli territory but also vessels linked to Israel in the Red Sea and the Gulf of Adén, in response to Israel's military campaign in Gaza following the October 7, 2023, Hamas-led attacks. These actions have forced rerouting of international shipping, increasing logistics costs and worsening the global trade crisis. International naval forces, including the U.S.-led Operation Prosperity Guardian, are actively protecting maritime traffic in the Red Sea, where several commercial ships have been sunk due to the rising hostilities. The attacks come amid ongoing peace negotiations between Israel and Hamas, with U.S. President Donald Trump proposing a peace plan that includes an initial withdrawal line in Gaza. On Saturday, Israel announced the deployment of an official delegation led by Minister Ron Dermer to Cairo for talks starting Monday, focused on Trump’s plan for Gaza’s reconstruction and future. After two years of war in Gaza, the possibility of an immediate ceasefire gained momentum following Trump’s announcement that Israel had accepted the initial withdrawal line, and he urged Hamas to accept the conditions to achieve a ceasefire, release hostages, and free prisoners.\nOriginal language: es\nPublish date: October 05, 2025 09:02 AM\nSource:[infobae](https://www.infobae.com/america/mundo/2025/10/05/mientras-avanzan-las-conversaciones-para-un-acuerdo-de-paz-en-gaza-los-huties-lanzaron-un-ataque-contra-israel/)\n\n**Israel Intercepts Houthi Ballistic Missile from Yemen Amid Escalating Regional Tensions**\nOn October 5, 2025, Israel's Defense Forces (FDI) reported intercepting a ballistic missile launched from Yemen by Houthi rebels, prompting air raid sirens in Jerusalem and other central regions of Israel. No damage or casualties have been reported to date. The FDI confirmed the missile was detected en route to Israeli territory and that defense systems were actively engaged. The Israeli military issued a preemptive alert, activating sirens across multiple regions, including Jerusalem and southern Cisjordania. This incident marks the 91st such missile launch by the Houthis since March 18, 2025, coinciding with the resumption of Israel’s military offensive in the Gaza Strip. The Houthis have previously launched over 40 ballistic missiles and more than 100 drones and cruise missiles in support of Hamas since the outbreak of the war, which began after the October 7, 2023 attacks by Hamas and allied Palestinian militias. The FDI has maintained active defense against these cross-border attacks. The incident underscores the expanding scope of the conflict beyond Israel and Palestine, involving multiple actors and fronts. In parallel, Israel confirmed it will send an official delegation led by Minister Ron Dermer to Cairo for talks on Monday, focused on the U.S. President Donald Trump’s proposed plan for Gaza’s reconstruction and future. The attack follows a prior drone launch by the Yemeni rebels on Wednesday, part of an escalating campaign targeting Israel and vessels in the Red Sea and Gulf of Aden.\nOriginal language: es\nPublish date: October 05, 2025 04:50 AM\nSource:[europa press](https://www.europapress.es/internacional/noticia-israel-intercepta-misil-huti-procedente-yemen-saltar-alarmas-jerusalen-centro-pais-20251005065034.html)\n\n**Houthi attacks and Red Sea shipping crisis**\nThe Red Sea is a 1200‑mile narrow strip that connects the Gulf of Aden to the Arabian Sea via the Bab‑el‑Mandeb Strait. It covers an area of 174,000 square miles, is 190 miles wide and 9,974 feet deep, and is a key maritime trade route carrying 30 % of oil and 40 % of other goods. In 2023, about 22 % of global trade passed through the Suez Canal, which generated $9.4 billion—2.3 % of the country’s GDP in 2022‑23. Houthi attacks have disrupted shipping, with more than 100 drone and missile strikes on merchant vessels from 35 countries, prompting the U.S. to deploy a multinational naval task force. A December 2023 UN‑brokered deal aimed to lift sanctions and reduce attacks, but the Houthis continued to target vessels, especially those linked to Israel, as a protest against the Gaza conflict. The attacks have caused a 9‑10 % global trade disruption, reduced Red Sea traffic to 60 % (from 90 % in 2023 to 36 % in August 2024), and pushed 586 container vessels to reroute in February 2024. Panama Canal transits fell from an average of 36 to 22 per day, with a forecast of 18, and car‑carrying ships dropped by half in 2023 versus 2022. Energy prices rose 5‑10 % during peak attacks, and fuel use increased 30‑40 %, raising carbon emissions and threatening International Maritime Organization environmental regulations. The crisis has intensified geopolitical tensions, with U.S.‑UK naval coalitions, China’s muted response, and Gulf states diverting oil exports, while Russia and Iran reportedly support the Houthis. The article states, 'It is a mark of protest against Israel that is carrying out a genocide in Gaza', highlighting the political framing of the attacks.\nOriginal language: en\nPublish date: September 25, 2025 02:54 PM\nSource:[The Express Tribune](https://tribune.com.pk/story/2568946/houthi-attacks-and-red-sea-shipping-crisis)\n\n**Houthis attack two ships in Red Sea for violating their Israel-related embargo**\nThe article reports that on August 21, 2025, the Houthi movement in Yemen carried out two attacks on vessels in the northern Red Sea that were said to have violated a ban on operations with Israeli ports.  According to a video address by Houthi leader Abdel Malik al‑Houthi, 'This week, we have conducted two operations in the northern Red Sea, attacking two vessels for violating the embargo.'  The ban was imposed by the rebel Ansar Allah movement after the escalation of the Gaza conflict in 2023, when the Houthis warned Israel that they would shell its territory and block ships linked to the Jewish state from passing through the Red Sea and the Bab el‑Mandeb Strait until Israel halted its military operation against Hamas.  The attacks stopped after a ceasefire in the Palestinian enclave in mid‑January, but resumed when the ceasefire was breached in early March, with the Houthis also targeting Israeli facilities such as Ben Gurion Airport.  On July 28, Houthi military spokesman Yahya Saree announced that the movement would intensify operations against Israel, planning strikes on vessels belonging to all companies working with Israeli ports within the range of their weapons.\nOriginal language: en\nPublish date: August 21, 2025 03:52 PM\nSource:[TASS](https://tass.com/world/2005795)\n\n**Houthi Organization Threatens to Attack Israeli-Linked Ships**\nThe Houthi organization, also known as the 'Young Movement', has threatened to attack all ships that have dealings with Israel, in an effort to increase pressure on Israel to lift its restrictions on the Gaza Strip. The Gaza Strip is currently experiencing a severe famine and a humanitarian crisis, causing international concern. Yahya Saree, a spokesperson for the Houthi organization, stated in a televised interview, 'All ships that become targets will be attacked wherever our armed forces can reach them.' He added, 'As long as the invasion of Gaza stops and the blockade is lifted, all our military actions will immediately stop.' The Houthi organization has been attacking Israeli and Red Sea ships since the conflict between Israel and Hamas, which controls Gaza, began in October 2023. Prior to the attacks, over $2 trillion in global maritime trade passed through the Yemeni coast each year, with most ships passing through the Suez Canal and traveling between Europe and Asia. However, since the Houthi attacks began, maritime trade in the area has decreased by approximately 70%. Despite a decrease in attacks in 2025, maritime trade remains low. Israel has been blockading Gaza since March 2, leading to a severe famine in the area. In response to international criticism, Israel has increased its humanitarian aid to Gaza. This Sunday, the Israeli military temporarily suspended some military actions to allow a UN rescue convoy to pass through, and for the first time since March, restored electricity to a Gaza water desalination plant. The Houthi organization has previously attacked ships with ties to Israel, and this month, they sank two cargo ships, killing three crew members and detaining 11 others, the first deadly attack on commercial ships since November last year. Israel has also carried out several airstrikes on Houthi targets in Yemen in retaliation.\nOriginal language: zh\nPublish date: July 27, 2025 11:48 PM\nSource:[UDN](https://udn.com/news/story/6809/8900499)\n\n**The Red Sea: A Strategic Region Open to Further Escalation**\nThe Red Sea has seen a significant escalation in naval attacks by the Houthis since late 2023, using drones, precision missiles, and naval mines. These attacks have resulted in the sinking of commercial ships and the withdrawal of major shipping companies from the Bab-el-Mandeb Strait, posing a real threat to global maritime security. In response, Europe launched 'Operation Aspides' in February 2024, led by France, to protect shipping lines in the Red Sea. However, the operation was characterized by a lack of capabilities and an evident failure to cover the extended route from Aden Gulf to the Suez Canal. As time passed, the mission's failure to deter the Houthis became apparent, particularly after they sank the 'TUTOR' and 'RUBYMAR' ships on June 12, 2024, marking a turning point in the maritime conflict. Meanwhile, the US announced the formation of a new maritime alliance, 'Guardian of Prosperity,' in December 2023, involving over 20 countries, to protect shipping in the Red Sea and Aden Gulf. However, this alliance focused on defensive protection without attacking Houthi sources of threat and did not achieve significant successes, making it more of a monitoring umbrella than an active alliance. In this context, former US President Donald Trump entered the scene, exploiting the escalating maritime threats in the Red Sea as part of his electoral agenda. In a June 2024 speech, Trump stated that if he were in office, he would respond strongly to the Houthis and use the maritime crisis as a bargaining chip against China in the tariff dispute, particularly since the closure of the Red Sea hinders Chinese goods' access to Europe through the Suez Canal (Bloomberg, June 2024). As the major powers continue to assert their presence in the Red Sea, Iran continues to bolster the Houthis with military and technological support. In May 2024, the National Resistance Forces, led by Brigadier General Tareq Mohammed Abdullah Saleh, announced the seizure of a shipment of advanced weapons en route to the Houthis through the Hodeidah coast, including military communication equipment and drone guidance systems. This operation highlights the ongoing Houthi threat, supported by Iran, through active maritime smuggling routes (Military Media, May 2024). Considering past experiences, the comparison between the current situation and the Somali piracy crisis in the Aden Gulf between 2008 and 2013 reveals a painful paradox. Back then, international coordinated operations like 'Operation Atlanta' and NATO operations successfully weakened Somali pirates through direct interventions, aerial surveillance, and rapid response. Today, despite the Houthis having greater capabilities and external support, the international response appears weaker and less effective (UN Security Council, 2013). As a result, companies like Maersk and MSC have announced shifting their routes from the Red Sea to the Cape of Good Hope, a longer and more costly route. This has led to a 30% increase in shipping costs, affecting fuel and commodity prices worldwide (Lloyd's List, June 2024). In this scenario, the Red Sea remains a strategic region open to further escalation unless a strong maritime alliance is reformed, one that goes beyond monitoring and aims to impose clear rules of engagement and dismantle Houthi attack platforms on Yemeni shores. In a short period, the Houthis sank two commercial ships, Magic Size and Internity Sea, and some crew members were killed, despite the US ceasefire on Houthi militias through Oman's mediation. The recent seizure of a shipment of advanced weapons by the National Resistance Forces, led by Brigadier General Tareq Saleh, highlights the presence of promising Yemeni ground capabilities, but they require international political, military, and intelligence support to face a threat that exceeds Yemen and the region, extending to global maritime security and the continued Iranian Revolutionary Guard Corps' policy of sending large quantities of advanced weapons and military equipment to the Houthi group, classified as a foreign terrorist organization by the United States and many other countries.\nOriginal language: ar\nPublish date: July 22, 2025 02:46 PM\nSource:[حضرموت نت | اخبار اليمن](https://7adramout.net/%D8%A7%D8%AE%D8%A8%D8%A7%D8%B1-%D8%A7%D9%84%D9%8A%D9%85%D9%86-%D8%A7%D9%84%D8%A8%D8%AD%D8%B1-%D8%A7%D9%84%D8%A3%D8%AD%D9%85%D8%B1-%D9%81%D9%8A-%D8%AE%D8%B6%D9%85-%D8%A7%D9%84%D8%AA%D8%B9%D8%B1%D9%81/)\n\n**Houthi Insurgents Attack Cargo Ship in Red Sea, Leaving 4 Dead and 11 Missing**\nA cargo ship, the Eternity C, has sunk in the Red Sea after being attacked by Houthi insurgents from Yemen. According to the European Union's Operation Áspides, four people are presumed dead and 11 are still missing. Ten people were rescued, including eight Filipino crew members, one Greek crew member, and one member of the ship's security team. The Houthi rebels have claimed to have taken some of the crew members, with the US Embassy in Yemen stating that they have been 'kidnapped'. This is the deadliest attack on a ship by the Houthi rebels, who have been targeting vessels in the critical maritime trade route, where over $1 billion in cargo passes through each year. The rebels claim to be attacking ships to support the Palestinians in the Gaza Strip during the war between Israel and Hamas. 'It is recommended that all nearby ships remain vigilant', said the EU mission. The Houthi rebels have previously held crew members hostage, including those from the Galaxy Leader, which was seized in November 2023 and released in January 2024. Since November 2023, the Houthi rebels have attacked over 100 ships with missiles and drones, before halting their attacks during a brief ceasefire in the Gaza war. They have since become the target of a US-led bombing campaign, before a reported ceasefire was declared by US President Donald Trump.\nOriginal language: es\nPublish date: July 11, 2025 03:54 PM\nSource:[Chicago Tribune](https://www.chicagotribune.com/2025/07/11/habra-4-muertos-y-11-desaparecidos-tras-hundimiento-de-2do-barco-en-el-mar-rojo-por-parte-de-hutes/)\n\n**Houthis Resume Attacks on Commercial Ships in Red Sea**\nThe Houthi rebels in Yemen have resumed their attacks on commercial ships in the Red Sea, targeting two vessels in the past few days. This marks the first attacks on merchant ships in 2025, after a six-month hiatus. The Houthis, who are close to Iran, have targeted over 100 cargo ships off the coast of Yemen since the start of the war between Israel and Hamas in Gaza 21 months ago. They claim to be acting in solidarity with the Palestinians. Houthi leader Abdel Malek al-Houthi said that the new attacks were a 'confirmation' of their decision to target Israeli-linked ships 'as long as the aggression and siege of Gaza continue'. However, the resumption of these attacks sends several messages in the current context, according to analysts. 'Why now?' they ask. The Houthis say they want to maintain pressure on Israel, at a time when indirect negotiations are underway between Israel and Hamas. 'Negotiate with your heads held high, we are with you (...) until the siege is lifted and the aggression stops', said Houthi political leader Mahdi al-Mashat to the Palestinians. This escalation comes two weeks after the 12-day war between Israel and Iran, in which the US also participated. The Houthis, who are part of the 'axis of resistance' against Israel led by Tehran, did not intervene in this conflict. However, the recent attacks are 'a reminder from the Guardians of the Revolution (Iran's ideological army) via their most important ally, that what has not been done (during the war with Israel) can, in case of repetition, be activated, at Bab al-Mandeb, Ormuz and Suez', three vital navigation routes for global trade, says Maged al-Madhaji, president of the Strategic Studies Center in Sanaa. 'What are the Houthis trying to prove?' they ask. The latest attacks were particularly violent, carried out using several boats equipped with rockets, as well as naval drones and missiles, according to maritime security agencies. Videos published by the Houthis showed their naval forces exploding and sinking the ships. With the weakening of other allies of Tehran within its 'axis of resistance' - the Hezbollah in Lebanon and the Hamas in Gaza - the Houthis want to show their 'regional and international strength', says Farea al-Muslimi, researcher at Chatham House. While the missiles fired regularly by the group on Israel have a limited impact, the disruption of traffic in the Red Sea, through which 12% of global trade passes, is 'a very effective way of bleeding the West', adds he. The Houthis are also trying to show that they have not been affected by the US bombings, which ended in May. These bombings have severely affected some of their military capabilities, but 'they still have a large stock and have quickly rebuilt their communication network', estimates M. Muslimi. According to Noam Raydan, of the Washington Institute for Near East Policy, the Houthis have also taken advantage of the significant decrease in international military presence in the area. 'They now seem to have more room to harm navigation freedom', she says. 'What are the consequences?' they ask. The Houthis' attacks have already forced many shipowners to avoid the Red Sea, taking a longer and more expensive route. According to Noam Raydan, the transit through the Bab al-Mandeb strait has decreased by over 50% compared to 2023. 'After the recent attacks, ships belonging to companies whose other vessels dock in Israeli ports will have to either reconsider their route or seek military escort, especially from the European mission Aspides deployed in the area', but that 'mission has very few naval units in the region', warns the researcher. By threatening navigation freedom, the Houthis risk facing a resumption of US bombings, as well as new attacks from Israel. On Thursday, Israeli Foreign Minister Gideon Saar called the Houthis a 'threat to international peace, security, and economy'. 'Not confronting them will only worsen the problem', he said.\nOriginal language: fr\nPublish date: July 11, 2025 12:42 PM\nSource:[AFP](https://afp.com/)\n\n**Houthi Militants Attack Commercial Ship in Red Sea, Leaving Crew Missing**\nHouthi militants in Yemen continued to attack a commercial ship in the Red Sea, hours after launching an assault on the vessel that left the crew missing, the latest sign that the group is increasing its threat to merchant shipping. 'The ship has suffered significant damage and has lost all propulsion,' said the UK Maritime Trade Operations (UKMTO) on Tuesday. 'The ship is surrounded by small boats and is under continuous attack.' The UKMTO warned ships to avoid the area after the incident, which occurred just weeks after the Israeli military conflict with Iran and the ongoing Israeli invasion of Gaza. The Red Sea is a crucial route for ships traveling between Asia and Europe via the Suez Canal in Egypt. According to the UKMTO, the attacks continued around 8:00 a.m. GMT, about 14 hours after the first incident was reported, which involved rocket-propelled grenades and the approach of several boats. Two people on board the Eternity C were injured and two others were missing, according to the ship's owner, Cosmoship. Jakob Larsen, director of security at BIMCO, the world's largest direct membership commercial shipping organization, said, 'These incidents highlight the Houthi's disregard for human life, as they continue to exploit sailors as pawns in their strategic conflicts.' The Eternity C was transporting cereals to Somalia for the World Food Programme and was attacked after completing its journey. The incident occurred about 51 nautical miles west of Hodeida, Yemen, and came after the Houthi militants claimed responsibility for a previous attack on a ship in the same area. The Houthi militants began attacking commercial ships in late 2023, claiming it was their response to the Israeli war in Gaza. Their actions led to the merchant fleet largely avoiding the area - and, by extension, the Suez Canal - and Stem Shipping suspended navigation through the route after the Houthi militants attacked the Sounion, a Greek oil tanker, in August last year, said Michael Bodouroglou, the company's CEO. The return of the attacks, especially given their severity, could once again deter more owners and crews from crossing the region and increase freight rates and insurance costs for transporters. 'I've personally heard of cases of ships being denied coverage,' said Corey Ranslem, CEO of Dryad Global, a maritime intelligence company. The United Arab Emirates said the Safeen Prism, operated by AD Ports Group, responded to a distress call from Magic Seas and rescued the 22 people on board.\nOriginal language: es\nPublish date: July 08, 2025 04:24 PM\nSource:[El Financiero](https://www.elfinanciero.com.mx/mundo/2025/07/08/huties-de-yemen-atacan-barco-comercial-en-el-mar-rojo-buque-sufrio-danos-importantes-dice-reino-unido/)\n\n**Houthi Rebels Attack Greek-Managed Cargo Ship in Red Sea**\nA Greek-managed cargo ship, the Eternity C, was attacked by Houthi rebels in the Red Sea, leaving two crew members injured and two missing. The incident occurred 50 nautical miles southwest of the port of Hodeida, Yemen, and is the second attack on merchant vessels in the Red Sea since November 2024, according to the EU's Operation Aspides. The ship, which was carrying a 21-person Filipino and Russian crew, as well as armed guards, was hit by drones and rocket-propelled grenades fired from fast boats. The bridge was damaged, communication systems were disrupted, and the crew was ordered to abandon ship, although the lifeboats had been destroyed during the attack. The ship, which was carrying no cargo and suffered significant structural damage, was left listing and adrift. Yahya Sarea, the Houthi military spokesperson, confirmed that the attack was a response to alleged violations of the blockade of 'occupied Palestinian ports,' referring to Israel. He stated that Houthi forces will continue to attack vessels associated with Israeli interests navigating the region, as long as the war in the Gaza Strip continues. Since the start of the conflict in Gaza in October 2023, the Houthis, backed by Iran, have intensified their attacks in the Red Sea against ships associated with Israel and have also attacked US and UK targets in retaliation for the bombings carried out by these countries in Yemen. The violence in one of the main international maritime routes is a concern for the impact on navigation and global trade security in the region. Since November 2024, the Red Sea maritime corridor has seen a growing number of attacks directed against merchant vessels, especially those linked to Greek, Israeli, and Western companies, according to UKMTO and the EU's Operation Aspides. The Houthi rebels have employed a wide range of tactics and armament, including explosive drones, ballistic and cruise missiles, as well as unmanned and fast boats, which has raised the risk for navigation and made it difficult to protect commercial ships in the area. Only in the first months of 2025, European and maritime authorities have counted more than 20 similar armed incidents, resulting in severe damage or sinkings of several grain and oil tankers.\nOriginal language: es\nPublish date: July 08, 2025 03:43 PM\nSource:[infobae](https://www.infobae.com/america/mundo/2025/07/08/un-barco-quedo-a-la-deriva-en-el-mar-rojo-tras-un-ataque-de-rebeldes-huties-hay-dos-marineros-heridos-y-dos-desaparecidos/)\n\n**Houthi Group Claims Responsibility for Sinking of Cargo Ship 'Magic Size' in Red Sea**\nThe Houthi group, backed by Iran, announced on Monday that a cargo ship, 'Magic Size', which they attacked with rockets and speedboats on Sunday, has sunk in the Red Sea. This is the first attack by the group on maritime shipping routes since the start of the current year. The Greek shipping company, Steam Shipping, which operates the ship, told Reuters that it has not been able to confirm the sinking of the ship from independent sources. The Houthis claimed responsibility for the attack and said they allowed the 19-member crew to leave the ship. Steam Shipping said that a commercial ship rescued all crew members and they are expected to arrive in Djibouti later on Monday. The ship was carrying iron and fertilizer from China to Turkey. The attack ended six months of calm in the Red Sea, one of the world's most used shipping routes, where Houthi attacks from late 2023 to late 2024 disrupted shipping between Europe and Asia through the Suez Canal. The Houthis have launched over 100 attacks on ships in the Red Sea, Gulf of Aden, and Bab-el-Mandeb Strait, which connects them, saying they were in solidarity with Palestinians after the war in Gaza in 2023. However, these attacks stopped this year, with the last ones recorded in December. Israeli attacks The Houthi military spokesperson, Yahya Saree, said in a statement broadcast on television that the ship was targeted on Sunday after naval forces issued warnings that were ignored by the ship's crew. He added that the ship was targeted using two speedboats, five rockets, and three drones. The British Maritime Trade Operations and the security firm 'Amber' said in two reports that eight small boats attacked the ship initially with gunfire and rocket fire, before a security team on board the ship returned fire. 'Amber' said in a separate warning that the ship was later attacked by four speedboats and rockets, and added: 'Two of the naval units collided with the ship, causing damage to its cargo.' The British Maritime Trade Operations said the attack led to a fire on the ship. Meanwhile, the Israeli army announced on Monday that it had bombed three Houthi-controlled ports. There was no indication that the Israeli attacks were related to the maritime attack. During their attacks, the group sank two ships, seized another, and killed at least four sailors, disrupting global shipping and forcing companies to change their routes, which prompted the United States to intensify its attacks on the group last year. In June, tensions escalated in the region following a 12-day war between Israel and Iran, which was joined by Washington with airstrikes on Iranian nuclear sites. President Donald Trump had announced a halt to US attacks on the Houthis, saying the group had agreed to stop disrupting critical shipping routes in the Middle East.\nOriginal language: ar\nPublish date: July 07, 2025 01:15 PM\nSource:[قناة العربية](https://www.alarabiya.net/aswaq/economy/2025/07/07/%D8%AC%D9%85%D8%A7%D8%B9%D8%A9-%D8%A7%D9%84%D8%AD%D9%88%D8%AB%D9%8A-%D8%AA%D8%A4%D9%83%D8%AF-%D8%A7%D8%B3%D8%AA%D9%87%D8%AF%D8%A7%D9%81-%D8%B3%D9%81%D9%8A%D9%86%D8%A9-%D8%A7%D9%84%D8%A8%D8%B6%D8%A7%D8%A6%D8%B9-%D9%85%D8%A7%D8%AC%D9%8A%D9%83-%D8%B3%D9%8A%D8%B2-%D9%81%D9%8A-%D8%A7%D9%84%D8%A8%D8%AD%D8%B1-%D8%A7%D9%84%D8%A7%D8%AD%D9%85%D8%B1)\n\n**Shipping in the Red Sea Increases by 60% Since August 2024**\nThe number of commercial ships passing through the Bab-el-Mandeb Strait has increased by 60% since August 2024, according to Admiral Vasilios Gribaris, citing the decrease in missile and drone attacks by the Houthis and the signing of a ceasefire agreement between the US and the armed group. However, Gribaris noted that shipping activity, which had dropped to 20-23 ships per day in August last year, is still below the previous average of 72-75 ships per day before the Houthis launched their attacks in the Red Sea in November 2023 in support of Palestinians during the Israeli war in Gaza. The mission to protect shipping in this strategic waterway, which connects the Mediterranean Sea to the Asian Gulf through the Suez Canal, was established and extended in February to include tracking illegal arms shipments and monitoring ships carrying Russian oil subject to sanctions. Gribaris explained that the last attack on a commercial ship occurred in November 2024, and that the Houthis have narrowed their targets, confirming that their attacks are limited to Israeli ships or those related to Israel or docked in Israeli ports. He added, 'If the ship does not meet these criteria... there is a high probability – exceeding 99% – that it will not be a target for the Houthis.' However, Gribaris emphasized that he cannot provide a guarantee against commercial ships being attacked. He pointed out that some companies have hesitated to use this route due to the shortage of ships assigned to the mission, which may lead to delays of up to a week for ships that require escort. He explained that the mission operates with two to three ships at the same time and has requested that the EU provide it with ten ships to enhance its ability to provide protection. The mission has provided direct protection to 476 ships, shot down 18 drones, destroyed two remotely controlled boats used in attacks, and intercepted four ballistic missiles.\nOriginal language: ar\nPublish date: June 05, 2025 08:44 PM\nSource:[hapijournal.com](https://hapijournal.com/2025/06/05/%d8%a3%d8%b3%d8%a8%d9%8a%d8%af%d8%b3-%d8%a7%d9%84%d9%85%d9%84%d8%a7%d8%ad%d8%a9-%d9%81%d9%8a-%d8%a7%d9%84%d8%a8%d8%ad%d8%b1-%d8%a7%d9%84%d8%a3%d8%ad%d9%85%d8%b1-%d8%aa%d8%b1%d8%aa%d9%81%d8%b9-60/)\n\n",
    "date": "2025-10-07T01:07:57.765382",
    "summary": "Across all expert perspectives—spanning maritime operations, international relations, security risk assessment, and regional studies—the consensus is that the probability of Maersk resuming shipping in the Red Sea in 2025 is low, with final probability estimates clustering in the 3% to 22% range. All experts identified the persistent, escalating, and lethal threat from Houthi attacks as the dominant decreasing factor. This continued violence, targeting even non-Israeli-linked ships, has kept insurance rates high and made corporate risk tolerance for Maersk extremely conservative. International naval operations (U.S., EU) provide some marginally positive pressure, but coverage is limited and insufficient to guarantee safety or satisfy insurance and corporate risk standards. Efforts at conflict resolution, including ongoing Gaza ceasefire talks, are cited as a slight positive, but experts note that even historic base rates show that major shipping lines only resume in high-threat zones after months of clear, durable security improvements—currently absent in the Red Sea. While all experts acknowledge that the resolution criteria allow for a partial resumption (even a single escorted voyage or a limited policy change could count as Yes), they find no present evidence of Maersk planning such a move, and recent deadly attacks have reinforced the status quo. Unless an unlikely, durable diplomatic breakthrough occurs before year-end, the group consensus is that Maersk will almost certainly not resume (even in part) Red Sea shipping in 2025.",
    "forecasters": [
        "Shipping and Maritime Operations (Risk Management ISO31000)",
        "Shipping and Maritime Operations (International Maritime Law UNCLOS)",
        "Shipping and Maritime Operations (ISPS Code Compliance)",
        "Security Risk Assessment (Maritime Threat Assessment)",
        "Security Risk Assessment (Critical Infrastructure Protection Standards)",
        "International Relations (Security Dilemma Theory)",
        "International Relations (Maritime Security Studies)",
        "Political Science (Conflict Resolution Theory)",
        "Political Science (Regime Stability Analysis)",
        "Regional Studies Middle East (Gulf Security Complex)"
    ]
}