{
    "deliberation_results": {
        "Diplomacy (ConsularPractice)": {
            "time_to_resolution": "Approximately 3 months until January 1, 2026",
            "perspective_relevance": "As an expert in Diplomacy (Consular Practice), I bring direct experience with the policies and operational constraints of consular services, passport issuance, and the interface between state mobilization law and the rights/protections of citizens abroad. I can assess both the practical feasibility and diplomatic ramifications of large-scale revocation of passports, especially under martial law and ongoing conflict.",
            "status_quo": "Ukraine has suspended consular services (including passport issuance/renewal) for military-age men abroad unless they update their military registration, but has not implemented mass passport revocation for men already holding valid passports. There is no credible report of passports being revoked en masse for men abroad.",
            "perspective_derived_factors": [
                {
                    "factor": "Legal and Logistical Constraints",
                    "effect": "Decreases probability. Revoking passports en masse requires clear legal authority, robust operational mechanisms, and coordination with foreign governments. The technical and legal hurdles are significant."
                },
                {
                    "factor": "Diplomatic Considerations and International Image",
                    "effect": "Decreases probability. Revoking passports for thousands abroad risks diplomatic friction with host countries (especially EU states), potential violation of international norms, and reputational damage, especially as Ukraine relies on Western support."
                },
                {
                    "factor": "Current Policy Trends",
                    "effect": "Decreases probability. Ukraine has focused on restricting consular services and requiring military registration, not on retroactive revocation. The most recent changes streamline registration and restrict future consular access but do not revoke existing passports."
                },
                {
                    "factor": "Domestic Political Pressures",
                    "effect": "Increases probability slightly. There is political pressure to increase mobilization and prevent draft evasion. This could incentivize harsh measures if the manpower crisis worsens."
                },
                {
                    "factor": "Operational Feasibility and Precedent",
                    "effect": "Decreases probability. There is no precedent for a democratic state at war to mass-revoke passports of its citizens abroad at this scale; operationally, it is easier to deny new documents than to invalidate existing ones."
                },
                {
                    "factor": "Information Environment and Propaganda",
                    "effect": "Decreases probability. Some rumors of mass revocations have been amplified by Russian propaganda, but these have not been substantiated by credible sources or official statements."
                }
            ],
            "no_scenario": "Ukraine continues to restrict consular services and enforces military registration requirements for men abroad, but does not implement a policy to revoke already-issued passports. Some individuals are unable to renew documents or access services, but existing valid passports are not cancelled en masse. Ukrainian authorities focus on other mobilization measures and digital registration systems.",
            "yes_scenario": "Facing acute mobilization shortfalls and public pressure, the Ukrainian government announces a policy that revokes the passports of at least 1,000 military-age men abroad who fail to comply with military registration, with the aim of compelling their return. This is reported by credible outlets as a deliberate, announced government initiative, not isolated or technical cancellations.",
            "final_reasoning": "The base rate for democratic states revoking passports of military-age men abroad for draft evasion is extremely low—there are no clear precedents, and the operational and diplomatic costs are high. The status quo is that Ukraine restricts access to new documents and consular services, but has not crossed the threshold into revocation of existing passports. The latest news and legal changes reinforce this trend: the focus is on registration, not retroactive punishment. While mobilization challenges may remain acute, the government appears to be relying on administrative barriers to services, not passport cancellation. Propaganda and rumors about revocation have not materialized into policy or credible reporting. Given these factors, and with only three months until resolution, the probability of a mass passport revocation policy being credibly reported is quite low, though not impossible if the war situation sharply worsens.",
            "final_probability": 7
        },
        "ImmigrationLaw (CitizenshipRevocationStandards)": {
            "time_to_resolution": "Approximately 3 months until January 1, 2026",
            "perspective_relevance": "As an expert in Immigration Law with a focus on citizenship revocation standards, I bring a detailed understanding of the technical, legal, and international-human-rights constraints surrounding passport revocation and citizenship policies. My perspective allows for evaluation of not only Ukraine’s statutory powers and recent legislative changes but also the practical, legal, and reputational risks of such a move, especially under ongoing international scrutiny and EU cooperation.",
            "status_quo": "Ukraine has suspended consular services for draft-age men abroad but has not revoked already-issued passports. Men abroad face barriers to renewing passports or accessing consular assistance unless registered for military service, but there is no evidence of mass passport revocation of draft-age men by the Ukrainian government as of now.",
            "perspective_derived_factors": [
                {
                    "factor": "Legal and International Precedent",
                    "effect": "Decreases probability. Revoking passports for the purpose of forced repatriation or punishment is rare and controversial internationally, especially for citizens abroad. International covenants and Ukraine’s obligations under European and international law (even outside the EU, as Ukraine is seeking closer ties) constrain such measures."
                },
                {
                    "factor": "Recent Policy Trends",
                    "effect": "Slightly increases probability. Ukraine has suspended consular services and restricted the ability of men abroad to renew or obtain passports, and now requires military registration for such services. However, this is a form of administrative leverage rather than outright revocation."
                },
                {
                    "factor": "Domestic Political and Military Pressure",
                    "effect": "Slightly increases probability. Ukraine faces acute manpower shortages and persistent calls for stricter mobilization enforcement. There are public and political calls to be harsher on draft evaders, and some politicians may support revocation as a deterrent."
                },
                {
                    "factor": "Administrative Feasibility and Technical Barriers",
                    "effect": "Decreases probability. Implementing mass revocation is logistically complex, especially for those already abroad. It risks stranding men in limbo, damaging relations with host countries, and creating diplomatic incidents."
                },
                {
                    "factor": "International Reputation and Diplomatic Consequences",
                    "effect": "Decreases probability. Mass revocation would provoke strong criticism from the EU, UN, and human rights organizations, potentially undermining Ukraine’s support among allies at a critical time."
                },
                {
                    "factor": "Public Communication and Russian Disinformation",
                    "effect": "Decreases probability. Ukrainian officials have publicly denied plans for mass revocation, characterizing such rumors as Russian disinformation, which signals reluctance to cross this line."
                },
                {
                    "factor": "Recent Developments and New Information",
                    "effect": "Neutral. The main new developments relate to Russia's own conscription and Ukraine's policies for men 18-22, but there is no credible reporting or evidence of a shift toward passport revocation for draft-age men abroad."
                }
            ],
            "no_scenario": "Ukraine continues to restrict consular services for draft-age men abroad and maintains strict requirements for military registration, but does not announce or implement a policy to revoke previously valid passports of at least 1,000 men. Instead, bureaucratic hurdles, legal obstacles, and international backlash dissuade policymakers from taking this step before 2026.",
            "yes_scenario": "Under acute military pressure, and possibly following a high-profile incident or political crisis, Ukraine’s government officially announces that men of draft age abroad who fail to comply with military registration requirements will have their passports revoked. This move is described as nationwide or affecting at least 1,000 individuals and is reported by credible international sources before January 1, 2026.",
            "final_reasoning": "The base rate for mass passport revocation by democratic or semi-democratic states for military evasion is extremely low, especially outside of autocratic contexts. Ukraine has taken escalating administrative steps to compel draft-age men to return or register, including suspending consular services and requiring military registration for document renewal. However, these measures stop short of outright revocation, reflecting both practical and reputational barriers. The news articles do not indicate any new movement toward revocation since the initial consular suspension in 2024. Instead, Ukraine is adjusting border policies for young men and integrating military registration databases, but not taking the step of nullifying passports already held by men abroad. Legal, technical, and international obstacles to such a policy remain formidable. The government’s public denials of such intent, and the characterization of the idea as Russian disinformation, further reduce the likelihood. Therefore, while pressure exists and cannot be discounted entirely, the probability that Ukraine will announce and credibly implement a nationwide or large-scale passport revocation for draft-age men abroad before 2026 is low.",
            "final_probability": 10
        },
        "Political Science (CivilMilitaryRelations)": {
            "time_to_resolution": "Approximately 3 months until January 1, 2026",
            "perspective_relevance": "As an expert in Political Science with a focus on Civil-Military Relations, I am attuned to the tensions between state security imperatives and the societal/political costs of coercive mobilization. Ukraine is in a situation where it must balance the need to replenish its military ranks against domestic and international legitimacy, diaspora relations, and the risk of political backlash. I bring contextual knowledge of how states under existential threat have historically treated expatriate citizens, especially men of military age, and how the social contract can fray under the pressures of total war.",
            "status_quo": "To date, Ukraine has suspended consular services (including passport renewal/issuance) for draft-age men abroad who are not properly registered for military service, but has not implemented a policy of revoking already-issued passports en masse. Men abroad face bureaucratic obstacles, but their passports have not been revoked retroactively.",
            "perspective_derived_factors": [
                {
                    "factor": "Operational and Political Cost of Passport Revocation",
                    "effect": "Decreases probability. Revoking passports en masse would risk severe backlash from the diaspora, negative international coverage (especially in the EU), and legal challenges. It could also create diplomatic friction with host countries and undermine remittance flows, which are valuable to Ukraine."
                },
                {
                    "factor": "Escalating Manpower Needs and Domestic Mobilization Pressure",
                    "effect": "Increases probability. With high battlefield losses and persistent manpower shortages, the Ukrainian government faces strong incentives to close loopholes and pressure men abroad to return and serve."
                },
                {
                    "factor": "Recent Policy Trajectory—Incremental Escalation",
                    "effect": "Decreases probability, but only moderately. Ukrainian authorities have adopted progressively stricter measures (requiring registration for consular services, data sharing between registries), but have stopped short of passport revocation. The trend is toward administrative escalation, but revocation is a qualitatively more extreme step."
                },
                {
                    "factor": "International Norms and Image Management",
                    "effect": "Decreases probability. Ukraine is reliant on Western support, and mass passport revocation would be seen as draconian and could undermine international sympathy, especially if it creates stateless persons or violates EU/host-country residency norms."
                },
                {
                    "factor": "Precedent and Base Rate",
                    "effect": "Decreases probability. Historically, even states at war rarely revoke passports en masse for draft evasion; they typically use administrative hurdles or criminal prosecution for evasion rather than ex-post document invalidation."
                },
                {
                    "factor": "Potential for Escalation in Case of Crisis",
                    "effect": "Increases probability, but only if the war situation deteriorates dramatically (e.g., major collapse at the front, existential threat, or loss of Western military aid). This could prompt a shift toward emergency/total-war measures previously considered unthinkable."
                }
            ],
            "no_scenario": "The Ukrainian government continues to block access to new consular services and passport renewals for men abroad unless they are properly registered for military service, but does not revoke existing passports. Administrative pressure increases, but mass revocation does not occur. Some men abroad remain in legal limbo, but are able to retain their identity documents and legal residency elsewhere.",
            "yes_scenario": "Facing acute military collapse, a severe manpower crisis, or a dramatic shift in the political/military situation (e.g., loss of key territory or sharp drop in Western aid), the government announces that men of draft age abroad who do not comply with mobilization requirements will have their passports revoked. This is implemented nationwide and affects at least 1,000 men, as announced by credible sources.",
            "final_reasoning": "The most compelling factors are: 1) the high operational and political cost of passport revocation (domestically and with the diaspora/international partners), and 2) the historical baseline—states almost never revoke passports en masse for draft evasion even in extreme circumstances. While Ukraine's manpower situation is dire and the trajectory has been toward tightening administrative measures, the government has consistently chosen to block new services rather than retroactively invalidate existing documents. Furthermore, international image management and legal/diplomatic risks provide strong negative incentives. However, if the war were to reach a true existential crisis point before 2026, all bets could be off and radical measures might be taken. Given the trend so far, and with only three months to go, the probability of such a dramatic escalation remains distinctly sub-50%, though not negligible. I assess the probability at 18%.",
            "final_probability": 18
        },
        "Political Science (StateCapacityTheory)": {
            "time_to_resolution": "Approximately 3 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in State Capacity Theory, I focus on how states utilize administrative tools, legal frameworks, and coercive/enabling mechanisms to further their interests, especially under conditions of existential threat. Ukraine's wartime policies on conscription and passport control reflect its capacity and willingness to mobilize both domestic and diaspora populations, and to balance sovereignty, legitimacy, and international relationships.",
            "status_quo": "Ukraine has suspended consular services (including passport renewal/issuance) for draft-age men abroad, but it has not formally revoked already-issued passports. Men abroad cannot renew passports unless they return to Ukraine and update military registration, but their existing passports have not been proactively cancelled or revoked en masse.",
            "perspective_derived_factors": [
                {
                    "factor": "State Administrative Capacity",
                    "effect": "Limited ability to identify, process, and enforce revocation on a large scale for men abroad. Ukraine's state capacity is strained by war, and passport revocation abroad is logistically challenging and risks unintended consequences for international travel and relations. This decreases the likelihood."
                },
                {
                    "factor": "International Legitimacy and Diplomatic Risks",
                    "effect": "Revoking passports for men abroad would damage Ukraine's standing with EU states and international organizations, potentially jeopardizing support for refugees and military aid. Western partners value due process and human rights, and mass revocation would trigger diplomatic backlash. This decreases the likelihood."
                },
                {
                    "factor": "Deterrence and Mobilization Needs",
                    "effect": "Ukraine faces severe manpower shortages and needs to maximize mobilization. Revoking passports could be seen as a threat or deterrent to avoid draft-dodging, but it could also drive more men to seek foreign citizenship or go underground. It increases the incentive, but not necessarily the probability, as less drastic tools are available."
                },
                {
                    "factor": "Public Backlash and Political Costs",
                    "effect": "A policy to revoke passports would provoke outrage among the Ukrainian diaspora, their families, and potentially the domestic population, undermining national unity at a sensitive time. The government is likely to avoid this unless absolutely necessary. This decreases the likelihood."
                },
                {
                    "factor": "Legal and Technical Feasibility",
                    "effect": "Ukraine can legally restrict consular services, but revoking valid passports en masse is technically and legally complex, especially for those already residing abroad. Most European countries do not facilitate such actions for their own citizens. This decreases the likelihood."
                },
                {
                    "factor": "Recent Policy Trends",
                    "effect": "Recent policies have tightened requirements for passport renewal and consular services (requiring military registration), but have stopped short of revocation. There is no evidence of imminent escalation to revocation. This keeps the probability low."
                }
            ],
            "no_scenario": "Ukraine continues to deny consular services (including passport renewals) to draft-eligible men abroad unless they update military data, but does not announce a policy to revoke passports already issued. Men can remain abroad on expired passports (or with unrevoked ones), even if unable to renew or obtain new documents. No credible announcement of mass revocation affecting at least 1,000 men abroad is made before Jan 1, 2026.",
            "yes_scenario": "Facing acute manpower shortages and growing public outrage over draft evasion by men abroad, the Ukrainian government announces (and credible media reports) a nationwide policy to revoke the passports of draft-age men residing abroad who have not updated military registration, affecting at least 1,000 individuals. This is officially characterized as revocation (not mere suspension of services), and credible reporting confirms implementation.",
            "final_reasoning": "The base rate for states revoking passports of citizens abroad for draft evasion is very low, especially in countries seeking Western integration and support. Ukraine has already taken the less extreme (but still significant) step of suspending consular services for draft-age men abroad. Implementing mass passport revocation would be logistically difficult, diplomatically damaging, and potentially counterproductive, especially in the context of reliance on Western support and the need to maintain goodwill with the Ukrainian diaspora. The Ukrainian state has shown willingness to tighten enforcement but has avoided the most extreme measures, and there is no credible reporting or strong signals of imminent escalation to revocation. The status quo is likely to persist, with tough but not maximal measures. Therefore, the probability of a 'Yes' outcome is low, but not zero, as catastrophic battlefield developments or political crises could shift the calculus. Given the time left (3 months), the recent status quo, and absence of strong indicators of imminent change, I estimate the probability at 8%.",
            "final_probability": 8
        },
        "International Law (CitizenshipLaw)": {
            "time_to_resolution": "3 months (until January 1, 2026)",
            "perspective_relevance": "As an International Law (CitizenshipLaw) expert, my perspective is relevant because passport revocation is fundamentally a matter of state sovereignty, citizenship rights, and compliance with international legal standards, including treaties on human rights, statelessness, and consular relations. Understanding the legal, political, and practical constraints on Ukraine’s ability to revoke passports for large groups abroad is crucial to evaluating the likelihood of such a drastic policy step.",
            "status_quo": "Ukraine has suspended consular services (including passport renewals) for military-age men abroad, but has not revoked previously issued passports. Instead, Ukraine has tightened military registration requirements and made it more difficult for men abroad to access services without registering for the draft, but has not announced or implemented mass passport revocations.",
            "perspective_derived_factors": [
                {
                    "factor": "International Law Constraints",
                    "effect": "Decreases probability. Revoking passports from citizens abroad risks violating international treaties (on statelessness, right to return, human rights, consular protection), potentially creating diplomatic incidents with host countries and international organizations."
                },
                {
                    "factor": "Domestic Political Pressure & Military Need",
                    "effect": "Increases probability. Ukraine faces severe manpower shortages and strong domestic calls for greater mobilization, creating incentives to pressure men abroad to return or serve."
                },
                {
                    "factor": "Administrative & Logistical Feasibility",
                    "effect": "Decreases probability. Implementing a mass revocation affecting at least 1,000 men abroad would require identifying, notifying, and technically invalidating passports through global consular networks, which is complex and unprecedented."
                },
                {
                    "factor": "Precedent and Escalation Patterns",
                    "effect": "Decreases probability. No major European or democratic state has ever enacted such a mass passport revocation policy for draft evasion in the past several decades, even under severe mobilization pressure."
                },
                {
                    "factor": "Recent Policy Trends",
                    "effect": "Slightly increases probability. Ukraine has escalated pressure on draft-age men abroad: suspending consular services, requiring in-person registration for military service, and denying passport renewals. Some politicians have openly discussed further steps to compel return, but stopped short of outright revocation."
                },
                {
                    "factor": "International & Diaspora Backlash",
                    "effect": "Decreases probability. Such a move would likely provoke strong negative reactions from the Ukrainian diaspora, Western governments, and human rights organizations, potentially undermining international support."
                }
            ],
            "no_scenario": "Ukraine continues or even tightens current measures—denying consular services, refusing passport renewals, and requiring in-person draft registration—but does not announce or implement a blanket or large-scale revocation of previously valid passports for men abroad. Instead, the government uses indirect pressure to encourage returns, but stops short of formal revocation.",
            "yes_scenario": "Ukraine’s military situation further deteriorates, and the government, under intense pressure to fill draft quotas, announces a policy targeting at least 1,000 draft-age men abroad, declaring their previously valid passports revoked due to failure to comply with draft registration requirements. This is formally reported by credible sources as a nationwide or large-scale revocation policy.",
            "final_reasoning": "While Ukraine has taken increasingly aggressive administrative measures to pressure draft-age men abroad, the leap from denying new documents to revoking existing passports is legally, diplomatically, and logistically much more serious. International law strongly disfavors actions that risk statelessness or restrict the right of return, and Western partners would likely push back hard. Historically, even under immense pressure, no European country has taken such a step in modern times. The most likely scenario is a continuation of the current approach: no access to consular services for men abroad, but no formal mass revocation. While continued battlefield losses and political pressure raise the risk, there is no credible reporting or legal infrastructure in place for such a policy as of October 2025. The time remaining is short, and such a policy would be highly visible and controversial.",
            "final_probability": 10
        },
        "International Law (ExtraterritorialJurisdiction)": {
            "time_to_resolution": "3 months until January 1, 2026",
            "perspective_relevance": "As an expert in International Law with a focus on extraterritorial jurisdiction, I am uniquely positioned to assess both the legal mechanisms Ukraine could employ to revoke passports abroad and the international legal, political, and practical constraints on such actions. This perspective is critical because the question concerns not just a domestic administrative measure, but one that would directly affect Ukrainian nationals under the jurisdiction of foreign states, and thus would have extraterritorial implications and likely provoke international responses.",
            "status_quo": "Ukraine has suspended consular services for military-age men abroad (since April 2024), but has not revoked passports already issued. Men must update military registration to access consular services, but there is no evidence of mass or targeted passport revocations affecting those abroad.",
            "perspective_derived_factors": [
                {
                    "factor": "International Law and Diplomatic Norms",
                    "effect": "Decreases probability. Revoking passports from citizens abroad is an extreme step that can contravene international norms, strain relations with host countries, and potentially violate international agreements on consular protection and the right to nationality. Most countries avoid such measures except in cases of criminality or national security."
                },
                {
                    "factor": "Domestic Political and Military Pressure",
                    "effect": "Increases probability. Ukraine is under immense pressure to mobilize more troops and prevent draft evasion, especially as battlefield losses mount and Russia increases its own mobilization. There is strong domestic incentive to close loopholes and compel return of draft-eligible men."
                },
                {
                    "factor": "Administrative and Technical Feasibility",
                    "effect": "Decreases probability. Implementing mass passport revocations abroad is logistically complex, requires coordination with foreign governments (who may not cooperate), and would likely be challenged both administratively and legally by affected individuals and host states."
                },
                {
                    "factor": "Public and International Backlash",
                    "effect": "Decreases probability. Such a move would likely provoke severe backlash from Ukrainian diaspora communities, human rights organizations, Western partners, and potentially trigger adverse legal or diplomatic consequences, particularly from the EU where most Ukrainian men abroad reside."
                },
                {
                    "factor": "Precedent and Base Rates",
                    "effect": "Decreases probability. Historically, few states at war have revoked passports en masse from military-age men abroad, preferring instead to suspend services, incentivize return, or use legal penalties for noncompliance. The base rate for such action is low."
                },
                {
                    "factor": "Recent Policy Shifts and Political Rhetoric",
                    "effect": "Slightly increases probability. Ukraine has tightened rules on registration and access to services for men abroad, signaling growing frustration with draft evasion. There is political pressure, but so far policy has stopped short of actual revocation."
                }
            ],
            "no_scenario": "Ukraine continues to restrict consular services for draft-age men abroad and pressures them to update military registration, but does not announce a policy of revoking passports. Men abroad retain their valid passports, though they may be unable to renew or replace them until compliance, and some may remain in limbo. International partners warn against revocation, and Ukraine heeds this advice to avoid diplomatic fallout.",
            "yes_scenario": "Facing acute manpower shortages and continued draft evasion by men abroad, Ukraine announces a nationwide policy to revoke the passports of at least 1,000 draft-eligible men residing abroad who have not regularized their military status. This is publicly reported by credible sources, with consular posts and embassies instructed to invalidate passports in the central registry, and notifications sent to affected individuals and possibly host governments. The move is justified as necessary for national security, despite expected backlash.",
            "final_reasoning": "While Ukraine faces severe domestic pressure to plug draft evasion and has suspended consular services for men abroad, the move to revoke previously valid passports is a qualitatively more extreme and internationally provocative step. International law, host country pushback, and administrative challenges all strongly disincentivize such action. The base rate for mass passport revocation in wartime is extremely low. Recent Ukrainian policy has focused on restricting services and requiring military registration rather than outright revocation. Rhetoric and incremental tightening of rules suggest frustration, but not a clear path to revocation. There is no credible reporting to date that such a policy is imminent or under serious consideration. Therefore, while not impossible given Ukraine's desperate situation, the probability remains low.",
            "final_probability": 8
        },
        "Area Studies Eastern Europe (PostSovietStatePolicy)": {
            "time_to_resolution": "About 3 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Eastern European area studies with a focus on post-Soviet state policy, I am well positioned to contextualize Ukraine’s consular and mobilization decisions in the broader context of war, state capacity, diaspora politics, and international law. I can apply knowledge of historical precedent, Ukrainian administrative practice, and the interplay between domestic legitimacy and external relations.",
            "status_quo": "Ukraine has suspended consular services for draft-age men abroad but has not revoked previously issued passports. Passports remain valid for those already abroad, with new issuance or renewal restricted unless military registration requirements are met.",
            "perspective_derived_factors": [
                {
                    "factor": "Ukrainian Legal and Administrative Constraints",
                    "effect": "Decreases probability. Ukraine has not historically revoked passports en masse except for clear, individual criminal or security cases. Administrative and legal hurdles to mass revocation, particularly under international scrutiny, are significant."
                },
                {
                    "factor": "State Capacity and Bureaucratic Feasibility",
                    "effect": "Decreases probability. Implementing a mass passport revocation process for thousands abroad would be logistically complex, potentially damaging Ukraine’s international reputation and causing backlash among Western allies."
                },
                {
                    "factor": "Political Cost and Diaspora Relations",
                    "effect": "Decreases probability. Ukraine relies heavily on diaspora support (financial, political, humanitarian). Revoking passports from the large number of draft-age men abroad would risk severe alienation of a key constituency and reduce remittance flows."
                },
                {
                    "factor": "International Norms and Human Rights Concerns",
                    "effect": "Decreases probability. Revoking passports from citizens abroad is regarded internationally as an extreme and punitive measure. Ukraine, which seeks EU accession and Western support, is incentivized to avoid such steps that would draw condemnation and possibly legal challenges."
                },
                {
                    "factor": "Military Manpower Needs and Domestic Pressure",
                    "effect": "Increases probability, but only modestly. Ukraine faces acute manpower shortages and public frustration with draft evasion. There is political pressure to be seen as tough on men who avoid mobilization by residing abroad."
                },
                {
                    "factor": "Recent Policy Trajectory",
                    "effect": "Neutral to slightly decreasing. Rather than revoking passports, Ukraine has opted to suspend or restrict consular services, requiring military registration for document renewal, and has recently eased exit restrictions for some younger men. No credible steps toward mass revocation have been reported."
                },
                {
                    "factor": "Russian Information Operations and Rumor Amplification",
                    "effect": "Decreases probability. Reports about passport revocation are frequently cited as Russian disinformation, and the Ukrainian government has made efforts to debunk such rumors, indicating a reluctance to adopt such a policy."
                }
            ],
            "no_scenario": "Ukraine continues to restrict or suspend consular services for draft-age men abroad and denies document renewal for those who do not comply with military registration, but does not announce or implement a policy of revoking previously valid passports. Some men may be stranded with expired documents, but their existing passports are not retroactively invalidated.",
            "yes_scenario": "The Ukrainian government, under acute domestic or battlefield pressure, publicly announces a nationwide (or large-scale, 1,000+ cases) policy of revoking previously valid passports of draft-age men abroad who have failed to register for military service, with credible media sources reporting the enforcement action and affected individuals.",
            "final_reasoning": "The Ukrainian government faces strong incentives to increase military registration, but these have thus far manifested as denial of new or renewed documents, not retroactive revocation. Mass passport revocation would be unprecedented in recent Ukrainian or European practice, highly controversial, and legally fraught. It would provoke diplomatic backlash, harm relations with the diaspora, and likely create problems with the EU and other partners. Given the policy trajectory, Kyiv is more likely to continue denying services or requiring compliance for future consular actions, not to announce revocation of existing passports. Base rates for such measures in similar contexts are extremely low. Recent developments (e.g., some liberalization of exit restrictions for 18-22 year olds, integration of military registries with consular databases) suggest a focus on registration and compliance rather than punitive revocation. No credible media has reported even plans for such a policy, and Ukrainian officials have repeatedly disavowed the idea. Thus, the probability of a qualifying nationwide or large-scale passport revocation policy being announced before Jan 1, 2026 remains very low.",
            "final_probability": 3
        }
    },
    "deliberation_probability": [
        7,
        10,
        18,
        8,
        10,
        8,
        3
    ],
    "deliberation_mean_probability": 9.142857142857142,
    "deliberation_sd": 4.561745697594706,
    "deliberation_probability_result": 9,
    "group_results": {
        "diplomacyConsularpractice": {
            "forecaster_to_engage": "Political Science (CivilMilitaryRelations)",
            "response_type": "critique",
            "response": "While your assessment correctly notes the possible risk of radical escalation if Ukraine faces a true existential crisis, your probability (18%) appears elevated given both the short time frame (only three months remain) and the absence of any credible signals that such a measure is under serious consideration. As someone steeped in consular practice, I would emphasize that the operational and diplomatic barriers to mass passport revocation are not just high but likely prohibitive, especially as Ukraine is still reliant on Western support and must avoid antagonizing host countries where its diaspora resides. The trend in Ukrainian policy has repeatedly stopped short of retroactive punitive measures: the government has chosen to lock out men from new services and enforce military registration, but mass revocation would likely trigger immediate legal challenges, outcry from Western partners, and negative publicity. Unless there was a dramatic, public change in the war situation—and there is no such indication in the reporting—an 18% probability seems to overstate the plausible risk. A probability in the single digits better reflects both precedent and the status quo trajectory."
        },
        "immigrationlawCitizenshiprevocationstandards": {
            "forecaster_to_engage": "Area Studies Eastern Europe (PostSovietStatePolicy)",
            "response_type": "defense",
            "response": "Your reasoning is especially strong in highlighting both the lack of precedent and the legal/diplomatic dangers for Ukraine if it were to pursue mass passport revocation. From an immigration law perspective, I concur that the government’s approach is more about leveraging service denial to enforce compliance, rather than punitive retrospective actions that would create international incidents and likely violate international human rights standards. You correctly note that the integration of military and consular databases is intended to enforce registration, not to facilitate revocation of existing passports. The extremely low base rate, absence of credible preparations for such a move, and consistent official denials all support your very low probability estimate. This is a well-founded, status quo–anchored forecast."
        },
        "politicalScienceCivilmilitaryrelations": {
            "forecaster_to_engage": "Diplomacy (ConsularPractice)",
            "response_type": "defense",
            "response": "Your argument is well-grounded in the realities of international relations and consular operations. I agree that the practical, diplomatic, and reputational barriers to mass passport revocation for draft-age men abroad are extremely high—likely prohibitive absent a national emergency of a much greater scale than currently observed. You accurately emphasize that Ukraine’s incremental administrative tightening has consistently stopped short of retroactive document cancellation, reflecting an acute awareness of both international legal norms and the need to maintain goodwill with the diaspora and Western partners. The absence of credible reporting or preparatory steps toward passport revocation is decisive. Your low probability estimate is justified by the base rate, the current trajectory, and the time remaining until question resolution."
        },
        "politicalScienceStatecapacitytheory": {
            "forecaster_to_engage": "International Law (CitizenshipLaw)",
            "response_type": "defense",
            "response": "Your reasoning closely aligns with the core insights from State Capacity Theory, particularly in emphasizing the legal, diplomatic, and logistical barriers to mass passport revocation. You correctly point out that international law and the principle against statelessness act as powerful constraints, and that no European country has taken such a step in modern times, even under wartime duress. The Ukrainian approach has focused on denying new consular services rather than retroactively punishing citizens abroad—reflecting both capacity limitations and the need to maintain international legitimacy. The absence of legal infrastructure or credible signals in news reporting further supports your assessment. Your probability is well-calibrated, resting on solid base rates and the current trajectory. This is a robust, status quo–anchored argument."
        },
        "internationalLawCitizenshiplaw": {
            "forecaster_to_engage": "International Law (ExtraterritorialJurisdiction)",
            "response_type": "defense",
            "response": "Your analysis is sound and well-aligned with the realities of citizenship law and international legal frameworks. You appropriately highlight the qualitative difference between suspending consular services and revoking passports already held by citizens abroad, as well as the strong disincentives under international law and the practical obstacles to such a move. Your emphasis on the rarity of such measures, the need for host country cooperation or at least acquiescence, and the absence of credible reporting of imminent change accurately reflects the legal and diplomatic landscape. The probability you assign is justified given the status quo, the logistical and legal hurdles, and Ukraine’s continued orientation toward the West and international legitimacy. Your approach correctly grounds the forecast in base rates and administrative reality."
        },
        "internationalLawExtraterritorialjurisdiction": {
            "forecaster_to_engage": "ImmigrationLaw (CitizenshipRevocationStandards)",
            "response_type": "defense",
            "response": "Your reasoning robustly recognizes the formidable legal and diplomatic barriers to mass passport revocation, which is particularly compelling from the standpoint of extraterritorial jurisdiction. You correctly emphasize that while Ukraine has escalated administrative requirements and denied services, it has not moved toward the much more provocative and challenging step of invalidating existing travel documents for those already abroad. The base rate for such actions is indeed extremely low in democratic or semi-democratic contexts, and the specific focus on Western legal standards and international human rights norms further substantiates your low probability assessment. The acknowledgment that rumors of passport revocation have been officially denied and treated as disinformation accurately reflects the prevailing policy intent and external signaling. Your argument is well-calibrated and, from the perspective of international law and state practice, supports a strong status quo bias in this forecast."
        },
        "areaStudiesEasternEuropePostsovietstatepolicy": {
            "forecaster_to_engage": "Political Science (StateCapacityTheory)",
            "response_type": "defense",
            "response": "Your reasoning is particularly strong in its application of state capacity theory, highlighting not only the logistical challenges for Ukraine in implementing mass passport revocation but also the importance of maintaining international legitimacy and diaspora relations. The linkage you draw between Ukraine's Western integration ambitions and its restraint from pursuing the most extreme administrative measures is persuasive. Additionally, your emphasis on the recent policy trajectory—tightening compliance via administrative means without crossing into outright revocation—captures the incremental, risk-averse approach observed in Ukrainian governance since 2022. The low base rate for such actions, strong negative incentives, and short time window left for resolution all reinforce your low probability assessment. Your analysis is well-calibrated and status quo–anchored, and I concur with your conclusion."
        }
    },
    "revision_results": {
        "Diplomacy (ConsularPractice)": {
            "my_phase1_final_probability": 7,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, particularly the near-unanimous consensus among experts in International Law, Area Studies, and Political Science that the probability of mass passport revocation remains extremely low, I find my initial reasoning reinforced. The only higher estimate (18%) was based on a hypothetical scenario of dramatic escalation, but as discussed, there is no credible evidence or precedent to support such a shift within the next three months. Most experts cited operational, legal, and diplomatic barriers as well as the lack of any credible reporting or policy signals. The lowest estimate (3%) also helps calibrate my forecast, but given the acute and unpredictable pressures facing Ukraine, I believe a slightly higher single-digit estimate remains justified. Therefore, I will keep my probability at 7%.",
            "revised_probability": 7
        },
        "ImmigrationLaw (CitizenshipRevocationStandards)": {
            "my_phase1_final_probability": 10,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, particularly the critiques and defenses among forecasters, I find my initial assessment well supported. The consensus across multiple relevant disciplines is that the likelihood of Ukraine announcing or implementing mass passport revocation for draft-age men abroad is extremely low, given legal, diplomatic, and practical constraints. The one higher probability (18%) was effectively critiqued as overstated for the reasons I outlined initially—namely, the absence of credible policy movement or signals, strong international disincentives, and the short time frame remaining. The defense of a very low probability (3%) by the Area Studies expert further reinforces that the status quo is likely to persist, and that all available evidence points away from imminent escalation to revocation. While a catastrophic shift in the war could theoretically change the calculus, there is no current indication of such a scenario. Therefore, I see no reason to revise my forecast.",
            "revised_probability": 10
        },
        "Political Science (CivilMilitaryRelations)": {
            "my_phase1_final_probability": 18,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, especially the detailed critiques from experts in Diplomacy (Consular Practice) and Immigration Law, I find their arguments compelling. Both highlight the extraordinarily high operational and diplomatic barriers to mass passport revocation, as well as the lack of any credible political, legal, or logistical signals that such a step is imminent. The base rate for this kind of action by democratic or semi-democratic states facing manpower shortages remains extremely low, and Ukrainian policy has consistently focused on restricting new services rather than retroactively invalidating existing documents. With only three months to go until resolution and no sign of a dramatic shift, my initial estimate appears too high. I now assess that the risk of a qualifying mass passport revocation is best represented in the single digits.",
            "revised_probability": 8
        },
        "Political Science (StateCapacityTheory)": {
            "my_phase1_final_probability": 8,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I find that the consensus among experts in related fields—diplomacy, law, and regional studies—strongly reinforces my initial assessment. All emphasize unprecedented legal, diplomatic, and operational barriers to mass passport revocation, and highlight the absence of any credible indication that Ukraine is preparing to cross this threshold. The group’s probabilities are clustered at or below my own, with some even lower, and their arguments further solidify the base-rate and status quo orientation of my forecast. No new evidence or compelling argument emerged to suggest the risk is higher than I initially judged. If anything, the group’s reasoning supports a marginal downward adjustment, but I will retain my original estimate for calibration, as it already reflects a low-probability, status quo-anchored outcome.",
            "revised_probability": 8
        },
        "International Law (CitizenshipLaw)": {
            "my_phase1_final_probability": 10,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I find strong consensus across expert perspectives—including consular practice, state capacity, civil-military relations, and area studies—that the legal, diplomatic, and practical barriers to mass passport revocation remain prohibitive. All forecasters emphasize the extremely low base rate for such action, the absence of credible policy signals or preparatory steps, and the likely negative impact on Ukraine’s relationships with Western partners and its own diaspora. The only forecast above 10% (18%) was critiqued as too high for the short timeframe and lack of escalation. No new evidence has emerged suggesting a shift toward revocation policy, and the policy trajectory remains tightly anchored to administrative denial of future services rather than retroactive punishment. Thus, the reasoning for my initial estimate is reinforced, and there is no substantive basis for an upward or downward revision.",
            "revised_probability": 10
        },
        "International Law (ExtraterritorialJurisdiction)": {
            "my_phase1_final_probability": 8,
            "reasoning_for_revised_probability": "After reviewing my initial forecast and the group deliberation, I find strong convergence among experts across relevant domains—diplomatic, legal, political science, and area studies—regarding the extremely low base rate, practical obstacles, and diplomatic/international legal barriers to mass passport revocation for draft-age men abroad. Notably, the Area Studies Eastern Europe perspective highlighted the unprecedented nature and consistent policy denials, while the Immigration Law and Consular Practice perspectives reinforced the focus on administrative service denial rather than revocation. The Political Science (CivilMilitaryRelations) estimate was somewhat higher, but ultimately most experts converged around a single-digit probability. No new evidence or argument during deliberation justified an upward revision. If anything, broad inter-field consensus and the lack of any sign of imminent escalation in policy, even under severe mobilization pressures, suggests a slightly lower probability could be warranted. However, since my initial estimate was already well-calibrated and in line with the modal group opinion, I will leave my probability unchanged.",
            "revised_probability": 8
        },
        "Area Studies Eastern Europe (PostSovietStatePolicy)": {
            "my_phase1_final_probability": 3,
            "reasoning_for_revised_probability": "The group deliberation reinforced the original assessment, with all expert perspectives—across diplomacy, immigration law, international law, and political science—converging on the conclusion that mass passport revocation is unprecedented, operationally difficult, diplomatically costly, and not signaled in recent Ukrainian policy. No credible reporting or preparatory steps have emerged, and the time frame is now very short. Arguments for a higher probability (e.g., CivilMilitaryRelations at 18%) were critiqued as overestimating the likelihood in the absence of acute crisis signals. The consensus and reasoning across disciplines support, if anything, even greater confidence in a very low probability for a 'Yes' outcome before 2026. Thus, I see no reason to revise my probability upward; if anything, a slight reduction could be justified, but for calibration and continuity, I will maintain the initial very low figure.",
            "revised_probability": 3
        }
    },
    "revision_probability": [
        7,
        10,
        8,
        8,
        10,
        8,
        3
    ],
    "revision_mean_probability": 7.714285714285714,
    "revision_sd": 2.3603873774083297,
    "revision_probability_result": 8,
    "question_details": {
        "id": 38839,
        "title": "Will Ukraine start revoking passports of military draft age men residing abroad before 2026?",
        "created_at": "2025-08-31T05:08:31.327400Z",
        "open_time": "2025-09-30T13:09:21Z",
        "cp_reveal_time": "2025-09-30T14:39:21Z",
        "spot_scoring_time": "2025-09-30T14:39:21Z",
        "scheduled_resolve_time": "2026-01-01T09:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-09-30T14:39:21Z",
        "actual_close_time": "2025-09-30T14:39:21Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "This question is synced with an identical question on Metaculus. The original question opened on 2024-04-30 12:30:00 and can be found [here](https://www.metaculus.com/questions/22560). This question will resolve to the same value as the synced question. The original question's background info at this time is below. \n\nShortly after new Ukrainian mobilization law [was signed](https://edition.cnn.com/2024/04/16/europe/zelensky-signs-mobilization-law-intl-latam/index.html), all [consular services for men age 18-60 was suspended](https://edition.cnn.com/2024/04/23/europe/ukraine-consulates-mobilization-intl-latam/index.html), including issuing and renewing passports.\n\nIn light of these developments, there have been concerns, reportedly amplified by [Russian propaganda](https://disinfo.detector.media/en/post/the-ukrainian-government-allegedly-wants-to-cancel-the-international-passports-of-citizens-abroad), that this will be supplemented by revoking already-issued passports, thus forcing Ukrainian men to return home.\n\n`{\"format\":\"metac_closes_in_period\",\"info\":{\"post_id\":22560,\"question_id\":22560}}`",
        "resolution_criteria": "This question will resolve as **Yes** if, before January 1, 2026, [credible sources](https://www.metaculus.com/help/faq/#definitions) report that the Ukraine government has initiated a policy of revoking previously valid passports of Ukrainian men, deemed to be of draft age, who reside outside the country.\n\nIf no credible sources report such revocation before January 1, 2026, this question resolves as **No**.",
        "fine_print": "This passport revocation announcement must describe the revocation as either nationwide or affecting at least 1,000 draft-eligible Ukrainian men abroad without proper military service documents.",
        "post_id": 39462,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Russia Launches Largest Autumn Draft Since 2016**\nRussian President Vladimir Putin signed a decree launching a record autumn conscription campaign that will run from Oct. 1 to Dec. 31, 2025. The decree mandates the drafting of men aged 18‑30 who are not in the reserve and whose service terms have expired, and it also authorises the release of soldiers, sailors, sergeants and foremen whose contracts have ended. Federal authorities are tasked with implementing the order.\n\nOn Sept. 24, the State Duma passed a bill that will extend conscription activities throughout the calendar year, so that from Jan. 1 2026 the call‑up will no longer occur twice a year but continuously from Jan. 1 to Dec. 31. Dispatching of conscripts to service units will still occur in two periods: Apr. 1‑Jul. 15 and Oct. 1‑Dec. 31, under presidential decrees.\n\nMoscow has denied any link between conscription and the war in Ukraine, insisting that conscripts will not be sent to the front. In contrast, Ukraine’s government has protested that thousands of the new conscripts are Ukrainian citizens who will be forced to fight against their own people.\n\nVice Admiral Vladimir Tsimlyanskiy, deputy chief of the Russian Army’s General Staff, told state media that in 2024 conscription was set at 130,000 men and \"that goal was fulfilled on time and in full.\" The local outlet Novosti Rostova reported that draft summons would also be distributed through managers at state‑run companies and educational institutions. Conscripts must report to recruiting offices and are obliged to serve for twelve months.\n\nRecruitment priorities for 2024 include the Komi Republic, Krasnodar, Krasnoyarsk, Amur, Kaliningrad, Moscow, Bryansk, Rostov, Samara, Sakhalin, St. Petersburg and Chelyabinsk regions, with Crimea described by Tsimlyanskiy as Russian territory and also listed as a key focus.\n\nThose labeled foreigners will be subject to residency rules, including a maximum 90‑day stay, mandatory medical exams and work restrictions. Anyone forced to take a Russian passport automatically becomes eligible for conscription.\nOriginal language: en\nPublish date: September 29, 2025 06:10 PM\nSource:[kyivpost.com](https://www.kyivpost.com/post/61092)\n\n**Putin signs decree on autumn mobilization – how many Russians will be drafted into the Russian army**\nOn 29 September 2025, Ukrainian media reported that Russian President Vladimir Putin signed a decree to launch an autumn mobilization campaign for the Russian army. The decree calls for drafting 135 000 citizens aged 18‑30, with service running from 1 October to 31 December 2025. Vice‑Admiral Volodymyr Tsymlanskyi, deputy head of the Main Organizational‑Mobilization Directorate of the General Staff, said that the conscripts would be sent to ‘displacement points for service on Russian territory and would not be involved in the war’. He also noted that the campaign would use the Unified Military Registry while paper summonses would remain in circulation. The mobilization is expected to be the largest since 2011, when 203 000 men were drafted; since 2012 the numbers have steadily declined, never exceeding 155.5 000. The article lists annual mobilization figures: 2021 (spring 134 650, autumn 127 500), 2022 (spring 134 500, autumn 120 000), 2023 (spring 147 000, autumn 130 000), 2024 (spring 150 000, autumn 160 000). It also reports that Moscow plans to rely on forced conscription and intimidation of detainees, and that Russia has officially withdrawn from the European Convention on Human Rights, signalling a disregard for international norms. The source, 5 kanal, frames the mobilization as a step toward expanding military operations in occupied Ukrainian territories.\nOriginal language: uk\nPublish date: September 29, 2025 03:08 PM\nSource:[5 канал](https://www.5.ua/svit/putin-pidpysav-ukaz-pro-osinnii-pryzov-skilkokh-rosiian-zaberut-do-armii-rf-361031.html)\n\n**Putin Issues Regular Draft for 135,000 Citizens Under 30**\nOn 29 September 2025, Russian President Vladimir Putin signed a presidential decree ordering the conscription of 135,000 Russian citizens aged 18 to 30 who are not part of the reserve forces, to serve from 1 October to 31 December 2025 (the article states). The decree was reported by TASS, which said, '푸틴 대통령은 현지 시각 29일 징병 대상이면서 예비군에 속하지 않은 18∼30세 러시아 시민 13만 5천 명을 10월 1일부터 12월 31일까지 징집하는 대통령령에 서명했다고 타스 통신이 전했습니다.' (the article quotes TASS). Russia operates a mixed conscription system, with regular conscription twice a year and a service period of one year (the article explains). The age limit for conscription was raised from 27 to 30 after the start of the Ukraine 'special military operation' in 2023 (the article notes). The Russian General Staff has stated that conscripted soldiers are not mobilized for the special military operation (the article reports). The article was published by KBS on 29 September 2025 (the article lists the publication date).\nOriginal language: ko\nPublish date: September 29, 2025 01:41 PM\nSource:[KBS](https://news.kbs.co.kr/news/pc/view/view.do?ncd=8370739)\n\n**This Year the Number Will Be Higher: Putin Signs Decree on Autumn Conscription**\nOn September 29, 2025, Russian dictator Vladimir Putin signed a decree to conduct an autumn conscription in 2025, according to the propaganda agency TASS. The campaign will run from October 1 to December 31 and is expected to mobilize 135,000 men aged 18‑30 who are not in reserve. The decree also states that soldiers whose service term has ended will be discharged. In 2024, 133,000 citizens were conscripted during the autumn draft, and in June 2024 the State Duma raised the upper age limit for conscription from 27 to 30, which will increase the number of conscripts by more than two million in the coming years. On January 30, the Main Intelligence Directorate reported that in 2025 Russia plans to bring at least 126,000 soldiers from the so‑called special contingent (prisoners, debtors, etc.) into the war against Ukraine. Overall, the Kremlin aimed to mobilize 280,000 people this year. In April, Ukrainian General Staff commander Oleksandr Syrskyi said the aggressor Russia adds 8‑9 thousand troops per month through contract soldiers, amounting to 120‑130 thousand per year. On June 21, the Main Intelligence Directorate of the Ukrainian Ministry of Defence reported an increase in forced mobilization of Central Asian citizens for the war against Ukraine, who are lured by quick wages and short‑term contracts but most die quickly. Key metrics: 135,000 conscripts planned for 2025; 133,000 conscripted in 2024; 126,000 special contingent soldiers targeted for 2025; 280,000 mobilized this year; 8‑9 thousand contract soldiers added monthly; 120‑130 thousand contract soldiers added annually.\nOriginal language: uk\nPublish date: September 29, 2025 12:35 PM\nSource:[Новое Время](https://nv.ua/ukr/world/countries/putin-pidpisav-ukaz-pro-osinniy-prizov-do-armiji-novini-rosiji-50548780.html)\n\n**This Year, the Numbers Will Be Higher: Putin Signs Decree on Autumn Military Draft**\nRussian President Vladimir Putin signed a decree on 29 September 2025 ordering an autumn draft for 2025. The campaign will run from 1 October to 31 December and is aimed at 135 000 men aged 18‑30 who are not in reserve. The decree also orders the dismissal of soldiers whose service term has ended. In 2024, 133 000 citizens were drafted in the autumn, and the State Duma’s June 2024 decision to raise the upper age limit for conscription from 27 to 30 means the number of draftees will rise by more than two million in the coming years. The Main Intelligence Directorate said Russia plans to mobilize at least 126 000 soldiers from the special contingent (prisoners, debtors, etc.) in 2025, and the Kremlin had planned to mobilize 280 000 people this year. In April, Ukrainian commander‑in‑chief Alexander Syrskyi said the aggressor country increases its armed forces by 8‑9 thousand per month through contract soldiers, amounting to 120‑130 thousand per year. On 21 June, the Ukrainian Ministry of Defence’s Main Intelligence Directorate reported an increase in forced mobilization of Central Asian citizens, who are lured by quick pay and short contracts but most die quickly.\nOriginal language: ru\nPublish date: September 29, 2025 12:35 PM\nSource:[Новое Время](https://nv.ua/world/countries/putin-podpisal-ukaz-ob-osennem-prizyve-v-armiyu-novosti-rossii-50548780.html)\n\n**Russia Launches Largest Autumn Draft Since 2016**\nRussian President Vladimir Putin signed a decree launching a record autumn conscription campaign that will run from Oct. 1 to Dec. 31, 2025. The decree mandates the drafting of men aged 18‑30 who are not in the reserve and whose service terms have expired, and it also authorises the release of soldiers, sailors, sergeants and foremen whose contracts have ended. Federal authorities are tasked with implementing the order.\n\nOn Sept. 24, the State Duma passed a bill that will extend conscription activities throughout the calendar year, so that from Jan. 1 2026 the call‑up will no longer occur twice a year but continuously from Jan. 1 to Dec. 31. Dispatching of conscripts to service units will still occur in two periods: Apr. 1‑Jul. 15 and Oct. 1‑Dec. 31, under presidential decrees.\n\nMoscow has denied any link between conscription and the war in Ukraine, insisting that conscripts will not be sent to the front. In contrast, Ukraine’s government has protested that thousands of the new conscripts are Ukrainian citizens who will be forced to fight against their own people.\n\nVice Admiral Vladimir Tsimlyanskiy, deputy chief of the Russian Army’s General Staff, told state media that in 2024 conscription was set at 130,000 men and \"that goal was fulfilled on time and in full.\" The local outlet Novosti Rostova reported that draft summons would also be distributed through managers at state‑run companies and educational institutions. Conscripts must report to recruiting offices and are obliged to serve for twelve months.\n\nRecruitment priorities for 2024 include the Komi Republic, Krasnodar, Krasnoyarsk, Amur, Kaliningrad, Moscow, Bryansk, Rostov, Samara, Sakhalin, St. Petersburg and Chelyabinsk regions, with Crimea described by Tsimlyanskiy as Russian territory and also listed as a key focus.\n\nThose labeled foreigners will be subject to residency rules, including a maximum 90‑day stay, mandatory medical exams and work restrictions. Anyone forced to take a Russian passport automatically becomes eligible for conscription.\nOriginal language: en\nPublish date: September 29, 2025 06:10 PM\nSource:[kyivpost.com](https://www.kyivpost.com/post/61092)\n\n**Putin Announces Mandatory Draft, Zelensky Declares Russia Won't Draw New Borders**\nRussian President Vladimir Putin signed a decree on September 29, 2025, instituting mandatory conscription for Russian citizens aged 18 to 30 between October 1 and December 31, 2025, with a target of 135,000 recruits.  Ukrainian President Volodymyr Zelensky, speaking on the same day, warned that Russia would not redraw its borders within Ukraine’s territory and called for a joint air‑defence shield with European partners.  Zelensky said, 'هذا الأمر ممكن، أوكرانيا قادرة على التصدّي لجميع أنواع الطائرات المسيّرة والصواريخ الروسية، وإذا عملنا معاً في المنطقة، فسنمتلك ما يكفي من الأسلحة والقدرة الإنتاجية'.  He also noted that the United States’ stance toward Ukraine had shifted toward a balanced approach that supports Ukraine while seeking a mediator role with Russia.  The Russian Foreign Ministry spokesperson Maria Zakharova accused Western countries of attempting to undermine Russian public opinion, claiming that the global media space is at risk of fragmentation.  The decree’s text explicitly states that conscription applies to citizens not in reserve, with a total of 135,000 people to be drafted.\nOriginal language: ar\nPublish date: September 29, 2025 03:31 PM\nSource:[صحيفة عكاظ](https://www.okaz.com.sa/news/politics/2215564)\n\n**Putin signs decree on autumn mobilization – how many Russians will be drafted into the Russian army**\nOn 29 September 2025, Ukrainian media reported that Russian President Vladimir Putin signed a decree to launch an autumn mobilization campaign for the Russian army. The decree calls for drafting 135 000 citizens aged 18‑30, with service running from 1 October to 31 December 2025. Vice‑Admiral Volodymyr Tsymlanskyi, deputy head of the Main Organizational‑Mobilization Directorate of the General Staff, said that the conscripts would be sent to ‘displacement points for service on Russian territory and would not be involved in the war’. He also noted that the campaign would use the Unified Military Registry while paper summonses would remain in circulation. The mobilization is expected to be the largest since 2011, when 203 000 men were drafted; since 2012 the numbers have steadily declined, never exceeding 155.5 000. The article lists annual mobilization figures: 2021 (spring 134 650, autumn 127 500), 2022 (spring 134 500, autumn 120 000), 2023 (spring 147 000, autumn 130 000), 2024 (spring 150 000, autumn 160 000). It also reports that Moscow plans to rely on forced conscription and intimidation of detainees, and that Russia has officially withdrawn from the European Convention on Human Rights, signalling a disregard for international norms. The source, 5 kanal, frames the mobilization as a step toward expanding military operations in occupied Ukrainian territories.\nOriginal language: uk\nPublish date: September 29, 2025 03:08 PM\nSource:[5 канал](https://www.5.ua/svit/putin-pidpysav-ukaz-pro-osinnii-pryzov-skilkokh-rosiian-zaberut-do-armii-rf-361031.html)\n\n**Putin Issues Regular Draft for 135,000 Citizens Under 30**\nOn 29 September 2025, Russian President Vladimir Putin signed a presidential decree ordering the conscription of 135,000 Russian citizens aged 18 to 30 who are not part of the reserve forces, to serve from 1 October to 31 December 2025 (the article states). The decree was reported by TASS, which said, '푸틴 대통령은 현지 시각 29일 징병 대상이면서 예비군에 속하지 않은 18∼30세 러시아 시민 13만 5천 명을 10월 1일부터 12월 31일까지 징집하는 대통령령에 서명했다고 타스 통신이 전했습니다.' (the article quotes TASS). Russia operates a mixed conscription system, with regular conscription twice a year and a service period of one year (the article explains). The age limit for conscription was raised from 27 to 30 after the start of the Ukraine 'special military operation' in 2023 (the article notes). The Russian General Staff has stated that conscripted soldiers are not mobilized for the special military operation (the article reports). The article was published by KBS on 29 September 2025 (the article lists the publication date).\nOriginal language: ko\nPublish date: September 29, 2025 01:41 PM\nSource:[KBS](https://news.kbs.co.kr/news/pc/view/view.do?ncd=8370739)\n\n**This Year the Number Will Be Higher: Putin Signs Decree on Autumn Conscription**\nOn September 29, 2025, Russian dictator Vladimir Putin signed a decree to conduct an autumn conscription in 2025, according to the propaganda agency TASS. The campaign will run from October 1 to December 31 and is expected to mobilize 135,000 men aged 18‑30 who are not in reserve. The decree also states that soldiers whose service term has ended will be discharged. In 2024, 133,000 citizens were conscripted during the autumn draft, and in June 2024 the State Duma raised the upper age limit for conscription from 27 to 30, which will increase the number of conscripts by more than two million in the coming years. On January 30, the Main Intelligence Directorate reported that in 2025 Russia plans to bring at least 126,000 soldiers from the so‑called special contingent (prisoners, debtors, etc.) into the war against Ukraine. Overall, the Kremlin aimed to mobilize 280,000 people this year. In April, Ukrainian General Staff commander Oleksandr Syrskyi said the aggressor Russia adds 8‑9 thousand troops per month through contract soldiers, amounting to 120‑130 thousand per year. On June 21, the Main Intelligence Directorate of the Ukrainian Ministry of Defence reported an increase in forced mobilization of Central Asian citizens for the war against Ukraine, who are lured by quick wages and short‑term contracts but most die quickly. Key metrics: 135,000 conscripts planned for 2025; 133,000 conscripted in 2024; 126,000 special contingent soldiers targeted for 2025; 280,000 mobilized this year; 8‑9 thousand contract soldiers added monthly; 120‑130 thousand contract soldiers added annually.\nOriginal language: uk\nPublish date: September 29, 2025 12:35 PM\nSource:[Новое Время](https://nv.ua/ukr/world/countries/putin-pidpisav-ukaz-pro-osinniy-prizov-do-armiji-novini-rosiji-50548780.html)\n\n**This Year, the Numbers Will Be Higher: Putin Signs Decree on Autumn Military Draft**\nRussian President Vladimir Putin signed a decree on 29 September 2025 ordering an autumn draft for 2025. The campaign will run from 1 October to 31 December and is aimed at 135 000 men aged 18‑30 who are not in reserve. The decree also orders the dismissal of soldiers whose service term has ended. In 2024, 133 000 citizens were drafted in the autumn, and the State Duma’s June 2024 decision to raise the upper age limit for conscription from 27 to 30 means the number of draftees will rise by more than two million in the coming years. The Main Intelligence Directorate said Russia plans to mobilize at least 126 000 soldiers from the special contingent (prisoners, debtors, etc.) in 2025, and the Kremlin had planned to mobilize 280 000 people this year. In April, Ukrainian commander‑in‑chief Alexander Syrskyi said the aggressor country increases its armed forces by 8‑9 thousand per month through contract soldiers, amounting to 120‑130 thousand per year. On 21 June, the Ukrainian Ministry of Defence’s Main Intelligence Directorate reported an increase in forced mobilization of Central Asian citizens, who are lured by quick pay and short contracts but most die quickly.\nOriginal language: ru\nPublish date: September 29, 2025 12:35 PM\nSource:[Новое Время](https://nv.ua/world/countries/putin-podpisal-ukaz-ob-osennem-prizyve-v-armiyu-novosti-rossii-50548780.html)\n\n**Call for Conscription Autumn‑Winter 2025: Who Will Be Drafted, Rules, Advice, Required Documents, and Who Will Be Drafted**\nThe Russian president signed a decree for a new conscription campaign that will run from 1 October to 31 December 2025, calling men aged 18‑30 (previously 18‑27) to serve.  The Ministry of Defence says the draft will be limited to service within Russia’s borders and explicitly excludes participation in the Special Military Operation (SVO) zone, a claim the General Staff reiterated to dispel rumours.  The article lists practical advice for recruits: bring non‑perishable food, simple clothing, required documents (passport, certificates, prescriptions), and a basic mobile phone that must be surrendered to the storage room.  It warns that failure to report a change of address can lead to administrative warnings, fines, and even criminal prosecution, and that non‑attendance at a summons can incur a 30‑thousand‑ruble fine and travel restrictions.  The draft will mobilise 135 000 men, a record figure, as the armed forces plan to grow to 1.5 million personnel by the end of 2024.  The article cites that the larger cohort of 18‑year‑olds is a result of the \"children‑of‑the‑family‑capital\" payments introduced in Russia.  The piece quotes the General Staff’s statement that \"all conscripts this autumn will serve only on Russian territory and not in the SVO zone,\" and the Ministry’s hotline that will open on 13 October for conscription questions.\nOriginal language: ru\nPublish date: September 29, 2025 11:35 AM\nSource:[kp.ru](https://www.kp.ru/daily/27722/5149477/)\n\n**What Will Change for Ukrainians from October 1**\nFrom 1 October 2025, Ukraine will implement a series of significant changes affecting pensioners, retail workers, bank customers, and families with children. Pensioners and recipients of social assistance may lose payments if they have not completed mandatory identification by the deadline; identification can be done at a PPU service centre, via video call, or through the ‘Diia.Pidpis’ electronic cabinet. The state will automatically add a pension supplement for those aged 70 and over: 300 UAH for ages 70–74, 456 UAH for 75–79, and 570 UAH for 80+. An additional payment is available for single people over 80 who need external care, subject to medical and family‑structure certificates. On 26 October, clocks will be set back one hour at 04:00 to observe winter time. The heating season for 2025/2026 will begin when the average temperature for three consecutive days does not exceed +8°C; the government has prepared 115,000 houses and nearly 22,000 social‑sector facilities for the cold. New rules for card‑to‑card transfers aim to increase transparency and reduce fraud. Basic social assistance will become available to all eligible individuals, with a six‑month duration and automatic two‑year renewal. From 12 October, EU border crossing rules for Ukrainian citizens will change: the Entry/Exit System (EES) will replace passport stamps for stays up to 90 days within any 180‑day period, recording biometric data and passport details. Finally, the National Bank will gradually withdraw 10‑kopiyok coins from circulation, though they will remain legal tender for transactions. These measures are intended to streamline social support, improve security, and modernise administrative procedures.\nOriginal language: uk\nPublish date: September 28, 2025 11:43 PM\nSource:[novosti-n.org](https://novosti-n.org/ua/news/SHHo-zminytsya-dlya-ukrayincziv-z-1-zhovtnya-324083)\n\n**Mobilization in 2025: Is a Child with Disability a Ground for Deferment?**\nAccording to the 24 Канал article, Ukrainian law allows men who raise a child with a disability to apply for a deferment from mobilization. The article cites lawyer Gennady Kapralov, stating that the man must submit a birth certificate, a medical report confirming the child’s disability or an individual rehabilitation program, proof of the parent’s identity, a marriage certificate, and if he is not the biological father, an adoption or guardianship decision. The article quotes: 'Мужчина, который воспитывает ребенка с инвалидностью имеет право на получение отсрочки.' It also warns that 'Если не принести соответствующие документы и не подтвердит право на отсрочку, то его могут мобилизовать и это будет законно.' Even after receiving a deferment, the man may still receive a mobilization summons; in that case he should return to the local service center (TC) with the required documents. If the TC claims that after a mobilization order the person becomes a soldier and therefore cannot have a deferment, the article advises going to court. When all conditions are met, the man and his child may travel abroad, carrying a military registration document, a passport, and the child’s diagnosis documents.\nOriginal language: ru\nPublish date: September 28, 2025 03:14 PM\nSource:[24 Канал](https://24tv.ua/ru/mobilizacija-2025-godu-javljaetsja-li-rebenok-invalidnostju-osnovaniem_n2923362)\n\n**Driver in Western Ukraine Hits Two Soldiers During Document Check**\nOn September 28, 2025, a driver of a Daewoo Lanos in Ternopil, western Ukraine, struck two soldiers who were attempting to verify his military registration documents. The driver refused to provide the documents, locked himself in the vehicle, and drove forward, causing injuries to the soldiers. A third soldier fired at the car's wheel. The driver fled the scene. The injured soldiers were transported to a hospital, and police are investigating and interviewing witnesses. Ternopil, the administrative center of Ternopil Oblast, had a 2024 population of 217.9 thousand. General mobilization in Ukraine began after Russia’s February 2022 military operation. Initially, conscription applied to men aged 27–60. In 2024, President Zelensky lowered the minimum age to 25. In September, Strana.ua reported that authorities might further lower the conscription age to 18 and reduce exemption grounds, potentially affecting hundreds of thousands of men. The article states, 'Водитель Daewoo с места происшествия скрылся.' and 'Водитель Daewoo Lanos в Тернополе сбил двух военнослужащих', confirming the incident details.\nOriginal language: ru\nPublish date: September 28, 2025 02:27 PM\nSource:[РБК](https://www.rbc.ru/rbcfreenews/68d941689a7947ff598f1979)\n\n**Ukraine’s Ministry of Defense: 21,000 Citizens Abroad Registered for Military Service**\nNearly 21,000 Ukrainian citizens living abroad who came to renew their passports were placed on military registration, according to a statement by Verkhovna Rada deputy Alexey Goncharenko, who is listed by Russia as a terrorist and extremist.  The deputy cited a Ministry of Defense report and said that the number of people who applied for passport renewal was \"about 21 000\".  Since the nationwide mobilization was declared in February 2022 and has been repeatedly extended, a new law that came into force on 18 May 2024 requires all men of conscription age to update their data at a military enlistment office within 60 days of the law’s entry into force, regardless of whether they have a draft card or a deferment.  Ukrainians abroad began to mass‑apply at consulates for document re‑issuance under the old regulations, but starting in December 2024 they faced refusals if their data were not registered in the national military registry.  To be registered, they must personally visit a military enlistment office in Ukraine.  Goncharenko’s Telegram channel reported the 21 000 figure and referenced the Ministry of Defense’s report.\nOriginal language: ru\nPublish date: September 15, 2025 06:40 PM\nSource:[Ридус](https://www.ridus.ru/ukrainskij-minoborony--21-tys--grazhdan-za-granicej-vstali-na-uchet-694366.html)\n\n**Mobilization in September 2025 – Do Men Abroad Need to Update Their Data?**\nUkraine’s new mobilization law requires all men aged 25 to 60 who are deemed fit to update their personal data, undergo a medical examination (ВВК), and keep their military registration current. The same rules apply to Ukrainian men living abroad: without updated data they cannot obtain internal or foreign passports or access consular services. From April 2025, staff of foreign ‘Document’ offices will check a person’s military registration status in the registry; if data are missing, the system will automatically enter them and the individual will be registered electronically. In September 2024 Parliament passed bill No. 12076, amending the Law on Military Duty and Service, particularly regarding the registration of 17‑year‑olds. The bill has entered force: youths no longer need to pass a medical examination before registration; they must register between 1 January and 31 July of the year they turn 17. In July 2025 Ukraine introduced an automatic military registration system that integrates the ‘Obereg’ registry with the State Migration Service databases, allowing registration without queues, paperwork, or a medical commission. This system is especially relevant for men abroad and those aged 17 to 25.\nOriginal language: ru\nPublish date: September 09, 2025 05:37 AM\nSource:[24 Канал](https://24tv.ua/ru/mobilizacija-sentjabre-2025-nuzhno-li-muzhchinam-za-rubezhom_n2910527)\n\n**Young Ukrainians rushing to leave the country – border official (VIDEO)**\nYoung men aged 18‑22 are leaving Ukraine in large numbers after Kiev lifted its travel ban on that age group, a border official announced on Thursday. Earlier this month President Vladimir Zelensky ordered authorities to allow men 18‑22 to exit, reversing a February 2022 restriction that barred all men 18‑60 from travelling abroad. State Border Guard Service spokesman Andrey Demchenko said 'young people had already begun departing after the travel ban was lifted' and reported that large numbers were heading toward the Polish and Hungarian borders, causing traffic jams that have been widely publicized on social media. He confirmed that the first applicants had already completed the necessary paperwork at checkpoints and left the country. Prime Minister Yulia Svyrydenko announced the regulation on Tuesday, stating it would apply to all men in the age group, including those already abroad, and it took effect on Thursday, requiring those crossing the border to present a passport and military ID. Ukraine’s general mobilisation, which mandates all able‑bodied men aged 25‑60 to serve, has failed to offset ongoing battlefield losses and has reportedly led commanders to voice concerns over persistent manpower shortages. Ukrainian officials say nearly 400,000 servicemen have deserted, and many do not plan to return. Recruiters have resorted to using force to fill the ranks; videos of forced conscription posted on social media have fueled public anger. Many men have tried to flee across rivers or remote terrain, with border guards intercepting thousands and sometimes resorting to the use of firearms.\nOriginal language: en\nPublish date: August 28, 2025 03:58 PM\nSource:[rt.com](https://www.rt.com/russia/623634-young-ukrainians-fleeing-abroad/)\n\n**The State Must Trust: Why Zelensky Allowed Men 18‑22 to Travel Abroad**\nThe Ukrainian government issued a decree on 27 August 2025 that permits men aged 18‑22 to leave the country while military‑law is in force. The decree, effective 28 August, allows this group to travel abroad provided they possess a valid passport and a military‑accounting document, and they must register with the State Border Service. The measure does not apply to officials in state or local authorities, who may only travel on official missions. The decree was reportedly conceived by President Volodymyr Zelensky after discussions with Prime Minister Yulia Sviridenko and military leadership, who noted a decline in high‑school graduates and concerns that parents might lower the mobilization age.  The decision has sparked debate: some lawmakers, such as MP Alexander Merzhko of the “Sovereign Ukraine” party, argue it restores trust in citizens, while MP Andrey Osadchuk of the “Voice” party claims it is a political move to protect the front from young, fit soldiers.  Military officers expressed skepticism, citing potential illegal exit routes and the lack of incentives for returning.  The Ministry of Defence has not yet issued an official stance, and the General Staff has deemed public comments premature.  The decree is intended to prevent a mass exodus and encourage the return of young Ukrainians abroad, but critics warn it may not achieve these goals.\nOriginal language: ru\nPublish date: August 27, 2025 06:15 PM\nSource:[LIGA](https://www.liga.net/politics/articles/gosudarstvo-dolzhno-doveryat-pochemu-zelenskii-razreshil-vyezd-muzhchin-18-22-let-za-granitsu)\n\n**Men Ages 18‑22 Must Have Military Record to Exit Ukraine**\nOn 26 August 2025 the Cabinet of Ministers adopted amendments to the procedure for crossing the state border that allow men aged 18‑22 to travel abroad during martial law if they possess a passport and a military‑record document in paper or electronic form. The changes, announced by State Border Service spokesperson Andriy Demchenko, will take effect only after the decree is published on the official Government portal. The new rule does not apply to men 18‑60 who are subject to mobilization, nor to officials holding state or local government positions, who may travel only on official assignments. Border guards are required to verify the military‑record document, which can be issued in paper form or via the \"Reserve+\" app; failure to present it may result in a fine of 17‑25.5 k hryvnia. The amendment follows the 16 May 2024 decree № 560 that obliges border guards to check such documents, and the 24 February 2022 presidential decree that extended martial law until 5 November 2025. A draft law (№ 13685) introduced on 22 August 2025 proposes extending the age limit to 24 years for men not subject to mobilization. Demchenko said, 'Для перетину кордону чоловікам віком від 18 до 22 років необхідно мати паспортний документ, який дає право на виїзд за кордон, а також військово-обліковий документ у паперовій або електронній формі, який пред'являється за вимогою представника ДПСУ на пунктах пропуску.'\nOriginal language: uk\nPublish date: August 27, 2025 01:00 PM\nSource:[Lietuvos Radijas ir Televizija](https://www.lrt.lt/ua/novini/1263/2656625/cholovikam-do-22-kh-rokiv-dlia-viyizdu-z-ukrayini-bude-potriben-viis-kovo-oblikovii-dokument)\n\n**Travel Abroad for Men up to 22: New Decree Text with Rules**\nOn August 27 2025, the Ukrainian government issued a decree that expands the age group of men allowed to leave the country during the ongoing war. Men aged 18 to 22 inclusive now have unrestricted border crossing, while those holding positions in state authorities or local self‑government remain limited to official business. All travelers must carry a passport and a military‑registration document (paper or electronic) and present them at checkpoints upon request. The decree takes effect the day after its official publication. The change follows earlier discussions: in July 2023, Speaker Ruslan Stepanchuk noted that 18‑22‑year‑olds were not subject to mobilization but were restricted from leaving. On August 12 2025, President Volodymyr Zelensky announced a simplified procedure for this age group to maintain ties and educational opportunities. RBC‑Ukraine correspondent Fedir Veniyslavsky explained that the restrictions forced young Ukrainians to seek semi‑illegal routes to study abroad.\nOriginal language: ru\nPublish date: August 27, 2025 12:31 PM\nSource:[РБК-Украина](https://www.rbc.ua/ukr/news/viyizd-kordon-cholovikiv-22-rokiv-z-yavivsya-1756297899.html)\n\n**Ukraine Lowers Wartime Exit Restrictions, Allowing 18‑22‑Year‑Old Men to Leave**\nUkraine has relaxed wartime exit restrictions, allowing men aged 18‑22 to leave the country freely for the first time since the war began more than three years ago.  Prime Minister Yulia Svyrydenko announced the change on her Telegram channel on 26 August, stating that the new measure also applies to citizens currently abroad.  She said, '我們希望烏克蘭人能儘可能與祖國保持聯繫'.  The policy comes as the Verkhovna Rada reviews an amendment to formalise wartime exit rules, giving men below draft age more freedom.  Speaker Ruslan Stefanchuk had earlier criticised the existing policy as unfair, noting that 18‑25‑year‑old men were prohibited from studying abroad or reuniting with family; he said at a Kyiv youth forum, '我們必須找到一個機制，讓他們能夠行使這些權利'.  Since Russia’s full‑scale invasion on 24 February 2022, 18‑60‑year‑old men have generally been barred from leaving, with only limited exceptions such as having three or more minor children or a disabled child.  The military enlistment age is 25‑60, and since July 2024 all 18‑60‑year‑old men must carry military registration documents when crossing borders or encountering police checks.  Eurostat data cited in the article show that as of June 2025, about 4.3 million Ukrainians live in EU member states, roughly 1 million of whom are adult men.  In April 2024 the government suspended consular services for overseas 18‑60‑year‑old men, requiring them to return home to obtain passports and related documents.  President Zelensky reported in January 2025 that Ukraine has about 880,000 soldiers deployed for defence and combat, while Russia’s spring draft of 160,000 men is the largest since 2011.\nOriginal language: zh\nPublish date: August 27, 2025 02:07 AM\nSource:[The Epoch Times](https://www.epochtimes.com/b5/25/8/27/n14581907.htm)\n\n**Men 18‑22 Travel Abroad Law: Everything About the Legislation**\nThe article reports on a Ukrainian parliamentary initiative, first discussed in July 2025, to allow men aged 18‑22 to travel abroad. Ruslan Stefanchuk, the parliamentary speaker, explained that \"People 18 to 25 are not subject to mobilization, but they cannot exercise many of their rights…\" (article). On 12 August President Zelensky proposed simplifying border crossings for young Ukrainians, and on 18 August Prime Minister Yulia Sviridenko said that by 22 August the Cabinet could adopt a decree permitting such travel, but instead the Cabinet submitted a draft law that would impose up to three years of imprisonment for attempted illegal border crossing and 3‑5 years for conscripts, reservists or military personnel staying abroad during martial law (article). On 22 August Sviridenko confirmed that the Cabinet was still considering the issue and consulting with the military, noting that \"This is regulated by a Cabinet decree and does not require changes to the law…\" (article). Fedir Vynyslavskyi, a member of the National Security Committee, said the decision would be taken by the Council instead of the Cabinet. Draft law No. 13685 would allow men 18‑22 to leave Ukraine freely without additional reasons such as study; it would enable all 22‑year‑old men to travel, while those turning 23 would be excluded. The current mobilization law exempts men under 25 from conscription, creating an “absurd situation” where young people who left before adulthood fear returning (article). Ivan Tymochko, head of the reserve forces council, emphasized that the initiative aims to communicate with youth and find legal ways to keep them in Ukraine, noting that 18‑22 is a critical period for first higher‑education studies (article). Demographic data cited in the article show that, according to the UN, 5.6 million Ukrainians were abroad as of 1 July 2025, and the National Bank of Ukraine forecasts that about 200 000 will leave per year for the next two years, with a gradual return expected only in 2027 (article). Expert Elena Lybanoeva warned that allowing 18‑22‑year‑olds to travel could have negative consequences because there is no guarantee of return; she noted that mobilization age starts at 25 and expressed concern that young people may not return after studying or working abroad (article). The draft law has not yet passed its first reading, and its details remain unknown. The article also notes that, under current law, men 18‑60 with deferment or exemption can travel abroad, but must possess military registration documents; since the start of 2025 the State Border Service has detained over 13 000 people for attempted illegal border crossing (article).\nOriginal language: uk\nPublish date: August 25, 2025 01:55 PM\nSource:[Украинская сеть новостей](https://ua.korrespondent.net/articles/4810366-vyizd-za-kordon-cholovikiv-do-22-rokiv-vse-pro-zakon)\n\n**Men Under 24 May Be Allowed to Travel Abroad**\nA draft bill (№ 13685) has been filed in the Verkhovna Rada to lift the travel ban on men under 24 who are not subject to conscription.  Currently, men aged 18‑60 who are conscripted or called up are prohibited from leaving Ukraine, but those who are exempt from mobilization because they have not reached the conscription age of 25 are also barred from travel.  The bill would allow men who have not yet reached 25 to travel abroad, while keeping the ban for those who are 25 or older.  The proposal cites that many 18‑25‑year‑olds who work or study abroad for more than three years cannot return, and that families sometimes send 17‑year‑olds abroad to avoid future travel restrictions.  Deputies argue the restriction creates “serious obstacles” for young people’s return and “provokes attempts to circumvent the law.”  They also note that the bill would not threaten Ukraine’s defence readiness, and that it would preserve the current restriction for men who turn 25 in the current or following year.  The draft would amend Article 6 of the Law on the Order of Exit and Entry of Ukrainian Citizens, adding a clause that temporarily limits exit rights for conscripts, reservists and those exempt from mobilization due to age.  The proposal also adds a phrase to Article 11 that allows military personnel to leave on general terms unless otherwise specified by law.  The initiative follows a presidential decree by President Zelenskyy on allowing men under 22 to travel, but the related government resolution has not yet been tabled.  Prime Minister Yulia Sviridenko says the issue is being processed together with the armed forces.\nOriginal language: uk\nPublish date: August 25, 2025 11:31 AM\nSource:[dailylviv.com](https://dailylviv.com/news/sytuatsiyi-i-pryhody/cholovikam-do-24-rokiv-mozhut-dozvolyty-vyyizd-za-kordon-140074)\n\n**Traveling abroad during wartime: who are exempt from restrictions**\nDuring the state of war in Ukraine, military conscripts aged 18-60 are restricted from traveling abroad. However, there are exceptions for certain individuals, as defined by law. OBOZ.UA explains the details. In August 2025, the rules for men traveling abroad will remain unchanged. The list of categories allowed to temporarily leave Ukraine includes: individuals called up for mobilization, men deemed unfit for service due to health reasons, single parents of three or more children under 18, single fathers, men accompanying individuals with disabilities or those requiring constant care, individuals with minor children and a spouse serving in the military, men whose close relatives have been killed or gone missing during the war, and military personnel traveling abroad for treatment, rehabilitation, or training, as well as other categories specified in Article 23 of the Law of Ukraine 'On Mobilization Preparation and Mobilization'. The crossing of the border by men under 25 has changed. In late 2024, the Cabinet of Ministers updated the rules for men aged 18-25 who have signed a contract to serve in the Armed Forces or intelligence units of the Ministry of Defense but have not completed full-term military service (except for basic training). These individuals can cross the border if they have: a military unit or TCC document with information about the contract signing; and a military ID document confirming their service. The necessary documents for men traveling abroad include: a military ID document, which must be presented together with a passport, as well as: a disability certificate; documents for deferment; birth certificates for children; documents for education and other documents confirming the right to leave the country. The full list is specified in the Cabinet's Resolution No. 57 of January 27, 1995, taking into account the latest changes made during the state of war. Reasons for refusal to cross the border include: the absence of a military ID document; the lack of other documents confirming the right to leave the country; errors or discrepancies in the documents; and the individual being wanted. We remind you that the Verkhovna Rada is discussing an initiative that would allow military conscripts aged 18-24 to cross the border. However, it is too early to talk about any legislative norms. For now, it is unknown what the decision of the relevant committee of the VRU will be. As OBOZ.UA wrote earlier, Vladimir Zelensky stated that Ukraine is not considering demobilization of soldiers. In his words, defenders will return home after victory.\nOriginal language: uk\nPublish date: July 20, 2025 08:55 AM\nSource:[OBOZREVATEL](https://www.obozrevatel.com/ukr/novosti-obschestvo/viizd-za-kordon-pid-chas-voennogo-stanu-dlya-kogo-isnuyut-vinyatki.htm)\n\n",
    "date": "2025-10-01T01:19:33.689590",
    "summary": "Across all expert perspectives, there is strong consensus that Ukraine is highly unlikely to start revoking passports of military draft age men residing abroad before 2026. Experts from diplomatic, legal, area studies, and political science backgrounds all emphasize that while Ukraine has tightened consular restrictions and requires military registration for access to services, no credible reports or legislative moves suggest imminent mass revocation of existing passports. The primary factors driving down the probability are formidable legal, administrative, logistical, and diplomatic barriers; the lack of relevant democratic or European precedent; the potential for international and diaspora backlash; and the Ukrainian government’s explicit denials of such plans, often framing revocation rumors as disinformation. Analysts note that Ukraine’s restrictive actions to date focus on suspending services and denying renewals rather than invalidating already-issued passports, which is logistically difficult and potentially damaging to vital Western relationships and diaspora support. The only scenarios in which revocation might occur involve extreme battlefield or political crisis, none of which have clear precursors as of October 2025. The final probabilities assigned by the experts are uniformly low, ranging from 3% to 18%, with most clustering around 7–10%. The collective forecast is that, barring unforeseen catastrophic developments, Ukraine will not implement a nationwide or large-scale passport revocation policy for draft-age men abroad before January 1, 2026.",
    "forecasters": [
        "Diplomacy (ConsularPractice)",
        "ImmigrationLaw (CitizenshipRevocationStandards)",
        "Political Science (CivilMilitaryRelations)",
        "Political Science (StateCapacityTheory)",
        "International Law (CitizenshipLaw)",
        "International Law (ExtraterritorialJurisdiction)",
        "Area Studies Eastern Europe (PostSovietStatePolicy)"
    ]
}