{
    "deliberation_results": {
        "Global Health Governance (WHO Emergency Committee Procedures)": {
            "time_to_resolution": "Approximately 2.5 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Global Health Governance with a focus on WHO Emergency Committee procedures, my perspective is critical because PHEIC declarations are not triggered purely by epidemiological data but by a structured, semi-political process involving risk assessments, member state engagement, and the Director-General's discretion. Understanding historical base rates, procedural inertia, and the nuanced thresholds for 'extraordinary' events allows for more accurate estimation than relying solely on media or case data.",
            "status_quo": "No PHEIC has been declared for H5 avian influenza to date. WHO currently assesses the global public health risk from H5 as low for the general population and low-to-moderate for occupationally exposed persons, with no evidence of sustained human-to-human transmission. The vast majority of past avian influenza outbreaks have not resulted in a PHEIC declaration.",
            "perspective_derived_factors": [
                {
                    "factor": "Base Rate of PHEIC Declarations for Avian Influenza",
                    "effect": "Decreases probability. Despite regular H5 outbreaks in poultry, and sporadic zoonotic spillovers, no PHEIC has ever been declared for any H5 event. The WHO reserves PHEIC declarations for events with clear international human health implications and/or evidence of unusual spread."
                },
                {
                    "factor": "Current WHO Risk Assessment",
                    "effect": "Decreases probability. As of the latest available updates, WHO continues to rate the risk as low for the general population and has not indicated any threshold-crossing event. The absence of a major change in risk assessment is a strong indication against imminent declaration."
                },
                {
                    "factor": "Human-to-Human Transmission",
                    "effect": "Strongly decreases probability. The key procedural threshold for PHEICs in influenza is evidence of sustained human-to-human transmission or a significant, unusual cluster. There is currently no such evidence—thus, a major procedural barrier to declaration remains."
                },
                {
                    "factor": "International Spread and Political Pressure",
                    "effect": "Slightly increases probability. There is increased global concern (e.g., Suriname and PAHO workshops, Spanish and Brazilian outbreaks in poultry), and WHO is under greater scrutiny post-COVID-19. However, unless there are clear signals of significant cross-border human cases, political pressure alone is unlikely to suffice."
                },
                {
                    "factor": "New WHO Alert Level (Pandemic Emergency) Above PHEIC",
                    "effect": "Decreases probability. The recent adoption of a new higher alert category may make the threshold for PHEIC slightly harder to cross, as the bar for international alarm has been raised and attention may be focused on reserving PHEIC for intermediate events."
                },
                {
                    "factor": "Time Remaining",
                    "effect": "Decreases probability. With less than three months left, the window for a dramatic change in epidemiology and subsequent procedural response is narrowing."
                }
            ],
            "no_scenario": "H5 avian influenza continues to cause sporadic outbreaks in poultry and wild birds, with occasional zoonotic infections in people closely exposed to animals (e.g., farm workers). These cases remain isolated, with no evidence of sustained human-to-human transmission or large international clusters. WHO maintains its current low-to-moderate risk assessment and continues regular monitoring, but the Emergency Committee is not convened or, if convened, does not advise a PHEIC. No declaration is made before January 1, 2026.",
            "yes_scenario": "A cluster of human H5 infections emerges—possibly in a high-density, international transit region (e.g., a major Asian or Latin American city)—with credible evidence of limited human-to-human transmission. This triggers international concern, rapid convening of the Emergency Committee, and a recommendation for a PHEIC. The Director-General, in the context of recent pandemic preparedness reforms and political pressure to act preemptively, issues a PHEIC declaration before the end of 2025.",
            "final_reasoning": "The base rate for PHEIC declarations in avian influenza is essentially zero, even during significant animal outbreaks and sporadic zoonotic events. The WHO has made clear that the current risk is low, and there is no evidence of the key procedural trigger: sustained human-to-human transmission. The news articles confirm ongoing animal outbreaks and heightened preparedness activities, but do not report any change in risk assessment, unusual human clusters, or cross-border human transmission. The procedural bar for PHEIC is high and, with less than three months remaining, the likelihood of a sufficiently dramatic epidemiological shift plus the convening and completion of the Emergency Committee process in time for a 2025 declaration is low. Recent changes in WHO alert structure (adding a new 'pandemic emergency' level above PHEIC) may increase caution in making PHEIC declarations for events that do not reach a high international threshold. The Yes scenario would require an abrupt, unprecedented shift in either viral behavior or political calculus—neither of which is currently evident. Thus, the most likely outcome is no PHEIC declaration for H5 avian influenza before 2026.",
            "final_probability": 7
        },
        "Risk Assessment Infectious Diseases (Joint External Evaluation WHO)": {
            "time_to_resolution": "Approximately 2.5 months (until December 31, 2025)",
            "perspective_relevance": "As an expert in Risk Assessment Infectious Diseases and the WHO Joint External Evaluation (JEE) process, I am trained to systematically evaluate the likelihood of a PHEIC declaration by analyzing outbreak dynamics, zoonotic potential, surveillance data, international spread, and the decision-making processes and thresholds used by the WHO. My perspective emphasizes base rates of PHEIC declarations, the technical criteria in the IHR, and the current global risk assessment for avian H5 viruses.",
            "status_quo": "WHO has NOT declared H5 avian influenza a PHEIC. Historically, H5 outbreaks have led to significant poultry losses and sporadic zoonotic events, but no sustained human-to-human transmission. Current WHO risk assessment remains low to moderate for humans.",
            "perspective_derived_factors": [
                {
                    "factor": "Current WHO risk assessment for H5",
                    "effect": "Decreases probability. The latest WHO assessment notes low risk to the general public and low-to-moderate risk for occupationally exposed individuals. No evidence of efficient human-to-human transmission."
                },
                {
                    "factor": "Recent and ongoing animal outbreaks",
                    "effect": "Slightly increases probability. Large-scale outbreaks in poultry and wild birds (e.g., Brazil, Spain) raise concern, but this is not new. The virus remains highly pathogenic in birds but not yet in humans."
                },
                {
                    "factor": "International spread and surveillance",
                    "effect": "Neutral to slightly increases probability. There is growing international coordination (e.g., One Health workshops), but no evidence yet of cross-border human clusters or uncontrolled international spread."
                },
                {
                    "factor": "Mutation potential and mammalian cases",
                    "effect": "Slightly increases probability. WHO and experts remain vigilant due to increasing mammalian infections (e.g., US dairy cattle), which theoretically could allow adaptation, but so far no key mutations for human-to-human spread have emerged."
                },
                {
                    "factor": "PHEIC declaration base rate",
                    "effect": "Strongly decreases probability. Since 2005, PHEIC declarations are rare and usually triggered by clear international human transmission and/or major public health impact (e.g., H1N1 2009, COVID-19, Ebola, Zika, Mpox). H5 has never been declared a PHEIC despite decades of outbreaks."
                },
                {
                    "factor": "Recent change in WHO emergency levels",
                    "effect": "Slightly decreases probability. The new 'pandemic emergency' alert level may make PHEIC declarations less likely for events not meeting the new, higher bar, or may shift perceptions of what constitutes a PHEIC-worthy event."
                },
                {
                    "factor": "Time remaining until resolution",
                    "effect": "Slightly decreases probability. With only 2.5 months left, the window for a dramatic change is narrow. Significant human-to-human transmission or a major international event would need to arise and be recognized in this period."
                }
            ],
            "no_scenario": "H5 continues to circulate among birds and occasionally spills over to mammals or the rare human, but there is no evidence of sustained human-to-human transmission, major international public health impact, or disruption to travel/trade between now and the end of 2025. WHO maintains current risk assessment and does not convene (or does not recommend) a PHEIC declaration.",
            "yes_scenario": "A significant change occurs in the epidemiology of H5: either a cluster of human-to-human transmission is detected (especially if it crosses borders), or a major zoonotic spillover results in severe disease and international concern. This could prompt the Emergency Committee to recommend, and the Director-General to declare, a PHEIC before the end of 2025.",
            "final_reasoning": "The base rate for PHEIC for avian influenza is extremely low, with no precedent despite decades of outbreaks. The current WHO risk assessment is explicitly low for the general population, and no new evidence of human-to-human transmission or international spread in humans has emerged as of mid-October 2025. While surveillance and preparedness are being strengthened, especially in regions like Latin America, all signals point to a status quo scenario barring an unexpected, dramatic change. The new WHO emergency framework may even make a PHEIC declaration less likely absent clear evidence of extraordinary public health risk. Given the short time to resolution and the slow-changing nature of zoonotic risk, the probability is low but not zero, acknowledging the small risk of a late-year cluster or international event.",
            "final_probability": 6
        },
        "Epidemiology (Outbreak Investigation)": {
            "time_to_resolution": "About 2.5 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in epidemiology and outbreak investigation, my perspective is directly relevant to understanding how the WHO assesses emerging infectious disease threats, evaluates risks of international spread, and determines when an event rises to the threshold of a PHEIC. My expertise in zoonotic diseases, surveillance, risk assessment, and international health regulations enables a nuanced evaluation of the likelihood that H5 avian influenza will be escalated to a PHEIC in the next 2.5 months.",
            "status_quo": "The WHO currently assesses the public health risk from H5 avian influenza as low for the general public and low-to-moderate for occupationally exposed persons. There have been sporadic animal outbreaks with rare human cases, but no sustained human-to-human transmission or major international spread. The status quo is that no PHEIC has been declared for H5 avian influenza, and the threshold for such a declaration has not been met.",
            "perspective_derived_factors": [
                {
                    "factor": "Current epidemiology: Absence of sustained human-to-human transmission",
                    "effect": "Strongly decreases probability; the main trigger for a PHEIC would be evidence of efficient human-to-human transmission, which is not present."
                },
                {
                    "factor": "International animal outbreaks and economic impact",
                    "effect": "Marginally increases probability; widespread outbreaks in poultry/livestock have economic and food security impacts, but the PHEIC definition is oriented toward human health and international human spread."
                },
                {
                    "factor": "WHO's recent history and willingness to declare PHEICs",
                    "effect": "Slightly increases probability; WHO has shown willingness to declare PHEICs for outbreaks with international spread or new variants (e.g., mpox, Zika), sometimes with fewer human deaths than H5 could theoretically cause."
                },
                {
                    "factor": "Recent IHR/WHO regulatory changes (introduction of 'pandemic emergency')",
                    "effect": "Decreases probability; the new higher alert level ('pandemic emergency') could make PHEICs relatively less likely for situations that do not yet meet the pandemic threshold, and member state hesitancy (not all have adopted the new IHR) may slow decisive action."
                },
                {
                    "factor": "Rising animal cases and international preparedness efforts",
                    "effect": "Slightly increases probability; cross-border workshops, culling, and emergency protocols (e.g., in Spain, Brazil, Suriname) indicate international concern, but these are preemptive and not a response to an actual public health emergency."
                },
                {
                    "factor": "Base rate of PHEIC declarations for avian influenza",
                    "effect": "Decreases probability; despite repeated animal outbreaks and occasional human cases over decades, no H5 PHEIC has ever been declared."
                }
            ],
            "no_scenario": "Despite ongoing avian outbreaks and occasional spillover to humans, there is no significant cluster of human-to-human transmission, and international spread among humans does not occur. The WHO maintains its risk assessment as low, with no urgent international coordination beyond standard preparedness and response activities. The new IHR framework makes the threshold for PHEIC more explicit, and the event does not qualify.",
            "yes_scenario": "A cluster of human H5 cases emerges, possibly with limited evidence of human-to-human transmission (e.g., among family members or healthcare workers), or a significant mutation is detected that raises pandemic fears. International concern grows, travel advisories are issued, and the WHO, prompted by public pressure and precaution, convenes the Emergency Committee and declares a PHEIC to mobilize resources and coordination.",
            "final_reasoning": "The evidence as of mid-October 2025 points to a continued pattern of high animal morbidity/mortality from H5 avian influenza, with rare but closely monitored human cases and no clear evidence of sustained human-to-human transmission. The base rate for H5 PHEIC declarations is zero, despite decades of outbreaks. The WHO's latest risk assessment remains low. While international preparedness is increasing, and workshops and emergency protocols are being activated in some regions, these are precautionary rather than reactive to a new public health threat. The new IHR regulations (with a higher alert level above PHEIC) and only 2.5 months left before resolution further reduce the likelihood. A scenario in which this changes rapidly is not impossible, but would likely require a significant and highly publicized change in the epidemiological situation (such as a confirmed human-to-human cluster), for which there is no current evidence. Therefore, while the probability is not zero, it is low and only slightly above the historical base rate due to heightened global vigilance and recent regulatory changes.",
            "final_probability": 7
        },
        "Epidemiology (Pandemic Phases WHO)": {
            "time_to_resolution": "Approximately 2.5 months (until Dec 31, 2025)",
            "perspective_relevance": "As an epidemiologist specializing in pandemic phases and WHO criteria for declaring a PHEIC, I am equipped to assess zoonotic threats, international transmission risks, and the operational and political context influencing WHO declarations. I can critically analyze virus evolution, animal-to-human spillover, and the likelihood of a shift to human-to-human transmission, as well as historical precedents and the practicalities of triggering global alerts.",
            "status_quo": "WHO has not declared any H5 avian influenza subtype a PHEIC. H5 remains primarily an animal health issue with sporadic, non-sustained human infections and no evidence of efficient human-to-human transmission.",
            "perspective_derived_factors": [
                {
                    "factor": "Current Epidemiology of H5 viruses",
                    "effect": "Decreases probability. As of October 2025, there are ongoing avian outbreaks (notably in Europe and Latin America), rare human cases, and no evidence of sustained human-to-human transmission. The WHO continues to assess risk to the general population as 'low', with only low-to-moderate risk for occupational exposure."
                },
                {
                    "factor": "International spread and cross-border concern",
                    "effect": "Slightly increases probability. The virus is widely distributed in the poultry sector, with cross-continental outbreaks, but these remain primarily animal health emergencies. No major clusters in humans have triggered global alarm."
                },
                {
                    "factor": "Mutation and pandemic potential",
                    "effect": "Increases probability, but only marginally. There is persistent scientific concern about the risk of H5 mutating to become more transmissible in humans. Workshops and One Health initiatives (e.g., Suriname, Caribbean) underscore global anxiety, but no evidence of such a shift as of now."
                },
                {
                    "factor": "WHO historical base rate for PHEIC declarations",
                    "effect": "Decreases probability. PHEICs are rare (e.g., only a handful in the last decade: COVID-19, Ebola, Zika, mpox). There is a high threshold: significant international spread, severe human disease, and a need for coordinated response."
                },
                {
                    "factor": "Recent changes to WHO International Health Regulations (IHR)",
                    "effect": "Ambiguous, but likely neutral to negative for H5 in 2025. The new IHR introduces a 'pandemic emergency' above PHEIC, but does not lower the bar for PHEIC. Also, not all countries (including the US) have adopted the new IHR, so the definition for a PHEIC remains unchanged for operational purposes."
                },
                {
                    "factor": "Media, political, and scientific pressure",
                    "effect": "Slightly increases probability. There is heightened sensitivity to zoonotic threats post-COVID and mpox, with increased advocacy for preparedness, but WHO has not signaled imminent concern for H5 specifically."
                },
                {
                    "factor": "Vaccine and countermeasure availability",
                    "effect": "Decreases probability. While candidate vaccines exist for H5, there is no urgent scramble for mass production or deployment as seen in prior PHEICs."
                },
                {
                    "factor": "Time remaining until resolution",
                    "effect": "Decreases probability. With only about 2.5 months left in 2025, the window for a major shift and subsequent WHO action is short."
                }
            ],
            "no_scenario": "H5 continues to cause large outbreaks in poultry and some wild birds, with sporadic spillovers to humans (typically those with direct animal contact), but without evidence of efficient human-to-human transmission. WHO continues to monitor and issue technical guidance, but does not escalate to a PHEIC. Public health response remains largely national/local, with international coordination focused on animal health.",
            "yes_scenario": "A sudden mutation in H5N1 or another H5 subtype results in multiple, geographically dispersed clusters of human cases with evidence of sustained human-to-human transmission, or a single large-scale human outbreak with international spread and severe health outcomes. The WHO, prompted by mounting evidence and international concern, convenes an Emergency Committee and the Director-General declares a PHEIC before the end of 2025.",
            "final_reasoning": "While there is ongoing alarm regarding avian influenza—especially H5—with significant outbreaks in poultry and wild birds and occasional (but rare) human infections, the core epidemiological criteria for a PHEIC (sustained or efficient human-to-human transmission, major international spread in humans, or urgent need for a coordinated international response) have not been met. The base rate for PHEIC declarations is low, and the status quo has been stable for years, despite mounting animal cases. The risk of a sudden, high-impact mutation is nonzero but low, and with only a short time until year-end, the probability of a qualifying event plus the time for the WHO to react and declare a PHEIC is even lower. There is some upward pressure from recent regulatory changes and increased global sensitivity to zoonotic threats, but not enough to change the fundamental outlook. Absent a dramatic epidemiological shift in the next few months, a declaration is unlikely.",
            "final_probability": 7
        },
        "Public Health Policy (International Health Regulations WHO)": {
            "time_to_resolution": "2.5 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Public Health Policy and International Health Regulations (IHR, WHO), my perspective is directly relevant. IHR procedures, the PHEIC criteria, and recent amendments (including the new 'pandemic emergency' alert level) shape how and when the WHO declares emergencies. I have deep familiarity with the technical, political, and procedural factors influencing such declarations, as well as base rates and precedent for avian influenza and other zoonotic threats.",
            "status_quo": "No PHEIC has been declared for H5 avian influenza as of October 15, 2025. Despite notable outbreaks in poultry and some sporadic mammal and rare human infections, the WHO currently assesses the risk to the general public as low. The virus is not transmitting efficiently between humans, and no major international spread or major disruption to travel has occurred.",
            "perspective_derived_factors": [
                {
                    "factor": "Base Rate for Avian Influenza PHEICs",
                    "effect": "Decreases probability. Despite decades of H5 outbreaks, the WHO has never declared a PHEIC for avian influenza, even during events with significant poultry losses and occasional human cases. This reflects a high bar for escalation absent sustained human-to-human transmission."
                },
                {
                    "factor": "Current Zoonotic & Human Health Risk Assessment",
                    "effect": "Decreases probability. WHO and CDC still assess risk to general human population as low, given lack of efficient human transmission."
                },
                {
                    "factor": "New IHR Alert Structure (Pandemic Emergency Above PHEIC)",
                    "effect": "Decreases probability. With 'pandemic emergency' now being the highest WHO alert (PHEIC is now second-tier), there may be a higher bar for PHEICs unless there is clear international risk and need for coordinated response. Also, recent high-profile PHEICs (COVID-19, Mpox) may make the WHO more cautious about overusing the label."
                },
                {
                    "factor": "International Spread in Poultry and Mammals",
                    "effect": "Slightly increases probability. Large outbreaks in poultry and mammals across continents increase the risk of mutation and international concern, raising pressure for preparedness—but not yet for a PHEIC."
                },
                {
                    "factor": "Absence of Sustained Human-to-Human Transmission",
                    "effect": "Strongly decreases probability. The key threshold for a PHEIC in zoonotic diseases is usually efficient human-to-human spread. Without this, precedent suggests the WHO will not declare a PHEIC."
                },
                {
                    "factor": "Recent WHO Activity/Workshops & One Health Preparedness",
                    "effect": "Neutral or slightly increases probability. Active international workshops (like in Suriname) and global concern show awareness and planning, but are not indicators of imminent PHEIC unless situation escalates."
                },
                {
                    "factor": "Political/Procedural Factors (Recent Amendments, US Non-Participation)",
                    "effect": "Slightly decreases probability. The new IHR amendments, with some countries (including the US) not participating, may complicate and slow consensus for new emergency declarations."
                }
            ],
            "no_scenario": "Despite ongoing outbreaks in poultry and some mammalian spillover events (e.g., cattle in the US, sporadic human cases), there is no evidence of efficient human-to-human transmission by the end of 2025. The WHO continues to monitor and issue technical guidance, countries cull animals and enact border controls as needed, but risk to international public health is deemed manageable without global coordination. No PHEIC is declared.",
            "yes_scenario": "A significant mutation in H5 emerges, leading to multiple clusters of human-to-human transmission in at least two countries, with evidence of international travel-related spread. Hospitals begin to see severe or fatal cases, there is disruption to travel/trade, and national health systems request WHO coordination. The Emergency Committee meets and recommends a PHEIC, which the Director-General declares before January 2026.",
            "final_reasoning": "The most powerful base rate is that the WHO has never declared a PHEIC for avian influenza despite repeated global poultry outbreaks and occasional human cases over the past 20+ years. Current risk assessments from WHO, CDC, and regional authorities continue to describe the public risk as low, as H5 viruses have not acquired mutations for efficient human-to-human spread. The new IHR regulations actually raise the bar for what is considered a global emergency, and PHEIC is now a second-tier alert. While international spread in animals increases vigilance, there is no evidence of the critical threshold (sustained human-to-human transmission) being met. Workshops and preparedness efforts are prudent but not signals of imminent emergency declaration. The window until January 1, 2026, is short—only 2.5 months. For Yes to resolve, there would need to be a rapid and dramatic shift in epidemiology, which is not indicated by current data. Therefore, the probability should be low, but not zero: rare, sudden zoonotic jumps have occurred before, and the WHO is under pressure to act decisively if a pandemic seems likely. I estimate the probability at 7%.",
            "final_probability": 7
        },
        "Public Health Policy (One Health Approach)": {
            "time_to_resolution": "Approximately 2.5 months (question closes December 31, 2025).",
            "perspective_relevance": "As an expert in Public Health Policy, particularly the One Health approach, I bring a comprehensive understanding of the interconnectedness of human, animal, and environmental health. This is directly relevant to H5 avian influenza due to its zoonotic nature and the role of animal (especially avian and, increasingly, mammalian) reservoirs. My expertise allows me to assess both the public health risk and the international policy dynamics that inform PHEIC declarations.",
            "status_quo": "The WHO currently assesses the risk of H5 avian influenza to the general human population as low, and there is no evidence of sustained human-to-human transmission. PHEIC has not been declared for H5 viruses to date, despite ongoing animal outbreaks and sporadic human cases.",
            "perspective_derived_factors": [
                {
                    "factor": "Current epidemiology of H5 in animals",
                    "effect": "Increases probability slightly. High pathogenicity and large-scale outbreaks in birds and some mammals (e.g., cattle in the U.S., outbreaks in Brazil and Spain) increase surveillance and concern, but without major jumps to humans."
                },
                {
                    "factor": "Human health risk and transmission",
                    "effect": "Decreases probability. Human cases are rare, and there is no evidence of efficient human-to-human transmission at this time, which is a key trigger for PHEIC declarations."
                },
                {
                    "factor": "International spread and impact on travel/trade",
                    "effect": "Neutral to slight increase. There have been trade impacts (e.g., poultry export bans), but these are standard for avian influenza and do not yet rise to the level of requiring a PHEIC."
                },
                {
                    "factor": "WHO institutional behavior and recent IHR changes",
                    "effect": "Decreases probability. The new IHR regulations have introduced a higher alert category ('pandemic emergency'), making PHEIC a relatively less drastic step, but the threshold for PHEIC remains high in practice."
                },
                {
                    "factor": "One Health awareness and preparedness activities",
                    "effect": "Slight increase. Heightened One Health preparedness (e.g., Suriname and regional workshops) suggests concern, but also that systems are being strengthened, possibly reducing the need for emergency declaration."
                },
                {
                    "factor": "Base rates of PHEIC declarations for zoonotic influenzas",
                    "effect": "Decreases probability. Historically, PHEIC has not been declared for avian influenza outbreaks lacking human-to-human transmission, even during large animal epizootics."
                },
                {
                    "factor": "Potential for viral mutation/adaptation",
                    "effect": "Small increase. There is always a nonzero risk of adaptation for human-to-human transmission, but no evidence this has occurred or is imminent."
                }
            ],
            "no_scenario": "Despite ongoing H5 epizootics in birds and some mammal spillover (e.g., cattle, limited wild mammals), no significant increase in human infections is observed. Human cases remain sporadic, with no clusters or evidence of efficient human-to-human transmission. International trade and travel are affected only at the local level. The WHO continues to monitor and advise preparedness, but the situation does not escalate to PHEIC. This matches the pattern of previous years.",
            "yes_scenario": "A major development occurs: either a sudden cluster of human H5 cases with evidence of limited human-to-human transmission (especially outside close contacts), or a multi-country outbreak in mammals that raises risk assessments substantially. International spread or severe economic disruptions prompt the WHO Emergency Committee and Director-General to declare a PHEIC to coordinate global response, even if efficient human transmission is only suspected but not confirmed.",
            "final_reasoning": "The status quo is strongly against a PHEIC declaration: H5 viruses are causing significant animal health and economic impacts and have prompted One Health preparedness activities, but human cases remain rare and there is no indication of efficient human-to-human transmission. The WHO's own risk assessment (as of the latest available) still rates public risk as low. While recent regulatory changes (IHR) lower the relative status of PHEIC, institutional inertia and base rates for avian influenza PHEICs suggest high thresholds remain in practice. The recent increase in animal outbreaks, trade impacts, and One Health attention slightly raise the risk, but there is no strong signal of an imminent threshold-crossing event. The most likely scenario is ongoing vigilance, with no PHEIC barring a sudden and dramatic epidemiological shift. Thus, while the risk is not zero and should be monitored closely, it remains substantially less than a coin flip.",
            "final_probability": 13
        },
        "Virology (Viral Pathogenicity)": {
            "time_to_resolution": "Approximately 2.5 months (question resolves 2026-01-01, today is 2025-10-15)",
            "perspective_relevance": "As a virologist specializing in viral pathogenicity, my expertise is crucial for assessing the likelihood of an H5 avian influenza virus event reaching the thresholds for a PHEIC. I can integrate knowledge of viral mutation rates, host adaptation, zoonotic spillover, and historical precedents for WHO declarations. This perspective allows me to objectively analyze current virological and epidemiological evidence for the risk of avian influenza escalating to a true global public health threat.",
            "status_quo": "H5 avian influenza causes severe outbreaks in poultry and wild birds globally, with sporadic but rare and mostly zoonotic human cases. As of now, there is no sustained human-to-human transmission, and WHO currently assesses the public health risk to the general population as low. The status quo is that H5 outbreaks are managed mainly as an animal health concern, with heightened surveillance, but no PHEIC declaration.",
            "perspective_derived_factors": [
                {
                    "factor": "Viral Mutations and Host Adaptation",
                    "effect": "Increases probability if H5 acquires mutations facilitating mammalian/human transmission. Current evidence indicates this has not yet occurred (per WHO and CDC risk assessments), so this factor currently weighs towards the status quo."
                },
                {
                    "factor": "Incidence of Human Infection and Human-to-Human Transmission",
                    "effect": "Increases probability if there is a significant rise in human cases, especially clusters or evidence of sustained human-to-human transmission. As of now, human cases remain sporadic and linked to animal exposure."
                },
                {
                    "factor": "International Spread and Trade Impact",
                    "effect": "Increases probability if outbreaks in animals cause significant cross-border trade disruption or if international spread is detected beyond poultry. The recent news shows culling and trade bans (e.g., in Brazil and Spain), but these are within the expected for H5 outbreaks and have not yet prompted a global coordinated response."
                },
                {
                    "factor": "WHO and Global Health Governance Precedents",
                    "effect": "Decreases probability: WHO is cautious in declaring PHEICs for avian influenza unless there is evidence of a novel public health risk, e.g., sustained human transmission, major international spread among humans, or severe travel/trade disruption. The new IHR amendments create an even higher alert category than PHEIC, making the threshold for PHEIC alone less exceptional."
                },
                {
                    "factor": "Global Health Attention and Competing Priorities",
                    "effect": "Decreases probability: With ongoing COVID-19 waves, mpox management, and other zoonotic threats, WHO may reserve PHEIC declarations for truly exceptional events. Unless H5 presents a clear, new, and urgent threat to human health, the tendency will be to maintain current surveillance and response."
                },
                {
                    "factor": "Preparedness and One Health Initiatives",
                    "effect": "Neutral to slightly decreasing: Multiple countries are running preparedness workshops and improving cross-sectoral surveillance, which increases early detection but also means that unless a drastic change occurs, existing systems are deemed adequate for the threat level."
                }
            ],
            "no_scenario": "H5 avian influenza continues to cause severe outbreaks in birds with sporadic zoonotic spillover to humans, but with no clusters, no or minimal human-to-human transmission, and no major international public health disruption. WHO continues to monitor and issue guidance but does not declare a PHEIC as the threshold for 'extraordinary event' and international spread among humans is not met.",
            "yes_scenario": "A sudden rise in human H5 cases is detected, including clusters suggestive of possible limited or sustained human-to-human transmission, or a dramatic and highly publicized animal outbreak causes significant international trade/travel disruptions and WHO judges that a coordinated international response is required. Alternatively, a new mutation is reported that raises the risk assessment and prompts a precautionary PHEIC.",
            "final_reasoning": "Base rates for WHO PHEIC declarations for avian influenza are low; prior H5 outbreaks, even with large animal die-offs and occasional human cases, have not triggered a PHEIC. The most recent WHO and CDC assessments emphasize that, despite ongoing outbreaks in birds and some mammals (notably U.S. cattle), the risk to humans remains low, with no evidence for efficient human-to-human transmission. The international response to current outbreaks remains focused on animal health measures and trade management. While the news shows ongoing concern and preparedness (e.g., Suriname's One Health workshops), there is no report of a fundamental change in the virological or epidemiological situation. The introduction of a new, higher 'pandemic emergency' category by the WHO could also make a PHEIC less likely unless there is major escalation. With only 2.5 months left and no sign of a tipping point, the probability of a PHEIC declaration before 2026 remains low, barring a very sudden and major development.",
            "final_probability": 7
        },
        "Virology (Zoonotic Spillover)": {
            "time_to_resolution": "About 2.5 months (question closes Dec 31, 2025; today is Oct 15, 2025)",
            "perspective_relevance": "As an expert in virology, specifically zoonotic spillover, I bring a detailed understanding of how avian influenza viruses, particularly H5 subtypes, cross species barriers, mutate, and pose risks for human infection and global spread. My expertise allows me to critically evaluate the likelihood of H5 acquiring the necessary mutations or reassortments for efficient human-to-human transmission within the remaining timeframe, as well as to assess the WHO's historical thresholds for declaring a PHEIC based on zoonotic virus activity.",
            "status_quo": "No H5 subtype has been declared a PHEIC by the WHO as of today. Human infections remain rare, mostly occupational, and there is no sustained human-to-human transmission. The global risk is currently assessed as low to moderate for exposed groups, low for the general population.",
            "perspective_derived_factors": [
                {
                    "factor": "Current epidemiology of H5 in animals and humans",
                    "effect": "Decreases probability. Despite ongoing outbreaks in poultry (e.g., Spain, Brazil) and rare human cases, there is no evidence for efficient human-to-human transmission. This is a critical threshold for escalation to PHEIC for influenza."
                },
                {
                    "factor": "Viral evolution and risk of spillover",
                    "effect": "Slightly increases probability. H5 is enzootic in birds, has shown capacity to infect mammals, and there is always a nonzero risk of sudden adaptation, but no evidence of major genetic shift has been reported recently."
                },
                {
                    "factor": "WHO risk assessment and historical PHEIC declarations",
                    "effect": "Decreases probability. WHO's recent assessments maintain that the risk is low and there is no indication of imminent change; historically, PHEICs for flu have required clear evidence of sustained human-to-human transmission or major international impact."
                },
                {
                    "factor": "Surveillance and international response",
                    "effect": "Decreases probability. There is heightened global surveillance and preparedness (as evidenced by Suriname's One Health workshop), but most countries are responding with preemptive measures rather than crisis management, indicating that the situation is not perceived as extraordinary."
                },
                {
                    "factor": "Recent changes in WHO Health Emergency alert system",
                    "effect": "Slightly increases probability. The new IHR allows for a higher 'pandemic emergency' category above PHEIC, but this does not lower the threshold for PHEIC itself. It may, however, affect public and organizational sensitivity to outbreaks."
                },
                {
                    "factor": "Time remaining",
                    "effect": "Decreases probability. With less than three months left in 2025, the window for a dramatic shift is closing unless a major unforeseen event occurs."
                }
            ],
            "no_scenario": "Avian influenza continues to cause severe outbreaks in poultry with occasional spillover into mammals or isolated human cases (primarily among those working with poultry or livestock). No evidence emerges of efficient human-to-human transmission, and the WHO maintains its current risk assessment. International travel and trade disruptions are managed at the national level. No PHEIC is declared by December 31, 2025.",
            "yes_scenario": "A sudden increase in human H5 cases is detected, possibly with genetic evidence of mutations facilitating human-to-human transmission (e.g., changes in HA or PB2 genes), or a cluster of unexplained human cases with epidemiological links appears in a country with ongoing animal outbreaks. The WHO convenes an emergency committee, and given the potential for international spread and disruption, declares a PHEIC before year-end.",
            "final_reasoning": "Base rates for PHEIC declarations for zoonotic flu are very low—no avian influenza subtype has ever received a PHEIC despite decades of concern. Historically, PHEICs are declared for viruses that have already demonstrated human-to-human spread with international implications (e.g., COVID-19, Zika, Mpox). While there are ongoing H5 outbreaks in animals and rare human spillover, there is no evidence of significant genetic change or epidemiological pattern indicating an imminent pandemic risk. WHO continues to assess the overall risk as low for the general population. The international preparedness activities described in the news are preemptive and not in response to a crisis. Only a dramatic, rapid shift in the situation—such as a cluster of human-to-human transmissions with severe disease—would likely push the WHO to declare a PHEIC in the remaining time. Given the short time to resolution and the absence of such signals, the probability is low but not zero.",
            "final_probability": 7
        }
    },
    "deliberation_probability": [
        7,
        6,
        7,
        7,
        7,
        13,
        7,
        7
    ],
    "deliberation_mean_probability": 7.625,
    "deliberation_sd": 2.1998376563477846,
    "deliberation_probability_result": 8,
    "group_results": {
        "globalHealthGovernanceWhoEmergencyCommitteeProcedures": {
            "forecaster_to_engage": "Public Health Policy (One Health Approach)",
            "response_type": "critique",
            "response": "While your forecast appropriately notes the importance of animal outbreaks and One Health preparedness in shaping global vigilance, your assignment of a 13% probability appears high given the lack of any precedent for a WHO PHEIC declaration on H5 avian influenza and the absence of key procedural triggers (notably, confirmed or credible suspected human-to-human transmission). One Health approaches certainly raise global preparedness and may increase the speed of international response, but they do not lower the threshold for a PHEIC declaration, which remains tightly linked to demonstrable international public health risk in humans. With only a few months left, the probability of a dramatic enough shift to both change the epidemiological situation and allow time for the full Emergency Committee process is very low. Thus, while ongoing animal outbreaks and workshops are notable, they do not warrant nearly doubling the probability compared to other well-justified evidence-based estimates."
        },
        "riskAssessmentInfectiousDiseasesJointExternalEvaluationWho": {
            "forecaster_to_engage": "Public Health Policy (One Health Approach)",
            "response_type": "critique",
            "response": "Your forecast gives appropriate weight to increased animal outbreaks and One Health activities, but the 13% probability appears overstated given the current evidence and history. The One Health approach improves surveillance and cross-sectoral preparedness, yet the criteria for PHEIC remain bound to human epidemiology—primarily the emergence of sustained human-to-human transmission or clear evidence of international human spread. No such signals are present, and the base rate for H5 PHEIC declarations is zero, even during periods of intense animal and sporadic zoonotic activity. The new IHR regulations arguably further raise the bar for a declaration. While One Health may speed up detection and coordination, it has not historically shifted the threshold for PHEICs. Thus, in the absence of a dramatic and rapid epidemiological shift, a probability nearly twice as high as other well-justified estimates seems to overstate the risk."
        },
        "epidemiologyOutbreakInvestigation": {
            "forecaster_to_engage": "Virology (Viral Pathogenicity)",
            "response_type": "defense",
            "response": "Your reasoning is robust and well-aligned with the available data and historical precedent. You correctly anchor your probability to the base rate—no H5 PHEIC declaration despite decades of concern and outbreaks—and factor in both the current risk assessments and recent regulatory changes at WHO. Notably, you accurately highlight that the new 'pandemic emergency' category could make PHEIC declarations less likely absent clear escalation. Your assessment that ongoing animal outbreaks and preparedness do not equate to imminent international public health emergency is sound, and your probability is appropriately low, reflecting the slow pace of zoonotic evolution and the short time to resolution. This evidence-based conservatism is justified in the absence of new signals indicating a shift in the risk landscape."
        },
        "epidemiologyPandemicPhasesWho": {
            "forecaster_to_engage": "Virology (Zoonotic Spillover)",
            "response_type": "defense",
            "response": "Your forecast is well-justified: you correctly emphasize the crucial point that PHEIC declarations for zoonotic influenza have never occurred, even in the face of substantial animal outbreaks and rare human infections over decades. You accurately note that the WHO requires clear evidence of sustained human-to-human transmission with international implications—criteria not currently met by H5. Your discussion of international preparedness activities as preemptive, rather than reactive to a genuine human health crisis, is sound. You also properly weight the extremely short time frame remaining, which makes a sudden shift unlikely to both occur and be formally recognized by the WHO. Thus, your low but nonzero probability is well-calibrated given historical base rates, current surveillance, and procedural realities."
        },
        "publicHealthPolicyInternationalHealthRegulationsWho": {
            "forecaster_to_engage": "Epidemiology (Outbreak Investigation)",
            "response_type": "defense",
            "response": "Your forecast appropriately integrates both the historical base rate (zero precedent for H5 PHEIC) and the current lack of critical epidemiological signals, such as sustained human-to-human transmission or major international spread in humans. You correctly contextualize the impact of new IHR regulations and the limited timeframe for a procedural response, highlighting that, while vigilance is warranted, the likelihood of a major change and subsequent declaration is very low. Your assessment is evidence-based and avoids overreacting to precautionary preparedness measures, making your low probability well-supported and in line with both precedent and the current risk landscape."
        },
        "publicHealthPolicyOneHealthApproach": {
            "forecaster_to_engage": "Risk Assessment Infectious Diseases (Joint External Evaluation WHO)",
            "response_type": "defense",
            "response": "Your forecast is strongly grounded in the historical and empirical base rate: despite decades of H5 outbreaks with sporadic zoonotic spillovers, a PHEIC has never been declared for avian influenza. You appropriately highlight the lack of new evidence for human-to-human transmission, and you correctly note that the new IHR 'pandemic emergency' tier may further raise the bar for a PHEIC. You also make a sound case that, while global attention and One Health preparedness are increasing, these do not equate to the kind of extraordinary, cross-border human health event required for a PHEIC. Your probability is appropriately conservative given the short time to resolution and the absence of any sign of a dramatic shift in the epidemiological situation. This methodical, base-rate-driven reasoning is the correct approach for a low-probability, high-impact scenario like this."
        },
        "virologyViralPathogenicity": {
            "forecaster_to_engage": "Public Health Policy (One Health Approach)",
            "response_type": "critique",
            "response": "Your forecast is thoughtful in recognizing the role of One Health preparedness and recent increases in animal outbreaks, yet your probability is meaningfully higher than other expert estimates. While One Health initiatives may boost surveillance and readiness, the threshold for a PHEIC declaration remains tightly bound to extraordinary risk to human health, particularly evidence of sustained human-to-human transmission or explosive international human spread. No such signals are present in the current data, and the base rate for H5 PHEICs is zero, even in the face of prior large-scale animal outbreaks and zoonotic events. The new IHR structure also arguably raises, not lowers, the bar for a PHEIC. Without concrete evidence of an imminent shift to human pandemic potential, assigning a probability nearly double that of other evidence-based forecasts appears to overstate the real risk."
        },
        "virologyZoonoticSpillover": {
            "forecaster_to_engage": "Global Health Governance (WHO Emergency Committee Procedures)",
            "response_type": "defense",
            "response": "Your reasoning is clear and appropriately cautious, accurately reflecting both the historical base rate for H5 avian influenza PHEIC declarations (zero) and the procedural realities of the WHO Emergency Committee. You rightly emphasize that, while animal outbreaks and preparedness activities abound, the absence of sustained human-to-human transmission remains the critical barrier to a PHEIC. Furthermore, your argument that the recent addition of a higher 'pandemic emergency' alert tier could make the committee even more conservative about triggering a PHEIC is well taken. The low probability you assign is thus well-justified; it captures the inertia of international health governance and the high bar required for a PHEIC, especially with such a short window remaining in 2025."
        }
    },
    "revision_results": {
        "Global Health Governance (WHO Emergency Committee Procedures)": {
            "my_phase1_final_probability": 7,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, particularly the critique of the higher 13% estimate and the general convergence of expert opinion around a low single-digit probability, my initial probability remains well-supported. All forecasters highlighted the absence of sustained human-to-human transmission, the high procedural threshold for PHEIC, and the extremely low historical base rate for such declarations on H5, even amid widespread animal outbreaks. While One Health preparedness and international concern are increasing, these are precautionary rather than reactive to a changed risk landscape. No new evidence or line of reasoning emerged in the group deliberation to justify increasing the probability, and the slight differences in estimates reflect minor weighting differences in the impact of preparedness activities versus procedural inertia. Therefore, I maintain my original probability.",
            "revised_probability": 7
        },
        "Risk Assessment Infectious Diseases (Joint External Evaluation WHO)": {
            "my_phase1_final_probability": 6,
            "reasoning_for_revised_probability": "After reviewing group deliberation and the reasoning of other forecasters, I find that the consensus is strong: the base rate for a WHO PHEIC declaration on H5 avian influenza is near zero, and there is broad agreement that no procedural or epidemiological threshold has been crossed. The only outlier was the Public Health Policy (One Health Approach) forecast at 13%, which, upon critique, does not present compelling new evidence to justify a higher probability. The additional perspectives reinforce the lack of any rapid upward drivers in the short time remaining. There is no substantive new risk signal or procedural change that would warrant increasing my estimate. In fact, the group consensus strengthens confidence in a low probability—but not absolute zero—due to the tiny residual risk of a late dramatic development. I therefore maintain my initial probability.",
            "revised_probability": 6
        },
        "Epidemiology (Outbreak Investigation)": {
            "my_phase1_final_probability": 7,
            "reasoning_for_revised_probability": "After reviewing both my initial forecast and the group deliberation, I find that the consensus among forecasters with expertise in global health governance, infectious disease risk assessment, virology, and public health policy solidly supports a low probability for a PHEIC declaration on H5 avian influenza before 2026. The only outlier—a 13% probability from the One Health perspective—was critiqued for overweighting animal outbreaks and preparedness activities, which do not directly alter the fundamental procedural threshold for a PHEIC, which is primarily linked to human epidemiology. The group’s arguments reinforce the extremely low base rate, the absence of human-to-human transmission, and the short time to resolution. No new arguments or data emerged to suggest an increased likelihood. Therefore, I maintain my initial probability.",
            "revised_probability": 7
        },
        "Epidemiology (Pandemic Phases WHO)": {
            "my_phase1_final_probability": 7,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, there is a clear consensus among diverse expert perspectives—spanning virology, epidemiology, global health governance, and public health policy—anchoring their probabilities closely to the historical base rate (6–7%), with careful justification based on both risk assessment and WHO procedural thresholds. Critiques of the one outlier (13%) demonstrate that increased One Health preparedness and international workshops do not meaningfully shift the PHEIC threshold in the absence of a dramatic change in human epidemiology. No new evidence or arguments have emerged to raise the risk of a PHEIC declaration before 2026, and the procedural and epidemiological barriers remain high. Therefore, I see no compelling reason to revise my initial probability.",
            "revised_probability": 7
        },
        "Public Health Policy (International Health Regulations WHO)": {
            "my_phase1_final_probability": 7,
            "reasoning_for_revised_probability": "The group deliberation strongly reinforced the original base rate–anchored reasoning, with nearly all domain experts (across epidemiology, virology, global health governance, and risk assessment) converging on a very low probability (6-7%), citing the absence of human-to-human transmission, the short time to resolution, and the procedural and historical barriers to a PHEIC for H5. The only outlier (13%) was critiqued as overstated relative to available evidence and precedent. No new information or argument emerged to justify moving above the original estimate, nor did any offer compelling reason to lower it further. Therefore, the original probability remains best justified.",
            "revised_probability": 7
        },
        "Public Health Policy (One Health Approach)": {
            "my_phase1_final_probability": 13,
            "reasoning_for_revised_probability": "Group deliberation revealed a strong and consistent consensus among forecasters with diverse expertise that the probability of a PHEIC declaration for H5 avian influenza before 2026 is very low, with most estimates tightly clustered between 6% and 7%. Critiques of my initial probability highlighted that even heightened One Health preparedness and escalating animal outbreaks do not alter the core procedural and epidemiological barriers for a PHEIC: confirmed or strongly suspected sustained human-to-human transmission or extraordinary international human health risk. The new IHR 'pandemic emergency' tier arguably further raises the bar, and with less than three months remaining, both a dramatic shift in the situation and the time for the WHO to process a declaration are unlikely. The base rate remains pivotal, and my initial probability was not sufficiently anchored to this historical precedent. Therefore, I will revise my estimate downward to reflect the overwhelming evidence and reasoning presented by the group.",
            "revised_probability": 7
        },
        "Virology (Viral Pathogenicity)": {
            "my_phase1_final_probability": 7,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, there is a strong consensus across multiple domains—epidemiology, public health policy, risk assessment, and virology—that the probability for a PHEIC declaration for H5 avian influenza before 2026 should remain low. The only dissenting voice, assigning a higher probability, was convincingly critiqued for overemphasizing the impact of One Health preparedness and animal outbreaks without sufficient evidence of a shift in human epidemiological risk or procedural triggers for a PHEIC. No new evidence or arguments emerged suggesting any material increase in risk, and all base-rate and procedural logic remain unchanged. The short time to resolution and recent regulatory changes reinforce the low probability. Therefore, I see no reason to revise my probability.",
            "revised_probability": 7
        },
        "Virology (Zoonotic Spillover)": {
            "my_phase1_final_probability": 7,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, there is strong consensus among diverse expert perspectives that the probability should remain quite low, with nearly all forecasts in the 6-7% range except for a single outlier at 13%, which was consistently critiqued as too high for the available evidence. No one raised compelling arguments that the risk should be higher than initially assessed. All agree that the base rate for H5 PHEIC declarations is zero, and that the current epidemiological and procedural context does not indicate imminent change. The new IHR regulations, if anything, are seen as maintaining or raising the threshold for a PHEIC. The short time remaining before year-end further reduces the likelihood of both a qualifying epidemiological shift and the necessary procedural steps for a declaration. Therefore, I see no justification for changing my probability; it remains strongly grounded in base rates, current risk assessment, and group consensus.",
            "revised_probability": 7
        }
    },
    "revision_probability": [
        7,
        6,
        7,
        7,
        7,
        7,
        7,
        7
    ],
    "revision_mean_probability": 6.875,
    "revision_sd": 0.3535533905932738,
    "revision_probability_result": 7,
    "question_details": {
        "id": 38790,
        "title": "Will the WHO declare H5 avian influenza to be a Public Health Emergency of International Concern (PHEIC) before 2026?",
        "created_at": "2025-08-31T05:07:55.525773Z",
        "open_time": "2025-10-09T01:32:37Z",
        "cp_reveal_time": "2025-10-09T03:02:37Z",
        "spot_scoring_time": "2025-10-09T03:02:37Z",
        "scheduled_resolve_time": "2026-01-01T17:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-10-09T03:02:37Z",
        "actual_close_time": "2025-10-09T03:02:37Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "This question is synced with an identical question on Metaculus. The original question opened on 2024-12-12 17:30:00 and can be found [here](https://www.metaculus.com/questions/30763). This question will resolve to the same value as the synced question. The original question's background info at this time is below. \n\nAccording to the WHO, the Emergency Committee of the International Health Regulations (IHR) [consists](https://www.who.int/news-room/questions-and-answers/item/emergencies-international-health-regulations-and-emergency-committees) \"of international experts who provide technical advice to the WHO Director-General in the context of a 'public health emergency of international concern' (PHEIC).\" Important factors the Emergency Committee weighs in its deliberation process are:\n\n1. risks to human health\n2. international spread of the outbreak, and\n3. interference with international travel.\n\nThe final determination of a PHEIC is made by the Director-General of the WHO.\n\nIn recent years, the WHO has declared a PHEIC for the [2022-2023](https://en.wikipedia.org/wiki/2022%E2%80%932023_mpox_outbreak) and [2023-2024](https://en.wikipedia.org/wiki/2023%E2%80%932024_mpox_epidemic) mpox outbreaks, the [COVID-19 pandemic](https://en.wikipedia.org/wiki/COVID-19_pandemic), the 2018-2020 [ebola outbreak](https://en.wikipedia.org/wiki/Kivu_Ebola_epidemic), and the 2015-2016 [Zika epidemic](https://en.wikipedia.org/wiki/2015%E2%80%9316_Zika_virus_epidemic).\n\nWith respect to H5, at the time of this question the WHO [assesses the risk](https://www.who.int/emergencies/disease-outbreak-news/item/2024-DON512) as follows:\n\n> Whenever avian influenza viruses are circulating in birds, there is a risk for sporadic infections in mammals and humans due to exposure to infected animals (including livestock), or contaminated environments and thus, further human cases are not unexpected.  Influenza A infection has been rarely reported in bovine species and spread among dairy cattle herds in four U.S. States is being assessed. Previously, there have been human infections with other avian influenza subtypes following exposure to infected mammals.\n\n> Since the virus has not acquired mutations that facilitate transmission among humans and based on available information, WHO assesses the public health risk to the general population posed by this virus to be low and for occupationally exposed persons the risk of infection is considered low-to-moderate.\n\n> There are no specific vaccines for preventing influenza A(H5N1) virus infection in humans. Candidate vaccines to prevent H5 infection in humans have been developed for pandemic preparedness purposes. Close analysis of the epidemiological situation, further characterization of the most recent viruses (from human cases and animal) and comprehensive investigations around human cases are critical to assess associated risk and to adjust risk management measures in a timely manner.\n\nFor more information please see:\n\n* US Centers for Disease Control [H5 Bird Flu: Current Situation](https://www.cdc.gov/bird-flu/situation-summary/index.html)\n* WHO [Risk assessments and summaries of influenza at the human-animal interface](https://www.who.int/teams/global-influenza-programme/avian-influenza/monthly-risk-assessment-summary)\n* Pan American Health Organization [Epidemiological alerts and updates](https://www.paho.org/en/epidemiological-alerts-and-updates)\n\n***\n\nThis question belongs to Vox's Future Perfect Community page and 2025 forecasting tournament. [Learn more and compete for the $2,500 prize pool](https://www.metaculus.com/c/future-perfect/).\n\n`{\"format\":\"metac_closes_in_period\",\"info\":{\"post_id\":30763,\"question_id\":30523}}`",
        "resolution_criteria": "This question resolves as **Yes** if before January 1, 2026, the World Health Organization (WHO) declares any H5 virus to be a Public Health Emergency of International Concern (PHEIC). If this does not occur, this question resolves as **No**.",
        "fine_print": "Per the WHO's [Q\\&A documentation](https://www.who.int/news-room/questions-and-answers/item/emergencies-international-health-regulations-and-emergency-committees):\n\n> A PHEIC is defined in the IHR (2005) as, “an extraordinary event which is determined to constitute a public health risk to other States through the international spread of disease and to potentially require a coordinated international response”. This definition implies a situation that is:\n\n> * serious, sudden, unusual or unexpected;\n> * carries implications for public health beyond the affected State’s national border; and\n> * may require immediate international action.\n\nIf WHO changes this definition in a manner that a panel of Metaculus Admins determines to be substantial, this question may be either clarified or annulled.\n\nFor purposes of this question, any subtype of H5 (e.g., H5N1, H5Nx) is acceptable if encompassed by the PHEIC.\n\nThe intention is for this question to resolve based on any PHEIC declaration by the WHO. Therefore, this question does not have additional requirements beyond the declaration (for example, human-to-human transmission is not required).",
        "post_id": 39413,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Ghana's Mpox cases rise to 670 with three deaths**\nAs of October 8, 2025, Ghana has recorded 670 cases of Mpox, including 13 new infections, according to the Ghana Health Service (GHS). Three deaths have been reported since the outbreak began on May 15, 2025, with one person currently hospitalized. Cases have been confirmed in all 16 regions and approximately 100 districts across the country. The GHS emphasized it remains vigilant, actively monitoring the outbreak through its surveillance system and coordinating with the Ministry of Health to implement public health measures, including contact tracing. Director General Prof. Samuel Kaba Akoriyea urged the public to remain calm, stating that existing protocols for detecting, managing, and controlling infectious diseases are being rigorously followed. The GHS advised the public to practice good hygiene, avoid close contact with symptomatic individuals, refrain from touching rashes or body fluids, use protective gear when caring for the sick, and report suspected cases. Symptoms of Mpox include rash, fever, headache, muscle aches, back pain, low energy, and swollen lymph nodes. The GHS recommended frequent handwashing, wearing masks, covering lesions, keeping skin dry, avoiding shared items, disinfecting shared spaces, and using saltwater rinses for mouth sores. The World Health Organization (WHO) declared Mpox a public health emergency of international concern in August 2024 due to a new variant spreading across Africa. Over 13 African countries have reported cases, with more than 17,000 suspected cases and 517 deaths recorded on the continent by the end of 2024. The WHO approved an Mpox vaccine in 2024 to improve access for millions at risk, as the outbreak has now infected over 20,000 people in Africa.\nOriginal language: en\nPublish date: October 08, 2025 09:23 PM\nSource:[Modern Ghana Media Communication Ltd.](https://www.modernghana.com/news/1438780/ghanas-mpox-cases-rise-to-670-with-three-deaths.html)\n\n**Covid-19: Still Present After Five Years**\nThe Covid-19 pandemic, though no longer dominating media headlines due to competing global crises, remains active five years after the emergence of the SARS-CoV-2 virus. In October 2025, a new wave of infections—designated the 15th—has emerged in Europe and the United States, driven by the XFG variant, a descendant of Omicron labeled 'Frankenstein.' In France, there has been a 16% weekly increase in suspected adult cases and a 17% rise among children aged 2 to 14 since September. The XFG variant now dominates viral circulation in Europe and the U.S., contributing to this resurgence. Experts from the Center for Infectious Disease Research and Policy (Cidrap) had previously predicted a pattern of recurring peaks and troughs in infections, confirming that the virus continues to follow this cyclical trend. In France, the 2025 vaccination campaign for vulnerable populations begins on October 14, with continued recommendations for the elderly and high-risk individuals due to the vaccine’s proven protection against severe illness and long Covid. Meanwhile, in the U.S., Robert Kennedy Jr., a known anti-vaccine figure appointed by the administration, has led experts to question the safety and efficacy of Covid-19 vaccines, rejecting official recommendations. Globally, the persistence of Covid-19 underscores the urgent need for pandemic preparedness. The World Health Organization’s (WHO) pandemic agreement, adopted in May 2025, aims to improve global coordination by ensuring equitable access to vaccines, treatments, and diagnostics, strengthening national health systems, enhancing surveillance and data sharing, and establishing mechanisms for international response during health emergencies. The threat of future pandemics—caused by mutated known viruses, zoonotic spillovers, or unknown pathogens—remains a long-term global health risk.\nOriginal language: fr\nPublish date: October 08, 2025 04:31 AM\nSource:[Ladepeche.fr](https://www.ladepeche.fr/2025/10/08/editorial-covid-19-toujours-la-12971654.php)\n\n**Suriname Strengthens Cross-Border Approach to Combat Bird Flu**\nSuriname has launched a four-day One Health Workshop on Highly Pathogenic Avian Influenza in Utopia Heritage, aimed at strengthening its preparedness and response capacity against a potential outbreak of bird flu. The event, organized by the Ministry of Health in collaboration with the Ministry of Agriculture, Livestock, and Fisheries and supported by the Pan American Health Organization, experts from Belize, and the Caribbean Public Health Agency, focuses on integrating human, animal, and environmental health perspectives. According to Radjesh Ori, acting director of the Bureau of Public Health (BOG), the workshop aligns with the One Health approach, emphasizing that 'everything is interconnected'—climate change and shifting living conditions affect both human and animal health. Although Suriname has not yet reported any confirmed cases, Ori warns that global trends show increasing animal infections, with the risk of viral mutation enabling human-to-human transmission, potentially triggering a pandemic larger than COVID-19. The workshop uses the WHO’s Mosaic Framework and other international assessment tools to identify gaps in planning, documentation, and coordination. Ori notes that while Suriname does much in public health, it underperforms in recording and systematizing plans. Experts from Belize are guiding field exercises based on their national experience. The ultimate goal, as stated by Ori, is to gain insight into weaknesses and develop a sustainable action plan to improve readiness for any future outbreak.\nOriginal language: nl\nPublish date: October 07, 2025 06:30 PM\nSource:[www.starnieuws.com](https://www.starnieuws.com/index.php/welcome/index/nieuwsitem/88590)\n\n**Suriname Prepares for Bird Flu with International One Health Workshop**\nSuriname has launched a three-day One Health Workshop on Highly Pathogenic Avian Influenza (HPAI) in Utopia Heritage, running from October 6 to October 9, 2025. Organized by the Ministry of Public Health in collaboration with the Ministry of Agriculture, Livestock, and Fisheries (LVV), and supported by PAHO, Belizean experts, and the Caribbean Public Health Agency (CARPHA), the workshop aims to strengthen national preparedness for a potential avian influenza outbreak. Radjesh Ori, acting director of the Bureau of Public Health (BOG), emphasized the One Health approach, stating that human, animal, and environmental health are interconnected, with climate change and shifting living conditions affecting both. Although Suriname has not yet reported any confirmed cases of bird flu, Ori warned that the absence of cases does not guarantee safety. He cautioned that if the virus mutates to become transmissible from human to human, it could trigger a pandemic larger than COVID-19. Participants used international evaluation tools, including the WHO’s mosaic framework, to identify vulnerabilities and gaps, with the goal of formulating concrete recommendations for a sustainable action plan. Ori noted that while Suriname has strong initiatives, it lacks systematic documentation of plans—this workshop aims to improve that. A key component is a field exercise guided by experts from Belize, who have previously conducted similar simulations. The ultimate goal, as stated by Ori, is to gain insight into existing shortcomings and implement structural improvements to ensure effective response should avian influenza reach the country.\nOriginal language: nl\nPublish date: October 06, 2025 05:35 PM\nSource:[culturu.com](https://www.culturu.com/nieuws/suriname/suriname-bereidt-zich-voor-op-vogelgriep-met-internationale-one-health-workshop/)\n\n**WHO Seeking $56 Million to Help Fight Zika, Hope of Vaccine Moves Forward**\nThe World Health Organization (WHO) has called for $56 million to combat the rapidly spreading Zika virus, which has been confirmed in 39 countries and linked to birth defects such as microcephaly and neurological disorders like Guillain-Barré syndrome. The funds, requested to support efforts until June 2016, will be used to fast-track vaccine development, improve diagnostics, and study virus transmission and control. WHO declared a global public health emergency in February 2016, noting the virus's shift from a minor threat to a serious concern due to its association with severe complications. The requested funds include $25 million for WHO and its regional offices, with the rest allocated to partners like UNICEF. Initially, WHO used a $2 million emergency contingency fund to launch operations. Georgetown University professor Lawrence Gostin criticized the limited emergency fund, citing the slow WHO response during the 2014–2016 Ebola outbreak, which killed over 11,300 people. Brazil, the hardest-hit country, reported over 4,442 suspected microcephaly cases, with 508 confirmed and 41 linked to Zika infection. No treatment exists for Zika, which was previously considered a mild illness. However, research progress is underway: 15 companies and academic groups are developing vaccines, and Inovio Pharmaceuticals reported a robust immune response in mice, causing its shares to rise 7% on the news. The company plans to begin human trials by year-end.\nOriginal language: en\nPublish date: February 17, 2016 08:56 PM\nSource:[thelincolnianonline.com](https://www.thelincolnianonline.com/2016/02/17/who-seeking-56-million-to-help-fight-zika-hope-of-vaccine-moves-forward.html)\n\n**Ghana's Mpox cases rise to 670 with three deaths**\nAs of October 8, 2025, Ghana has recorded 670 cases of Mpox, including 13 new infections, according to the Ghana Health Service (GHS). Three deaths have been reported since the outbreak began on May 15, 2025, with one person currently hospitalized. Cases have been confirmed in all 16 regions and approximately 100 districts across the country. The GHS emphasized it remains vigilant, actively monitoring the outbreak through its surveillance system and coordinating with the Ministry of Health to implement public health measures, including contact tracing. Director General Prof. Samuel Kaba Akoriyea urged the public to remain calm, stating that existing protocols for detecting, managing, and controlling infectious diseases are being rigorously followed. The GHS advised the public to practice good hygiene, avoid close contact with symptomatic individuals, refrain from touching rashes or body fluids, use protective gear when caring for the sick, and report suspected cases. Symptoms of Mpox include rash, fever, headache, muscle aches, back pain, low energy, and swollen lymph nodes. The GHS recommended frequent handwashing, wearing masks, covering lesions, keeping skin dry, avoiding shared items, disinfecting shared spaces, and using saltwater rinses for mouth sores. The World Health Organization (WHO) declared Mpox a public health emergency of international concern in August 2024 due to a new variant spreading across Africa. Over 13 African countries have reported cases, with more than 17,000 suspected cases and 517 deaths recorded on the continent by the end of 2024. The WHO approved an Mpox vaccine in 2024 to improve access for millions at risk, as the outbreak has now infected over 20,000 people in Africa.\nOriginal language: en\nPublish date: October 08, 2025 09:23 PM\nSource:[Modern Ghana Media Communication Ltd.](https://www.modernghana.com/news/1438780/ghanas-mpox-cases-rise-to-670-with-three-deaths.html)\n\n**Covid-19: Still Present After Five Years**\nThe Covid-19 pandemic, though no longer dominating media headlines due to competing global crises, remains active five years after the emergence of the SARS-CoV-2 virus. In October 2025, a new wave of infections—designated the 15th—has emerged in Europe and the United States, driven by the XFG variant, a descendant of Omicron labeled 'Frankenstein.' In France, there has been a 16% weekly increase in suspected adult cases and a 17% rise among children aged 2 to 14 since September. The XFG variant now dominates viral circulation in Europe and the U.S., contributing to this resurgence. Experts from the Center for Infectious Disease Research and Policy (Cidrap) had previously predicted a pattern of recurring peaks and troughs in infections, confirming that the virus continues to follow this cyclical trend. In France, the 2025 vaccination campaign for vulnerable populations begins on October 14, with continued recommendations for the elderly and high-risk individuals due to the vaccine’s proven protection against severe illness and long Covid. Meanwhile, in the U.S., Robert Kennedy Jr., a known anti-vaccine figure appointed by the administration, has led experts to question the safety and efficacy of Covid-19 vaccines, rejecting official recommendations. Globally, the persistence of Covid-19 underscores the urgent need for pandemic preparedness. The World Health Organization’s (WHO) pandemic agreement, adopted in May 2025, aims to improve global coordination by ensuring equitable access to vaccines, treatments, and diagnostics, strengthening national health systems, enhancing surveillance and data sharing, and establishing mechanisms for international response during health emergencies. The threat of future pandemics—caused by mutated known viruses, zoonotic spillovers, or unknown pathogens—remains a long-term global health risk.\nOriginal language: fr\nPublish date: October 08, 2025 04:31 AM\nSource:[Ladepeche.fr](https://www.ladepeche.fr/2025/10/08/editorial-covid-19-toujours-la-12971654.php)\n\n**Suriname Strengthens Cross-Border Approach to Combat Bird Flu**\nSuriname has launched a four-day One Health Workshop on Highly Pathogenic Avian Influenza in Utopia Heritage, aimed at strengthening its preparedness and response capacity against a potential outbreak of bird flu. The event, organized by the Ministry of Health in collaboration with the Ministry of Agriculture, Livestock, and Fisheries and supported by the Pan American Health Organization, experts from Belize, and the Caribbean Public Health Agency, focuses on integrating human, animal, and environmental health perspectives. According to Radjesh Ori, acting director of the Bureau of Public Health (BOG), the workshop aligns with the One Health approach, emphasizing that 'everything is interconnected'—climate change and shifting living conditions affect both human and animal health. Although Suriname has not yet reported any confirmed cases, Ori warns that global trends show increasing animal infections, with the risk of viral mutation enabling human-to-human transmission, potentially triggering a pandemic larger than COVID-19. The workshop uses the WHO’s Mosaic Framework and other international assessment tools to identify gaps in planning, documentation, and coordination. Ori notes that while Suriname does much in public health, it underperforms in recording and systematizing plans. Experts from Belize are guiding field exercises based on their national experience. The ultimate goal, as stated by Ori, is to gain insight into weaknesses and develop a sustainable action plan to improve readiness for any future outbreak.\nOriginal language: nl\nPublish date: October 07, 2025 06:30 PM\nSource:[www.starnieuws.com](https://www.starnieuws.com/index.php/welcome/index/nieuwsitem/88590)\n\n**Respiratory Disease Outbreaks Intensify: Urging Implementation of Three Key Prevention Lines**\nSince October 1, 2025, free influenza and COVID-19 vaccines have been available in Taiwan. Experts warn that respiratory disease outbreaks have surged two months earlier than usual, highlighting ongoing threats from respiratory infections. According to the Taiwan Centers for Disease Control (CDC), reported cases of COVID-19 and influenza have reached the highest levels in three years, with continued increases in influenza and respiratory syncytial virus (RSV) detection rates. Dr. Zhang Fengyi, President of the Taiwan Society of Infectious Diseases, emphasized that while COVID-19 has transitioned from a global acute pandemic to a常态化 (常态化 means 'normalization') endemic disease, it remains a serious threat. Multiple respiratory pathogens—including influenza, RSV, and Streptococcus pneumoniae—are now co-circulating, posing a heightened risk to individuals aged 65 and older, with co-infections potentially doubling mortality rates and increasing severe cases, thereby straining healthcare capacity. To mitigate risks, Dr. Zhang advocates for a 'three-line defense' strategy: widespread vaccination, routine rapid antigen testing, and early use of antiviral medications. Dr. Hsieh Hsien-sen, Deputy Secretary-General of the Taiwan Society of Infectious Diseases, reported that vaccination rates among high-risk groups remain low: only 20.3% of those aged 65+ received the JN.1 booster, 43.9% received the 2024 seasonal flu vaccine, and only 24.9% completed the two-dose pneumococcal vaccine series by April 2025. He stressed the critical gap between public awareness and actual behavior, urging high-risk individuals and their families to take proactive steps to protect themselves and others.\nOriginal language: zh\nPublish date: October 07, 2025 02:00 PM\nSource:[Yahoo News (Taiwan)](https://tw.news.yahoo.com/%E5%91%BC%E5%90%B8%E9%81%93%E7%96%AB%E6%83%85%E5%8D%87%E6%BA%AB-%E8%90%BD%E5%AF%A63%E5%A4%A7%E9%98%B2%E7%B7%9A-220015040.html)\n\n**National Disease Control Agency: Safe Return, Monitor Your Health**\nThe National Disease Control and Prevention Administration (NDCPA) released health guidance on October 7, 2025, urging travelers returning from overseas to proactively declare any symptoms such as cough, fever, rash, or diarrhea before entering China. The guidance emphasizes that travelers must undergo temperature checks and medical inspections at entry points, and cooperate with customs on epidemiological investigations and medical examinations if needed, to determine potential infectious disease exposure and enable early treatment while reducing transmission risks. During travel, passengers are advised to wear masks properly in prolonged, enclosed, crowded public transport settings to reduce the risk of respiratory infections. Upon returning home, individuals should conduct self-health monitoring; if symptoms such as cough, fever, rash, or diarrhea occur, they should seek medical care promptly and inform healthcare providers of their travel history. This guidance aligns with the State Council's Joint Prevention and Control Mechanism’s recent notice, 'On Doing a Good Job in the Prevention and Control of Key Infectious Diseases, Including COVID-19, During and After the National Day and Mid-Autumn Festival and in the Autumn-Winter Season,' which calls for unified thinking, heightened awareness, and proactive planning to ensure the overall stability of the national epidemic situation, supporting a favorable environment for socioeconomic development.\nOriginal language: zh\nPublish date: October 07, 2025 09:36 AM\nSource:[news.cn](http://www.news.cn/politics/20251007/2c83e400d7c24a46b3a40ab872faac81/c.html)\n\n**Avian Influenza Outbreak Sparks Global Alarm: Spain Activates Emergency Protocol, Brazil Becomes Hotspot with 17,000 Chickens Dead**\nThe avian influenza virus has caused widespread fear and concern globally, particularly in Europe and Latin America. Spain activated a health emergency protocol after detecting a new outbreak in Alcobendas, following multiple cases in Andalusia, and ordered the culling of over 850 birds. Experts, including Spanish immunologist Alfredo Correl, emphasize that while human transmission remains rare—only around 900 cases recorded globally since 1997—the virus is highly lethal in poultry, causing 100% mortality among infected birds, and has a 30% to 50% fatality rate in confirmed human cases. Crucially, the virus currently does not spread from person to person, and experts believe it is unlikely to mutate for human-to-human transmission in the near future, as it benefits from host survival. Authorities stress that infected birds and all nearby poultry must be destroyed to prevent spread, and the public is advised not to touch dead birds and to wash hands thoroughly if contact occurs. Spain has identified nine outbreak sites, including in Seville’s Parque María Luisa and La Puerta del Río, with fears of further spread. In Brazil, the virus has become a major outbreak hotspot, with approximately 17,000 chickens dying in Rio Grande do Sul and preventive culling of remaining birds. Brazil has suspended poultry exports to the European Union, Mexico, Chile, and Uruguay; the EU partially lifted the ban after stabilization. Multiple Brazilian states have reported outbreaks, raising alarms over potential spread to large farms if preventive measures are not improved. Although human cases remain rare, experts from Spain and Latin America warn of 'shared risks' if the virus mutates to spread between species or appears in mammals.\nOriginal language: ar\nPublish date: October 07, 2025 06:32 AM\nSource:[اليوم السابع](https://www.youm7.com/story/2025/10/7/%D9%81%D9%8A%D8%B1%D9%88%D8%B3-%D8%A5%D9%86%D9%81%D9%84%D9%88%D9%86%D8%B2%D8%A7-%D8%A7%D9%84%D8%B7%D9%8A%D9%88%D8%B1-%D9%8A%D8%AB%D9%8A%D8%B1-%D8%A7%D9%84%D8%B1%D8%B9%D8%A8-%D8%A8%D8%AF%D9%88%D9%84-%D8%A7%D9%84%D8%B9%D8%A7%D9%84%D9%85-%D9%85%D8%B9-%D9%85%D8%AE%D8%A7%D9%88%D9%81-%D8%A7%D9%86%D8%AA%D9%82%D8%A7%D9%84%D9%87/7146691)\n\n**Suriname Prepares for Bird Flu with International One Health Workshop**\nSuriname has launched a three-day One Health Workshop on Highly Pathogenic Avian Influenza (HPAI) in Utopia Heritage, running from October 6 to October 9, 2025. Organized by the Ministry of Public Health in collaboration with the Ministry of Agriculture, Livestock, and Fisheries (LVV), and supported by PAHO, Belizean experts, and the Caribbean Public Health Agency (CARPHA), the workshop aims to strengthen national preparedness for a potential avian influenza outbreak. Radjesh Ori, acting director of the Bureau of Public Health (BOG), emphasized the One Health approach, stating that human, animal, and environmental health are interconnected, with climate change and shifting living conditions affecting both. Although Suriname has not yet reported any confirmed cases of bird flu, Ori warned that the absence of cases does not guarantee safety. He cautioned that if the virus mutates to become transmissible from human to human, it could trigger a pandemic larger than COVID-19. Participants used international evaluation tools, including the WHO’s mosaic framework, to identify vulnerabilities and gaps, with the goal of formulating concrete recommendations for a sustainable action plan. Ori noted that while Suriname has strong initiatives, it lacks systematic documentation of plans—this workshop aims to improve that. A key component is a field exercise guided by experts from Belize, who have previously conducted similar simulations. The ultimate goal, as stated by Ori, is to gain insight into existing shortcomings and implement structural improvements to ensure effective response should avian influenza reach the country.\nOriginal language: nl\nPublish date: October 06, 2025 05:35 PM\nSource:[culturu.com](https://www.culturu.com/nieuws/suriname/suriname-bereidt-zich-voor-op-vogelgriep-met-internationale-one-health-workshop/)\n\n**H3N2 influenza spreads rapidly in Delhi, northern India | Taiwan News | Oct. 1, 2025 14:27**\nThe H3N2 strain of influenza is spreading rapidly in northern India, particularly in the Delhi metropolitan region, which encompasses approximately 46 million people across Haryana, Uttar Pradesh, and Rajasthan. According to a LocalCircles survey, 69% of households in the area report at least one person with flu-like symptoms. Dr. Rituja Ugalmugle of Wockhardt Hospitals confirms H3N2 is the predominant variant, noting widespread circulation. Symptoms include sudden high fever, chills, sore throat, runny nose, dry or productive cough, severe fatigue, muscle aches, and gastrointestinal issues, especially in children. High-risk groups—children, the elderly, pregnant individuals, and those with chronic conditions like asthma, diabetes, or heart disease—are most vulnerable. While most cases resolve within a week, complications such as bronchitis, pneumonia, or worsening of pre-existing conditions can occur, with some patients requiring hospitalization. Dr. Mayanka Lodha Seth of Redcliffe Labs emphasizes that H3N2 is typically more severe and longer-lasting than common flu or colds. Emergency symptoms include difficulty breathing, blue lips or nails, confusion, and severe dehydration, requiring immediate medical attention. Preventive measures include handwashing, masking, avoiding crowds, healthy eating, and annual flu vaccination. There is no specific antiviral treatment; care focuses on symptom relief, with antivirals reserved for severe or high-risk cases. H3N2 originated from the 1968 pandemic, combining with an avian H3 virus, and has since evolved through human adaptation. A 2024 study found that receptor-binding changes in H3N2 have increased transmissibility and immune evasion. The World Health Organization (WHO) currently assesses the pandemic risk as low, but vigilance is ongoing due to H3N2’s rapid mutation potential. Scientists monitor the virus closely, as significant mutations could lead to a sudden epidemic or pandemic.\nOriginal language: en\nPublish date: October 01, 2025 02:27 PM\nSource:[taiwannews.com.tw](https://taiwannews.com.tw/news/6209513)\n\n**WHO Enacts New Regulations**\nThe World Health Organization (WHO) announced that on Friday the new International Health Regulations (IHR) went into force, allowing the declaration of 'pandemic emergencies' for severe global health crises such as the COVID‑19 pandemic. Previously, the highest alert level was the 'public health emergency of international concern', which was applied during COVID‑19, Ebola, mpox, and influenza A. Under the new regulations, that level will become the second‑most severe, positioned below the new pandemic emergency category.\nOriginal language: es\nPublish date: September 19, 2025 08:23 PM\nSource:[El Nacional](https://elnacional.com.do/oms-pone-en-vigor-nuevas-regulaciones/)\n\n**WHO to Declare Pandemic Emergencies with New International Health Regulations**\nThe World Health Organization (WHO) announced that the new International Health Regulations (IHR) will take effect on Friday, allowing the organization to declare a \"pandemic emergency\" for severe global health crises such as the COVID‑19 pandemic. Until now the highest alert level was \"public health emergency of international concern\", which was used for COVID‑19, Ebola, mpox, and influenza A. The new regulations introduce a second, more severe alert level. They also explicitly embed a principle of \"solidarity among countries\" to address the unequal access to vaccines and treatments that hampered the COVID‑19 response, especially in low‑income nations. Additionally, the IHR establish a financial mechanism under the authority of the World Health Assembly to better coordinate resources. The amendments were adopted at the 2024 Assembly, the first major changes since the 2005 revision following the SARS outbreak. Eleven of the 194 member states, including the United States, rejected the new regulations; in those countries the 2005 IHR will remain in force. In a press conference, WHO Director‑General Tedros Adhanom Ghebreyesus said, 'Estados Unidos fue el primer país que propuso una enmienda del RSI, por lo que espero que lo reconsidere y se una a la nueva regulación, porque su contribución ha sido muy significativa hasta la conclusión del acuerdo.'\nOriginal language: es\nPublish date: September 19, 2025 05:37 PM\nSource:[Noticias SIN](https://noticiassin.com/estados-unidos-y-las-regulaciones-sanitarias-de-la-oms-2008315)\n\n**Mpox no longer a global emergency, but WHO warns against complacency**\nThe World Health Organization (WHO) has officially declared that Mpox (formerly monkeypox) is no longer a Public Health Emergency of International Concern (PHEIC) after a sustained decline in cases, especially in African hotspots. WHO Director‑General Dr Tedros Adhanom Ghebreyesus warned that the threat remains and that global vigilance must continue, saying, 'This decision is based on sustained declines in cases -- as seen in the Democratic Republic of the Congo and in other affected countries including Burundi, Sierra Leone and Uganda.' The emergency committee, which reviews Mpox status quarterly, lifted the PHEIC based on consistent evidence of falling infections in the Democratic Republic of the Congo, Burundi, Sierra Leone and Uganda. The designation was first declared in August 2024 due to a more virulent Clade Ib strain. WHO clarified that lifting the emergency tag does not mean the virus is eradicated; high‑risk groups such as children, pregnant women and people living with HIV remain at higher risk of severe illness.\n\nWHO’s latest surveillance update up to 31 March 2025 reports 137,892 confirmed cases (Jan 2022‑Mar 2025) and 317 deaths. The African Region accounts for 84.8 % of cases, Europe 8.6 %, and the Americas 5.6 %. Notably, the African Region saw a 14 % decline in cases in March 2025 alone.\n\nIndia has reported about 40 confirmed Mpox cases and one death over the past five years, with the first case detected in Kerala in July 2022. In late 2024 to early 2025, 10 cases of a newer Mpox strain were identified, mostly linked to travel or close contact with travellers. While India’s caseload remains low compared to global figures, health officials emphasize continued vigilance and contact tracing.\n\nMpox is caused by the Monkeypox virus, part of the Orthopoxvirus family. The illness typically lasts two to four weeks, beginning with fever, headache, muscle pain, fatigue and swollen lymph nodes, followed by a rash that develops into blisters and scabs, often affecting the face, hands, feet or genital area.\nOriginal language: en\nPublish date: September 08, 2025 07:49 AM\nSource:[Business Standard](https://www.business-standard.com/health/mpox-no-longer-a-global-emergency-but-who-warns-against-complacency-125090800441_1.html)\n\n**WHO: Mpox no longer an international health emergency**\nThe World Health Organization (WHO) has declared that mpox, formerly known as monkeypox, is no longer a Public Health Emergency of International Concern (PHEIC). The decision followed the fifth meeting of the International Health Regulations Emergency Committee, which advised Director‑General Dr Tedros Adhanom Ghebreyesus to lift the emergency status; he accepted the advice. The announcement states, 'The Committee advised the Director‑General Dr Tedros that the situation no longer represents an international health emergency. He accepted the advice. Lifting the emergency declaration does not mean the threat is over, as mpox outbreaks, including new ones, continue to be reported.' The Director‑General noted a sustained decline in cases and deaths in heavily affected countries such as the Democratic Republic of the Congo, Burundi, Sierra Leone, and Uganda, but emphasized that the removal of the emergency label does not mean the disease has been eradicated. He added, 'Mpox is still present, and countries must not let their guard down.'\n\nIn Kenya, mpox remains a growing concern. Ministry of Health data reported more than 314 confirmed cases by early August 2025, spread across 22 counties. Later humanitarian health updates indicated the tally had surpassed 330 cases in at least 24 counties, with Mombasa accounting for nearly half of the total. The coastal city and the Mombasa‑Malaba transport corridor have become epicentres of transmission, with many cases traced to truck drivers, sex workers, and their close contacts. The nation has reported several fatalities linked to the disease, underscoring the continued threat despite the WHO's declaration. The WHO has pledged continued support for Kenya and other African countries to maintain progress achieved during the emergency phase, and the Kenyan government has rolled out vaccination drives in several counties.\nOriginal language: en\nPublish date: September 06, 2025 05:54 AM\nSource:[The Star](https://www.the-star.co.ke/news/2025-09-06-who-mpox-no-longer-an-international-health-emergency)\n\n**WHO says mpox no longer a global public health emergency - The Statesman**\nThe World Health Organization (WHO) announced that the spread of mpox (monkeypox) in Africa no longer constitutes a Public Health Emergency of International Concern (PHEIC).  WHO’s Emergency Committee, which meets quarterly, met on Friday and advised that the situation had \"sustained declines in cases and deaths in Congo, and in other affected countries, including Burundi, Sierra Leone, and Uganda,\" leading to the decision.  WHO Director‑General Tedros Adhanom Ghebreyesus said, 'Yesterday, they met again and advised me that in their view, the situation no longer represents an international health emergency. I have accepted that advice.'  He added that the decision is based on \"a better understanding of the drivers of transmission, the risk factors for severity, and the most affected countries have developed a sustained response capacity.\"  However, WHO clarified that lifting the emergency declaration does not mean the threat is over or that response will stop, noting that the Africa CDC still considers mpox a continental emergency.  The Africa CDC reported new surges in Ghana, Liberia, Kenya, Zambia and Tanzania, even as weekly confirmed cases declined by 52 %.  Since May 2022, more than 100 countries and regions worldwide have reported mpox cases.  Mpox is a viral zoonotic disease; initial symptoms include fever, headache, muscle aches, back pain and swollen lymph nodes, which can progress to widespread rashes.  Most infected individuals recover within a few weeks, but some may experience severe illness or death.  WHO’s decision follows its August 2024 declaration of a PHEIC for the outbreak outside Africa’s traditional endemic areas.\nOriginal language: en\nPublish date: September 06, 2025 02:55 AM\nSource:[The Statesman](https://www.thestatesman.com/world/who-says-mpox-no-longer-a-global-public-health-emergency-1503482167.html)\n\n**WHO says mpox no longer a global public health emergency**\nOn 6 September 2025, the World Health Organization (WHO) announced that the spread of mpox in Africa no longer constitutes a Public Health Emergency of International Concern (PHEIC). The decision followed a meeting of WHO’s Emergency Committee, which convenes quarterly to assess the outbreak. In a media briefing, WHO Director‑General Tedros Adhanom Ghebreyesus said, 'Yesterday, they met again and advised me that in their view, the situation no longer represents an international health emergency. I have accepted that advice.' He explained that the decision is based on sustained declines in cases and deaths in Congo, Burundi, Sierra Leone and Uganda. The committee also noted that the WHO will continue to monitor the situation, 'nor that our response will stop, and we note the Africa CDC's decision yesterday that mpox remains a continental emergency.' The Africa Centres for Disease Control and Prevention (Africa CDC) confirmed that new surges were observed in Ghana, Liberia, Kenya, Zambia and Tanzania, even as weekly confirmed cases fell by 52 %. The WHO declared the outbreak a PHEIC in August 2024; since May 2022, more than 100 countries and regions worldwide have reported mpox cases. The article stresses that flare‑ups may still occur and that ongoing surveillance and response capacity are essential, especially for vulnerable groups such as young children and people living with HIV. Mpox is a viral zoonotic disease with initial symptoms of fever, headache, muscle aches, back pain and swollen lymph nodes, which can progress to widespread rashes; most infected individuals recover within weeks, though severe illness or death can occur.\nOriginal language: en\nPublish date: September 06, 2025 01:17 AM\nSource:[Social News XYZ](https://www.socialnews.xyz/2025/09/05/who-says-mpox-no-longer-a-global-public-health-emergency/)\n\n**Mpox no longer a global health emergency, WHO says**\nOn September 5 2025, the World Health Organization announced that mpox is no longer a global public health emergency. The agency had declared a Public Health Emergency of International Concern (PHEIC) in August 2024 after a mutant clade 1b strain spread from the Democratic Republic of Congo (DRC) to neighbouring countries. A panel concluded that the situation no longer meets the criteria for a PHEIC, citing declining case numbers and deaths in the DRC, Burundi, Sierra Leone, and Uganda. WHO Director‑General Tedros Adhanom Ghebreyesus said at a press conference that 'This is based on case numbers and deaths steadily declining in the DRC and other affected countries, including Burundi, Sierra Leone, and Uganda,' and that 'We also have a better understanding of the drivers of transmission, the risk factors for severity, and the most affected countries have developed a sustained response capacity.' He added that lifting the declaration does not mean the threat is over. Globally, more than 34,000 mpox cases have been confirmed since the start of the year, with 138 deaths. The DRC and Sierra Leone have been hardest hit. Case numbers have dropped 76 % since the epidemic peak, but sporadic outbreaks continue in West, East, and Central Africa. Kenya has begun a vaccination campaign after a recent rise in cases. The WHO and Africa CDC will continue coordination of vaccination and surveillance, focusing on high‑risk groups such as young children and people living with HIV. Mpox spreads mainly through close contact, and the case fatality rate in the DRC is about 3 %.\nOriginal language: en\nPublish date: September 05, 2025 03:51 PM\nSource:[Yahoo](https://www.yahoo.com/news/articles/mpox-no-longer-global-health-155111733.html)\n\n**WHO Holds Fourth Emergency Meeting on Mpox Outbreak**\nThe World Health Organization (WHO) held its fourth emergency meeting on the 2005 International Health Regulations (IHR) concerning the resurgence of mpox (monkeypox) in 2024. The meeting was held on June 5, 2025, and was attended by 16 members and 2 advisors of the IHR Committee. The WHO Director-General welcomed the participants and presented the objectives of the meeting, which were to determine whether the mpox outbreak still constitutes a Public Health Emergency of International Concern (PHEIC) and to formulate recommendations for temporary measures for States Parties. The WHO presented an overview of the global epidemiological situation of mpox, including the circulation of all clades of the monkeypox virus (MPXV). The meeting discussed the recent developments in the mpox outbreak, including the stabilization or decline of cases in most provinces in the Democratic Republic of the Congo (DRC), the decrease in cases in Burundi, and the recent surge in cases in Sierra Leone. The WHO also presented its evaluation of the risk for different clades of MPXV, which includes a high risk for the DRC and neighboring countries, a moderate risk for the DRC, a moderate risk for Nigeria and countries in West and Central Africa where mpox is endemic, and a moderate risk for the world. The meeting also discussed the progress made in the fight against mpox, including the launch of vaccination campaigns in seven countries and the upcoming launch in four other countries. However, the WHO emphasized that the current progress is threatened by a growing funding deficit, which compromises not only the response efforts but also global health programs that support mpox prevention and control activities.\nOriginal language: fr\nPublish date: July 24, 2025 10:04 AM\nSource:[ReliefWeb](https://reliefweb.int/report/world/quatrieme-reunion-du-comite-durgence-du-reglement-sanitaire-international-2005-concernant-la-recrudescence-de-la-mpox-variole-simienne-en-2024)\n\n**Global Health Alert: WHO Declares) Mpox a Public Health Emergency | Per Second News**\nThe World Health Organisation (WHO) has declared Mpox a Public Health Emergency of International Concern (PHEIC) due to the ongoing rise in cases, including a recent increase in West Africa, and likely ongoing undetected transmission in some countries beyond the African continent. According to WHO Director-General Dr. Tedros Ghebreyesus, the decision was made after the fourth meeting of the IHR Emergency Committee, which advised that the event continues to constitute a PHEIC. Ghebreyesus stated, 'Ongoing operational challenges in responding to the event, including concerning surveillance and diagnostics, as well as a lack of funding, make prioritising response interventions challenging and require continued international support.' The WHO has issued revised temporary recommendations to member states experiencing Mpox outbreaks to guide countries' efforts to prevent and control the spread of the disease.\nOriginal language: en\nPublish date: June 10, 2025 11:58 AM\nSource:[persecondnews.com](https://persecondnews.com/2025/06/10/global-health-alert-who-declares-mpox-a-public-health-emergency/)\n\n**Meet The Scientist Warning The World About The Next Pandemic - Health Policy Watch**\nDr. Tulio de Oliveira, leader of the Centre for Epidemic Response and Innovation at Stellenbosch University and a key figure in identifying the Beta and Omicron variants of COVID-19, warns that global health preparedness must remain a top priority despite the world's shift in focus away from the pandemic. In an interview with Dr. Garry Aslanyan, Oliveira emphasized that global health is a moral responsibility requiring constant vigilance, collaboration, and investment. He highlighted how climate change is exacerbating health crises—such as dengue outbreaks in Ethiopia and cholera in Malawi—due to extreme weather, flooding, and increased human mobility, which heighten the risk and severity of epidemics. Oliveira stressed that pathogens do not respect borders and that cutting global health funding is short-sighted and dangerous. His advice to the global health community is to stay focused, deliver results, and never underestimate the power of preparedness. The interview was published on February 5, 2025, by Health Policy Watch.\nOriginal language: en\nPublish date: February 05, 2025 12:00 AM\nSource:[healthpolicy-watch.news](https://healthpolicy-watch.news/meet-the-scientist-warning-the-world-about-the-next-pandemic/)\n\n**New Mpox strain sparks global health emergency**\nOn August 13, 2024, the Africa Centres for Disease Control and Prevention declared the Mpox outbreak in the Democratic Republic of the Congo a public health emergency of continental security, and the World Health Organization followed on August 14, declaring a Public Health Emergency of International Concern (PHEIC). The outbreak, which may have begun in September 2023, is driven by a newly identified lineage, 'clade Ib', that is more efficient at human‑to‑human transmission than the previously known 'clade II' strains. The virus has spread across most DRC provinces and crossed national borders, overwhelming a health system already strained by Ebola, cholera and limited resources. Africa CDC estimates the continent needs about 10 million doses of the Mpox vaccine, yet only roughly 200 000 are currently available. The only approved vaccine, MVA‑BN (Modified Vaccinia Ankara‑Bavarian Nordic), is costly and largely unaffordable for many African countries. WHO has called for international solidarity, noting that Europe has the capacity to help but the supply gap remains a critical barrier. In June 2024, the World Health Assembly adopted amendments to the International Health Regulations (IHR) to improve global preparedness, though they have not yet taken effect. WHO has identified an immediate funding need of $15 million for surveillance, preparedness and response, but has released only $1.45 million from its contingency fund. The article stresses that addressing Mpox requires coordinated vaccine access, strengthened testing and monitoring, health‑care service improvement, public‑health education, behavioral change promotion, and economic support for affected communities. It concludes that global health security depends on collective action and sustained investment to prevent future outbreaks from escalating into worldwide crises.\nOriginal language: en\nPublish date: August 24, 2024 06:07 PM\nSource:[weeklyblitz.net](https://weeklyblitz.net/2024/08/25/new-mpox-strain-sparks-global-health-emergency/)\n\n**WHO Seeking $56 Million to Help Fight Zika, Hope of Vaccine Moves Forward**\nThe World Health Organization (WHO) has called for $56 million to combat the rapidly spreading Zika virus, which has been confirmed in 39 countries and linked to birth defects such as microcephaly and neurological disorders like Guillain-Barré syndrome. The funds, requested to support efforts until June 2016, will be used to fast-track vaccine development, improve diagnostics, and study virus transmission and control. WHO declared a global public health emergency in February 2016, noting the virus's shift from a minor threat to a serious concern due to its association with severe complications. The requested funds include $25 million for WHO and its regional offices, with the rest allocated to partners like UNICEF. Initially, WHO used a $2 million emergency contingency fund to launch operations. Georgetown University professor Lawrence Gostin criticized the limited emergency fund, citing the slow WHO response during the 2014–2016 Ebola outbreak, which killed over 11,300 people. Brazil, the hardest-hit country, reported over 4,442 suspected microcephaly cases, with 508 confirmed and 41 linked to Zika infection. No treatment exists for Zika, which was previously considered a mild illness. However, research progress is underway: 15 companies and academic groups are developing vaccines, and Inovio Pharmaceuticals reported a robust immune response in mice, causing its shares to rise 7% on the news. The company plans to begin human trials by year-end.\nOriginal language: en\nPublish date: February 17, 2016 08:56 PM\nSource:[thelincolnianonline.com](https://www.thelincolnianonline.com/2016/02/17/who-seeking-56-million-to-help-fight-zika-hope-of-vaccine-moves-forward.html)\n\n",
    "date": "2025-10-15T02:27:42.412190",
    "summary": "All experts agree that the probability of the WHO declaring H5 avian influenza a Public Health Emergency of International Concern (PHEIC) before January 1, 2026, is low. The base rate for such a declaration in the context of avian influenza is effectively zero, as it has never occurred despite decades of global outbreaks and occasional zoonotic spillover. As of mid-October 2025, the WHO and CDC continue to assess the risk to the general population as low, with no evidence of sustained human-to-human transmission, and no international clusters indicative of a higher threat. Experts consistently note that the main procedural and epidemiological trigger for a PHEIC—efficient or sustained human-to-human transmission—has not been met. Other factors, such as the introduction of a WHO 'pandemic emergency' category above PHEIC, generally reinforce a high threshold for a PHEIC declaration. While there is acknowledgment of ongoing animal outbreaks, heightened international surveillance, and some marginal increases in risk due to preparedness activities and the theoretical chance of viral mutation, these are not considered sufficient to change the overall outlook. Individual probabilities from the expert summaries primarily cluster between 6% and 7%, with one outlier at 13%. The consensus in the forecasts is that barring an unexpected, major epidemiological shift—such as a cluster of documented human-to-human transmissions with significant disease—no PHEIC will be declared before 2026.",
    "forecasters": [
        "Global Health Governance (WHO Emergency Committee Procedures)",
        "Risk Assessment Infectious Diseases (Joint External Evaluation WHO)",
        "Epidemiology (Outbreak Investigation)",
        "Epidemiology (Pandemic Phases WHO)",
        "Public Health Policy (International Health Regulations WHO)",
        "Public Health Policy (One Health Approach)",
        "Virology (Viral Pathogenicity)",
        "Virology (Zoonotic Spillover)"
    ]
}