{
    "deliberation_results": {
        "Legal Practice in Germany (Verfassungsrecht Litigation Procedures)": {
            "time_to_resolution": "Just under 3 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in German constitutional law (Verfassungsrecht) and litigation procedures, I can evaluate the formal criteria, legal hurdles, procedural timelines, political calculus, and historical precedents required for a party ban application to be filed at the Bundesverfassungsgericht. My expertise is crucial in distinguishing between political rhetoric and actionable progress toward a formal filing, and in understanding the interplay between legal requirements, government actors, and public sentiment.",
            "status_quo": "No application to ban the AfD has yet been filed at the Federal Constitutional Court. Previous attempts to ban parties have been rare and procedurally cautious, with strong legal and societal reluctance due to both the legal standards and the political risks involved.",
            "perspective_derived_factors": [
                {
                    "factor": "Legal Threshold for Party Ban",
                    "effect": "Decreases probability. Article 21(2) GG requires proof that a party actively seeks to undermine or abolish the free democratic basic order and that there is a concrete risk. The BVerfG has only banned two parties (SRP 1952, KPD 1956) and rejected two (NPD, twice) in the last 70 years, setting a high bar."
                },
                {
                    "factor": "Political Will and Coordination",
                    "effect": "Increases probability. The SPD has formally called for preparing a ban application, and cross-state/federal working groups exist, indicating more political momentum than in past debates. However, key actors (e.g., Interior Minister, CDU/CSU leadership) remain publicly skeptical, and a Bundestag/Bundesrat majority is not guaranteed."
                },
                {
                    "factor": "BfV Classification and Legal Precedents",
                    "effect": "Mixed. The BfV has (as of May 2025) classified the AfD as 'right-wing extremist', but this status is currently suspended pending a court challenge. A pending administrative court case means any filing may be strategically delayed until this legal basis is more secure."
                },
                {
                    "factor": "Public Opinion and Electoral Dynamics",
                    "effect": "Decreases probability. Multiple polls show a clear majority of Germans oppose a ban, with especially strong opposition in eastern Germany. Key parties may fear a backlash or strengthening the AfD, as seen in expert and party leader statements."
                },
                {
                    "factor": "Procedural Time Constraints",
                    "effect": "Decreases probability. As of early October 2025, less than three months remain. Even with accelerated action, consensus-building, committee reports, and a parliamentary vote would be needed, making pre-2026 filing logistically difficult unless already in advanced stages."
                },
                {
                    "factor": "Recent Actions and Announcements",
                    "effect": "Increases probability. News from October 2025 confirms that the SPD and some parliamentarians are explicitly calling for preparation and evidence-gathering for a ban application, and that a formalized process is underway. However, the process described involves thorough legal review before any filing, and key actors stress the need for a 'viable case.'"
                }
            ],
            "no_scenario": "Despite vocal calls, the SPD and other proponents do not secure the necessary legal or political consensus in time. The working group continues gathering evidence, but the ongoing administrative court case means the classification of the AfD as 'extremist' is not fully legally established. Procedural requirements—such as committee review, parliamentary debate, and coalition-building—delay any final vote. As a result, no formal application is submitted to the Bundesverfassungsgericht before January 1, 2026.",
            "yes_scenario": "Mounting political pressure and SPD momentum result in an expedited internal process. The working group deems the legal threshold met based on the existing BfV report and evidence. Either the Bundestag (possibly with a slim majority), the Bundesrat, or the federal government moves ahead despite ongoing legal contestation of the BfV classification. A formal application is filed with the Federal Constitutional Court before the end of 2025, perhaps as a symbolic move ahead of the next electoral cycle.",
            "final_reasoning": "While political momentum has grown significantly, and the legal groundwork (BfV classification, working groups, SPD push) is more advanced than in prior years, several key obstacles remain. The legal standard is extremely high, and the ongoing administrative court case over the BfV classification provides a strong incentive for cautious timing. Public opposition is substantial, and some key actors in government and the Bundestag remain skeptical or opposed, fearing unintended electoral consequences. Crucially, time is very short to complete internal reviews, gather evidence, and achieve the necessary formal decisions within major organs (Bundestag, Bundesrat, or government). Although the possibility is higher than at any previous point since the AfD's founding, the logistical and legal hurdles for filing an application before January 1, 2026 remain formidable. I estimate the probability at 30%: higher than base rates for party ban attempts, but still meaningfully less likely than not, given the remaining procedural, legal, and political barriers.",
            "final_probability": 30
        },
        "Legal Practice in Germany (Political Party Ban Process)": {
            "time_to_resolution": "Just under 3 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in German legal practice—specifically the process and prerequisites for party bans under the Basic Law (Grundgesetz)—I understand the high legal bar for party bans, the historical precedents, the procedural hurdles, and the interplay between political momentum and judicial feasibility. This perspective allows me to weigh not only public and political pressure but also the likelihood that formal, procedural, and evidentiary requirements will be met to the extent that an actual application is filed before the Federal Constitutional Court (BVerfG).",
            "status_quo": "No application to ban the AfD has been filed with the Federal Constitutional Court. Despite mounting calls and some preparations, the formal threshold—an application by the Bundestag, Bundesrat, or Federal Government—has not yet been crossed.",
            "perspective_derived_factors": [
                {
                    "factor": "Political Momentum and SPD Initiative",
                    "effect": "Increases probability. The SPD and allied parties are actively preparing the ground for a ban, passing resolutions, and forming working groups. There is a clear, organized political will in at least one major governing party to initiate proceedings if legal review supports it."
                },
                {
                    "factor": "Legal Threshold and Evidentiary Demands",
                    "effect": "Decreases probability. German party bans require not just evidence of anti-constitutional intent, but also proof that the party's actions represent an 'active, aggressive, and combative' stance against the liberal-democratic order, and that it poses a concrete threat. The failure of the previous NPD ban attempt (2017) due to lack of threat, not intent, is a sobering precedent. The SPD's own statements stress that a ban should only be pursued if legal review suggests a strong chance of success."
                },
                {
                    "factor": "Timing and Judicial Caution",
                    "effect": "Decreases probability. While the SPD is accelerating preparations, the process of gathering, reviewing, and consolidating evidence is time-consuming. There is risk aversion in filing a weak case, given the high political and reputational stakes. There is also a tendency to wait for pending litigation (e.g., the challenge to the BfV extremist classification) to be resolved, which may not happen by end-2025."
                },
                {
                    "factor": "Coalitional and Institutional Resistance",
                    "effect": "Decreases probability. Key figures outside the SPD (e.g., Interior Minister Dobrindt/CSU, Chancellor Merz/CDU) oppose a ban, fearing it would backfire politically. A formal application typically requires consensus-building across parties or at least within the Bundestag majority or Bundesrat, which currently appears fragmented."
                },
                {
                    "factor": "Public Opinion and Social Backlash",
                    "effect": "Decreases probability. Polls show a clear majority of Germans, especially in the east, oppose a ban. Political actors may hesitate to move forward with a divisive step that could be seen as undemocratic or fuel AfD support."
                },
                {
                    "factor": "BfV Classification and Ongoing Litigation",
                    "effect": "Decreases probability. The classification of the AfD as a 'confirmed' right-wing extremist organization is suspended pending the outcome of court proceedings. This legal limbo makes it less likely that an application will be filed imminently, since the classification is key evidence for any potential ban."
                },
                {
                    "factor": "Historical Base Rate",
                    "effect": "Decreases probability. Since 1949, only two parties have been banned, and in the past decades, even attempts against the NPD failed. Applications are exceedingly rare and only made after exhaustive review."
                }
            ],
            "no_scenario": "Despite ongoing SPD preparations and political rhetoric, the legal review is not completed or does not yield a sufficiently convincing case by end-2025. The BfV classification remains tied up in litigation, coalition partners and/or the Bundesrat/Bundestag do not reach the necessary consensus, and/or the political calculation is made that filing before further consolidation of evidence or public support would be premature and risky. No formal application is filed before January 1, 2026.",
            "yes_scenario": "The SPD, potentially joined by other parties or after a shift in coalition dynamics, accelerates its legal review and, on the basis of the existing BfV report and ongoing political pressure, files an application before the end of 2025. This could be triggered by a new scandal, a surge in AfD radicalization, or a fast-tracked conclusion that waiting is more dangerous than acting.",
            "final_reasoning": "There is substantial political momentum for an AfD ban, with the SPD and other political actors openly preparing for an application. However, the German legal system sets an extremely high bar for party bans, both in terms of evidence and in the procedural caution exercised before filing. Key legal evidence (BfV classification) is suspended pending ongoing litigation, and there is not yet clear consensus among all constitutional organs empowered to file. Public opinion is also largely against a ban, adding further hesitation. Historically, party bans are exceedingly rare, and applications are only filed after exhaustive review and cross-party consensus, which are not yet conclusively in place. While the probability has risen from a year ago, and a last-minute political decision remains possible, the combination of legal, procedural, and political headwinds means the most likely outcome remains that no application will be filed before 2026.",
            "final_probability": 28
        },
        "German Political Analysis (Policy Advisory on FarRight Parties)": {
            "time_to_resolution": "About 3 months (until December 31, 2025)",
            "perspective_relevance": "As an expert in German Political Analysis focusing on far-right parties, I have a deep understanding of the institutional, legal, and political constraints and incentives that affect party bans in Germany. I can evaluate both the procedural hurdles, the historic base rates for such bans, the political calculus within key actors (SPD, CDU/CSU, Greens, FDP, Bundesrat, federal government), the legal thresholds, and the likely reactions from German public opinion and constitutional institutions.",
            "status_quo": "No formal application to ban the AfD has been filed at the Federal Constitutional Court. While calls and preparations are underway, the Bundestag, Bundesrat, or federal government have not yet submitted an application.",
            "perspective_derived_factors": [
                {
                    "factor": "Legal Precedent and Base Rate",
                    "effect": "Decreases probability. Only two parties have been banned by the Constitutional Court (SRP 1952, KPD 1956), and both were in the early Federal Republic under unique circumstances. Multiple attempts to ban the NPD failed, partly due to procedural and evidentiary hurdles."
                },
                {
                    "factor": "Public Opinion",
                    "effect": "Decreases probability. Multiple recent polls show a clear majority of Germans (52% nationally, higher in the East) oppose banning the AfD. Politicians are aware of the risk of backlash, especially in the East, and the risk of martyring the party."
                },
                {
                    "factor": "Political Will and SPD/Green/Left Mobilization",
                    "effect": "Increases probability. The SPD and some Greens/Left are pushing hard, with formal declarations, working groups, and public statements. There is some momentum and coordination at the federal and state level."
                },
                {
                    "factor": "Institutional Resistance and CDU/CSU/FDP Reluctance",
                    "effect": "Decreases probability. Key figures in the federal government (CDU/CSU Interior Minister), and the CDU/CSU as a whole, are publicly opposed, arguing that a ban could backfire and that it's better to 'govern the AfD out of existence.' An application without CDU/CSU support is much harder to pass in the Bundestag or Bundesrat."
                },
                {
                    "factor": "Legal/Procedural Readiness",
                    "effect": "Neutral to slightly increases probability. Preparatory work is ongoing, but as of October 2025, the process is still at the evidence-gathering/assessment stage. Application would only be filed if there is a high chance of success, per SPD statements."
                },
                {
                    "factor": "BfV Classification and Judicial Process",
                    "effect": "Decreases probability for short-term. The nationwide 'extremist' classification is suspended pending outcome of AfD's legal challenge. Uncertainty about the outcome of this case complicates the basis for a ban application."
                },
                {
                    "factor": "Political Incentive Timing",
                    "effect": "Slightly increases probability. With AfD now polling first or tied for first and entering a period of maximum threat perception among establishment parties, incentives for a dramatic move before the next federal election are high. However, the legal process is slow and risk-averse."
                },
                {
                    "factor": "International/EU Context and Precedent",
                    "effect": "Slightly increases probability. Recent bans/disqualifications of far-right parties or politicians in other EU states (France, Romania, Moldova) may embolden some actors, but Germany's legal culture is more cautious."
                }
            ],
            "no_scenario": "The SPD and allied parties continue to prepare the legal groundwork but fail to secure broad enough support in the Bundestag or Bundesrat to submit a formal application before the end of 2025. CDU/CSU and FDP continue to oppose, citing risks and public opinion. The BfV's extremist classification remains in legal limbo, and risk-averse legal advice from government ministries prevails. No application is filed before 2026.",
            "yes_scenario": "Faced with increasing pressure from the SPD base, civil society, and some state governments, and emboldened by the BfV's evidence (even if under legal challenge), a coalition of SPD, Greens, and Left gathers enough votes in either the Bundestag or Bundesrat to submit an application, possibly even without CDU/CSU support, or the federal government itself acts. The move is justified as a defense of the constitutional order amid polls showing AfD leading. The application is filed in late 2025, even if it is likely to fail in court.",
            "final_reasoning": "The base rate for party bans is extremely low in the Federal Republic, and the process is designed to be slow, cautious, and consensus-driven. The legal and political risk of backfiring is high, as is public opposition, especially in the East. However, the current moment is the closest Germany has come in decades: the AfD is at an all-time polling high, the SPD and some Greens/Left are committed to at least preparing for a ban, and there is a federal/state working group gathering evidence. The BfV's extremist classification boosts the legal case, but its suspension (pending court challenge) is a significant procedural hurdle. Key institutional actors (CDU/CSU, FDP) remain opposed, and cross-party consensus—historically required for such a dramatic step—remains elusive. The SPD's language is strong, but the official process is still in the preparatory stage, and their own statements indicate they will only file if prospects for success are clear. While the probability is higher than in any previous cycle, the inertia of the German legal and political system, public opinion, and the need for broad support suggest the most likely outcome is that no application will be filed before 2026. Nevertheless, the probability is meaningfully nonzero due to the extraordinary pressure and advanced preparatory steps.",
            "final_probability": 27
        },
        "Political Science (Party Systems Theory)": {
            "time_to_resolution": "Approximately 3 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Political Science with a focus on Party Systems Theory, I am equipped to analyze institutional incentives, historical base rates of party bans, the dynamics of party competition in advanced democracies, legal and constitutional thresholds, and the strategic calculus of mainstream parties facing electorally successful challengers. This perspective helps contextualize calls for banning parties like the AfD within the broader trajectory of democratic resilience, party competition, and the concept of 'militant democracy' in Germany.",
            "status_quo": "No formal application to ban the AfD has been filed at the Federal Constitutional Court by the Bundestag, Bundesrat, or Federal Government. Despite mounting calls, the legal process has not been triggered yet.",
            "perspective_derived_factors": [
                {
                    "factor": "Base Rate of Party Bans in Germany",
                    "effect": "Decreases probability. Only two parties have ever been banned in postwar Germany (SRP 1952, KPD 1956); more recent attempts (e.g., NPD) failed. The constitutional threshold is high and precedent is rare."
                },
                {
                    "factor": "Political Incentives and Risks for Mainstream Parties",
                    "effect": "Decreases probability. Mainstream parties risk backlash, increased AfD support, and accusations of undemocratic behavior. Surveys show most Germans oppose a ban, and prominent voices (e.g., Dobrindt/CSU) advocate against it for fear of martyring the AfD."
                },
                {
                    "factor": "Legal Preconditions and Ongoing Litigation",
                    "effect": "Decreases probability. The BfV's classification of the AfD as 'extremist' is not currently final—it's suspended pending court review. A ban application is unlikely to move forward while this is unresolved, as a failed application would be politically costly."
                },
                {
                    "factor": "Recent Escalation of Political and Social Pressure",
                    "effect": "Increases probability. SPD and some other parties are publicly mobilizing for a ban, and a federal-state working group has been established to prepare evidence. The climate is more favorable to a ban attempt than at any previous time."
                },
                {
                    "factor": "AfD’s Electoral Strength and Social Legitimacy",
                    "effect": "Decreases probability. The AfD is polling at historic highs and is often the leading or second party. Banning the largest opposition party risks severe legitimacy costs for the political system and may be seen as anti-democratic by a large segment of the public."
                },
                {
                    "factor": "Militant Democracy Norms and International/EU Context",
                    "effect": "Small increase. Germany's 'militant democracy' principle allows for party bans, and recent EU trends show more assertive actions against far-right parties, which could embolden proponents of a ban."
                },
                {
                    "factor": "Time Constraints",
                    "effect": "Decreases probability. The question resolves in less than three months, a short window for the necessary consensus and procedural steps, especially given the pace of German legal and parliamentary processes."
                }
            ],
            "no_scenario": "SPD and allied parties continue rhetorical and preparatory work but do not secure the necessary cross-party support or legal clarity (e.g., BfV classification remains suspended). Mainstream parties, fearing backlash and legal failure, delay or shelve plans until after the resolution deadline. The application is not filed before January 1, 2026.",
            "yes_scenario": "A surge in political momentum—possibly due to a scandal, violence linked to AfD affiliates, or an adverse court ruling upholding the 'extremist' classification—pushes either the Bundestag, Bundesrat, or Federal Government to act rapidly. Sufficient evidence is marshaled and a formal application is filed before the deadline.",
            "final_reasoning": "The current environment is the most favorable for a ban application in German postwar history, with the SPD actively preparing the groundwork and a federal-state working group established. However, crucial legal hurdles remain: the BfV's 'extremist' classification is not final and remains suspended pending litigation, making a ban application legally risky and potentially doomed if filed prematurely. The political risks are also acute: public opinion is mostly against a ban, and major coalition actors (notably the CDU/CSU) are skeptical or opposed, fearing it will further boost the AfD. The process for filing such an application is politically and procedurally complex, and the time window is very short. While the groundwork is being laid, it is most likely that a final application will not be filed before the deadline, though the probability is higher than in any previous period. A last-minute surge (e.g., due to a major crisis) could change this, but barring such a development, the status quo will prevail.",
            "final_probability": 23
        },
        "Political Science (Radical Right Parties Literature)": {
            "time_to_resolution": "Just under 3 months (until December 31, 2025)",
            "perspective_relevance": "As an expert in Political Science with a focus on Radical Right Parties, I bring knowledge of institutional responses to far-right parties, the legal and political history of party bans in Germany, the concept of 'militant democracy,' and the empirical literature on how mainstream parties, civil society, and the judiciary interact with rising radical right movements. I am also attentive to base rates—how rare party bans are in postwar Germany—and to the distinction between public rhetoric, intra-elite consensus, and actual institutional action.",
            "status_quo": "No application to ban the AfD has yet been filed at the Federal Constitutional Court. Political discussion and preparation are ongoing, with working groups and growing calls for action, but the formal step has not been taken.",
            "perspective_derived_factors": [
                {
                    "factor": "Legal and Historical Precedent",
                    "effect": "Decreases probability. Only two parties have ever been banned by the Federal Constitutional Court (SRP, KPD, both in early postwar years). More recent attempts (e.g., NPD) failed even with substantial evidence, showing the very high bar for both evidence and political consensus."
                },
                {
                    "factor": "Political Mobilization and Elite Consensus",
                    "effect": "Increases probability. The SPD has formally called for preparation of a ban, working groups are active, and there is cross-party support at least to consider the step, with the SPD, Greens, and some CDU members involved."
                },
                {
                    "factor": "Public Opinion and Backlash Risk",
                    "effect": "Decreases probability. Most Germans (52%) oppose a ban, especially in the east, and many believe banning AfD would only strengthen it by fueling a martyr narrative. Elite actors are aware of the backlash risk and may hesitate."
                },
                {
                    "factor": "Recent Institutional Developments",
                    "effect": "Increases probability. The BfV classified AfD as a 'confirmed right-wing extremist' party (though currently suspended pending court review), which provides more legal basis for a ban application, and there is an active federal-state working group."
                },
                {
                    "factor": "Internal Government Division",
                    "effect": "Decreases probability. Key figures (e.g., Interior Minister Dobrindt) oppose a ban for strategic reasons, and CDU leadership is hesitant. Without broad consensus in Bundestag/Bundesrat/Federal Government, the application may stall."
                },
                {
                    "factor": "Time Constraints and Bureaucratic Process",
                    "effect": "Decreases probability. The process of preparing the extensive legal evidence and gaining institutional agreement is slow. There are less than three months left, and no indication that an application is imminent."
                }
            ],
            "no_scenario": "Despite working groups and public statements, political elites remain divided (especially CDU/CSU resistance), legal hurdles (ongoing court challenge to BfV classification) slow the process, and concerns about public backlash or the risk of martyrdom for AfD cause the Bundestag, Bundesrat, and federal government to delay or indefinitely postpone the filing of a formal ban application until after January 1, 2026.",
            "yes_scenario": "SPD, with support from enough other Bundestag factions (possibly Greens and parts of CDU/CSU), accelerates evidence-gathering, achieves an elite consensus (motivated by further AfD radicalization, violence, or scandal), and files a formal application to the Federal Constitutional Court before the end of 2025, possibly as a symbolic stance even if prospects for success are unclear.",
            "final_reasoning": "The legal and historical base rate for party bans in Germany is extremely low, and previous attempts (NPD) show both the evidentiary bar and the political caution around such moves. While there is clear momentum—SPD and others are actively preparing, the BfV has provided more legal ammunition, and the AfD's radicalization continues—the combination of public opposition, risk of backlash, internal government division (notably, CDU/CSU and some ministers are not on board), slow bureaucratic process, and very tight time window all weigh heavily against a filing before 2026. My expertise suggests that while the odds are higher than they would have been in recent years (perhaps moving from low single digits to the teens or low twenties), a formal application is still somewhat unlikely in the remaining time. A symbolic or rushed filing is possible but would require a sudden political shock—there is no evidence of that as of early October. Therefore, I assign a probability moderately above the strict status quo base rate, but not close to even odds.",
            "final_probability": 22
        },
        "German Constitutional Law (Militant Democracy Doctrine)": {
            "time_to_resolution": "Just under 3 months (until Jan 1, 2026).",
            "perspective_relevance": "As an expert in German Constitutional Law, especially the doctrine of 'streitbare Demokratie' (militant democracy), I bring detailed knowledge of the legal and procedural prerequisites, political risks, and historical precedents for banning parties in Germany. I am attuned to the legal thresholds, the political calculus of constitutional actors, and the significance of ongoing legal disputes about extremism classification.",
            "status_quo": "No application to ban the AfD has yet been filed at the Federal Constitutional Court. Preparations and political debates are ongoing, but the procedural step has not yet been taken.",
            "perspective_derived_factors": [
                {
                    "factor": "Legal Threshold for Party Ban (Grundgesetz Art. 21(2))",
                    "effect": "Decreases probability. The hurdle is very high: the party must actively seek to undermine or abolish the free democratic basic order, and there must be a concrete threat. Previous bans (SRP, KPD) are rare; two recent NPD ban attempts failed (2003, 2017) or partially succeeded, reinforcing reluctance."
                },
                {
                    "factor": "Current Status of Extremism Classification",
                    "effect": "Decreases probability. While the BfV classified AfD as extremist in May 2025, this is under judicial review and the classification is currently suspended. A pending decision weakens the legal basis for a ban application, as a negative ruling would undermine the case."
                },
                {
                    "factor": "Political Will and Coordination Among Initiators",
                    "effect": "Increases probability. SPD and allied parties are preparing dossiers and working groups, with public statements and resolutions pushing for a ban. If evidence review finds a \"viable\" case, they claim there is a duty to proceed."
                },
                {
                    "factor": "Public Opinion and Political Risks",
                    "effect": "Decreases probability. Recent polls show a majority of Germans oppose a ban, especially in eastern Germany. Political actors may fear backlash, AfD martyrdom, or further polarization, making them hesitant to actually file."
                },
                {
                    "factor": "Time Pressure and Precedent of Deliberateness",
                    "effect": "Decreases probability. The legal and political process for party bans is slow and methodical. Given just three months left, and that only preparations (not filings) are reported, the timeline is tight for consensus-building and legal risk assessment."
                },
                {
                    "factor": "Political Divisions in Government",
                    "effect": "Decreases probability. The CDU/CSU, part of the governing coalition, is on record as opposing a ban, preferring to 'govern the AfD out of existence.' Without broad support in Bundestag or Bundesrat, filing is less likely."
                }
            ],
            "no_scenario": "The SPD and allies continue preparing legal materials and evidence. The federal-state working group reviews but does not reach consensus, citing ongoing court cases over the BfV classification and the political/constitutional risks. CDU/CSU and others block or delay parliamentary votes. The government or Bundesrat does not file. No application is made before Jan 1, 2026.",
            "yes_scenario": "SPD and aligned parties, citing urgency and sufficient evidence from BfV and internal reviews, push through a Bundestag vote (possibly with minimum 5% support required for initiative). Either the Bundestag, Bundesrat, or federal government (after coalition negotiation) files an application before Jan 1, 2026, regardless of pending court ruling on BfV classification, possibly to shape the narrative or respond to public pressure.",
            "final_reasoning": "While momentum has grown on the left for a ban, and organizational steps (working groups, evidence gathering) are underway, there remain serious legal, political, and procedural obstacles. The legal threshold is high, and the key factual basis (BfV's extremist classification) is under court review, arguably making a filing premature and legally risky. Public opinion and CDU/CSU opposition further reduce the likelihood of a cross-party consensus or government action. Historically, party bans are rare, and the German constitutional system is cautious, favoring deliberation over haste. With less than three months left, and no credible reports of a vote or imminent filing, the base rate and current trajectory suggest a No outcome is still most likely, though the probability is not negligible given the intense preparation and political signaling. I estimate the probability at 35%.",
            "final_probability": 35
        },
        "German Constitutional Law (Federal Constitutional Court Precedents)": {
            "time_to_resolution": "Approximately 3 months (until January 1, 2026)",
            "perspective_relevance": "Expertise in German Constitutional Law and Federal Constitutional Court precedents is central to this question, as party bans are extremely rare and procedurally complex. The Federal Constitutional Court's jurisprudence (notably the NPD party ban attempts) provides direct insight into the legal and political hurdles for merely filing such an application, irrespective of its ultimate success.",
            "status_quo": "No application to ban the AfD has been filed yet at the Federal Constitutional Court. Despite mounting political and civil society pressure, the legal process has not advanced to the stage of a formal application.",
            "perspective_derived_factors": [
                {
                    "factor": "Legal Precedent and High Bar for Party Bans",
                    "effect": "Decreases probability. The Federal Constitutional Court has only banned two parties (SRP in 1952 and KPD in 1956) and rejected the NPD ban in 2003 and 2017, establishing a very high bar for both filing and success. Politicians and legal experts are acutely aware of the reputational risks of a failed bid."
                },
                {
                    "factor": "Political Momentum and SPD/Coalition Actions",
                    "effect": "Increases probability. There is unprecedented momentum among SPD and allied lawmakers, with formal declarations calling for the preparation of a party ban application, and the establishment of a federal-state working group. Calls for a ban are louder and closer to formalization than in any recent case."
                },
                {
                    "factor": "Constitutional Protection Classification and Legal Challenge",
                    "effect": "Decreases probability. The BfV's 'confirmed right-wing extremist' classification of AfD is suspended pending a court challenge. The lack of a legally unassailable classification undermines the evidentiary basis for a party ban application and likely delays any formal move until the administrative court process is resolved."
                },
                {
                    "factor": "Political Risks and Elite Division",
                    "effect": "Decreases probability. Key figures (e.g., the federal interior minister from CSU) explicitly oppose a ban, citing the risk of martyring the AfD and fueling its support. The Bundestag, Bundesrat, and federal government are not unified, making the required majority for an application uncertain."
                },
                {
                    "factor": "Public Opinion",
                    "effect": "Decreases probability. Polls show a clear majority of Germans (especially in the east) oppose a ban, increasing the political cost and perceived illegitimacy of such a move."
                },
                {
                    "factor": "Time Constraints",
                    "effect": "Decreases probability. With less than three months left, and no application yet filed, time pressure is significant. Previous party ban efforts took months-to-years to build consensus and gather evidence."
                },
                {
                    "factor": "Recent Developments Indicating Preparation",
                    "effect": "Increases probability. As of early October 2025, SPD and legal experts are publicly stating an obligation to file if their working group's assessment finds a viable case. Some reports suggest evidence-gathering is already underway and the climate is more favorable to a filing than ever before."
                }
            ],
            "no_scenario": "Despite ongoing evidence-gathering and mounting political pressure, the SPD and coalition partners do not secure sufficient majority support in the Bundestag/Bundesrat, or the federal-state working group concludes that the legal chances are insufficient and delays or shelves the process. The government ultimately decides that a filing would be premature or too risky without a final, court-upheld 'extremist' designation for AfD. No application is filed before January 1, 2026.",
            "yes_scenario": "The SPD-led working group rapidly compiles evidence and judges that the BfV's (even if suspended) classification and other materials suffice to justify a ban application. With mounting internal and external pressure, and perhaps in response to further radicalization or a scandal involving AfD leadership, a coalition of SPD, Greens, and possibly other parties secure the necessary majority in the Bundestag or Bundesrat—even in the face of some dissent. The formal application to ban AfD is filed at the Federal Constitutional Court before the end of 2025.",
            "final_reasoning": "The procedural and constitutional hurdles to even filing a party ban application in Germany are extraordinarily high, as underscored by prior NPD cases. The current legal situation is complicated by the fact that the BfV's extremist classification of AfD is suspended pending outcome of a legal challenge, weakening the legal foundation for a filing and providing political cover for delay. While SPD and some allied parties are energetically preparing the groundwork and have signaled a willingness to file if a legal review is favorable, key coalition partners (notably the CDU/CSU) are deeply divided or opposed, and there is significant public resistance, especially in the east. The time window before the resolution date is very short. While the environment is more favorable to a filing than at any time in recent history, the actual threshold for consensus and legal readiness is likely not yet met. The probability of a formal application being filed before January 1, 2026, is thus higher than the historical base rate (almost zero), but still unlikely given the stalled status and legal uncertainties. A reasonable, well-justified estimate is 25%.",
            "final_probability": 25
        },
        "Sociology (Social Movement Theory)": {
            "time_to_resolution": "Approximately 3 months (until December 31, 2025)",
            "perspective_relevance": "As an expert in Social Movement Theory, I analyze not only the formal institutional and legal developments but also the dynamics of public opinion, mobilization, countermobilization, elite framing, and legitimacy crises. The prospect of banning a major party like AfD in Germany is best understood as a high-stakes interaction between movement actors, state institutions, and broader societal currents, including the risk of backfire, legitimation crises, and the tactical calculus of political elites.",
            "status_quo": "As of October 2025, no application to ban the AfD has been filed at the Federal Constitutional Court. The Social Democratic Party (SPD) and allied actors are calling for such a move, but the government and Bundestag have not yet acted. The AfD remains legal and highly popular in polls, with significant public opposition to a ban.",
            "perspective_derived_factors": [
                {
                    "factor": "Elite Political Will and Intra-Elite Division",
                    "effect": "Moderately increases probability. There is strong support among SPD leadership and legal experts for preparing a ban, but key figures in the CDU/CSU and the federal Interior Minister oppose such a move, fearing it would legitimize or strengthen the AfD. Cross-party consensus is lacking, but the SPD is actively building evidence and institutional groundwork."
                },
                {
                    "factor": "Public Opinion and Risk of Backfire",
                    "effect": "Decreases probability. Multiple recent surveys show a clear majority of the German public opposes banning the AfD, especially in the east. There is widespread belief that a ban would be seen as undemocratic or would only spawn successor parties. Political elites are likely to weigh the risk of backlash or further radicalization."
                },
                {
                    "factor": "Social Movement Pressure and Civil Society Mobilization",
                    "effect": "Slightly increases probability. Mass protests, coalition mobilization, and antifascist activism keep public and elite attention on the AfD's radicalization, raising the salience and perceived necessity of institutional action among some segments of the political elite, particularly the SPD."
                },
                {
                    "factor": "Legal Institutional Constraints and Precedent",
                    "effect": "Decreases probability. The bar for party bans is extremely high in Germany, with only two parties banned since WWII. Legal experts and previous court decisions emphasize that a ban is a last resort and requires overwhelming evidence. The ongoing legal challenge to the BfV's classification of AfD as 'extremist' may slow or complicate proceedings."
                },
                {
                    "factor": "Recent Radicalization and BfV Classification",
                    "effect": "Moderately increases probability. The May 2025 classification of AfD as a 'confirmed right-wing extremist organization' by the Federal Office for the Protection of the Constitution (BfV) provides a legal and symbolic basis for a ban, even though it is currently suspended pending litigation."
                },
                {
                    "factor": "International and EU Context",
                    "effect": "Slightly increases probability. Growing moves in Europe to use legal means to curtail or ban far-right parties (e.g., France, Romania), and pressure from Brussels to defend 'militant democracy', may embolden German elites to act, though these same trends also fuel populist counternarratives."
                }
            ],
            "no_scenario": "Despite SPD and allied initiatives, the Bundestag or Federal Government fails to achieve the necessary consensus to file an application before the end of 2025. Key CDU/CSU actors and coalition partners, concerned about political backlash and legitimacy, either stall or block the move. Ongoing legal challenges to the BfV's extremist classification of AfD provide a pretext for delay. Public opposition and fear of strengthening the AfD's 'martyr' narrative prevail. Preparations and evidence-gathering continue into 2026, but no formal application is filed before the deadline.",
            "yes_scenario": "SPD and affiliated actors succeed in building enough momentum and institutional consensus, perhaps catalyzed by a further radical incident or damning evidence from the BfV. The Bundestag, Bundesrat, or Federal Government moves to file an application to the Constitutional Court in late 2025, after concluding that the political risks of inaction outweigh those of action. The decision is justified as a defense of democracy, possibly over the objections of some CDU/CSU leaders. The application is filed before January 1, 2026, even if the actual ban is seen as a long shot.",
            "final_reasoning": "The probability of an application to ban the AfD being filed before 2026 is higher than at any previous point, given the SPD's escalation, the BfV's classification, and sustained civil society pressure. There is clear evidence that preparations are underway, with legal and parliamentary frameworks being assembled. However, formidable obstacles remain: public opposition is strong, intra-elite consensus is lacking, and the risk of political backfire is salient. The status quo is powerful, and the German system is designed to make party bans extremely difficult. Nonetheless, the window for a formal application is now open, and the SPD appears committed to pushing the process forward if their legal review concludes there is a viable case. Given the short timeline (about three months) and the hesitancy among key coalition partners, the probability is significant but not overwhelming. Weighting the status quo, elite hesitation, and legal barriers against growing momentum and institutional groundwork, a moderate-to-high probability is warranted.",
            "final_probability": 43
        }
    },
    "deliberation_probability": [
        30,
        28,
        27,
        23,
        22,
        35,
        25,
        43
    ],
    "deliberation_mean_probability": 29.125,
    "deliberation_sd": 6.957780844904091,
    "deliberation_probability_result": 29,
    "group_results": {
        "legalPracticeInGermanyVerfassungsrechtLitigationProcedures": {
            "forecaster_to_engage": "Sociology (Social Movement Theory)",
            "response_type": "critique",
            "response": "While the sociological perspective correctly notes increased civil society pressure and the unprecedented level of official preparation for a ban, the probability assigned (43%) appears to underweight key legal and procedural bottlenecks specific to the German Verfassungsrecht framework. In particular, the mere existence of momentum or mobilization does not overcome the institutional inertia and legalistic caution that define party ban procedures in Germany. The status quo bias in the German legal-political system is especially pronounced in Verfassungsrecht litigation, where past attempts (e.g., NPD) have taken years just to prepare and required broad elite consensus and airtight legal documentation. Additionally, the ongoing suspension of the BfV's extremist classification due to court challenge makes any imminent filing legally risky, and public opposition further dampens the likelihood of a rushed move. Thus, while social movement pressure is relevant, it does not substitute for the formal procedural hurdles that remain, making a probability as high as 43% an overestimate when viewed through the lens of legal practice and precedent."
        },
        "legalPracticeInGermanyPoliticalPartyBanProcess": {
            "forecaster_to_engage": "German Constitutional Law (Militant Democracy Doctrine)",
            "response_type": "defense",
            "response": "Your estimate of 35% recognizes both the heightened momentum for a ban and the formidable legal and procedural obstacles that remain. I support your emphasis on the legal threshold (particularly the suspended BfV classification and lack of a key triggering event), the importance of CDU/CSU opposition, and the persistent need for cross-party consensus for such a consequential move. Your reasoning appropriately balances the unique uptick in preparatory activity with the enduring status quo bias of German constitutional law, and your probability is well-calibrated to reflect a scenario that is more likely than at any time since 1949, but still not the default. The slightly higher probability compared to others is defensible due to the extraordinary political context, but it does not overstate the likelihood given the legal and procedural realities."
        },
        "germanPoliticalAnalysisPolicyAdvisoryOnFarrightParties": {
            "forecaster_to_engage": "German Constitutional Law (Federal Constitutional Court Precedents)",
            "response_type": "defense",
            "response": "Your analysis provides a well-calibrated and nuanced perspective rooted in both the legal and procedural realities of Germany’s party ban framework. In particular, you correctly emphasize the extraordinary legal threshold for filing, the chilling effect of the BfV classification being suspended pending judicial review, and the historic rarity of successful (or even attempted) party ban applications in the Bundesrepublik. You also accurately highlight the importance of political consensus, which remains elusive given ongoing CDU/CSU and FDP opposition. Your probability estimate of 25% is justified by both the current uptick in preparatory activity and the persistent systemic caution built into Germany's constitutional order. This approach avoids overreacting to short-term political momentum and respects the inertia and legal conservatism that have shaped past decisions, especially as seen in the NPD cases. Thus, your reasoning and probability assignment represent a sound and defensible synthesis of legal precedent and current developments."
        },
        "politicalSciencePartySystemsTheory": {
            "forecaster_to_engage": "Political Science (Radical Right Parties Literature)",
            "response_type": "defense",
            "response": "Your estimate and reasoning are strong, especially in their grounding in base rates and comparative cases (such as the NPD). You correctly note that, while legal and political momentum is at an all-time high, the institutional design of the German party system and the constitutional process for bans make such filings rare and slow-moving. The risks of backlash and political martyrdom for the AfD, public opposition (particularly in the east), and the high evidentiary bar are appropriately weighted. In addition, your recognition of the need for a sudden political shock to alter the current trajectory aligns well with historical patterns of system-level interventions against radical parties. By placing your probability in the low twenties, you avoid overestimating the effect of current mobilization, which is a common pitfall when interpreting periods of high political tension. Your scenario analysis is particularly helpful for clarifying what would have to change for a Yes outcome to become plausible."
        },
        "politicalScienceRadicalRightPartiesLiterature": {
            "forecaster_to_engage": "Legal Practice in Germany (Political Party Ban Process)",
            "response_type": "defense",
            "response": "Your forecast is well-founded: it recognizes the significant political momentum and legal groundwork being laid, but also demonstrates acute awareness of the high legal and procedural bar required for a party ban in Germany. You properly emphasize the suspension of the BfV's extremist classification as a critical procedural obstacle, which undermines the legal case for a ban and offers political actors justification for caution or delay. Your probability (28%) is slightly above the strict status quo, reflecting the unique moment, yet remains realistic given the inertia and risk-averse nature of German constitutional politics. The nuanced balance you strike between heightened pressure and entrenched institutional caution effectively mirrors the literature on how major party bans are discussed but rarely enacted in established democracies. This careful calibration is preferable to more reactive or optimistic assessments."
        },
        "germanConstitutionalLawMilitantDemocracyDoctrine": {
            "forecaster_to_engage": "Legal Practice in Germany (Verfassungsrecht Litigation Procedures)",
            "response_type": "defense",
            "response": "Your analysis is exemplary in its focus on the unique procedural and evidentiary constraints within German constitutional litigation, especially regarding party bans. You correctly highlight that the logistical and legal hurdles are formidable, and that even with high political momentum, the structural bias toward caution in Verfassungsrecht litigation is decisive. The ongoing suspension of the BfV's extremist classification is a critical, underappreciated legal bottleneck, and your reasoning rightly weighs this as a strong impediment against imminent filing. By situating your probability (30%) above historical base rates, yet well below a coin toss, your assessment is both realistic and sensitive to the unique features of German constitutional law. This clear-eyed focus on legal process and precedent is essential for avoiding the overstatement of short-term political developments."
        },
        "germanConstitutionalLawFederalConstitutionalCourtPrecedents": {
            "forecaster_to_engage": "German Political Analysis (Policy Advisory on FarRight Parties)",
            "response_type": "defense",
            "response": "Your argument is compelling in its synthesis of legal, political, and public opinion factors in the context of Germany's unique party ban regime. You correctly emphasize the extreme rarity of party ban applications and the slow, consensus-driven nature of the process, referencing the NPD cases and the inertia of the German legal-political system. Your weighting of public and elite hesitation is well-justified, especially in light of CDU/CSU and FDP resistance, and you do not overinterpret the SPD's preparatory activity as a guarantee of imminent action. The recognition that the BfV's classification, while significant, is not dispositive when suspended, demonstrates an appreciation for the layered procedural hurdles. Your probability, just below 30%, is prudent and well-calibrated to the evidence: it acknowledges the extraordinary political moment, but ultimately gives due weight to the entrenched barriers to fast action in the German constitutional order."
        },
        "sociologySocialMovementTheory": {
            "forecaster_to_engage": "Legal Practice in Germany (Verfassungsrecht Litigation Procedures)",
            "response_type": "critique",
            "response": "Your analysis is rigorous on the procedural and legal bottlenecks, but it may underappreciate the degree to which political and societal mobilization can act as a catalyst for elite action even in highly institutionalized legal systems. Social Movement Theory suggests that when political opportunity structures shift—such as through mass protests, elite defection, or legitimacy crises—previously rigid institutional routines can become more permeable. While status quo bias and procedural caution are real, the intense and sustained mobilization against the AfD, combined with a potential tipping point in elite consensus (particularly if a symbolic incident or new evidence surfaces), could compress timelines and induce a window for action. This does not negate the high bar, but it means that the probability should not be anchored too strictly to past ban attempts (e.g., NPD), where movement pressure and public salience were lower. The legal system, though conservative, is still embedded in a dynamic social context that can produce rapid shifts—especially when actors perceive existential threats to democracy. Thus, while 43% may be on the higher end, a modest upward adjustment from your 30% could better account for these sociopolitical dynamics."
        }
    },
    "revision_results": {
        "Legal Practice in Germany (Verfassungsrecht Litigation Procedures)": {
            "my_phase1_final_probability": 30,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, especially the critique of the Sociology (Social Movement Theory) forecast, my assessment of the legal and procedural hurdles is reinforced. Most other expert perspectives—including those focused on political and legal process—align closely with my own probability estimate, clustering between 22% and 35%, and consistently highlight the same obstacles: the high legal threshold, unresolved BfV classification, short procedural timeline, and lack of broad institutional consensus. The sociological argument for a higher probability is insufficient to outweigh these issues, as social movement pressure does not directly translate into expedited legal action in German Verfassungsrecht. Therefore, I see no compelling reason to revise my probability estimate at this time.",
            "revised_probability": 30
        },
        "Legal Practice in Germany (Political Party Ban Process)": {
            "my_phase1_final_probability": 28,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, my assessment of the legal and procedural hurdles remains robust. Other legal experts and political scientists converge near my estimate, emphasizing the substantial status quo inertia and the high legal bar for filing such an application. The critique of the higher estimate (43%) is persuasive: social mobilization and political will are necessary but not sufficient for a ban application under German constitutional law, given the ongoing suspension of the BfV classification and lack of cross-party consensus. However, the defense of a slightly higher probability (35%) by the 'Militant Democracy Doctrine' perspective is also valid, considering the extraordinary political moment and the unprecedented level of preparatory work. Given the short time remaining and the procedural bottlenecks, my confidence in a sub-30% probability is strengthened. Nevertheless, to modestly reflect the unusually high level of groundwork and some chance of a last-minute political shift, I will edge my probability up slightly.",
            "revised_probability": 30
        },
        "German Political Analysis (Policy Advisory on FarRight Parties)": {
            "my_phase1_final_probability": 27,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, my initial forecast (27%) remains well-supported by the consensus among experts in law, political science, and German constitutional practice. The modal range of well-argued probabilities is 22–35%, with most forecasters converging on the status quo bias, elevated but still minority odds due to unprecedented political momentum. The higher estimate from 'Sociology (Social Movement Theory)' (43%) appears to overstate the causal power of civil society mobilization given the entrenched procedural and legal hurdles. Conversely, my initial forecast, which closely matches the 25–30% probabilities of legal specialists and constitutional scholars, reflects the best synthesis of legal, political, and institutional realities. No new evidence from the deliberation phase justifies a meaningful change in my estimate. Therefore, my revised probability remains 27%.",
            "revised_probability": 27
        },
        "Political Science (Party Systems Theory)": {
            "my_phase1_final_probability": 23,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I find my initial estimate remains well-calibrated. Several forecasters from legal and political science backgrounds independently converge on probabilities in the low-to-mid 20s to mid-30s, all citing the same key barriers: the unresolved legal status of the BfV's classification, historical base rates, lack of elite consensus (notably CDU/CSU opposition), and strong status quo inertia. The defense of the Radical Right Parties Literature perspective reinforces my own scenario analysis, particularly the requirement for a sudden shock to shift the trajectory. Critiques of higher probabilities (such as the 43% estimate) are compelling, emphasizing that social movement pressure cannot substitute for formal legal and procedural requirements. No new information arose suggesting that an application is imminent or that procedural bottlenecks have eased. Therefore, I see no justification for adjustment and maintain my original estimate.",
            "revised_probability": 23
        },
        "Political Science (Radical Right Parties Literature)": {
            "my_phase1_final_probability": 22,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, my initial probability remains within the consensus range of most legal and political science forecasters (generally 22–30%), with all recognizing the extraordinary procedural and legal barriers to filing a party ban application in Germany. The strongest arguments presented in deliberation reinforce my view: the status quo bias and base rate for actual filings are extremely low, and the current BfV classification is suspended, making a rushed application unlikely. While the group included one notably higher probability (43%), the majority remain clustered around my initial estimate, and the legal practitioners in particular emphasize the inertia and risk aversion of the German system. The best arguments for revision upward—growing momentum and civil society pressure—are already factored into my estimate, and do not outweigh the procedural and legal headwinds. Thus, I see no compelling case for a change.",
            "revised_probability": 22
        },
        "German Constitutional Law (Militant Democracy Doctrine)": {
            "my_phase1_final_probability": 35,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I find my initial probability is well-supported by both legal and political analyses from other forecasters. There is broad agreement on the extraordinary legal and procedural barriers, especially the significance of the suspended BfV classification and the lack of consensus among key constitutional actors. The only notably higher probability comes from the sociological perspective, but as several legal experts (including myself) pointed out, social movement pressure is not sufficient to overcome the German legal system's institutional inertia and procedural caution regarding party bans. The probability range among legal and political experts (22-30%) supports the view that, while the environment is unprecedentedly favorable for a ban application, the status quo bias and tight timeline make a filing before 2026 unlikely but not negligible. Therefore, I see no compelling reason to revise my probability from Phase 1.",
            "revised_probability": 35
        },
        "German Constitutional Law (Federal Constitutional Court Precedents)": {
            "my_phase1_final_probability": 25,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, there is strong convergence among legal and political experts that, while the probability of a filing is higher than the historical base rate, the formidable legal, procedural, and political obstacles remain decisive barriers. The legal status of the BfV's classification (suspended pending appeal) and the lack of unified political will in key organs (Bundestag, Bundesrat, or federal government) are recurring, well-justified themes. The defense of my own and similar forecasts reinforces that the current political momentum, while unprecedented, is still insufficient to overcome entrenched legal and procedural inertia—especially given the extremely short time frame remaining. No new evidence or argument emerged in deliberation to warrant raising the probability. If anything, the consensus among specialists in German law and party bans supports holding firm, or even marginally lowering, the estimate. However, 25% continues to best balance the current political activity with the prevailing legal and institutional barriers.",
            "revised_probability": 25
        },
        "Sociology (Social Movement Theory)": {
            "my_phase1_final_probability": 43,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I recognize that legal experts and political scientists consistently stress the exceptional inertia and procedural hurdles in the German party ban process, especially the importance of the BfV classification being suspended and the historical rarity of any party ban filings. The consensus among these domain experts is that, while the probability is higher than in any prior period, the legal and institutional brakes remain very strong, and the time window is extremely short. My own critique of the legal perspective highlighted that social mobilization can sometimes accelerate elite action even in slow-moving systems. However, the forceful arguments about status quo bias, the risk of legal backfire, and the lack of broad elite consensus make it clear that my initial estimate was likely too high. A moderate downward revision is warranted to better reflect the entrenched procedural and legal obstacles, while still recognizing the exceptional mobilization and groundwork now underway.",
            "revised_probability": 35
        }
    },
    "revision_probability": [
        30,
        30,
        27,
        23,
        22,
        35,
        25,
        35
    ],
    "revision_mean_probability": 28.375,
    "revision_sd": 5.0124844139408555,
    "revision_probability_result": 28,
    "question_details": {
        "id": 38968,
        "title": "Will an application to ban AfD be filed at the Federal Constitutional Court before 2026?",
        "created_at": "2025-08-31T06:17:46.252423Z",
        "open_time": "2025-10-03T11:27:28Z",
        "cp_reveal_time": "2025-10-03T12:57:28Z",
        "spot_scoring_time": "2025-10-03T12:57:28Z",
        "scheduled_resolve_time": "2026-01-01T10:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-10-03T12:57:28Z",
        "actual_close_time": "2025-10-03T12:57:28Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "This question is synced with an identical question on Metaculus. The original question opened on 2025-01-10 20:00:00 and can be found [here](https://www.metaculus.com/questions/31341). This question will resolve to the same value as the synced question. The original question's background info at this time is below. \n\nFounded in 2013, the [AfD (Alternative for Germany) party](https://en.wikipedia.org/wiki/Alternative_for_Germany) has gained increasing support in recent years, particularly in eastern Germany. In 2024 it achieved very strong results in three east Germany federal states, coming first in Thuringia and a close second in both Saxony and Brandenburg.\n\nAfD is known for its Eurosceptic stance and its strong opposition to immigration, especially from Muslim countries. The German judiciary has classified the party as a \"suspected extremist\" party, despite the party's claims of adherence to democratic principles. Various voices [have called](https://www.bbc.com/news/world-europe-68029232) for a ban of AfD, a sentiment that has recently gained momentum ([DW](https://www.dw.com/en/will-german-far-right-afd-party-be-banned/a-70531838)):\n\n> Their chance of success is uncertain, but a cross-party group of Bundestag parliamentarians, led by lawmaker Marco Wanderwitz of the center-right Christian Democrats (CDU) is attempting it anyway: On Thursday, 37 lawmakers announced that they would seek to ban the partially right-wing extremist Alternative for Germany (AfD). Together, they represent 5% of parliament — a requirement to take their initiative to the next stage: a parliamentary vote which, if passed, would bring the matter before the Federal Constitutional Court.\n\n`{\"format\":\"metac_closes_in_period\",\"info\":{\"post_id\":31341,\"question_id\":30970}}`",
        "resolution_criteria": "This question will resolve as **Yes** if, before January 1, 2026, an application is filed at the German Federal Constitutional Court to ban the Alternative for Germany (AfD) political party at the federal level, by the Federal Government, the Bundestag, or the Bundesrat",
        "fine_print": "",
        "post_id": 39591,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**AGONY OF EU POLITICAL PLURALISM: HOW BRUSSELS BURIES DEMOCRATIC PRINCIPLES**\nThe article argues that the European Union is undermining democratic principles by systematically suppressing political pluralism, particularly in post-Soviet and core EU countries. It highlights the 2025 parliamentary elections in Moldova, where President Maia Sandu’s Action and Solidarity Party (PAS) won 50.20% of the vote, with 78.5% of diaspora votes—mostly in EU countries—providing a decisive advantage. The opposition faced legal disqualification, mass detentions, and allegations of orchestrated suppression. Similarly, in Romania, the Constitutional Court annulled the first round of the 2024 presidential election after Călin Georgescu, a Eurosceptic candidate, led with 22.94%, citing alleged foreign interference. Georgescu was later barred from the re-run, which was won by pro-European candidate Nicușor Dan. In France, Marine Le Pen was convicted in March 2025 of embezzling EU funds, sentenced to four years (two suspended), fined €100,000, and disqualified from public office for five years—effectively barring her from the 2027 presidential election. In Germany, the Federal Office for the Protection of the Constitution (BfV) classified the Alternative for Germany (AfD) as a 'far-right extremist' organization on 2 May 2025, based on a 1,000-page report, despite the party’s rise to 20.8% of the vote and 152 seats in the Bundestag. The SPD has since initiated efforts to ban the AfD via the Federal Constitutional Court. The author contends these cases reveal a systemic pattern: when political competition threatens Brussels-aligned elites, legal mechanisms are weaponized to suppress opposition, transforming the EU’s democratic facade into a 'simulacrum' of pluralism. The article concludes that the EU’s institutional architecture is failing to address core challenges and is increasingly authoritarian in practice.\nOriginal language: en\nPublish date: October 02, 2025 08:10 PM\nSource:[The Duran](https://theduran.com/agony-of-eu-political-pluralism-how-brussels-buries-democratic-principles/)\n\n**Nationwide Coalition Mobilizes Against AfD Youth Re-Founding in Gießen**\nA nationwide coalition named 'widersetzen' is mobilizing against the planned re-establishment of the AfD youth organization in Gießen on November 29–30, 2025. The coalition, representing over 80 cities and including unions, antifascist groups, and NGOs, argues that a youth wing of the far-right AfD must not exist due to its ties to violent groups. Protest actions include road blockades of access routes to the Messe Gießen, with only emergency vehicles permitted through. The group plans mass mobilization via buses from across Germany, aiming to surpass the 15,000 attendees and 200 buses that disrupted the AfD’s 2024 party congress in Riesa. Police anticipate up to 40,000 demonstrators over two days and are preparing for multiple scenarios, though no concrete calls for violence have been reported. The coalition emphasizes non-escalation, stating it seeks only to prevent the event. The new AfD youth group, expected to be radicalized under the influence of Björn Höcke, may adopt names such as 'Patriotische Jugend' or 'Junge Alternative'. Höcke, a central figure in the party’s völkisch-nationalist wing, is highly popular among young right-wing members and has promoted radical ideas, including a controversial reference to the Hitler Youth motto. The likely new federal chairman, Jean-Pascal Hohm (28), is a Brandenburg state MP with a history of far-right affiliations and is considered a right-wing extremist by the state’s constitutional protection agency. Another potential figure, Manuel Krauthausen, is a Bundestag member with a past involvement in racist online chats. Despite internal debates within the AfD about moderating the youth wing, the leadership appears unlikely to distance itself from radical elements, raising concerns that the new youth organization will continue the legacy of the banned Junge Alternative (JA), which had 2,400 members and allowed non-AfD members. The reorganization aims to integrate youth under the parent party, with automatic membership or an AfD party book required for those under a certain age.\nOriginal language: de\nPublish date: October 02, 2025 05:52 PM\nSource:[taz.de](https://taz.de/AfD-Jugend-gruendet-sich-in-Giessen-neu/!6117457/)\n\n**German Social Democrats Prepare Application to Ban 'Alternative for Germany'**\nMembers of Germany's Social Democratic Party (SPD) are increasingly calling for the preparation of a formal application to ban the far-right party 'Alternative for Germany' (AfD). According to a joint statement from SPD parliamentary faction representatives in state parliaments and the Bundestag, as reported by dpa, such a ban is not a political attack but a necessary intervention to protect democracy, grounded in historical experience and the foundational principles of a functioning democracy. SPD policymakers justify the move by citing the AfD's increasing radicalization, spread of disinformation, support for right-wing extremist networks, and promotion of a platform that deliberately undermines core constitutional values. The 'Berlin Declaration for Democracy' calls for immediate preparation of a ban procedure before the Federal Constitutional Court, starting with gathering and evaluating evidence of the party's anti-constitutional activities. If the assessment indicates a viable case, there is an obligation to file the application. Only the Federal Constitutional Court can decide on banning a party, and the application must be submitted by the Bundestag, Bundesrat, or federal government. In spring 2025, federal and state interior ministers agreed to establish a federal-state working group to combat the AfD, which has since been formed. The Federal Office for the Protection of the Constitution has classified the AfD as a confirmed right-wing extremist organization, though the party is challenging this classification in the Administrative Court of Cologne, where the classification remains temporarily suspended until the case is resolved.\nOriginal language: uk\nPublish date: October 02, 2025 02:35 PM\nSource:[Європейська правда](https://www.eurointegration.com.ua/news/2025/10/2/7221563/)\n\n**SPD Legal Experts Urge AfD Ban Procedure Amid Broader Political Reforms**\nSPD legal experts are calling for the initiation of a formal procedure to ban the Alternative for Germany (AfD) party, arguing that such a move is not a political attack but a necessary democratic safeguard rooted in historical experience and the principles of a resilient democracy. In a joint statement titled the 'Berlin Declaration for Democracy,' SPD parliamentary spokespersons from the Bundestag and state parliaments emphasize the urgent need to prepare a ban application for review by the Federal Constitutional Court. They state that if the review indicates a potential success, the application must be filed. The legal process must be accompanied by continued political engagement with the AfD. Only the Federal Constitutional Court can decide on a party ban, which can be initiated by the Bundestag, Bundesrat, or federal government. Federal Interior Minister Alexander Dobrindt (CSU) opposes the move, arguing it would benefit the AfD by giving it more visibility, and instead advocates for 'governing the AfD out of existence.' The Federal Office for the Protection of the Constitution classified the AfD as a confirmed right-wing extremist organization in early May, though this designation was temporarily suspended due to an ongoing legal challenge by the AfD. The article also covers other political developments, including the federal cabinet's first retreat focusing on modernization, economic competitiveness, and digitalization; plans for a unified vehicle registration portal; a proposed drone defense center; and debates on social media restrictions for minors under 16. Additionally, the article mentions the health of Transport Minister Patrick Schnieder, who collapsed during the retreat and was hospitalized, and the broader political context of Germany's economic and social reforms.\nOriginal language: de\nPublish date: October 02, 2025 11:19 AM\nSource:[Süddeutsche Zeitung](https://www.sueddeutsche.de/politik/bundesregierung-liveblog-spd-afd-verbot-verfahren-li.3315943)\n\n**Voter Intentions: How Citizens Would Vote in a Hypothetical Bundestag Election**\nA daily updated overview of the 'Sunday question' from German polling institutes such as Forsa and Infratest dimap reveals current voter intentions for a hypothetical Bundestag election. The RedaktionsNetzwerk Deutschland (RND) calculates the average of the last ten surveys. After the 2021 Bundestag election, the SPD initially led in polls but was soon overtaken by the CDU/CSU. The Greens' post-election surge lasted longer, but they too lost support over time. The FDP also declined, ultimately failing to cross the 5% threshold in the 2025 Bundestag election. The largest beneficiary of the decline of the coalition parties (SPD, Greens, FDP) was the AfD, which rose to become the second-strongest party in polls by mid-2023. However, the AfD lost some ground in early 2024. During this period, pollsters first included the new party BSW (Bündnis Sahra Wagenknecht), which narrowly missed the 5% threshold, receiving just under 5% of voter support. The latest poll and results from recent federal, eastern German (Thuringia, Saxony, Brandenburg), and European elections are displayed in a graphic.\nOriginal language: de\nPublish date: October 03, 2025 04:03 AM\nSource:[rnd.de](https://www.rnd.de/politik/umfragen-zu-parteien-aktuelle-trends-fuer-spd-union-afd-gruene-und-co-3-10-2025-462SFUR3SNBCLN3ACXRFNANNSE.html)\n\n**Far-Right AfD Ties for First in German Poll Amid Declining Government Approval and Democratic Concerns**\nThe far-right Alternative for Germany (AfD) has tied with the conservative CDU/CSU coalition—led by federal chancellor Friedrich Merz—for first place in the Deutschlandtrend poll conducted by Infratest Dimap and broadcast by ARD, with both parties scoring 26% support. The Social Democratic Party (SPD) follows with 15%, the Greens with 12%, and The Left with 10%. The AfD gained one percentage point from the previous month, achieving its highest result ever in the Deutschlandtrend survey, while the CDU/CSU lost one point. The SPD remained unchanged, the Greens rose by one point, and The Left stayed stable. The Sahra Wagenknecht Alliance (BSW) and the Free Democratic Party (FDP) each scored 3%, below the 5% threshold needed to gain seats in the Bundestag. The federal government coalition (CDU/CSU and SPD) faces low approval, with 77% of voters expressing little or no satisfaction—its lowest level since the government took office in May. The AfD benefits from this dissatisfaction. On the 35th anniversary of German reunification, 61% of respondents expressed satisfaction with reunification, while 34% were dissatisfied. Satisfaction was higher in western Germany (64%) than in eastern Germany (50%), where 46% were dissatisfied. The poll surveyed 1,306 German voters between September 29 and October 1, with a margin of error between 2% and 3%. Only 42% of voters are satisfied with the state of democracy in Germany, while 56% are dissatisfied—especially among AfD supporters (91%). Among AfD supporters, the main perceived threats to democracy are dysfunctional political institutions (35%) and migration (16%). In contrast, supporters of other Bundestag parties identify right-wing extremism and populism as the top threat: 63% of Greens, 52% of The Left, 51% of SPD, and 39% of CDU/CSU voters cited this first. Disfunctional institutions were also seen as a major threat by traditional party supporters, though at lower rates than among AfD supporters.\nOriginal language: pt\nPublish date: October 03, 2025 02:32 AM\nSource:[Metrópoles](https://www.metropoles.com/mundo/ultradireita-alcanca-1-lugar-em-pesquisa-na-alemanha)\n\n**AGONY OF EU POLITICAL PLURALISM: HOW BRUSSELS BURIES DEMOCRATIC PRINCIPLES**\nThe article argues that the European Union is undermining democratic principles by systematically suppressing political pluralism, particularly in post-Soviet and core EU countries. It highlights the 2025 parliamentary elections in Moldova, where President Maia Sandu’s Action and Solidarity Party (PAS) won 50.20% of the vote, with 78.5% of diaspora votes—mostly in EU countries—providing a decisive advantage. The opposition faced legal disqualification, mass detentions, and allegations of orchestrated suppression. Similarly, in Romania, the Constitutional Court annulled the first round of the 2024 presidential election after Călin Georgescu, a Eurosceptic candidate, led with 22.94%, citing alleged foreign interference. Georgescu was later barred from the re-run, which was won by pro-European candidate Nicușor Dan. In France, Marine Le Pen was convicted in March 2025 of embezzling EU funds, sentenced to four years (two suspended), fined €100,000, and disqualified from public office for five years—effectively barring her from the 2027 presidential election. In Germany, the Federal Office for the Protection of the Constitution (BfV) classified the Alternative for Germany (AfD) as a 'far-right extremist' organization on 2 May 2025, based on a 1,000-page report, despite the party’s rise to 20.8% of the vote and 152 seats in the Bundestag. The SPD has since initiated efforts to ban the AfD via the Federal Constitutional Court. The author contends these cases reveal a systemic pattern: when political competition threatens Brussels-aligned elites, legal mechanisms are weaponized to suppress opposition, transforming the EU’s democratic facade into a 'simulacrum' of pluralism. The article concludes that the EU’s institutional architecture is failing to address core challenges and is increasingly authoritarian in practice.\nOriginal language: en\nPublish date: October 02, 2025 08:10 PM\nSource:[The Duran](https://theduran.com/agony-of-eu-political-pluralism-how-brussels-buries-democratic-principles/)\n\n**Nationwide Coalition Mobilizes Against AfD Youth Re-Founding in Gießen**\nA nationwide coalition named 'widersetzen' is mobilizing against the planned re-establishment of the AfD youth organization in Gießen on November 29–30, 2025. The coalition, representing over 80 cities and including unions, antifascist groups, and NGOs, argues that a youth wing of the far-right AfD must not exist due to its ties to violent groups. Protest actions include road blockades of access routes to the Messe Gießen, with only emergency vehicles permitted through. The group plans mass mobilization via buses from across Germany, aiming to surpass the 15,000 attendees and 200 buses that disrupted the AfD’s 2024 party congress in Riesa. Police anticipate up to 40,000 demonstrators over two days and are preparing for multiple scenarios, though no concrete calls for violence have been reported. The coalition emphasizes non-escalation, stating it seeks only to prevent the event. The new AfD youth group, expected to be radicalized under the influence of Björn Höcke, may adopt names such as 'Patriotische Jugend' or 'Junge Alternative'. Höcke, a central figure in the party’s völkisch-nationalist wing, is highly popular among young right-wing members and has promoted radical ideas, including a controversial reference to the Hitler Youth motto. The likely new federal chairman, Jean-Pascal Hohm (28), is a Brandenburg state MP with a history of far-right affiliations and is considered a right-wing extremist by the state’s constitutional protection agency. Another potential figure, Manuel Krauthausen, is a Bundestag member with a past involvement in racist online chats. Despite internal debates within the AfD about moderating the youth wing, the leadership appears unlikely to distance itself from radical elements, raising concerns that the new youth organization will continue the legacy of the banned Junge Alternative (JA), which had 2,400 members and allowed non-AfD members. The reorganization aims to integrate youth under the parent party, with automatic membership or an AfD party book required for those under a certain age.\nOriginal language: de\nPublish date: October 02, 2025 05:52 PM\nSource:[taz.de](https://taz.de/AfD-Jugend-gruendet-sich-in-Giessen-neu/!6117457/)\n\n**German Social Democrats Prepare Application to Ban 'Alternative for Germany'**\nMembers of Germany's Social Democratic Party (SPD) are increasingly calling for the preparation of a formal application to ban the far-right party 'Alternative for Germany' (AfD). According to a joint statement from SPD parliamentary faction representatives in state parliaments and the Bundestag, as reported by dpa, such a ban is not a political attack but a necessary intervention to protect democracy, grounded in historical experience and the foundational principles of a functioning democracy. SPD policymakers justify the move by citing the AfD's increasing radicalization, spread of disinformation, support for right-wing extremist networks, and promotion of a platform that deliberately undermines core constitutional values. The 'Berlin Declaration for Democracy' calls for immediate preparation of a ban procedure before the Federal Constitutional Court, starting with gathering and evaluating evidence of the party's anti-constitutional activities. If the assessment indicates a viable case, there is an obligation to file the application. Only the Federal Constitutional Court can decide on banning a party, and the application must be submitted by the Bundestag, Bundesrat, or federal government. In spring 2025, federal and state interior ministers agreed to establish a federal-state working group to combat the AfD, which has since been formed. The Federal Office for the Protection of the Constitution has classified the AfD as a confirmed right-wing extremist organization, though the party is challenging this classification in the Administrative Court of Cologne, where the classification remains temporarily suspended until the case is resolved.\nOriginal language: uk\nPublish date: October 02, 2025 02:35 PM\nSource:[Європейська правда](https://www.eurointegration.com.ua/news/2025/10/2/7221563/)\n\n**Administrative Court Rules in Favor of AfD in Hechingen Stadthalle Dispute Over 2026 Party Congress**\nThe Administrative Court ruled in favor of the AfD in a dispute over the use of Hechingen's Stadthalle for its planned regional party congress on November 8–9, 2026, stating that the city's amendment to the hall's usage regulations violated the party's right to equal treatment in political competition. The city had changed the rules in September 2025, banning federal and state-level party events from October 2025 onward, citing increased security demands and the risk of overburdening the venue. The AfD had already secured a lease for the hall in August 2025, but the city canceled the contract after the rule change. The court's decision is not yet legally binding; the city of Hechingen has two weeks from receipt to file an appeal. AfD Co-Chairman Emil Sänze welcomed the ruling, saying 'the principles of the rule of law have prevailed.' The city also raised concerns about the timing of the event—November 9, 2026, coinciding with the anniversary of the Reichspogromnacht—labeling it a 'right-wing extremist suspect case' under the State Office for the Protection of the Constitution. The AfD stated the date was chosen coincidentally and emphasized the event’s purpose: adopting its state election program for the March 2026 state election.\nOriginal language: de\nPublish date: October 02, 2025 01:40 PM\nSource:[Stuttgarter-Zeitung.de](https://www.stuttgarter-zeitung.de/inhalt.umstrittener-parteitag-in-hechingen-gericht-gibt-afd-im-streit-um-stadthalle-recht.0b1d9d06-27b8-4a84-bf39-0d8ba9d67777.html)\n\n**SPD Legal Experts Urge AfD Ban Procedure Amid Broader Political Reforms**\nSPD legal experts are calling for the initiation of a formal procedure to ban the Alternative for Germany (AfD) party, arguing that such a move is not a political attack but a necessary democratic safeguard rooted in historical experience and the principles of a resilient democracy. In a joint statement titled the 'Berlin Declaration for Democracy,' SPD parliamentary spokespersons from the Bundestag and state parliaments emphasize the urgent need to prepare a ban application for review by the Federal Constitutional Court. They state that if the review indicates a potential success, the application must be filed. The legal process must be accompanied by continued political engagement with the AfD. Only the Federal Constitutional Court can decide on a party ban, which can be initiated by the Bundestag, Bundesrat, or federal government. Federal Interior Minister Alexander Dobrindt (CSU) opposes the move, arguing it would benefit the AfD by giving it more visibility, and instead advocates for 'governing the AfD out of existence.' The Federal Office for the Protection of the Constitution classified the AfD as a confirmed right-wing extremist organization in early May, though this designation was temporarily suspended due to an ongoing legal challenge by the AfD. The article also covers other political developments, including the federal cabinet's first retreat focusing on modernization, economic competitiveness, and digitalization; plans for a unified vehicle registration portal; a proposed drone defense center; and debates on social media restrictions for minors under 16. Additionally, the article mentions the health of Transport Minister Patrick Schnieder, who collapsed during the retreat and was hospitalized, and the broader political context of Germany's economic and social reforms.\nOriginal language: de\nPublish date: October 02, 2025 11:19 AM\nSource:[Süddeutsche Zeitung](https://www.sueddeutsche.de/politik/bundesregierung-liveblog-spd-afd-verbot-verfahren-li.3315943)\n\n**AfD Member in Monastery Community: Leadership Responds to Scandal**\nThe Evangelical Stift Marienfließ in Stepenitz, Brandenburg, faced a major scandal after it was revealed that Pastor Helmut Kautz allowed Andreas Tute, a member of the AfD and Fraktionsvorsitzender (chairperson) of the AfD in a Lower Saxony district council, to move onto the monastery grounds while concealing his political role. The community was shocked upon discovering the truth, prompting public outcry and intervention from Stiftsamtfrau Eva-Maria Menard, the superior of Pastor Kautz and overall responsible for the site. Menard stated that Tute, representing a party classified by the Federal Office for the Protection of the Constitution as right-wing extremist and anti-constitutional in its 2024 report, and deemed 'inhuman' by the Evangelical Church, violated the community’s values. As a result, the Stiftskapitel demanded Tute vacate the premises and terminate his lease by August 31, 2025. The incident has sparked internal and external debates within the church about how to handle AfD members and functionaries. The Evangelical Church Berlin-Brandenburg-schlesische Oberlausitz, to which Pastor Kautz belongs, had previously, in 2024, passed a resolution at its Landessynode in Görlitz banning AfD members from serving in parish church councils, citing the party’s 'unholy alliance' with right-wing extremists who actively undermine democracy and the rule of law.\nOriginal language: de\nPublish date: October 02, 2025 11:09 AM\nSource:[Berliner Morgenpost](https://www.morgenpost.de/berlin/article410139875/afd-mann-in-kloster-gemeinschaft-so-reagiert-die-leitung.html)\n\n**Geoff Russ: Geert Wilders' coming triumph and the end of Europe's mushy centrists**\nIn the Netherlands, nationalist right-wing party the Party for Freedom (PVV), led by Geert Wilders, is poised to win the upcoming snap election, with current polls projecting it and its right-wing rival JA21 to secure nearly half the seats in parliament. This follows a rapid rise from political margins to the center of power across Europe, driven by widespread frustration over mass immigration, housing shortages, and the rising cost of living. Despite the PVV's 2023 coalition agreement collapsing, Wilders remains a dominant political figure, even as mainstream parties like the People's Party for Freedom and Democracy (VVD) face their weakest electoral performance since the 1970s. In France, the National Rally (RN) has gained momentum, winning significant support from disaffected blue-collar workers and youth, though it was blocked from power in 2024 through strategic withdrawals by centrist parties. In Germany, the Alternative for Germany (AfD) has become the second-largest party and now leads in polls. In the UK, Nigel Farage’s Reform UK is gaining ground in former Labour strongholds. Across Europe, voters are rejecting traditional centrist and establishment parties, which are seen as failing to address immigration, energy costs, and stagnant wages. Energy prices in the Netherlands are projected to triple by 2040 due to reduced natural gas supply and strict environmental regulations, while housing shortages have driven rent hikes and made the country one of the most unaffordable in Europe. According to the article, the EU’s political establishment has lost legitimacy due to its inability to address these issues, and the rise of nationalist parties reflects a demand for change rather than consensus. The author argues that continued attempts to block nationalist coalitions through fragile alliances only delay the inevitable shift toward populist governance.\nOriginal language: en\nPublish date: October 02, 2025 10:00 AM\nSource:[Yahoo](https://ca.news.yahoo.com/geoff-russ-geert-wilders-coming-100010821.html)\n\n**Germany’s Far‑Right AfD Surges in Polls Amid Calls for Ban**\nGermany’s far‑right Alternative for Germany (AfD) has risen sharply in recent polls, now polling 30 % in a June 2024 survey by Insa, up from 20.8 % in the 2021 elections. The Christian Democratic Union (CDU) sits at 27 %, while the Social Democratic Party (SPD) trails at 7 %. The Left records 13 %, the BSW 6 %, and the Greens and FDP each garner only 3 %. In May, the Federal Office for the Protection of the Constitution (BfV) classified AfD as an extremist organization, a designation that was temporarily suspended after a lawsuit. Parliamentary leaders have called for a ban, noting that only the Federal Constitutional Court can ultimately decide on party prohibition.  A letter from the Greens and Left parliamentary groups states: 'A la vista de nuestra responsabilidad histórica, el Bundestag alemán tiene la obligación jurídica y política de considerar seriamente la posibilidad de iniciar un procedimiento para prohibir un partido cuando existan motivos para ello.'\nOriginal language: es\nPublish date: September 04, 2025 10:12 AM\nSource:[El Correo](https://www.elcorreo.com/internacional/europa/extrema-derecha-continua-ascenso-alemania-pese-cordon-20250904115953-ntrc.html)\n\n**Over 40% of Germans Believe AfD Will Win Next Election**\nAccording to a recent survey by the INSA institute for the Bild newspaper, over 40% of Germans believe that the right-wing party 'Alternative for Germany' (AfD) will win the next parliamentary elections in 2029. The survey found that 43% of respondents expect AfD to be the strongest party in the next election, while 39% disagree and 18% were unsure. 56% of respondents believe that AfD will increase its influence on voters before the election, and 47% think that the ruling coalition CDU/CSU should continue to refuse cooperation with AfD. The survey was conducted among 1006 respondents and has a margin of error that is not specified. In April and August, AfD surpassed the Christian Democratic and Christian Social Unions (CDU/CSU) and became the most popular party in Germany. In 2023, the German Federal Office for the Protection of the Constitution (BfV) recognized AfD's branches in Saxony, Thuringia, and Saxony-Anhalt as right-wing extremist. On the federal level, the party was only suspected of extremism until recently, which is considered a lower threat. AfD's leaders, Tino Chrupalla and Alice Weidel, called the party's recognition as a right-wing extremist organization a blow to democratic institutions. The party has filed a lawsuit against the BfV and has accused the German authorities of persecution and suppressing dissent.\nOriginal language: ru\nPublish date: August 16, 2025 10:00 PM\nSource:[РИА Новости](https://ria.ru/20250817/vybory-2035843134.html)\n\n**AfD Surpasses CDU/CSU in Popularity in Germany, According to Recent Poll**\nA recent Forsa poll for RTL and N-TV has shown that the Alternative for Germany (AfD) party has surpassed the CDU/CSU block in popularity in Germany, with 24% of respondents supporting the block and 25% supporting the AfD. The Social Democratic Party (SPD) continues to hover around 13% support, while the Greens and the Left party have 13% and 11% support respectively. The FDP and other parties have 3% and 6% support respectively. The poll also shows that 25% of respondents are either undecided or did not vote, a significant increase from the 17.9% who did not vote in the recent Bundestag elections. The approval rating for Chancellor Olaf Scholz has dropped to a new low, with only 29% of respondents satisfied with his work, a three-point decrease from the last poll. 'This is the worst result since his election in May. Disapproval has increased by three points to 67%', said the sociologists. The AfD was founded in 2013 as a eurosceptic party and has been known for its pro-Russian and far-right views. In May 2025, the Federal Office for the Protection of the Constitution classified the AfD as a right-wing extremist party. Thousands of people protested against the AfD in May, calling for its ban. In an interview with the Frankfurter Allgemeine Zeitung, German Justice Minister Stephanie Hubig said that the party should be considered for a ban. 'The Federal Office for the Protection of the Constitution is convinced that AfD is 'unconditionally right-wing extremist'. Therefore, we must take this party very seriously as a potential threat to our democracy. This, of course, includes considering the question of banning the party', she said. The SPD has unanimously agreed to prepare a procedure for banning the AfD, which would first be investigated by a working group at the federal state level and then sent to the Federal Constitutional Court if there is sufficient evidence of the party's anti-constitutional nature.\nOriginal language: ru\nPublish date: August 12, 2025 03:41 PM\nSource:[Новое Время](https://nv.ua/world/countries/reytingi-partiy-v-germanii-padenie-podderzhki-hds-hss-i-rost-populyarnosti-adg-opros-50536623.html)\n\n**Germans Oppose Ban on AfD Party, Survey Finds**\nA recent survey by the Allensbach institute, published in the Frankfurter Allgemeine Zeitung, shows that 52% of Germans are against banning the right-wing party 'Alternative for Germany' (AfD), while only 27% support the idea. The survey found that residents of eastern Germany are particularly opposed to the ban, with two-thirds of respondents disagreeing with it. Many respondents believe that even if the AfD is banned, a new party with similar views will quickly emerge. The survey also notes that 67% of western Germans and 88% of eastern Germans personally know someone who supports the AfD, which may reduce support for banning the party. Additionally, many believe that the parties seeking to ban the AfD are primarily motivated by a desire to eliminate a strong competitor. According to the survey, the potential support for the AfD has grown from 22% in 2023 to 33% in 2025, particularly in eastern Germany (47%). The survey was conducted from July 4 to 16, 2025, and involved 1054 participants. The potential error margin is not specified. In 2023, the German federal agency for the protection of the constitution recognized the AfD's branches in Saxony, Thuringia, and Saxony-Anhalt as extremist. In May 2025, the agency declared the AfD extremist nationwide, allowing for increased surveillance and considered a step towards banning the party, which had previously surpassed the winning coalition of the Christian Democratic Union and Christian Social Union in several polls. The co-leaders of the AfD, Tino Chrupalla and Alice Weidel, called the agency's decision a blow to democracy. The AfD subsequently filed a lawsuit against the agency, which temporarily suspended the extremist designation. German Chancellor Friedrich Merz commented on the possibility of banning the AfD, stating that it would be impossible to ban 10 million of its supporters and emphasizing the need to review the previous decision to recognize the party as extremist.\nOriginal language: ru\nPublish date: July 19, 2025 12:52 PM\nSource:[РИА Новости](https://ria.ru/20250719/opros-2030157767.html)\n\n**Germans Oppose Ban on Far-Right Party 'Alternative for Germany'**\nA recent survey found that 52% of Germans oppose banning the far-right party 'Alternative for Germany' (AfD), while 27% support the ban. The survey, conducted by the Allensbach Institute for Public Opinion Research on behalf of the German newspaper Frankfurter Allgemeine Zeitung, showed that the opposition to the ban is higher in eastern Germany, where 65% of respondents reject the ban, compared to 49% in western Germany. The AfD has a strong base of support in eastern Germany. The survey found that the main reason for opposing the ban is the perceived bias in the media, with 67% of respondents in western Germany and 88% in eastern Germany stating that their acquaintances support the AfD. Many respondents view these acquaintances as more sympathetic than the party itself. Another reason for opposing the ban is the perception that the parties calling for it are trying to eliminate a strong competitor in the political landscape. The calls for banning the AfD have increased after the Federal Office for the Protection of the Constitution (BfV) classified the party as 'extreme right-wing' and 'certain', allowing for greater flexibility in monitoring the party. The BfV has since suspended the classification pending a court decision on the party's appeal. It is worth noting that only the federal government, the Bundestag, or the Bundesrat can request a ban on the party before the Federal Constitutional Court. The AfD, known for its anti-immigrant, anti-Muslim, and eurosceptic rhetoric, has been a source of tension in German politics for over a decade. In recent years, the party has gained momentum, exploiting economic discontent and growing public concerns about immigration. It is now the largest opposition party in Germany.\nOriginal language: ar\nPublish date: July 19, 2025 11:32 AM\nSource:[Deutsche Welle](https://www.dw.com/ar/%D8%A7%D8%B3%D8%AA%D8%B7%D9%84%D8%A7%D8%B9-%D9%84%D9%87%D8%B0%D8%A7-%D9%8A%D8%B1%D9%81%D8%B6-%D8%BA%D8%A7%D9%84%D8%A8%D9%8A%D8%A9-%D8%A7%D9%84%D8%A3%D9%84%D9%85%D8%A7%D9%86-%D8%AD%D8%B8%D8%B1-%D8%AD%D8%B2%D8%A8-%D8%A7%D9%84%D8%A8%D8%AF%D9%8A%D9%84/a-73335298)\n\n**Most Germans Oppose Ban on Alternative for Germany Party**\nA recent survey by the Allensbach Institute found that 52% of Germans oppose banning the far-right Alternative for Germany (AfD) party, while 27% support the ban. The opposition to the ban is strongest in eastern Germany, where 65% of respondents are against it. The main reason for this opposition is that many Germans are familiar with AfD supporters, with 67% of western Germans and 88% of eastern Germans knowing someone who supports the party. These individuals are viewed more positively than the party itself. Another reason for the opposition is that many respondents believe that the parties pushing for the ban are simply trying to eliminate a difficult competitor in the political arena. The calls for a ban on the party have increased since the federal intelligence agency classified AfD as a 'recognized ultra-right extremist' organization, giving them more freedom to monitor the party's activities. However, this classification is currently being challenged in court by AfD. The Constitutional Court of Germany is the highest authority in deciding on any ban. AfD, known for its anti-immigration, anti-Muslim, eurosceptic, and nationalist rhetoric, has been a hot topic in German politics for over a decade. In recent years, the party has gained strength by capitalizing on economic discontent and growing public concern about immigration. Today, it is the largest opposition party in Germany.\nOriginal language: ru\nPublish date: July 19, 2025 11:11 AM\nSource:[rossaprimavera.ru](https://rossaprimavera.ru/news/db34d2f0)\n\n**Germany's AfD Party Faces Growing Calls for Prohibition**\nThe Alternative for Germany (AfD) party, which is now the largest opposition group in Germany, is facing growing calls for its prohibition, despite being more popular than ever. The party has been classified as an extremist organization by the national intelligence agency, and a recent report by the Federal Office for the Protection of the Constitution (BfV) has exposed its racist and anti-Muslim views. The AfD has received significant support from the Trump administration, and its popularity has increased to 26% in some polls, making it briefly the most popular party in the country. However, the path to prohibiting the AfD is long and largely unprecedented. The German system of government is based on the concept of 'streitbare Demokratie' or 'militant democracy', which allows the state to defend itself against internal threats to its democratic principles and constitutional order. To prohibit a party, the Federal Constitutional Court must determine that it acts against the free democratic order, showing an aggressive and bellicose stance, and that it represents a tangible threat to democracy. The court has only prohibited two parties in the country's history, and the process is considered a measure of last resort against enemies of democracy. Some lawmakers are divided on the issue, with some fearing that prohibition could be counterproductive and fuel the sympathies of the far-right. The AfD's prohibition could have significant repercussions, including the loss of its seats in the Bundestag and the European Parliament, and a change in the majority proportion of the other parties.\nOriginal language: es\nPublish date: July 06, 2025 04:57 PM\nSource:[CNN](https://www.cnnchile.com/mundo/aumentan-llamados-a-prohibir-partido-de-extrema-derecha-en-alemania-aunque-sean-mas-populares-que-nunca_20250706/)\n\n**Calls are mounting to ban Germany's far-right AfD party - despite it being more popular than ever**\nThe far-right Alternative for Germany (AfD) party is facing growing calls for an outright ban, despite being more popular than ever. The party has been classified as an extremist entity by Germany's domestic intelligence agency and has been accused of being racist, anti-Muslim, and devaluing entire segments of Germany's population. The center-left Social Democratic Party (SPD) has voted unanimously to begin efforts to outlaw the AfD, but the legal path to banning the party is lengthy and largely unprecedented. A formal request must be made to the federal court, which would then decide whether to begin proceedings or throw out the application. If the AfD were to be banned, its sitting lawmakers would receive an automatic loss of mandate, and its seats in the Bundestag and European Parliament would remain vacant. The German Federal Constitutional Court has only banned two parties in the country's history, and experts believe that imposing a ban on the AfD would be difficult and could have significant reverberations.\nOriginal language: en\nPublish date: July 06, 2025 04:00 AM\nSource:[Yahoo News](https://sg.news.yahoo.com/calls-mounting-ban-germany-far-040024225.html)\n\n**SPD Seeks to Ban AfD Party Over 'Threat to Democracy'**\nThe Social Democratic Party of Germany (SPD) wants to ban the 'Alternative for Germany' (AfD) party, which advocates for the renewal of mutually beneficial trade and economic relations with Russia. The SPD adopted a special resolution at its national congress, calling on the parliament and government to initiate the procedure for recognizing AfD as unconstitutional as soon as possible. The resolution states: 'With a party that abuses democratic principles to fight democracy from within, fair competition is impossible. Any attempt to include them in the democratic discourse will lead to nothing. It is now time for competent constitutional bodies to create conditions for an immediate statement on the submission of an application for the unconstitutionality of AfD.' EADaily notes that two months ago, the German counter-intelligence agency declared AfD an 'extremist organization', assessing it as a 'threat to democracy'. So far, this status has only been applied to the party's regional structures in Thuringia, Saxony, and Saxony-Anhalt. The entire party was simply classified as 'suspected of extremism'. In response, AfD filed a lawsuit against the counter-intelligence agency and accused the outgoing federal government of conducting a 'politically motivated smear campaign'. However, many German politicians have noted that the attempt to ban AfD may only strengthen it and bring it more support. Experts also point to the uncertain outcome of a possible court hearing, citing a recent decision by the Federal Administrative Court of Germany, which overturned the ban on the 'Compact' magazine associated with AfD.\nOriginal language: ru\nPublish date: June 30, 2025 06:30 AM\nSource:[EADaily](https://eadaily.com/ru/news/2025/06/30/sdpg-hochet-zapretit-partiyu-alternativa-dlya-germanii)\n\n**German Social Democrats Plan to Ban Far-Right AfD Party**\nThe German Social Democratic Party plans to move forward with efforts to ban the far-right 'Alternative for Germany' (AfD) party. A proposal to be voted on today at the party's annual conference in Berlin calls on constitutional bodies to pave the way for a lawsuit to declare the AfD party unconstitutional due to its anti-immigration stance. The proposal states, 'It is time for the constitutional bodies to prepare the ground for a swift request to the Federal Constitutional Court to declare the AfD party unconstitutional.' The party's leader, Berlina Pas, expressed her support for the proposal, saying, 'We must now clarify whether there are sufficient grounds to submit a proposal to the Federal Constitutional Court to declare the AfD party unconstitutional.' She added that if such evidence is found, 'as a social democratic party, we have a democratic duty to do our utmost to ensure that a proposal to ban the party can be submitted.' The AfD party has been known for its anti-immigration and anti-Muslim rhetoric, as well as its skepticism towards the European Union and its advocacy for nationalism. The party has gained momentum in recent years by exploiting economic discontent and growing concerns about immigration. It is now the largest opposition party in Germany. Calls for banning the AfD party have increased after the Federal Office for the Protection of the Constitution reclassified the party as a 'right-wing extremist group' in May, allowing for expanded surveillance. However, the office has since decided to suspend this classification pending a court review, and will treat the party as a 'suspected right-wing extremist group' until a court ruling is made.\nOriginal language: ar\nPublish date: June 29, 2025 06:48 AM\nSource:[جريدة الشروق](https://www.shorouknews.com/news/view.aspx?cdate=29062025&id=5434e9a0-8592-47e2-be8c-15a15858740d)\n\n",
    "date": "2025-10-04T01:03:41.474018",
    "summary": "The forecasts of eight experts from diverse but complementary backgrounds converge on a similar overall assessment: while momentum and legal preparations to ban the AfD (Alternative for Germany) have increased substantially in 2025—driven primarily by the SPD (Social Democratic Party), pressure from civil society, and a federal/state working group—the probability that a formal application will be filed with the German Federal Constitutional Court before January 1, 2026, remains below 50% and most likely is still less than one-third, with estimates clustering between 22% and 35%. One outlier (43%) highlights the importance of recent radicalization, civil society mobilization, and a heightened sense of urgency among political elites, but even this perspective acknowledges significant headwinds. \n\nThe experts' reasoning consistently identifies the following key barriers: (1) the historically high legal threshold and base rate for party bans in Germany (only two such bans in postwar history, with recent NPD ban attempts failing even with strong evidence); (2) the lack of a finalized legal foundation following the BfV’s (intelligence agency’s) currently suspended extremist classification of the AfD, pending court review; (3) public opinion, with a clear majority of Germans—especially in eastern regions—opposing a ban and elites fearing backlash or political martyrdom of the AfD; (4) the absence, as of early October 2025, of unified cross-party consensus or support within Bundestag, Bundesrat, or the federal government, with CDU/CSU and some government figures either opposed or highly cautious; (5) acute time pressure given less than three months remain, and the parliamentary and legal processes required are typically slow and consensus-driven.\n\nFactors that slightly increase the probability include strong SPD and Green/Left mobilization, intensified evidence-gathering and preparation, the legal and symbolic boost from the BfV’s classification, and growing international precedent for action against radical right parties. Nonetheless, these are offset by deep-seated institutional, legal, and procedural caution—echoed in every expert’s scenario planning, with most ‘yes’ stories requiring a last-minute surge, crisis, legal breakthrough, or shift in elite consensus to materialize before the deadline. \n\nIn summary, the current environment is the closest Germany has come in decades to actually filing such a case, but experts overwhelmingly expect that, given the remaining barriers and the short timeline, it is still more likely than not that no application to ban the AfD will be filed before 2026.",
    "forecasters": [
        "Legal Practice in Germany (Verfassungsrecht Litigation Procedures)",
        "Legal Practice in Germany (Political Party Ban Process)",
        "German Political Analysis (Policy Advisory on FarRight Parties)",
        "Political Science (Party Systems Theory)",
        "Political Science (Radical Right Parties Literature)",
        "German Constitutional Law (Militant Democracy Doctrine)",
        "German Constitutional Law (Federal Constitutional Court Precedents)",
        "Sociology (Social Movement Theory)"
    ]
}