{
    "deliberation_results": {
        "IntelligenceAnalysis (IndicatorsAndWarningsMethod)": {
            "time_to_resolution": "Approximately 6 weeks (until January 1, 2026)",
            "perspective_relevance": "As an expert in Intelligence Analysis (Indicators and Warnings Method), my unique perspective leverages systematic assessment of coup risk factors, historical base rates, and ongoing intelligence signals (such as military unrest, regime legitimacy, elite fragmentation, external intervention, and social unrest). This approach identifies both overt warning signs and subtle shifts in coup risk, assessing the likelihood of rapid, destabilizing transitions.",
            "status_quo": "If nothing changes, the most likely outcome is 'No successful coup' in Africa or Latin America before January 1, 2026. The status quo is that coups, while more frequent in recent years (especially in Africa), remain rare events in any given 4-6 week window. The Latin American coup base rate is especially low; Africa’s is higher but still not overwhelming for such a short period.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent coup attempts and successes in Africa (2020-2025)",
                    "effect": "Increases probability. The recent surge in coups (e.g., Niger 2023, Gabon 2023, Burkina Faso 2022, Mali 2021) signals regional instability and lowered coup inhibition, especially in the Sahel."
                },
                {
                    "factor": "Current regime fragility and legitimacy crises (Sahel, Guinea-Bissau, Benin, etc.)",
                    "effect": "Increases probability. Multiple governments are facing legitimacy deficits, elite exclusion, and declining public trust (e.g., Guinea-Bissau's electoral manipulation, Benin's opposition exclusion). Such dynamics historically correlate with coup attempts."
                },
                {
                    "factor": "Elite cohesion and security force loyalty",
                    "effect": "Decreases probability. Recent successful coups tend to be followed by purges and co-optation to shore up regime control, temporarily raising coup-proofing. Current reporting (e.g., Nigeria, Mali) shows active measures against internal dissent."
                },
                {
                    "factor": "External actors (Russia’s Africa Corps, Turkey, Wagner/PMC presence)",
                    "effect": "Increases probability. Foreign military contractors can both stabilize regimes (by providing coup-proofing) and create new vulnerabilities (by alienating local militaries or fueling elite rivalry). Russian presence, while shoring up certain juntas, may also breed resentment among sidelined officers."
                },
                {
                    "factor": "Jihadist insurgencies and deteriorating security (Mali, Burkina Faso, Niger)",
                    "effect": "Increases probability. Persistent insurgency increases military frustration and can serve as a pretext for military intervention or intra-military coups, especially when economic and social conditions worsen."
                },
                {
                    "factor": "Regional and international pressure (sanctions, ECOWAS, ICC withdrawal)",
                    "effect": "Mixed effect. Sanctions and international condemnation can either weaken junta resolve or push them further into isolation, sometimes provoking coups; however, they may also deter would-be plotters by increasing the costs of instability."
                },
                {
                    "factor": "Base rate of coups in Latin America",
                    "effect": "Decreases probability. The historical frequency of successful coups in Latin America since 1990 is extremely low compared to Africa, and recent coup attempts (Bolivia 2024, Brazil 2023) have failed."
                },
                {
                    "factor": "Proximity to scheduled elections and constitutional changes (Guinea-Bissau, Benin, CAR)",
                    "effect": "Increases probability. Electoral manipulation and term extensions often trigger coup attempts, especially where opposition is excluded or elections lack credibility."
                },
                {
                    "factor": "Short time window (6 weeks)",
                    "effect": "Strongly decreases probability. Even in coup-prone regions, the monthly probability of a successful coup in any given country is low. The short window is a significant dampener on overall risk."
                }
            ],
            "no_scenario": "Despite ongoing instability and recent coup attempts, security forces in vulnerable states remain loyal to ruling juntas or civilian governments. Regimes continue coup-proofing through purges, external support (Russia, Turkey), and co-optation of elites. Jihadist violence persists but does not trigger decisive military intervention against the executive. Manipulated or uncompetitive elections (e.g., Guinea-Bissau, Benin) proceed with opposition marginalized but without military action. Latin America remains stable, with no serious coup attempts.",
            "yes_scenario": "A military faction or elite group in a vulnerable African country (such as Mali, Burkina Faso, Niger, or Guinea-Bissau) capitalizes on regime infighting, declining public order, or an economic shock. A rapid, well-coordinated move unseats the sitting executive, with the perpetrators consolidating control and quelling resistance. Alternatively, a self-coup occurs, where an incumbent suspends constitutional order and uses force to stay in power. In Latin America, an unlikely but possible scenario is a military-backed self-coup during an electoral crisis—Bolivia or a Central American state being the most plausible, though still quite unlikely.",
            "final_reasoning": "The base rate for coups in Africa in recent years has increased (7-8 successful coups since 2020), with most occurring in the Sahel. This translates to roughly 1-2 successful coups per year on the continent, but the probability for any 6-week window is much lower—roughly 10-15% at the upper bound for Africa alone. Latin America’s rate is close to zero for the time window. Multiple high-risk indicators exist: ongoing legitimacy crises (Guinea-Bissau, Benin), persistent elite fragmentation (Mali, Niger), external military actors (Russian Africa Corps), and active jihadist insurgencies. There have been recent failed or foiled coup attempts (Nigeria October 2025, Mali August 2024), which can either signal instability or demonstrate regime vigilance and successful coup-proofing. Most vulnerable regimes have recently increased surveillance, purges, and foreign backing, which temporarily reduces coup risk. The short remaining window (about 6 weeks) is a major limiting factor. While the risk is elevated by historical trends and current conditions, the probability of a successful coup in this precise period is moderate but not high. A reasonable, defensible forecast—balancing base rates, news, and warning signals—is 18%.",
            "final_probability": 18
        },
        "IntelligenceAnalysis (PoliticalRiskAssessment)": {
            "time_to_resolution": "Approximately 44 days (until January 1, 2026)",
            "perspective_relevance": "As an expert in intelligence analysis and political risk assessment, I specialize in evaluating regime stability, coup risk indicators, and regional security trends, particularly in Africa and Latin America. My approach combines base rate analysis, current event monitoring, and evaluation of elite cohesion, external influences, and structural vulnerabilities. This expertise is essential for accurately assessing both the probability and plausible mechanisms of a coup in the specified regions within the forecast window.",
            "status_quo": "No successful coup occurs in Africa or Latin America before January 1, 2026. Most regimes, especially those currently under military control in Africa, remain in power through repression or inertia. Latin America continues its trend of attempted but unsuccessful coups or self-coups, but without achieving full regime change.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent coup frequency and base rate (Africa)",
                    "effect": "Increases probability. Africa, notably the Sahel, has seen an elevated coup frequency since 2020, with military regimes in Mali, Burkina Faso, Niger, and others. The base rate for successful coups in Africa is one of the highest globally, especially in West Africa."
                },
                {
                    "factor": "Elite cohesion and coup-proofing measures",
                    "effect": "Decreases probability. Many current military regimes have taken steps to purge potential rivals, increase surveillance, and rely on foreign mercenaries (e.g., Russian Africa Corps), making further coups or counter-coups harder in the short term."
                },
                {
                    "factor": "Economic and security deterioration in Sahel",
                    "effect": "Increases probability. Jihadist insurgencies, economic distress, and public discontent have eroded regime legitimacy and created opportunities for ambitious officers or rival factions to justify a coup, especially if military failures mount."
                },
                {
                    "factor": "External actors and foreign military presence",
                    "effect": "Mixed effect. Russian and Turkish support for some juntas provides stability, yet external actors can also become involved in coup attempts or provoke rivalries among domestic factions."
                },
                {
                    "factor": "Upcoming or recent elections and constitutional manipulation",
                    "effect": "Slightly increases probability. Constitutional changes (e.g., Benin, Guinea-Bissau) and disputed elections often trigger elite splits and can motivate coups, particularly if opposition is violently suppressed or excluded."
                },
                {
                    "factor": "Current intelligence on coup attempts and suppression",
                    "effect": "Decreases probability. Recent reports of failed coup attempts in Nigeria and Mali, with swift crackdowns and arrests, suggest high vigilance by incumbent regimes, reducing the likelihood of a successful coup in the short remaining window."
                },
                {
                    "factor": "Latin America coup base rates and current climate",
                    "effect": "Decreases probability. While Latin America has seen coup attempts (Bolivia, Brazil), the region’s base rate for successful coups is much lower than Africa’s, and current intelligence shows no imminent high-risk cases."
                }
            ],
            "no_scenario": "In the next six weeks, no military or elite group in Africa or Latin America successfully overthrows a sitting executive. Existing juntas in Mali, Burkina Faso, Niger, Guinea, and others maintain control, suppressing dissent and coup plots through purges, intelligence, and foreign support. Latin America experiences political tension or isolated unrest, but lacks the necessary elite splits or security force collusion for a coup to succeed.",
            "yes_scenario": "An ambitious faction within a military regime—likely in a Sahelian country with ongoing security and economic crises (e.g., Mali, Burkina Faso, Niger)—executes a swift, overt coup, successfully removing the current junta and establishing control over the government and armed forces. Alternatively, a sudden elite split in a fragile civilian government (e.g., Guinea-Bissau) or a self-coup scenario (incumbent dissolving parliament and ruling by decree) could meet the resolution criteria if authority is consolidated and resistance suppressed.",
            "final_reasoning": "The base rate for successful coups in Africa, particularly the Sahel, remains elevated, but the concentration of military regimes has paradoxically reduced vulnerability to further coups in the short term due to elite purges, foreign mercenary support, and increased surveillance. While Mali and Burkina Faso are experiencing severe security and economic crises, evidence suggests current juntas are actively coup-proofing and suppressing opposition. Latin America’s base rate for successful coups is historically much lower, and no current crises match the pre-coup conditions seen in Africa. The short time window (44 days) further favors the status quo, but persistent instability, elite divisions, and possible unforeseen triggers (e.g., high-profile assassinations, battlefield disaster, or sudden economic collapse) keep the probability above base-level noise. Weighing recent attempted coups, structural vulnerabilities, and the historical frequency, but emphasizing the short window and coup-proofing measures, I assess the probability at 18%.",
            "final_probability": 18
        },
        "SecurityStudies (CivilMilitaryRelations)": {
            "time_to_resolution": "Approximately 6 weeks (until January 1, 2026)",
            "perspective_relevance": "My expertise in Security Studies, particularly Civil-Military Relations, enables me to analyze institutional, organizational, and cultural factors influencing coup risk. This includes understanding the role of military cohesion, elite rivalries, external actors, public legitimacy, and the dynamics of coup-proofing and regime durability. This unique lens helps distinguish between surface-level political instability and actual coup likelihood.",
            "status_quo": "In the absence of new shocks, the status quo is that no successful coup occurs in Africa or Latin America during any given six-week period—coups are low-frequency but non-trivial events, with higher baseline risk in certain African states recently, and a very low base rate in Latin America since the 1990s.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent Coup Base Rate in Africa",
                    "effect": "Increases probability. Since 2020, Africa—especially the Sahel—has seen a resurgence in successful coups (Mali, Burkina Faso, Guinea, Niger, Gabon), with attempted coups (Nigeria, Guinea-Bissau, Sierra Leone, Chad) even in 2024-25, indicating elevated regional base rates."
                },
                {
                    "factor": "Civil-Military Disunity and Regime Legitimacy",
                    "effect": "Increases probability. Evidence from Mali, Burkina Faso, Niger, and Guinea-Bissau shows declining regime legitimacy, elite exclusion, security failures, and suppressed opposition, all of which historically correlate with coup risk, especially when armed forces are dissatisfied or factionalized."
                },
                {
                    "factor": "Presence of Foreign Military Actors (Russia, Wagner/Africa Corps)",
                    "effect": "Mixed effect. On one hand, external support can stabilize regimes (coup-proofing via security advisors), but on the other, it can fuel resentment within the officer corps, especially if foreign actors are seen as undermining local autonomy or if their support is distributed unevenly, creating grievances."
                },
                {
                    "factor": "Insurgency and State Capacity Collapse",
                    "effect": "Increases probability. Where jihadist insurgencies are dismantling state authority (Mali, Burkina Faso, parts of Niger), the resulting security vacuum and loss of legitimacy can prompt coups, either as a desperate measure or as a pretext for power grabs."
                },
                {
                    "factor": "Recent Failed Coup Attempts and Security Crackdowns",
                    "effect": "Increases probability. Recent attempted coups in Nigeria and Mali, and severe crackdowns, indicate underlying instability. While crackdowns may deter some plots, they also reveal insecurity and provoke further conspiracies—historically, failed coups often precede successful ones in the near term."
                },
                {
                    "factor": "Regional and International Constraints",
                    "effect": "Decreases probability. ECOWAS, the African Union, and international actors have at times deterred coups through sanctions, threats of intervention, or diplomatic isolation. However, their leverage has recently weakened, especially in the Sahel after the formation of the Sahel Alliance."
                },
                {
                    "factor": "Latin America Coup Base Rate",
                    "effect": "Decreases probability. In Latin America, despite recent unrest (Peru, Brazil, Bolivia), actual successful coups remain very rare in the 21st century, with strong civilian control norms and international disincentives."
                }
            ],
            "no_scenario": "Despite ongoing instability, military regimes in the Sahel (Mali, Burkina Faso, Niger) maintain control through repression, elite bargains, and foreign security assistance. Jihadist violence continues, but no faction within the regime mounts a successful coup; attempted coups are foiled by loyalist forces. In Guinea-Bissau and Benin, manipulated or flawed elections proceed without military intervention. Latin America remains stable despite isolated unrest. External actors refrain from direct destabilization, and international pressure, though weakened, is enough to deter would-be coup plotters.",
            "yes_scenario": "An internal military faction in Mali, Burkina Faso, or Niger, frustrated with the ruling junta's failures against jihadists, launches a successful palace coup, possibly with tacit support from sidelined officers or external actors. Alternatively, a deteriorating security or economic crisis precipitates a self-coup (e.g., a leader illegally extends their mandate, dissolves institutions, and forcibly consolidates power). In Guinea-Bissau, elite exclusion and electoral manipulation provoke a military intervention. Latin America is less likely, but a sudden crisis in a weak democracy (e.g., Bolivia) cannot be wholly ruled out.",
            "final_reasoning": "The base rate for successful coups in Africa over a six-week period is low in absolute terms but elevated by recent trends—since 2020, at least one major African state has experienced a successful coup nearly every 6-12 months, and attempted coups are occurring every few months. Current news signals high risk: military regimes in Mali, Burkina Faso, and Niger are under pressure from insurgency, economic collapse, and internal dissent; Nigeria and Guinea-Bissau have had recent coup scares. The presence of Russian forces could both stabilize regimes and increase internal resentment. No clear signals of imminent coups are present, but the structural preconditions (factionalized militaries, legitimacy crises, external pressures, and recent failed coups) suggest the window remains open. Latin America’s risk is much lower—historically, the region has not seen a successful coup since Honduras (2009), and recent attempts have all failed. Given these factors, the probability of at least one successful coup in Africa or Latin America before Jan 1, 2026, is notably above the long-term average but not so high as to warrant extreme confidence. Balancing the risk factors, I assign a probability of 34%.",
            "final_probability": 34
        },
        "InternationalRelations (RegionalSecurityComplexTheory)": {
            "time_to_resolution": "Approximately 1.5 months (until January 1, 2026)",
            "perspective_relevance": "Regional Security Complex Theory (RSCT) frames coup risk as shaped by interconnected security dynamics, regional power constellations, and the diffusion of instability within security complexes. This perspective highlights how coups are not isolated events but are often catalyzed by cross-border contagion, competitive intervention by external powers, and the interplay of local, regional, and systemic insecurity.",
            "status_quo": "In the absence of new catalysts, the status quo is that one or more African countries experience a coup every 9–12 months, but Latin America sees only rare coup attempts, with most recent ones failing. The short time frame until resolution (about six weeks) means the baseline expectation is 'No coup,' since successful coups are infrequent even in Africa, and much less so in Latin America.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent coup base rate in Africa",
                    "effect": "Increases probability. Africa, especially the Sahel, has seen a high coup frequency in the last five years, particularly in Mali, Burkina Faso, Niger, Guinea, and Gabon. There have also been several failed or attempted coups in 2024–2025 (e.g., Nigeria, Chad). This establishes a 5–10% per-country annual probability for certain hot spots, raising the collective regional risk."
                },
                {
                    "factor": "Coup contagion and regional demonstration effects",
                    "effect": "Increases probability. RSCT posits that successful coups in neighboring states (especially within the same security complex) lower the psychological and practical barriers to further coups, as militaries see precedent and opportunity. The ongoing instability in the Sahel (Mali, Burkina Faso, Niger) continues to provide such demonstration effects."
                },
                {
                    "factor": "Entrenched military regimes and external support",
                    "effect": "Decreases probability. Many Sahelian juntas have consolidated control (e.g., Mali, Burkina Faso, Niger) with support from Russia’s Africa Corps (formerly Wagner), making further successful coups harder in the short run, as military elites are increasingly co-opted and external actors provide regime security."
                },
                {
                    "factor": "Factionalism and declining regime legitimacy",
                    "effect": "Increases probability. Multiple sources note growing discontent within militaries (e.g., low morale in Nigeria, intra-army tensions in Burkina Faso and Mali, mutinies in Niger), economic hardship, and popular unrest. This increases the risk of intra-military coups or elite splits."
                },
                {
                    "factor": "Short time window to resolution",
                    "effect": "Decreases probability. Even in high-risk states, the probability of a successful coup in any given six-week period is low, given the logistical and political challenges of executing a coup and consolidating control."
                },
                {
                    "factor": "Latin America’s low base rate and recent failures",
                    "effect": "Decreases probability. Latin America has seen only failed or attempted coups in the last two years (Peru, Brazil, Bolivia), with robust institutional and international resistance. No current news suggests imminent high-risk cases."
                },
                {
                    "factor": "Security externalization and regional rivalries",
                    "effect": "Increases probability. The presence of Russian, Turkish, and other foreign security actors in Africa suggests increased militarization and regional rivalries, sometimes destabilizing weak regimes or provoking elite backlash."
                }
            ],
            "no_scenario": "Despite ongoing instability and attempted coups (e.g., Nigeria, Chad), no faction is able to overcome internal regime consolidation, external security backing, and elite co-optation in the time frame. Latin American militaries remain largely loyal to constitutional order. Even in fragile states (Mali, Burkina Faso, Niger, Guinea-Bissau), discontent does not crystallize into a coordinated and successful coup. The short window to January 1, 2026, passes without a credible, media-confirmed, successful coup.",
            "yes_scenario": "A military or elite faction in a high-risk African state (e.g., Mali, Burkina Faso, Niger, Guinea-Bissau, Central African Republic, Chad) exploits declining regime legitimacy, intra-military tensions, or a security crisis to launch a coup that succeeds in ousting the current leadership and consolidating control (as defined by cessation of significant resistance). Alternatively, a self-coup occurs where an incumbent refuses to leave office or subverts the constitutional order. Less likely, but possible, a sudden crisis in Latin America (e.g., post-election turmoil in a weak state with a history of instability) enables a successful coup.",
            "final_reasoning": "The base rate for successful coups in Africa remains the highest of any world region, especially in the Sahel security complex, with multiple recent attempts and successful coups. However, most recent attempts have failed or regimes have further consolidated control with Russian and local security force support. The short time window (about six weeks) critically reduces the probability, as the per-week risk is low even in high-risk states. Latin America’s base rate is near zero, and current news does not indicate imminent risk there. While the underlying drivers of instability (factionalism, economic hardship, declining legitimacy, elite exclusion) persist, the short time horizon and current regime consolidation (sometimes with foreign support) counterbalance the risk. Nevertheless, the possibility of an unforeseen elite split or opportunistic coup, especially in the Sahel, keeps the probability non-negligible—historically, coups can occur with little warning. I therefore assign a probability of 18%, reflecting the high base rate in Africa, the ongoing instability, but heavily discounting for the short window and recent regime consolidation.",
            "final_probability": 18
        },
        "Political Science (CoupTrapTheory)": {
            "time_to_resolution": "Approximately 6 weeks (from November 18, 2025, to January 1, 2026)",
            "perspective_relevance": "As an expert in Political Science with emphasis on CoupTrap Theory, I focus on coup cycles, institutional legacies, civil-military relations, elite incentives, and the international context. CoupTrap Theory highlights how recent coups in a region both increase coup risk through demonstration effects and institutional weakening, and decrease risk in the immediate aftermath due to heightened vigilance, consolidation by new juntas, and purges. This perspective is crucial for distinguishing between background instability and the specific conditions that lead to successful coups within short timeframes.",
            "status_quo": "No successful coup occurs; most African and Latin American countries remain under their current regimes, with recent juntas in the Sahel consolidating power and Latin America experiencing turbulence but no outright military takeovers.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent Wave of Coups in Africa (CoupTrap Dynamics)",
                    "effect": "Slightly increases risk. The demonstration effect and regional norm erosion can embolden would-be plotters, but immediate post-coup periods usually see juntas consolidate power, purge rivals, and increase vigilance, reducing short-term coup risk."
                },
                {
                    "factor": "Elite Fragmentation and Military Cohesion in Sahel States",
                    "effect": "Moderately increases risk. In Mali, Burkina Faso, and Niger, evidence of intra-military tensions, failed coup attempts, and declining legitimacy heighten the risk of new coups, though often these are pre-empted or suppressed."
                },
                {
                    "factor": "International Involvement (Russia, Wagner/Africa Corps, Turkey, etc.)",
                    "effect": "Mixed effect. External backing can prop up regimes, reducing coup risk by providing security and resources, but can also aggravate elite splits and public resentment, increasing risk if interventions are perceived as illegitimate."
                },
                {
                    "factor": "Jihadist Threats and State Fragility",
                    "effect": "Moderately increases risk. The worsening security situation in Mali and neighboring states undermines junta legitimacy, increases military stress, and creates openings for ambitious officers to justify intervention."
                },
                {
                    "factor": "Institutionalization of Military Rule",
                    "effect": "Decreases risk in the short term. Recent juntas (Mali, Burkina Faso, Niger) have purged rivals, criminalized opposition, and built patronage networks, making imminent successful coups less likely absent major shocks."
                },
                {
                    "factor": "Latin America: Declining but not Collapsed Democratic Norms",
                    "effect": "Slightly increases risk, but not to the levels seen in Africa. While recent events in Bolivia, Brazil, and Peru show stress, there are currently no credible indications of imminent, successful military interventions."
                },
                {
                    "factor": "Short Timeframe (6 weeks)",
                    "effect": "Strongly decreases probability. Coups are rare on a monthly timescale; even in turbulent regions, successful coups do not occur every few months."
                }
            ],
            "no_scenario": "Despite ongoing instability and some attempted coups (e.g., in Nigeria and possible unrest in the Sahel), juntas in Mali, Burkina Faso, and Niger suppress rivals and maintain control with external (e.g., Russian) backing. No new successful coup occurs in either Africa or Latin America by January 1, 2026.",
            "yes_scenario": "A faction within the military or security apparatus in a Sahel country (e.g., Mali or Burkina Faso), frustrated by ongoing losses to jihadists or resource distribution, launches a decisive coup and rapidly seizes full control, overcoming the junta's countermeasures. Alternatively, an unexpected elite split or popular backlash in Latin America (e.g., a disputed election in Guinea-Bissau or elsewhere) leads to a quick and successful military or self-coup.",
            "final_reasoning": "Base rates suggest roughly 1-2 successful coups per year in Africa, with a higher concentration in the Sahel. Over the last five years (2020-2025), at least one successful coup has occurred nearly every year in Africa, but most coups cluster in the first half of the year or after longer buildup, not within a 6-week period. The recent wave of coups (2020-2023) has increased background risk, but post-takeover periods typically see juntas on high alert and actively suppressing dissent, making immediate further coups less likely. News reports confirm recent failed coup attempts (e.g., Nigeria, Mali 2024), elite purges, and increased external support for existing juntas (notably from Russia), all of which temporarily harden regimes against internal threats. In Latin America, despite some instability (Bolivia, Peru, Brazil), none of the credible sources indicate an imminent, successful coup in the next six weeks. The short timeframe is crucial: the historical monthly probability of a successful coup in these regions is low, even with elevated background risk. Therefore, while the risk is not negligible—especially due to elite fragmentation and state fragility in the Sahel—it remains much lower than annualized coup rates would suggest.",
            "final_probability": 12
        },
        "Political Science (ComparativeAuthoritarianism)": {
            "time_to_resolution": "Approximately 6 weeks (until January 1, 2026)",
            "perspective_relevance": "As an expert in comparative authoritarianism, I draw on research into coup triggers, regime vulnerability, patterns of military intervention, and elite dynamics in hybrid and autocratic contexts. I am skilled at distinguishing between surface-level instability and the deeper institutional and coalitional fractures that make successful coups probable. I can apply knowledge about recent regional coup waves, military and civilian elite relationships, and the influence of external actors such as Russia, Turkey, and France. My judgment is grounded in both the historical base rates and the specific risk factors present in the current regional context.",
            "status_quo": "The status quo is that there is NO successful coup in either Africa or Latin America between now and January 1, 2026. The majority of days in both regions pass without a successful coup, even in periods of elevated risk.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent coup wave in Africa, especially the Sahel",
                    "effect": "INCREASES probability. The past five years have seen an uptick in successful coups (Mali, Burkina Faso, Niger, Gabon, Guinea), especially in West/Central Africa, suggesting a temporarily higher base rate."
                },
                {
                    "factor": "Coup fatigue, learning, and adaptation",
                    "effect": "DECREASES probability. After a wave of coups, both military and civilian actors adapt—juntas purge rivals, militaries enhance loyalty monitoring, and potential plotters are on high alert for surveillance. This can suppress further coups in the short term."
                },
                {
                    "factor": "Elite fragmentation and grievances within militaries",
                    "effect": "INCREASES probability. Reports from Mali, Burkina Faso, Niger, and Nigeria indicate dissatisfaction among mid-level officers, poor morale, and intra-military rivalries, which historically correlate with coup attempts."
                },
                {
                    "factor": "External actors providing regime insulation",
                    "effect": "DECREASES probability. The presence of Russian military personnel (Africa Corps, ex-Wagner) in Mali, Burkina Faso, Niger, etc., provides embattled juntas with training, intelligence, and coup-proofing strategies, making successful coups harder."
                },
                {
                    "factor": "Jihadi insurgencies and loss of state control",
                    "effect": "AMBIGUOUS. On one hand, weakened regimes are more vulnerable to coups; on the other, when states lose control to insurgents, militaries may be too overstretched/demoralized to plot coups, or such states may collapse without a coup per se."
                },
                {
                    "factor": "Latin American coup base rates",
                    "effect": "DECREASES probability. In Latin America, successful coups have become rare since the 1990s. Recent events (Peru, Bolivia, Brazil) were coup attempts or self-coups, but were not fully successful or did not meet the resolution criteria."
                },
                {
                    "factor": "Short time horizon",
                    "effect": "DECREASES probability. The question closes in about six weeks, limiting the window for plotting, executing, and consolidating a coup."
                },
                {
                    "factor": "Recent failed/foiled coup attempts",
                    "effect": "INCREASES probability. Recent coup scares in Nigeria, Guinea-Bissau, and Bolivia highlight ongoing elite instability, and the fact that some attempts have failed could mean continued plotting or a buildup of pressure."
                }
            ],
            "no_scenario": "Despite ongoing unrest and elite grievances, juntas in Mali, Burkina Faso, Niger, and other hotspots remain vigilant and successfully suppress internal dissent with the help of foreign advisors and surveillance. Latin America remains relatively stable, with no military or autogolpe successfully toppling incumbents. Any coup plots are detected and foiled, or result in only attempted, not successful, coups.",
            "yes_scenario": "A faction within the military (likely in a Sahelian state such as Mali, Burkina Faso, or Niger) overthrows the current junta, exploiting elite fragmentation and popular frustration over deteriorating security and economic crises. Alternatively, a self-coup occurs in a fragile democracy (e.g., Guinea-Bissau or possibly a Central African state), with an incumbent using force to extend their rule and successfully consolidating power before January 1, 2026.",
            "final_reasoning": "The base rate for successful coups in Africa has risen in the last five years, especially in the Sahel, but even during this acute period, the rate is roughly 1-2 per year across the continent. In Latin America, successful coups are extremely rare post-2000. The current context features high instability in the Sahel (Mali, Burkina Faso, Niger), with evident elite dissatisfaction, economic crisis, and insurgency pressures. However, these regimes have been quick to purge potential rivals and have enhanced counter-coup measures with Russian help. Recent coup scares in Nigeria and Guinea-Bissau suggest ongoing risk, but the very short time window (six weeks) reduces the likelihood that a coup can be planned, executed, and consolidated. The 'status quo bias' and base rates indicate that most six-week periods do NOT see a successful coup, even in today's environment. Therefore, while the risk is notably higher than in the pre-2020 period, it is still less likely than not, though not by a wide margin. The probability should reflect heightened risk but not be extreme.",
            "final_probability": 26
        },
        "Political Science (PoliticalInstitutionalism)": {
            "time_to_resolution": "Approximately 1.5 months (until January 1, 2026)",
            "perspective_relevance": "As a political institutionalist, I specialize in the stability, resilience, and dynamics of formal and informal institutions—especially the military, executive, judiciary, and party systems. This perspective is highly relevant for coups, which are often triggered or prevented by institutional weaknesses, elite fragmentation, legitimacy crises, or failed civilian-military relations. Institutionalism also emphasizes the role of path dependence, historical patterns, and comparative base rates, all central to forecasting coups.",
            "status_quo": "The status quo is that there is significant coup risk in several African countries (notably in the Sahel), but no successful coup has occurred since the question opened (August 21, 2025). In Latin America, recent events (Brazil, Bolivia, Peru) have not resulted in successful coups. If current trends hold, no successful coup will occur before January 1, 2026.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent Coup Base Rates in Africa",
                    "effect": "Increases probability. Africa has seen at least 7 successful coups since 2020, with a marked concentration in Mali, Burkina Faso, Niger, and Gabon. Historical frequencies suggest an annualized risk of 1-2 coups per year in Africa."
                },
                {
                    "factor": "Current Regime Types and Elite Fragmentation",
                    "effect": "Increases probability. Multiple Sahelian countries (Mali, Burkina Faso, Niger) are under military regimes or transitional governments with weak legitimacy, internal divisions, and deteriorating security, all raising coup risk."
                },
                {
                    "factor": "Foreign Military Involvement and Protection",
                    "effect": "Decreases probability in some cases, increases in others. Russian 'Africa Corps' presence in Mali, Burkina Faso, Niger may deter coups against current juntas, but also signals regime insecurity and could provoke intra-military competition."
                },
                {
                    "factor": "Popular Support and Institutional Legitimacy",
                    "effect": "Mixed effect. Popular dissatisfaction may increase the likelihood of attempted coups, but entrenched juntas have suppressed opposition and dissent, lowering immediate risk of successful coups by opposition forces."
                },
                {
                    "factor": "Recent Failed or Attempted Coups and Purges",
                    "effect": "Increases probability. Recent coup attempts (e.g., Nigeria, Mali 2024, Burkina Faso, Guinea-Bissau) indicate ongoing instability and unresolved elite tensions, which can be precursors to successful coups, especially if purges deepen resentments."
                },
                {
                    "factor": "Regional and International Norms",
                    "effect": "Decreases probability, slightly. ECOWAS and AU sanctions have proven weak deterrents, but international pressure can sometimes delay or delegitimize coups, especially in countries more integrated into global systems."
                },
                {
                    "factor": "Latin American Coup Base Rates",
                    "effect": "Decreases probability. Post-1990s, Latin America has had few successful coups, and recent high-profile attempts (Brazil 2023, Bolivia 2024, Peru 2022) failed. Civil-military norms and international pressure strongly discourage overt coups."
                }
            ],
            "no_scenario": "Despite high tension and underlying risks, military and regime elites in the Sahel maintain internal discipline or are effectively deterred by foreign support (Russia), purges, and suppression of dissent. In Latin America, civil-military relations hold, and even in crisis-prone states (e.g., Bolivia, Peru), security apparatuses remain loyal or are neutralized, preventing a successful coup.",
            "yes_scenario": "A faction within the military or security services in Mali, Burkina Faso, or Niger, dissatisfied with the current junta’s failures, instability, or foreign entanglements, organizes a successful palace coup or counter-coup, removing current leaders and consolidating power. Alternatively, a self-coup occurs (e.g., a leader in Guinea-Bissau or Central African Republic refuses to step down or annuls elections), or a delayed, successful coup emerges in a context with documented elite and military fracturing.",
            "final_reasoning": "Base rates for successful coups in Africa (especially the Sahel) remain elevated; from 2020-2024, the region averaged more than one successful coup per year. Multiple countries are ruled by recently installed, insecure juntas facing internal and external pressures, and recent news documents ongoing coup plotting (Nigeria, Mali), elite purges, economic crises, and legitimacy deficits. However, several factors temper the risk: military regimes have fortified themselves with foreign (especially Russian) support, signaling both insecurity and deterrence; recent purges and failed coup attempts (Nigeria, Mali) may have disrupted immediate plotting; and the time window is now just 1.5 months. In Latin America, coup base rates are much lower, and institutional norms are more robust. The most likely location for a successful coup remains the Sahel (Mali, Burkina Faso, Niger), where regime instability, elite fracturing, and foreign involvement could combine to produce a coup, but the short time frame and recent repression/purges slightly lower the risk relative to the annualized base rate. Given these considerations, and weighting the status quo heavily due to the short resolution window, I estimate the probability of a successful coup in Africa or Latin America before January 1, 2026 at 28%.",
            "final_probability": 28
        },
        "Sociology (SocialMovementTheory)": {
            "time_to_resolution": "Approximately 1.5 months (from 2025-11-18 to 2026-01-01)",
            "perspective_relevance": "As a sociologist specializing in Social Movement Theory, my expertise is particularly relevant to forecasting coups, which are collective actions by elites or segments of the military often responding to grievances, legitimacy crises, or shifting opportunity structures. SMT helps analyze the preconditions, mobilization processes, and framing dynamics that make coup attempts more or less likely to succeed. It also contextualizes how state weakness, elite fragmentation, and international actors shape the 'political opportunity structures' that enable or inhibit collective elite action.",
            "status_quo": "The status quo is that coups in Africa (particularly the Sahel) have been frequent in recent years, but Latin America has seen only attempts, not successful coups. At present (late 2025), most recent coup-prone regimes in Africa are led by military juntas, and regional instability persists, but no successful coups have occurred since the Niger and Gabon events in 2023. If nothing changes, no new successful coup would occur before January 2026.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent History and Coup Base Rate in Africa",
                    "effect": "Increases probability. Africa, especially the Sahel, has experienced a high coup frequency—at least 7 successful coups since 2020—suggesting a persistent regional vulnerability. The short forecast window (1.5 months) reduces the base rate, but the background rate remains non-trivial."
                },
                {
                    "factor": "Regime Type and Elite Cohesion",
                    "effect": "Mixed effect. Many coup-prone states are already under military rule, which typically reduces the risk of further coups in the short term due to elite cohesion and suppression of rival factions, although intra-junta coups are possible when legitimacy or resources are contested."
                },
                {
                    "factor": "Social and Economic Grievances",
                    "effect": "Increases probability. Economic crises, insurgencies, and legitimacy deficits (e.g., Mali's fuel crisis, Burkina Faso's security issues, Guinea-Bissau's rigged elections) heighten grievances, providing motive and justification for elite action."
                },
                {
                    "factor": "Presence of External Military Actors",
                    "effect": "Mixed effect. Russian and Turkish support for Sahel juntas can bolster regime security (decreasing probability of a successful coup from outside the ruling clique), but also increases internal and external resentment, creating potential for factional splits or coups by dissatisfied officers."
                },
                {
                    "factor": "Popular Mobilization and Civil Society Weakness",
                    "effect": "Decreases probability. Popular uprisings are excluded by resolution criteria, and civil society is weak in most junta-led regimes, making elite-driven coups (rather than mass action) the primary risk."
                },
                {
                    "factor": "International Isolation and Sanctions",
                    "effect": "Increases probability. Withdrawal from ECOWAS and the ICC, economic sanctions, and isolation (e.g., Mali, Burkina Faso, Niger) increase internal strain and reduce external constraints on coup plotting."
                },
                {
                    "factor": "Short Forecast Window",
                    "effect": "Decreases probability. The time window (1.5 months) is narrow, which statistically limits the likelihood of rare, high-impact events."
                },
                {
                    "factor": "Recent Coup Attempts (but not Success)",
                    "effect": "Slightly increases probability. Nigeria, Guinea-Bissau, and Bolivia have all experienced coup attempts in the last 18 months, indicating ongoing elite instability, but lack of success suggests greater regime resilience or elite cohesion."
                }
            ],
            "no_scenario": "Military juntas in Mali, Burkina Faso, Niger, Guinea, and Gabon maintain internal discipline through a combination of external support (from Russia/Turkey), repression, and elite patronage. No major internal splits occur, and coup plotting is contained or preempted (e.g., as in Nigeria's October 2025 coup scare). Latin America remains relatively stable, with no elite moves against sitting executives. The forecast window closes with no credible reports of a successful coup.",
            "yes_scenario": "A credible split emerges within a ruling junta (e.g., Mali, Burkina Faso, Niger, Guinea-Bissau), likely triggered by deteriorating security, resource shortages, or external pressure (e.g., fuel crisis in Mali, further economic decline in Burkina Faso). A dissatisfied faction within the military moves to unseat the current leader, capitalizing on grievances and elite fragmentation. The coup rapidly succeeds, with the new faction assuming control and quelling resistance. Alternatively, in Guinea-Bissau or a similar context with hollowed-out electoral legitimacy, a self-coup or elite-driven takeover could occur if post-election disputes escalate. Latin America remains unlikely to see a successful coup given recent failed attempts and stronger institutional resilience.",
            "final_reasoning": "The high base rate of coups in Africa, especially in the Sahel, must be balanced against the narrow forecast window and the reality that most highly vulnerable states are already under military rule. Social Movement Theory highlights the importance of elite fragmentation, legitimacy crises, and changing opportunity structures. While economic and security grievances are acute (e.g., Mali's fuel crisis, Burkina Faso's jihadist threats), most juntas have consolidated power through external support (Russia, Turkey) and repression, reducing immediate coup risk. However, elite cohesion is brittle—recent coup attempts in Nigeria (October 2025) and intra-junta tensions in Mali and Burkina Faso indicate persistent risk. Latin America, despite recent coup attempts (Bolivia, Brazil), shows stronger institutional buffers and no current high-risk cases. Given the short time frame and the need for both motive and opportunity for a coup to succeed, the probability is above the naive base rate but not extreme. I estimate the probability at 20%, reflecting the ongoing instability and history of rapid, unanticipated coups in the region, but discounting for the short window and current regime types.",
            "final_probability": 20
        },
        "Sociology (EliteTheory)": {
            "time_to_resolution": "Approximately 1.5 months (resolves January 1, 2026; today is November 18, 2025)",
            "perspective_relevance": "As an expert in Sociology with a specialization in Elite Theory, I focus on the dynamics of elite competition, intra-elite conflict, and the structural vulnerabilities of political systems. This perspective is particularly relevant for coup forecasting, as coups are typically elite-driven events resulting from rifts, dissatisfaction, or opportunities perceived by military or political elites. Elite Theory helps identify both the structural and situational preconditions for elite-led regime change.",
            "status_quo": "The status quo is that coups in Africa, especially the Sahel, have been frequent in recent years, with several successful coups in Mali, Burkina Faso, Niger, and Gabon since 2020, as well as multiple attempts in Nigeria and Guinea-Bissau. In Latin America, coup attempts have been less frequent and less successful, with only failed or self-coup attempts in Peru, Bolivia, and Brazil. Currently, several African states are under military regimes or experiencing severe instability, while Latin America remains relatively more stable but with some democratic erosion.",
            "perspective_derived_factors": [
                {
                    "factor": "High Base Rate of Recent Coups in Africa",
                    "effect": "Substantially increases probability. Since 2020, the rate of successful coups in Africa has exceeded historic averages, particularly in the Sahel. The window for the forecast is short, but the environment remains volatile."
                },
                {
                    "factor": "Elite Fragmentation and Discontent within Military Regimes",
                    "effect": "Increases probability. Reports of failed or thwarted coup attempts (e.g., Nigeria Oct 2025, Mali Aug 2024, Guinea-Bissau Dec 2023/2024) suggest ongoing intra-elite struggles. Elite Theory indicates that regimes with recent or ongoing purges are more vulnerable to further elite-led actions."
                },
                {
                    "factor": "Consolidation of Military Regimes, Regional Alliances",
                    "effect": "Decreases probability. Many current juntas are entrenching themselves, forming alliances (Sahel Confederation), and purging or suppressing opposition, which may reduce the immediate risk of successful coups by preempting rivals."
                },
                {
                    "factor": "Foreign Military Presence and Support",
                    "effect": "Ambiguous: can both increase (by fostering resentment or providing new elite factions) or decrease (by shoring up regime security) the probability. Russian presence (Africa Corps, ex-Wagner) in Mali, Burkina Faso, etc., strengthens some regimes, but elite dependence on foreign actors can also spur nationalist backlash or elite factionalism."
                },
                {
                    "factor": "Institutional Weakness and Popular Discontent",
                    "effect": "Increases probability. Weak institutions, recurring economic crises, and popular disenchantment can embolden elite actors to attempt coups, especially if popular legitimacy is low. However, mass uprisings alone do not count for this question; the trigger must be intra-elite."
                },
                {
                    "factor": "Latin America: Low Recent Base Rate and Stronger Institutions",
                    "effect": "Decreases probability. While there are recurrent tensions in places like Bolivia and Peru, recent coup attempts have failed, and the region overall has stronger civilian control over the military compared to the Sahel."
                }
            ],
            "no_scenario": "Despite ongoing instability, military regimes in the Sahel (Mali, Burkina Faso, Niger) consolidate power through purges, repression, and support from foreign (mainly Russian) military advisors. Elite discontent is present, but surveillance, intelligence-sharing, and preemptive arrests (as seen in Nigeria and Mali) prevent any new successful coups. In Latin America, no military or elite group is able to organize a successful coup before January 1, 2026, due to institutional resilience or lack of opportunity.",
            "yes_scenario": "A successful intra-elite coup occurs in a Sahelian country where intra-military or political elite rivalries escalate—perhaps in Mali or Burkina Faso, where recent purges, operational failures, or deteriorating security provide an opportunity for a dissatisfied faction to seize power. Alternatively, a self-coup by a civilian incumbent (e.g., in Guinea-Bissau or Central African Republic) results in the illegal extension of rule by force, or in a surprise case, a military faction in a relatively stable but institutionally weak state (e.g., Guinea-Bissau, Cameroon) exploits political crises to unseat the executive.",
            "final_reasoning": "The historical base rate for coups in Africa over the past five years is high (at least 1–2 successful coups per year). Even with some recent consolidation, multiple reports indicate ongoing elite discontent, failed coup attempts, and a lack of legitimacy for many military regimes. The purges and instability within both the security apparatus and governing elites (notably in Mali, Burkina Faso, Nigeria, Guinea-Bissau) create persistent opportunities for intra-elite regime change. The presence of foreign (particularly Russian) forces may deter some coup attempts but can also create new elite cleavages. Latin America is less likely to see a successful coup—recent attempts have not succeeded and institutions are more robust—but it cannot be fully discounted, especially given ongoing democratic erosion in several states. With only ~1.5 months left, the probability is somewhat lower than the annualized base rate, but the structural vulnerabilities and elite dynamics in the Sahel keep the risk elevated. A probability in the 30–35% range is justified by the short window, ongoing elite instability, and recent coup history.",
            "final_probability": 33
        },
        "AreaStudiesAfrica (AfricanStateFragility)": {
            "time_to_resolution": "Approximately 6 weeks (until January 1, 2026)",
            "perspective_relevance": "As an expert in AreaStudiesAfrica with a focus on African State Fragility, I bring a data-driven understanding of coup dynamics, fragility indicators (state legitimacy, security, economic stress), historical coup base rates, and the institutional/structural drivers of instability. My expertise allows me to assess risks not just from sensational news, but from careful analysis of regime durability, elite cohesion, and the coup-proofing strategies employed in both Africa and Latin America.",
            "status_quo": "If nothing changes, the status quo suggests a high but subsiding risk of coups in Africa, especially the Sahel, with Latin America at a substantially lower risk. In recent years, there have been frequent coups in the Sahel and West Africa. However, late 2025 has seen more attempted rather than successful coups, and entrenched juntas are actively coup-proofing. Latin America has seen failed attempts but no recent successful coups.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent Coup Base Rate (Africa & Latin America)",
                    "effect": "Increases probability. Africa, particularly the Sahel, has experienced an unprecedented cluster of coups (8 successful since 2020). Latin America has seen attempts but not successes. Historically, the base rate for a successful coup in Africa over a half-year is around 1-2%, but rises to 8-12% in current conditions due to clustering."
                },
                {
                    "factor": "Elite Fragmentation and Coup-Proofing by Juntas",
                    "effect": "Decreases probability. Juntas in Mali, Burkina Faso, Niger, etc., have intensified internal surveillance, purges, and repression following coup attempts. This reduces immediate risk, as new regimes are typically most vulnerable in their first 1-2 years; by late 2025, many are consolidating power."
                },
                {
                    "factor": "Jihadist Insurgencies and State Weakness",
                    "effect": "Increases probability. Mali, Burkina Faso, and Niger face escalating insurgencies, eroded legitimacy, and economic collapse. Security breakdowns can prompt military moves either to oust failing juntas or as power struggles within the regime."
                },
                {
                    "factor": "Foreign Military Presence and External Actors",
                    "effect": "Ambivalent, but slightly decreases probability. Russian (Africa Corps) presence in Mali, Burkina Faso, and CAR reinforces incumbent juntas and provides coup-proofing help. However, it also increases elite resentment and could spark factionalism; net effect is stabilization in the short term."
                },
                {
                    "factor": "Recent Attempted Coups and Crackdowns",
                    "effect": "Decreases probability. Nigeria, Mali, and Burkina Faso have seen foiled or suppressed coup attempts in the past 3-6 months. Crackdowns and purges that follow tend to suppress further immediate attempts, but risk can rebound if repression backfires."
                },
                {
                    "factor": "Electoral Manipulation and Erosion of Democratic Legitimacy",
                    "effect": "Increases probability, especially in countries like Guinea-Bissau, Benin, CAR, and Côte d'Ivoire, where exclusionary politics and constitutional manipulation can provoke military intervention. However, the time frame is short, and most militaries in these states have shown restraint recently."
                },
                {
                    "factor": "Regional and International Attention",
                    "effect": "Decreases probability. ECOWAS, AU, and international actors have responded assertively to recent coups, raising the cost of new ones. However, in the Sahel, regional isolation means this deterrent is weaker."
                }
            ],
            "no_scenario": "No successful coup occurs by January 1, 2026. Juntas in Mali, Burkina Faso, Niger, and others maintain power through repression, internal purges, and foreign support. Coup attempts may occur (as in Nigeria and Mali), but are foiled or remain at the planning stage. In Latin America, despite political tension (Peru, Bolivia), militaries refrain from direct intervention or attempts are unsuccessful. Even in fragile contexts (Guinea-Bissau, Benin), elite deals and security force loyalty prevent a power seizure.",
            "yes_scenario": "A successful coup occurs in Africa, most likely in the Sahel (Mali, Burkina Faso, Niger), where intra-military splits or elite rivalry prompt a faction to oust the current junta. This could be triggered by battlefield defeats, economic collapse, or a failed transition promise. Alternatively, a surprise military or self-coup in a fragile democracy (e.g., Guinea-Bissau, CAR, Côte d'Ivoire) or an unexpected breakdown in Latin America (less likely, but not impossible) results in the ouster and consolidation of power by a new leader and the cessation of significant resistance.",
            "final_reasoning": "The probability of a successful coup in Africa or Latin America before January 1, 2026 is elevated by recent trends in the Sahel, with fragile juntas under severe pressure and a record of clustered coups. However, the time window is short (6 weeks), and recent events suggest juntas are actively coup-proofing, crackdowns are fresh, and foreign (especially Russian) support bolsters regime resilience. The base rate for a successful coup in Africa over such a short period is historically low (1-2%), but given the current environment and recent clustering, I estimate a 10-12% baseline for Africa, almost negligible (1-2%) for Latin America. The net effect of recent purges and heightened security post-coup attempts is a temporary suppression of immediate coup risk, but fragility means risk remains well above historic norms. I see the balance of evidence suggesting a real but not dominant risk—most likely scenario is no successful coup, but a non-trivial chance remains, especially in the Sahel. I therefore judge the probability at 13%.",
            "final_probability": 13
        },
        "AreaStudiesAfrica (NeoPatrimonialism)": {
            "time_to_resolution": "Approximately 6 weeks (until January 1, 2026)",
            "perspective_relevance": "As an AreaStudiesAfrica (NeoPatrimonialism) expert, my perspective is uniquely relevant because many of the recent and ongoing coups in Africa can be analyzed through the lens of neo-patrimonial regimes—where personal rule, patronage networks, and the blurring of public and private interests dominate. Such systems tend to generate political instability, elite fragmentation, and weak institutionalization, all of which are critical precursors and facilitators of coup risk. I am attuned to the signals of elite dissatisfaction, regime decay, and the patterns of coup-proofing and external influence characteristic of neo-patrimonial polities. This helps in weighing both the base rate and current triggers across Africa and, to a lesser degree, Latin America.",
            "status_quo": "The status quo is that coups—both attempted and successful—have been frequent in Africa over the past five years, especially in the Sahel. Latin America has seen fewer successful coups, with recent events mostly being failed attempts or self-coup efforts that did not result in regime change. Most African countries with recent coups remain ruled by military juntas, but no successful coup has occurred in the last few months. If nothing changes, the default expectation would be for no new successful coup before January 1, 2026, given the short time window.",
            "perspective_derived_factors": [
                {
                    "factor": "Base rate of coups in Africa for short time frames",
                    "effect": "Increases probability. Historically, Africa has averaged 1-2 successful coups per year, but the probability for a 6-week window is lower; still, the concentration of coup-prone states (Sahel, Central Africa) and recent attempts suggest a non-negligible risk."
                },
                {
                    "factor": "Elite fragmentation and intra-military dissent in Sahel regimes",
                    "effect": "Increases probability. Reports of coup attempts, arrests (e.g., in Nigeria, Mali), and loss of regime popularity/legitimacy in Mali, Burkina Faso, Niger, and potential mutinies suggest active elite contestation."
                },
                {
                    "factor": "Coup-proofing via foreign support (Russia, Wagner/Africa Corps, Turkey)",
                    "effect": "Decreases probability. Russian and Turkish military support to current juntas (Mali, Burkina Faso, Niger, CAR, Equatorial Guinea, Libya) can buttress incumbents, making successful coups harder in the short term."
                },
                {
                    "factor": "Jihadist insurgency and state fragility",
                    "effect": "Increases probability. Severe security crises (Mali, Burkina Faso) historically correlate with coups, especially if the army feels the government is failing; however, severe fragmentation can also paralyze coup coordination."
                },
                {
                    "factor": "Legitimacy decay and popular discontent",
                    "effect": "Increases probability. Neo-patrimonial regimes facing economic hardship, repression, and exclusion of opposition (e.g. Guinea-Bissau, Benin) risk elite and popular backlash, but the timeline to coup is often longer than a few weeks."
                },
                {
                    "factor": "Regional coup contagion and recent attempts",
                    "effect": "Increases probability. The 'coup belt' (Sahel, West Africa) is in a period of regional contagion, and recent attempts (Nigeria, Mali, Guinea-Bissau) show ongoing risk."
                },
                {
                    "factor": "Latin America base rate and context",
                    "effect": "Decreases probability. Latin America’s base rate for successful coups is very low in this period; recent attempts (Bolivia 2024, Peru 2022) failed or were self-coups not resulting in full regime change."
                }
            ],
            "no_scenario": "Despite ongoing instability and elite tensions, strong coup-proofing by Russian and Turkish support, ongoing purges and repression, and the short time window (6 weeks) mean that no group is able to successfully seize power. Coup plots are detected early (as in Nigeria, October 2025, or Mali, 2024), or result only in failed/abortive attempts. Latin America remains stable, with no successful military seizure of power.",
            "yes_scenario": "A major elite split or military mutiny in one of the high-risk Sahelian states (Mali, Burkina Faso, Niger) materializes rapidly, overwhelming coup-proofing efforts or exploiting a moment of regime weakness (e.g., a sudden death or incapacitation of a leader, or foreign support being suddenly withdrawn or redirected). Alternatively, in a less-likely scenario, a sudden breakdown in Guinea-Bissau or a yet-unstable regime (e.g., CAR, Sudan) results in a new group seizing full control before January 1, 2026. Latin America remains a remote possibility but could see a self-coup if an incumbent refuses to step down or dissolves other branches of power.",
            "final_reasoning": "The historical base rate for successful coups in Africa is about 1-2 per year, but the window here is only 6 weeks. Recent months have seen several attempted or rumored coups (Nigeria, Mali, Guinea-Bissau), and the core of the 'coup belt' remains unstable, with internal dissent, deteriorating security, and eroding legitimacy. However, there is significant coup-proofing via Russian and Turkish support, ongoing purges, and fear of reprisals, which raise the bar for coup success. Most regime collapses take longer to materialize, and the short time frame sharply decreases the likelihood. In Latin America, the base rate is very low, and no acute triggers are visible. Still, the atmosphere in the Sahel and the history of sudden, last-minute coups (e.g., Gabon 2023) means a non-trivial probability remains. I estimate the probability of at least one successful coup in Africa or Latin America before January 1, 2026, at 18%. This reflects a significant risk, but the short timeline and stabilization efforts make a coup less likely than not.",
            "final_probability": 18
        },
        "AreaStudiesLatinAmerica (LatinAmericanMilitaryIntervention)": {
            "time_to_resolution": "Approximately 44 days (from November 18, 2025, to January 1, 2026)",
            "perspective_relevance": "As an expert in Area Studies with a focus on Latin American military intervention, I bring an understanding of base rates and drivers of coups in both Latin America and Africa, comparative institutional resilience, the dynamics of military and civilian relations, and the influence of internal and external actors (especially foreign mercenary presence and regional organizations). I can assess structural vulnerabilities, recent coup trends, and the likelihood of near-term regime breakdowns in both regions.",
            "status_quo": "Historically, coups—especially successful ones—are rare events, even in regions with recurrent instability. The status quo is no successful coup occurring within a four-month window, as most years in both regions see zero or one such event.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent spike in African coups, especially in the Sahel",
                    "effect": "Increases probability. The last few years have seen a notable spike, with several African states already under military rule. This suggests some contagion and regime fragility."
                },
                {
                    "factor": "Short forecast window (44 days)",
                    "effect": "Decreases probability. The base rate of successful coups per month, even in high-risk years, is low."
                },
                {
                    "factor": "Consolidation of existing juntas (Mali, Burkina Faso, Niger, Guinea, Gabon, etc.)",
                    "effect": "Mixed effect. Coups are more likely in unstable transitions, but once a junta entrenches itself, further coups may decrease unless there is major internal dissent or a counter-coup."
                },
                {
                    "factor": "Signs of internal dissent and failed/attempted coups (e.g., Nigeria coup scare, Mali August 2024 failed coup, Guinea-Bissau's eroding legitimacy)",
                    "effect": "Increases probability, as it suggests ongoing friction and possible openings for military intervention."
                },
                {
                    "factor": "Presence of Russian military and Wagner/Africa Corps in Sahel countries",
                    "effect": "Increases probability. Such presence can embolden ruling juntas against civilian authorities, but also creates intra-military tension and potential for counter-coup attempts."
                },
                {
                    "factor": "Recent regional elections manipulated by incumbents (Benin, Guinea-Bissau, Cameroon, Tanzania, Côte d'Ivoire)",
                    "effect": "Increases probability slightly, especially in weak states, since exclusionary politics can provoke military actors or opposition elites to act outside legal means."
                },
                {
                    "factor": "External pressure is currently low (e.g., ECOWAS efforts have waned, international attention is fragmented)",
                    "effect": "Slightly increases probability, as deterrence against coups is weaker than in past decades."
                },
                {
                    "factor": "Latin America base rate is very low for successful coups in this time frame",
                    "effect": "Decreases probability. Recent incidents (Brazil 2023, Peru 2022, Bolivia 2024) were all unsuccessful, and militaries in the region are generally more institutionalized and less likely to attempt or succeed in coups absent major crises."
                },
                {
                    "factor": "Jihadist insurgency in the Sahel (Mali, Burkina Faso, Niger)",
                    "effect": "Mixed effect. While the threat destabilizes regimes, it can also consolidate military power, making internal coups less likely unless severe defeat or dissent occurs."
                }
            ],
            "no_scenario": "No major regime-threatening events occur in the next 44 days. Juntas in Mali, Burkina Faso, Niger, and Guinea-Bissau maintain control despite internal dissent and external threats. Manipulated elections or elite reshuffling do not provoke military actors to attempt (or succeed at) a coup. In Latin America, despite some political instability, militaries refrain from overt intervention, and civil-military relations hold.",
            "yes_scenario": "A successful coup occurs in a junta-led African country (e.g., a counter-coup in Mali, Burkina Faso, or Niger by dissatisfied officers or rival factions), or in a fragile democracy such as Guinea-Bissau or Benin, triggered by recent electoral manipulation or deteriorating security. Alternatively, a surprise event in Latin America (e.g., a military intervention in a highly unstable country) breaks the regional pattern of coup avoidance, but this is much less likely.",
            "final_reasoning": "The base rate of successful coups across Africa and Latin America is about 1–2 per year in recent years, with most concentrated in the Sahel. The trend since 2020 shows heightened risk in Africa, especially in Mali, Burkina Faso, Niger, Guinea-Bissau, and Gabon, with several recent coup attempts and internal dissent. However, the short window (44 days) means the odds are still low in absolute terms—on the order of 1/6 to 1/8 per month in coup-prone countries, and lower elsewhere. While the presence of Russian/Africa Corps, ongoing jihadist threats, and manipulated elections increase risk, there is no reporting of imminent breakdowns or extraordinary instability in the next six weeks. Latin America, despite some turbulence, remains much more coup-resistant at this time. Taking all factors into account, I judge the probability of a successful coup in either region before January 1, 2026, at 18%. This is higher than a pure base rate due to heightened African instability, but not extreme given the short remaining window and relative consolidation of most current juntas.",
            "final_probability": 18
        },
        "AreaStudiesLatinAmerica (DemocraticBreakdownTheory)": {
            "time_to_resolution": "Approximately 1.5 months (until January 1, 2026)",
            "perspective_relevance": "As an Area Studies Latin America (Democratic Breakdown Theory) expert, I bring a comparative, base-rate, and process-oriented understanding of the conditions that produce coups, drawing on the historical prevalence and recent patterns of breakdowns in civilian rule in both regions. My expertise enables a nuanced assessment of risk factors—elite divisions, regime legitimacy, economic distress, external influences, and institutional robustness—grounded in both the historical record and current developments.",
            "status_quo": "Africa, especially the Sahel, has experienced a cluster of successful coups since 2020; Latin America, while less prone in recent decades, has seen recurrent attempts (Peru, Brazil, Bolivia), but no fully successful military takeovers. The short time window and post-coup consolidations suggest no new successful coup is the more likely default outcome.",
            "perspective_derived_factors": [
                {
                    "factor": "Recent Coup Clustering in Africa",
                    "effect": "Increases probability. The Sahel region in particular (Mali, Burkina Faso, Niger) has seen repeated successful coups since 2020, suggesting an elevated local base rate and possible diffusion effects."
                },
                {
                    "factor": "Elite Divisions and Regime Instability",
                    "effect": "Increases probability. News reports describe deepening splits within militaries and ruling coalitions in countries like Mali, Burkina Faso, and Niger. Nigeria recently experienced a failed coup attempt and high-level arrests, indicating volatility."
                },
                {
                    "factor": "External Influence and Mercenary Presence",
                    "effect": "Increases probability. The formalization of Wagner/Africa Corps in several Sahel countries, and Russia's direct involvement, heightens uncertainty and can both stabilize (regime protection) and destabilize (elite resentment, foreign meddling) regimes."
                },
                {
                    "factor": "Jihadist Insurgency and State Weakness",
                    "effect": "Increases probability. Mali and neighboring states face existential insurgent threats. Loss of territorial control and legitimacy can prompt hardline factions within regimes to attempt internal purges or counter-coups."
                },
                {
                    "factor": "Coup Fatigue and Consolidation",
                    "effect": "Decreases probability. Repeated coups can lead to heightened security, elite purges, and consolidation (as seen in Mali and Burkina Faso, both now led by military juntas intent on regime survival), making further coups harder in the immediate term."
                },
                {
                    "factor": "Short Time Window and Coup Planning Lag",
                    "effect": "Decreases probability. With only about six weeks left, the window for a successful coup (from planning to execution and consolidation) is tight, especially given stepped-up regime paranoia and surveillance."
                },
                {
                    "factor": "Latin American Exceptionalism",
                    "effect": "Decreases probability. Despite attempts, recent decades show a markedly decreased base rate of successful classical military coups in Latin America. Recent events (Bolivia, Brazil, Peru) failed to unseat executives or led to self-coups that stalled."
                }
            ],
            "no_scenario": "Despite ongoing instability, military regimes in Mali, Burkina Faso, and Niger maintain sufficient control—bolstered by Russian support and elite purges—to prevent internal overthrow. In Nigeria, the recent coup attempt is neutralized, with the regime tightening security. In Latin America, political crises remain intense (Peru, Bolivia, Brazil), but militaries refrain from direct seizure of power, and incumbents either step down or suppress challenges using legal/institutional means. No successful (as per the question definition) military or self-coup occurs before Jan 1, 2026.",
            "yes_scenario": "A faction within an already unstable military regime in Mali, Burkina Faso, or Niger exploits regime exhaustion, elite infighting, or a sudden crisis (e.g., collapse of Bamako, major military defeat, or popular unrest) to mount a successful coup, quickly consolidating control. Alternatively, a dramatic self-coup takes place in a country like Guinea-Bissau or in a fragile Latin American state, with the incumbent using the security forces to dissolve democratic institutions and retain power beyond legal means.",
            "final_reasoning": "The base rate of successful coups in Africa, especially in the Sahel, has sharply increased since 2020, with several cases in just the last two years. Elite fissures, state weakness, and external (especially Russian) involvement all heighten risks. However, recent successful juntas have responded to prior coup attempts by purging rivals and increasing security, which typically reduces the immediate risk of further coups in the short term. Multiple reports detail failed or preempted plots (e.g., Nigeria, Mali in 2024), showing both high intent and high regime vigilance. The time window—just over six weeks—further constrains the likelihood, as coups require significant planning and post-takeover consolidation. In Latin America, the base rate remains much lower, with recent attempts failing to fully oust sitting executives. While Guinea-Bissau and Benin show worrying trends in democratic backsliding, neither is currently showing the acute symptoms (military mobilization, mass unrest, or imminent executive overreach) typically preceding successful coups within such a short window. Therefore, while the risk is meaningfully elevated (especially in the Sahel), the combination of recent regime consolidation and the narrow time frame suggests the probability of a successful coup before January 1, 2026, is notably above the world average, but still less than even odds. I assess the probability at 28%.",
            "final_probability": 28
        }
    },
    "deliberation_probability": [
        18,
        18,
        34,
        18,
        12,
        26,
        28,
        20,
        33,
        13,
        18,
        18,
        28
    ],
    "deliberation_mean_probability": 21.846153846153847,
    "deliberation_sd": 7.174563329873044,
    "deliberation_probability_result": 22,
    "group_results": {
        "intelligenceanalysisIndicatorsandwarningsmethod": {
            "forecaster_to_engage": "SecurityStudies (CivilMilitaryRelations)",
            "response_type": "critique",
            "response": "While your probability of 34% effectively highlights the elevated coup risk in the Sahel due to structural instability, you appear to overweight recent base rates and structural factors without sufficiently discounting for the very short time window (6 weeks). Historically, even in periods of high coup clustering, successful coups rarely occur in such a narrow timeframe, especially following recent purges and coup-proofing after attempted or successful coups. Most regimes at highest risk have just undergone heightened security crackdowns, elite purges, and external support reinforcement, which temporarily reduce the likelihood of a successful plot. Your argument also notes the absence of clear, imminent warning signals, which should further temper the risk. Therefore, while acknowledging the instability, a probability in the mid-30s overstates the likelihood relative to both base rates per month and the observable indicators in the current window."
        },
        "intelligenceanalysisPoliticalriskassessment": {
            "forecaster_to_engage": "Political Science (CoupTrapTheory)",
            "response_type": "defense",
            "response": "Your estimate of 12% is a well-argued application of base rate thinking, especially regarding the distribution of coups within the year and the effect of post-coup consolidation. You correctly identify that most successful coups in high-risk regions are followed by periods of heightened vigilance, purges, and coup-proofing, which sharply reduce the window for subsequent regime change. The news supports your assessment: frequent coup attempts have been met with swift crackdowns and increased foreign backing, making short-term success less likely. While the risk is not negligible due to persistent elite fragmentation and structural fragility, your estimate appropriately discounts the probability for the short time frame and recent regime consolidation."
        },
        "securitystudiesCivilmilitaryrelations": {
            "forecaster_to_engage": "Sociology (EliteTheory)",
            "response_type": "critique",
            "response": "Your estimate of 33% robustly emphasizes the significance of ongoing elite discontent, intra-military fissures, and the destabilizing effects of foreign presence, all of which are valid from a civil-military relations perspective. However, your reasoning underplays the sharp effect of recent coup-proofing measures following failed and successful coup attempts in the Sahel. Historically, periods immediately after purges and elite crackdowns see a marked, though temporary, reduction in coup risk as regimes fortify themselves, particularly when backed by foreign military support. While elite instability is a persistent risk factor, the very short time window (six weeks) and absence of imminent warning indicators should lead to greater discounting. A probability in the low-to-mid 30s overstates the risk relative to both historical coup incidence per month and the observable security environment in late 2025."
        },
        "internationalrelationsRegionalsecuritycomplextheory": {
            "forecaster_to_engage": "Political Science (ComparativeAuthoritarianism)",
            "response_type": "defense",
            "response": "Your reasoning judiciously balances the elevated post-2020 coup base rate in the Sahel against the realities of post-coup consolidation and the short time horizon, while factoring in both structural instability and regime adaptation. You appropriately note that most successful coups are clustered earlier in the year or after longer periods of buildup, and that robust coup-proofing, foreign support, and recent purges diminish risk in the short term. Additionally, your skepticism about Latin America's risk and emphasis on the status quo bias are consistent with both historical data and the current news cycle. The resulting probability of 26% is well-calibrated: it is high enough to reflect the special circumstances in the Sahel, but not so high as to overstate the likelihood in a narrow 6-week window. This approach is compelling from a Regional Security Complex perspective, as it acknowledges both the contagious nature of instability and the dampening effect of regime learning and external patronage."
        },
        "politicalScienceCouptraptheory": {
            "forecaster_to_engage": "AreaStudiesAfrica (AfricanStateFragility)",
            "response_type": "defense",
            "response": "Your estimate of 13% closely aligns with the logic of CoupTrapTheory, weighing both the heightened regional fragility and the effect of recent coup-proofing measures. You correctly identify the clustering of coups in the Sahel and the ongoing pressure on juntas, but also recognize how fresh purges, foreign military support, and risk-averse elite behavior temporarily suppress immediate coup risk. By emphasizing the short time window and the historically low probability of a successful coup in any given 6-week period, you avoid the trap of simply annualizing the base rate. Your probability is appropriately nonzero—given persistent instability and latent intra-elite tensions—but remains status quo-favoring, reflecting both the structure of coup cycles and the specific dynamics of late 2025."
        },
        "politicalScienceComparativeauthoritarianism": {
            "forecaster_to_engage": "Political Science (PoliticalInstitutionalism)",
            "response_type": "defense",
            "response": "Your forecast of 28% is well-defended and demonstrates a nuanced appreciation for both the structural vulnerabilities and the temporal constraints of the current environment. You appropriately highlight the clustering of risk in the Sahel, the role of foreign support in coup-proofing, and the importance of recent purges and crackdowns in lowering immediate coup probability. Your reasoning effectively balances persistent elite fragility and external pressure with the strong status quo bias imposed by the short window. Additionally, you do not overstate the probability for Latin America, keeping the analysis grounded in regionally differentiated base rates. From a comparative authoritarianism perspective, your weighting of status quo persistence, time horizon, and regime adaptation is compelling and your probability is justifiably close to my own estimate."
        },
        "politicalSciencePoliticalinstitutionalism": {
            "forecaster_to_engage": "Sociology (SocialMovementTheory)",
            "response_type": "critique",
            "response": "Your estimate of 20% is thoughtful in emphasizing the importance of elite fragmentation, legitimacy crises, and shifting opportunity structures for coup risk, and you correctly incorporate the effects of regime consolidation and repression in reducing immediate threat. However, from a political institutionalist perspective, your assessment could give more weight to the powerful coup-proofing mechanisms currently in place—namely, the foreign military presence (especially Russian), heightened surveillance, and recent elite purges—which historically create a strong, albeit temporary, buffer against successful coups. In addition, you might further discount for the short time window: coups, even in unstable environments, are rare events in any given 6-week stretch. While your estimate is not unreasonable, giving slightly greater weight to institutional hardening and the temporality of post-coup environments would likely nudge the probability a bit lower."
        },
        "sociologySocialmovementtheory": {
            "forecaster_to_engage": "AreaStudiesAfrica (NeoPatrimonialism)",
            "response_type": "defense",
            "response": "Your probability estimate of 18% reflects an appropriate synthesis of the structural account of coup risk and the temporal realities of the current window. From a Social Movement Theory perspective, you correctly recognize that the short time frame and recent coup-proofing (purges, repression, and external support) reduce the likelihood of elite mobilization, even in highly unstable settings. Your argument also highlights the intuitive but critical point that while the 'atmosphere' in the Sahel is charged and coups can cluster, the majority of short periods—even in volatile contexts—pass without elite-led regime change. This aligns with the SMT understanding of mobilization: the opportunity structure is not only shaped by long-term grievances, but by acute shifts in elite incentives, which in this case are temporarily dampened by recent regime reactions. Your estimate avoids both complacency and alarmism, and is well-calibrated given the evidence."
        },
        "sociologyElitetheory": {
            "forecaster_to_engage": "AreaStudiesLatinAmerica (DemocraticBreakdownTheory)",
            "response_type": "defense",
            "response": "Your estimate of 28% is well supported from an Elite Theory perspective. You accurately recognize that the recent clustering of coups in the Sahel significantly elevates background risk, and you correctly identify the persistent structural vulnerabilities: elite fragmentation, state weakness, and the destabilizing influence of external actors. At the same time, you give appropriate weight to the dynamics of post-coup consolidation—namely, that juntas typically respond with purges and coup-proofing, creating a temporary buffer against further successful coups. Your reasoning also astutely discounts Latin America, where the base rate remains low and no acute warning signs are present. The news corroborates your argument: multiple failed coup attempts and fresh regime crackdowns point to both high intent and high regime vigilance. Your probability is status quo-favoring, but not naively so, and it fits well with both the historical base rate and the particular dynamics of late 2025. This synthesis is compelling from an elite-focused sociological lens, as it captures both opportunity and constraint for intra-elite regime change."
        },
        "areastudiesafricaAfricanstatefragility": {
            "forecaster_to_engage": "IntelligenceAnalysis (IndicatorsAndWarningsMethod)",
            "response_type": "defense",
            "response": "Your forecast of 18% demonstrates a disciplined approach to base rate thinking and an appropriate weighting of structural indicators, intelligence warnings, and temporal constraints. You are correct to emphasize that the base rate for coups in Africa has sharply increased, but that the probability for a successful coup in any given 6-week period remains moderate, even in high-risk contexts. Your reasoning also correctly interprets recent attempted coups as signals of both instability and active regime vigilance, which tends to dampen risk in the immediate aftermath. By integrating both warning signals and the limits imposed by the short time horizon, your estimate avoids both overreaction to recent events and complacency. This approach is well-calibrated and defensible from an African state fragility and intelligence analysis perspective."
        },
        "areastudiesafricaNeopatrimonialism": {
            "forecaster_to_engage": "AreaStudiesLatinAmerica (LatinAmericanMilitaryIntervention)",
            "response_type": "critique",
            "response": "Your estimate of 18% is reasonable in its synthesis of the African coup base rate and the very low risk in Latin America, and your logic for discounting Latin American coup likelihood is sound. However, from a NeoPatrimonialism perspective, your argument could be strengthened by more directly engaging with the distinctive coup-proofing mechanisms at play in the Sahel—namely, how intensified neo-patrimonial dynamics (elite purges, distribution of spoils, foreign security patronage) produce acute but often short-lived windows of regime hardening after both successful and failed coup attempts. While you note the short window and regime consolidation, you might further emphasize that the very features which make these states coup-prone (personalist rule, fragmented institutions) also enable swift and brutal repression of coup plots in the immediate post-crisis period, making a successful coup less likely in the weeks following a crackdown. Thus, while your probability is in line with my own, a more explicit weighting of the short-term dampening effect of neo-patrimonial consolidation would better justify the lower end of the risk spectrum."
        },
        "areastudieslatinamericaLatinamericanmilitaryintervention": {
            "forecaster_to_engage": "Political Science (ComparativeAuthoritarianism)",
            "response_type": "defense",
            "response": "Your reasoning clearly articulates the necessity of balancing recent coup clustering in the Sahel with the short time horizon and the surge in coup-proofing measures. You correctly identify that while background risk is elevated, the majority of short timeframes pass without a coup—even in the most coup-prone environments. I especially agree with your emphasis on the status quo bias and the importance of distinguishing between annualized and short-term probabilities. Your skepticism about Latin America's risk is well-founded, and your overall probability (26%) is justifiably higher than the pre-2020 norm yet not alarmist. This approach is especially compelling from the standpoint of Latin American military intervention studies, where the structural and institutional barriers to coups are robust and well-documented. Your forecast is a well-balanced, status quo-favoring assessment that reflects the realities of both regions."
        },
        "areastudieslatinamericaDemocraticbreakdowntheory": {
            "forecaster_to_engage": "Sociology (EliteTheory)",
            "response_type": "critique",
            "response": "Your estimate of 33% is driven by a strong focus on persistent elite instability, intra-military fissures, and the ambiguous effects of foreign actors. However, from a Democratic Breakdown Theory and Area Studies Latin America perspective, this probability appears too high given the importance of temporal dynamics and recent regime responses. The evidence from both regions—especially the Sahel—shows that immediately after major coup attempts or successful takeovers, regimes are highly vigilant and purge or neutralize potential rivals, often with the assistance of external actors like Russia. This period of 'coup-proofing' typically creates a short-term buffer during which coup risk drops sharply, even if underlying structural weaknesses persist. Furthermore, the six-week window is very short relative to the historic distribution of coups, and most such periods—even in unstable times—pass without a successful coup. While your analysis is correct to keep risk above pre-2020 levels, discounting more heavily for the immediate post-purge environment and the short time window would likely yield a probability closer to 20–28%, better matching both the base rates per month and the current cycle of regime consolidation."
        }
    },
    "revision_results": {
        "IntelligenceAnalysis (IndicatorsAndWarningsMethod)": {
            "my_phase1_final_probability": 18,
            "reasoning_for_revised_probability": "Group deliberation reinforced my assessment: most expert probabilities clustered between 12% and 28%, with only a few outliers (e.g., 33–34%). Critiques focused on the need to discount for the very short time window and recognize the effect of recent coup-proofing, purges, and external support. No new compelling evidence or sharply divergent reasoning emerged to justify either a substantial increase or decrease. The consensus view remains that, despite heightened coup risk in the Sahel and ongoing elite instability, the six-week window is a decisive limiting factor, and status quo bias should be strongly weighted. Therefore, I see no basis to revise my initial forecast.",
            "revised_probability": 18
        },
        "IntelligenceAnalysis (PoliticalRiskAssessment)": {
            "my_phase1_final_probability": 18,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, especially the critique of higher probability forecasts (e.g., 34%) and the defense of lower estimates (12%), I find my initial forecast of 18% remains well-calibrated. The consensus among experts is that, while the structural and historical risk in the Sahel is elevated, the extremely short time window (about six weeks), recent coup-proofing, purges, and foreign support for existing regimes collectively suppress the probability of a successful coup in this period. No new intelligence or compelling argument emerged during the group phase to justify moving significantly higher or lower. The modal forecast from other area and method experts also clusters at 18%, reinforcing that this is a balanced position given the evidence.",
            "revised_probability": 18
        },
        "SecurityStudies (CivilMilitaryRelations)": {
            "my_phase1_final_probability": 34,
            "reasoning_for_revised_probability": "Group deliberation highlighted that my initial estimate (34%) may have overweighted the impact of structural instability and recent base rates while insufficiently discounting for the short time window and the immediate effect of post-coup crackdowns, purges, and foreign-backed coup-proofing. Multiple forecasters, including those using indicators-and-warnings and political risk assessment methods, converged on probabilities in the mid-to-high teens, citing the sharp decline in coup probability during short windows following major repression and regime consolidation. While elite fragmentation and legitimacy crises remain real, the lack of imminent warning indicators and historical patterns show that most six-week windows, even in high-risk periods, do not see successful coups. Thus, I am revising my probability downward to better reflect these constraints, balancing the persistent elevated risk in the Sahel with the powerful short-term dampening effect of recent security measures and the short time horizon.",
            "revised_probability": 20
        },
        "InternationalRelations (RegionalSecurityComplexTheory)": {
            "my_phase1_final_probability": 18,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, the consensus among experts in political risk, intelligence analysis, and area studies remains tightly clustered between 12% and 28%, with most forecasters emphasizing the importance of the short time window and recent coup-proofing efforts by regimes in Africa's Sahel region. Critiques of higher probabilities (in the 30s) convincingly argue that the observable surge in security crackdowns, elite purges, and foreign backing sharply reduces short-term risk, even in otherwise high-risk environments. Defenses of lower estimates reinforce the need to weigh the time constraint and the status quo bias heavily. No new evidence or compelling argument emerged to suggest a significant upward or downward revision from my initial estimate. Thus, my initial assessment—anchored in the elevated regional base rate, persistent instability, but sharply discounted by the short window and regime consolidation—remains well-supported.",
            "revised_probability": 18
        },
        "Political Science (CoupTrapTheory)": {
            "my_phase1_final_probability": 12,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I find strong convergence among methodologically rigorous forecasters (IndicatorsAndWarnings, PoliticalRiskAssessment, RegionalSecurityComplex, NeoPatrimonialism, AfricanStateFragility) around probabilities in the 12-20% range, with most discounting sharply for the short window and recent regime consolidation. The higher estimates (in the 28-34% range) tend to overweight structural instability and underweight the coup-proofing, external security support, and immediate post-coup suppression effects, as well as the short timeframe. No new arguments or indicators have surfaced to suggest that the risk in the next 6 weeks is higher than initially estimated. If anything, the clustering of probabilities just above 10% among those most sensitive to time-window and consolidation effects reinforces my initial judgment. Therefore, I maintain my original estimate.",
            "revised_probability": 12
        },
        "Political Science (ComparativeAuthoritarianism)": {
            "my_phase1_final_probability": 26,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I note that the modal probability among forecasters clusters between 12% and 20%, with a few outliers in the low 30s. The most persuasive reasoning, both from PoliticalInstitutionalism and CoupTrapTheory, emphasizes that the short window (6 weeks), recent regime consolidation, and active coup-proofing should be weighted more heavily than I initially did. While my original estimate accounted for heightened Sahel risk and ongoing elite instability, the deliberation highlighted that recent purges and foreign support produce a more substantial, if temporary, dampening effect. Additionally, the absence of imminent warning indicators or acute triggers in either Africa or Latin America further justifies a reduction from my initial estimate. The group consensus and detailed defenses for lower probabilities suggest my prior was slightly high for this resolution window. Therefore, I am revising my forecast downward to 18%, aligning with the most rigorous base rate and status quo reasoning, while still acknowledging elevated risk relative to long-term averages.",
            "revised_probability": 18
        },
        "Political Science (PoliticalInstitutionalism)": {
            "my_phase1_final_probability": 28,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I note that most forecasters converge on a probability range between 12% and 34%, with a clear consensus that the short time window is the most important downward modifier. The strongest arguments for lowering the probability come from those emphasizing that even in periods of heightened instability, successful coups rarely cluster within a single 6-week period, especially immediately after waves of repression, elite purges, and foreign-backed coup-proofing. The higher estimates (30-34%) are well-argued in terms of ongoing structural fragility and elite disunity, but I am persuaded that the coup-proofing effect and the temporal constraint are slightly stronger than I initially weighted. Several defenses of lower forecasts (12-20%) make a compelling case for a somewhat more status quo-favoring baseline, especially given the lack of imminent warning signs. While I still see the risk as notably above long-term historic norms, I now believe my initial 28% slightly overstates the short-term risk. I will revise down to 22%, which more fully reflects the potent status quo bias imposed by the short window and the consolidation efforts of current regimes, while also capturing the persistent—but not dominant—risk of a sudden breakdown in the Sahel.",
            "revised_probability": 22
        },
        "Sociology (SocialMovementTheory)": {
            "my_phase1_final_probability": 20,
            "reasoning_for_revised_probability": "Upon reviewing the group deliberation, I note that the consensus among a broad range of experts (Intelligence, Political Science, Area Studies, and Sociology) is tightly clustered between 12% and 28%, with most forecasters landing between 13% and 20%. The main arguments for lowering the probability are the very short time window (about 6 weeks), the powerful coup-proofing mechanisms currently in place (purges, foreign military presence, increased surveillance), and historical data showing that even in highly unstable periods, successful coups are rare in such short intervals. While my initial estimate already heavily discounted for these factors, several persuasive critiques (notably from PoliticalInstitutionalism and others) suggest that my weighting of ongoing elite instability and opportunity structures may have slightly overstated the risk relative to the base rate for such a compressed period. However, evidence from group deliberation also supports that a non-negligible risk remains due to ongoing elite fissures and persistent instability in the Sahel. Given this, I will revise my probability modestly downward to better reflect the base rate for a 6-week window and the current regime hardening.",
            "revised_probability": 16
        },
        "Sociology (EliteTheory)": {
            "my_phase1_final_probability": 33,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, it is clear that my initial forecast (33%) is at the high end of the distribution, with most expert forecasters clustering between 12% and 28%. The central critique is that my estimate, while well-grounded in elite instability and structural vulnerability, underweights the strong coup-proofing that typically follows failed or recent coups, as well as the effect of the very short time window. Multiple forecasts, including those from CoupTrapTheory, PoliticalInstitutionalism, and ComparativeAuthoritarianism, convincingly argue that post-coup purges, surveillance, and foreign support create a powerful—if temporary—barrier to further elite action. The absence of clear imminent warning indicators and the status quo bias for a 6-week period are strong reasons to discount the risk further. Given this, I am revising my probability downward to better reflect these time-bound institutional and security effects, while still acknowledging persistent elite fissures and structural fragility.",
            "revised_probability": 25
        },
        "AreaStudiesAfrica (AfricanStateFragility)": {
            "my_phase1_final_probability": 13,
            "reasoning_for_revised_probability": "Reviewing the group deliberation, there is broad consensus among forecasters using a variety of disciplinary lenses that, despite an elevated background risk due to recent coup clustering and ongoing instability in the Sahel, the very short time window (6 weeks) and recent wave of coup-proofing, purges, and external support sharply reduce the immediate probability of a successful coup. Most credible estimates cluster between 12% and 20%, with only a few outliers in the 26-34% range—which tended to underweight the temporal and consolidation effects. The arguments for a higher probability do not present decisive new evidence of imminent regime breakdown, and the observable security environment remains consistent with the status quo. My initial estimate (13%) is at the lower end but within the consensus range and is well supported by both base rate logic and the latest intelligence indicators discussed in deliberation. Therefore, I see no compelling reason to revise my forecast.",
            "revised_probability": 13
        },
        "AreaStudiesAfrica (NeoPatrimonialism)": {
            "my_phase1_final_probability": 18,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, most expert forecasts cluster in the 12-28% range, with strong arguments for both the elevated background risk in the Sahel and the significant impact of recent coup-proofing, elite purges, and foreign support in suppressing short-term coup probability. Critiques of higher estimates (30%+) are persuasive in emphasizing the importance of the very short time window and the dampening effect of recent regime consolidation after attempted coups. Defenses of lower estimates (12-18%) further reinforce that, even in periods of high instability, the majority of 6-week windows—especially right after crackdowns—do not see successful coups. My own reasoning, rooted in NeoPatrimonialism, aligns with emphasizing the acute but transient hardening of regimes following attempted coups, which, combined with the short timeline, keeps the risk above historical lows but favors the status quo. The deliberation did not surface any overlooked imminent triggers or new warning indicators. Therefore, I see no compelling reason to change my original estimate.",
            "revised_probability": 18
        },
        "AreaStudiesLatinAmerica (LatinAmericanMilitaryIntervention)": {
            "my_phase1_final_probability": 18,
            "reasoning_for_revised_probability": "After reviewing both my initial forecast and the group deliberation, I see broad consensus among most forecasters (especially those using base rate and structural approaches) in the 12-20% range, with a few outliers in the high 20s to low 30s. Critiques of higher estimates effectively highlight the strong dampening effect of coup-proofing, purges, and foreign support in the immediate post-crisis period. Multiple defenses of mid-to-high teen probabilities emphasize that, although background risk is elevated in the Sahel, the combination of recent regime hardening and the very short time window heavily favors the status quo. No new indicators suggest imminent regime collapse or a breakdown large enough to outweigh these constraints. The small minority arguing for probabilities above 30% did not shift the consensus or provide new evidence compelling enough to warrant a substantial upward revision. Therefore, I see no reason to move from my original estimate, which is well supported by both the evidence and group deliberation.",
            "revised_probability": 18
        },
        "AreaStudiesLatinAmerica (DemocraticBreakdownTheory)": {
            "my_phase1_final_probability": 28,
            "reasoning_for_revised_probability": "Group deliberation revealed a clear consensus for a probability band between roughly 12%–28%, with most forecasters converging toward the lower end due to the short time window and recent, intensive coup-proofing following failed and successful attempts in the Sahel. Critiques of higher estimates highlighted the strong dampening effect of elite purges, foreign regime support, and immediate post-coup crackdowns, all of which sharply reduce coup risk in the short term even in highly unstable environments. Defenses of lower and moderate estimates persuasively emphasized both monthly base rates and the rarity of successful coups even during acute instability. While my initial estimate at 28% was at the upper end of the consensus, it is now clear that a small downward adjustment is warranted to better reflect the short window, regime consolidation, and the historical rarity of successful coups in such a brief period. Therefore, after weighing both the collective reasoning and my own perspective, I revise my probability downward to 22%.",
            "revised_probability": 22
        }
    },
    "revision_probability": [
        18,
        18,
        20,
        18,
        12,
        18,
        22,
        16,
        25,
        13,
        18,
        18,
        22
    ],
    "revision_mean_probability": 18.307692307692307,
    "revision_sd": 3.520999275409738,
    "revision_probability_result": 18,
    "question_details": {
        "id": 38793,
        "title": "Will there be a successful coup in Africa or Latin America before January 1, 2026?",
        "created_at": "2025-08-31T05:07:57.159527Z",
        "open_time": "2025-11-17T23:03:13Z",
        "cp_reveal_time": "2025-11-18T00:33:13Z",
        "spot_scoring_time": "2025-11-18T00:33:13Z",
        "scheduled_resolve_time": "2026-01-01T06:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-11-18T00:33:13Z",
        "actual_close_time": "2025-11-18T00:33:13Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "This question is synced with an identical question on Metaculus. The original question opened on 2025-08-21 12:00:00 and can be found [here](https://www.metaculus.com/questions/39292). This question will resolve to the same value as the synced question. The original question's background info at this time is below. \n\nAccording to [Powell & Thyne (2011, p. 252)](https://www.uky.edu/~clthyn2/powell-thyne-JPR-2011.pdf), a coup is \"illegal and overt attempts by the military or other elites within the state apparatus to unseat the sitting executive.\" In recent years, some of the coups in Africa have been:&#x20;\n\n* [Mali August 2020](https://en.wikipedia.org/wiki/2020_Malian_coup_d%27%C3%A9tat)\n* [Mali May 2021](https://en.wikipedia.org/wiki/2021_Malian_coup_d%27%C3%A9tat)\n* [Niger March 2021](https://en.wikipedia.org/wiki/2021_Nigerien_coup_attempt) (attempt)\n* [Niger July 2023](https://en.wikipedia.org/wiki/2023_Nigerien_coup_d%27%C3%A9tat)\n* [Gabon August 2023](https://en.wikipedia.org/wiki/2023_Gabonese_coup_d%27%C3%A9tat)\n* [Chad January 2025](https://en.wikipedia.org/wiki/2025_N%27Djamena_attack) (possible attempt)\n* [Burkina Faso January 2022](https://en.wikipedia.org/wiki/January_2022_Burkina_Faso_coup_d%27%C3%A9tat)\n* [Burkina Faso September 2022](https://en.wikipedia.org/wiki/September_2022_Burkina_Faso_coup_d%27%C3%A9tat)&#x20;\n* [Guinea September 2021](https://en.wikipedia.org/wiki/2021_Guinean_coup_d%27%C3%A9tat)\n\nLatin America has had the following coup attempts in recent years:\n\n* [Peru self-coup attempt](https://en.wikipedia.org/wiki/2022_Peruvian_self-coup_attempt), December 2022\n* [Brazil Congress attack](https://en.wikipedia.org/wiki/2023_Brazilian_Congress_attack), January 2023\n* [Bolivia coup attempt](https://en.wikipedia.org/wiki/2024_Bolivian_coup_attempt), June 2024\n\nSee also: [VoA by the numbers Coups in Africa](https://projects.voanews.com/african-coups/)\n\n`{\"format\":\"metac_closes_in_period\",\"info\":{\"post_id\":39292,\"question_id\":38638}}`",
        "resolution_criteria": "This question resolves as **Yes** if there is a successful coup d’état in any country on the African continent or Latin America after August 21, 2025 and before January 1, 2026, according to [credible](https://www.metaculus.com/faq/#definitions) media reports. If this does not occur, this question resolves as **No**.",
        "fine_print": "Latin America is defined as any country in North America or South America whose primary language is Spanish, Portuguese or French.\n\nA coup d’état (often shortened to \"coup\") is [defined](https://en.wikipedia.org/wiki/Coup_d'%C3%A9tat) as an event in which a state's military or other components of its power structure overthrow the existing political authority.&#x20;\n\nA \"successful\" coup is defined as a coup in which the group or person attempting to seize power establishes control over both the government and military, and will be considered to have succeeded once any significant resistance to their authority has ceased.&#x20;\n\nA self-coup, [defined](https://en.wikipedia.org/wiki/Self-coup) as a political leader, having come to power through legal means, remaining in power through illegal means, will count. This includes scenarios in which an incumbent leader refuses to relinquish power after an election.\n\nExternal support for a coup, such as is described [here](https://africacenter.org/spotlight/africas-coups-and-the-role-of-external-actors/), will count as long as the mercenaries or other external actors are acting in support of a perpetrator from within the state.\n\nCivil wars, mutinies, rebellions or popular uprisings will not count, nor will changes to a country's constitution that restrict a country's democratic norms.",
        "post_id": 39416,
        "aggregations": {
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Kremlin Allegedly Stations Troops in Six African Countries Amid Wagner Group Reorganization and Human Rights Allegations**\nAccording to Russian state media reports, Russian military personnel are stationed in six African countries: Mali, Burkina Faso, Niger, Equatorial Guinea, the Central African Republic, and Libya. These forces are part of the Russian 'Africa Corps,' subordinated to the Russian Ministry of Defense, with most soldiers having previously participated in the 'special military operation' in Ukraine. The presence includes military equipment such as aircraft, helicopters, and armored vehicles, along with Wagner Group flags. The Wagner Group, which was dissolved after the death of its leader Yevgeny Prigozhin in a mysterious plane crash in August 2023, has been reorganized into a formal military unit. The group has been accused of severe human rights violations in Mali, including the abduction, detention, torture, and killing of hundreds of civilians between 2022 and 2024. A May 2025 investigation by the journalist network Forbidden Stories, based on testimonies from Malian refugees in Mauritania, documented six locations where Wagner operatives held civilians, including former UN bases. Torture methods included waterboarding, beatings, and cigarette burns, with victims reporting similarities to abuses in Ukraine. The Wagner Group has also provided military training, political advisory services, and security for leaders in Mali, where a military junta led by General Assimi Goita has ruled since 2020 and shifted allegiance from France to Russia.\nOriginal language: de\nPublish date: November 17, 2025 08:07 PM\nSource:[N-tv](https://www.n-tv.de/politik/Kreml-soll-Truppen-in-sechs-afrikanischen-Laendern-stationiert-haben-id30033579.html)\n\n**Benin Revises Constitution to Extend Terms and Create Senate Amid Political Controversy**\nThe National Assembly of Benin adopted a comprehensive constitutional revision early Saturday morning after a long night of deliberation. The new text establishes a Senate and extends presidential, parliamentary, and mayoral terms from five to seven years. According to La Nation, this reform will take effect starting with the next general elections, meaning it does not apply to President Patrice Talon’s current term, which ends in May 2026. The presidential movement claims the revision aims to strengthen institutional stability, transparency, and democratic vitality. However, concerns persist: La Nouvelle Tribune notes that while the reform is framed as a move toward political calm and development, critics argue it may deepen political fractures and discourage opposition participation. The main opposition party, the Démocrates, was excluded from local and presidential elections due to insufficient endorsements, raising suspicions about the process. Aujourd'hui reports that Talon, stepping down after his second term, is reshaping the political landscape in favor of his chosen successor, Romuald Wadagni, who now faces no significant challenger. The Pays, a Burkinabé outlet, questions the timing of the reform, suggesting it is a politically calculated maneuver to entrench Talon’s system, neutralize weakened opposition, and shield the elite from judicial accountability. The extension of mandates to seven years is seen as reducing political pluralism and diminishing electoral frequency, effectively locking in the current power structure. The creation of a Senate, where members are appointed or automatically included—such as former presidents—is viewed as a strategic move to ensure lifelong political privilege. Ledjely from Guinea highlights that the reform, despite initial optimism over Talon’s pledge not to seek a third term, now appears to undermine democratic progress, especially given the exclusion of opposition figures and the continued detention of political prisoners like Reckya Madougou. The overall outcome suggests a democratic victory that may be more illusory than real.\nOriginal language: fr\nPublish date: November 17, 2025 07:36 AM\nSource:[RFI](https://www.rfi.fr/fr/podcasts/revue-de-presse-afrique/20251117-%C3%A0-la-une-le-b%C3%A9nin-r%C3%A9vise-sa-constitution)\n\n**Teams Already Eliminated from the 2026 World Cup Qualifications**\nAs of November 15, 2025, numerous national teams have been officially eliminated from the qualification process for the 2026 FIFA World Cup, which began in September 2023 and will conclude in March 2026. Eliminated teams from Asia include Mongolia, Maldives, Guam, Sri Lanka, Macao, Cambodia, Timor-Leste, Brunei, Bhutan, Laos, India, Afghanistan, Syria, Myanmar, Thailand, Singapore, Malaysia, China, Chinese Taipei (Taiwan), Turkmenistan, Hong Kong, Vietnam, Philippines, Tajikistan, Pakistan, Yemen, Nepal, Lebanon, Bangladesh, North Korea, Bahrain, Kyrgyzstan, Kuwait, Palestine, Indonesia, Oman, and others. In Africa, eliminated nations include Eritrea (which withdrew), Burkina Faso, Sierra Leone, Guinea-Bissau, Ethiopia, Djibouti, Sudan, Togo, Mauritania, South Sudan, Benin, Lesotho, Rwanda, Zimbabwe, Libya, Angola, Mauritius, Eswatini, Niger, Tanzania, Zambia, Congo, Gambia, Kenya, Burundi, Seychelles, Uganda, Mozambique, Guinea, Botswana, Somalia, Namibia, Liberia, Malawi, Equatorial Guinea, São Tomé and Príncipe, Madagascar, Mali, Comoros, Central African Republic, Chad, Gabon, Cameroon, and others. From Europe, teams eliminated include Luxembourg, Slovenia, Greece, Belarus, Azerbaijan, Georgia, Bulgaria, Hungary, Armenia, Finland, Lithuania, Malta, Cyprus, San Marino, Israel, Estonia, Moldova, Kazakhstan, Liechtenstein, Serbia, Latvia, Andorra, Montenegro, Gibraltar, and others, with some disqualified due to the war in Ukraine. In Oceania, eliminated teams are the Cook Islands, Samoa, American Samoa, Tonga, Solomon Islands, Papua New Guinea, Vanuatu, Samoa, Tahiti, Fiji, and others. In CONCACAF, eliminated nations include Turks and Caicos Islands, U.S. Virgin Islands, Cayman Islands, Antigua and Barbuda, Cuba, Grenada, Saint Christopher and Nevis, Bahamas, Aruba, Barbados, Saint Lucia, Guyana, Montserrat, Belize, Dominican Republic, Dominica, British Virgin Islands, Saint Vincent and the Grenadines, Anguilla, Puerto Rico, Guatemala, El Salvador, Trinidad and Tobago, Bermuda, Nicaragua, and others. In CONMEBOL, Chile, Peru, and Venezuela have been eliminated. The list is subject to change as the qualification rounds progress. The article was published on November 15, 2025, by Sopitas.com, and includes a call to support Mexico.\nOriginal language: es\nPublish date: November 15, 2025 09:47 PM\nSource:[sopitas.com](https://www.sopitas.com/deportes/selecciones-eliminadas-mundial-2026-eliminatorias-conmebol-europa-asia-africa-concacaf-oceania/)\n\n**Is Africa Coming Under Mysterious Attacks As Primate Ayodele Foretold?**\nThe article discusses rising political instability across Africa, citing recent military coups in Niger Republic and an attempted coup in Sierra Leone, as well as regional tensions involving the Economic Community of West African States (ECOWAS) and military juntas in Burkina Faso, Guinea Bissau, and Mali. It claims that ECOWAS ordered the Niger junta to restore democratic rule, prompting a warning from other West African military regimes that any forceful intervention would be viewed as war and provoke retaliation. The article frames the situation as a potential continental conflict, suggesting Africa is heading toward internal warfare. It references Primate Elijah Ayodele, a self-proclaimed prophet, who in January 2023 and February 2023 foretold a 'mysterious attack' on Africa, describing it as an unexplainable crisis, widespread insecurity, and a war between African nations. Ayodele also warned that the presence of foreign powers—such as China, Russia, the U.S., the UK, and Israel—could turn Africa into a geopolitical testing ground. The article concludes by posing the question: 'Will it be right to say Africa is coming under a mysterious attack as foretold by Primate Ayodele?' The claims are presented without independent verification, relying solely on the prophet’s statements and current geopolitical developments.\nOriginal language: en\nPublish date: August 02, 2023 09:18 AM\nSource:[topcelebrities.com.ng](https://topcelebrities.com.ng/is-africa-coming-under-mysterious-attacks-as-primate-ayodele-foretold/)\n\n**The Blogs: Mali: Al-Qaeda's Next Fallen State**\nAl-Qaeda has not been defeated but has repositioned itself from Afghanistan to Africa, with Mali on the brink of becoming the terror network's most significant resurgence in a generation. According to the article, after France's withdrawal in 2022 and the UN's departure in 2023, Al-Qaeda's local affiliate, Jama'at Nusrat al-Islam wal-Muslimin (JNIM), systematically filled the power vacuum in Mali, dismantling state authority, enforcing sharia, taxing populations, and encircling the capital Bamako by 2025. This marks Mali as the third country in a generation to fall under Islamist rule, following Afghanistan under the Taliban and Syria under HTS. The article frames this not as a sudden collapse but as a methodical construction of a jihadist proto-state. Al-Qaeda has reconstituted a pan-African insurgent network across Burkina Faso, Niger, Nigeria, Somalia, Mozambique, Libya, Algeria, Sudan, and Chad, creating a transcontinental ecosystem stronger than its Middle East presence. The U.S. drone campaign has constrained but not eliminated Al-Qaeda’s Yemeni branch (AQAP), which could gain a sanctuary if Mali falls. A jihadist-controlled Mali would collapse Africa’s security architecture, enable a contiguous jihadist corridor from Mauritania to Somalia, and destabilize North Africa, threatening Israel’s intelligence and counterterrorism alliances. It would also empower Iran’s proxies, trigger a new migration wave into Europe, and erase the West’s strategic foothold in the Sahel. The article concludes that Mali’s fall would mark the beginning of a new jihadist era, not in Kabul or Raqqa, but in Africa’s overlooked expanses where Al-Qaeda has quietly prepared its most dangerous resurrection. The piece cites 'The Times of Israel' as the source and was published on November 17, 2025.\nOriginal language: en\nPublish date: November 17, 2025 10:01 PM\nSource:[The Times of Israel](https://blogs.timesofisrael.com/mali-al-qaedas-next-fallen-state/)\n\n**Kremlin Allegedly Stations Troops in Six African Countries Amid Wagner Group Reorganization and Human Rights Allegations**\nAccording to Russian state media reports, Russian military personnel are stationed in six African countries: Mali, Burkina Faso, Niger, Equatorial Guinea, the Central African Republic, and Libya. These forces are part of the Russian 'Africa Corps,' subordinated to the Russian Ministry of Defense, with most soldiers having previously participated in the 'special military operation' in Ukraine. The presence includes military equipment such as aircraft, helicopters, and armored vehicles, along with Wagner Group flags. The Wagner Group, which was dissolved after the death of its leader Yevgeny Prigozhin in a mysterious plane crash in August 2023, has been reorganized into a formal military unit. The group has been accused of severe human rights violations in Mali, including the abduction, detention, torture, and killing of hundreds of civilians between 2022 and 2024. A May 2025 investigation by the journalist network Forbidden Stories, based on testimonies from Malian refugees in Mauritania, documented six locations where Wagner operatives held civilians, including former UN bases. Torture methods included waterboarding, beatings, and cigarette burns, with victims reporting similarities to abuses in Ukraine. The Wagner Group has also provided military training, political advisory services, and security for leaders in Mali, where a military junta led by General Assimi Goita has ruled since 2020 and shifted allegiance from France to Russia.\nOriginal language: de\nPublish date: November 17, 2025 08:07 PM\nSource:[N-tv](https://www.n-tv.de/politik/Kreml-soll-Truppen-in-sechs-afrikanischen-Laendern-stationiert-haben-id30033579.html)\n\n**Russian Military Active in Six African Countries, State TV Reports**\nAccording to a report by Russia's state television, the Russian military is active in six African countries, marking a rare official acknowledgment of Moscow's military presence on the continent. This expansion comes amid Western isolation following Russia's full-scale invasion of Ukraine, prompting Moscow to strengthen its political, economic, and military ties with African nations in recent years. A state TV correspondent reported on Sunday that Russian military officers and soldiers are operating in six African countries, though the specific nations were not named except for Mali. Reports indicate the deployment of additional Russian troops or military trainers in Burkina Faso, Niger, Equatorial Guinea, the Central African Republic, and Libya. The African Corps, a unit linked to Russia's Ministry of Defense, has taken over the roles previously held by the Wagner Group, a private military company, across Africa, according to diplomatic sources in the Sahel region. The Wagner Group was dismantled and restructured after the mysterious plane crash that killed its leader, Yevgeny Prigozhin, in August 2023, following a brief rebellion against Moscow. Wagner forces had previously fought in Ukraine and were deployed across Africa. The state TV report confirmed the African Corps is under Russia's Ministry of Defense and stated that most deployed personnel are 'veterans of the special military operation'—Russia’s term for the war in Ukraine. Footage from the report showed a flag resembling Wagner’s skull emblem at a base in Mali, as well as Russian Su-25 aircraft conducting airstrikes and heavy Russian military equipment, including helicopters and armored personnel carriers. Moscow claims its forces are helping African governments combat extremist insurgencies.\nOriginal language: ar\nPublish date: November 17, 2025 03:33 PM\nSource:[صحيفة الشرق الأوسط](https://aawsat.com/node/5209797)\n\n**Azhar Observatory: Rise in Terrorist Activity in West Africa During October 2025, but with Decline in Civilian Casualties and Kidnappings**\nThe Azhar Observatory reported a rise in terrorist activities in West Africa during October 2025, with 4 attacks in Nigeria, 1 in Niger, and none in Senegal or Benin. Despite the increase in operations, civilian casualties dropped significantly from 141 in September to 74 in October—a 52.5% decrease—and kidnappings fell from 45 to 5, a reduction of nearly 89%. Injuries totaled 35 in October, compared to zero in September, indicating a shift from large-scale massacres to limited or targeted attacks. Nigeria remained the epicenter, with Boko Haram and ISWAP (Islamic State West Africa Province) continuing to operate, though with reduced casualties. Niger recorded only one attack with no fatalities, signaling improved border security following intensified joint operations with Nigeria and Chad. Senegal and Benin reported no terrorist activity, reflecting continued relative stability in the Gulf of Guinea region. The October data marked a strategic shift from September’s pattern of killing 100 terrorists without arrests, toward more precise operations combining on-the-ground neutralization and intelligence-led arrests. The increase in military operations, neutralization rates, and arrests reflects improved security coordination among Sahel countries and Nigeria, particularly through the West African Sahel Group. The Azhar Observatory emphasized the need to strengthen early warning systems, border surveillance, intelligence sharing, regional cooperation, and rehabilitation programs to combat radicalization, especially in northern Nigeria and eastern Burkina Faso.\nOriginal language: ar\nPublish date: November 17, 2025 12:30 PM\nSource:[cairo24.com](https://www.cairo24.com/2319396)\n\n**Benin Revises Constitution to Extend Terms and Create Senate Amid Political Controversy**\nThe National Assembly of Benin adopted a comprehensive constitutional revision early Saturday morning after a long night of deliberation. The new text establishes a Senate and extends presidential, parliamentary, and mayoral terms from five to seven years. According to La Nation, this reform will take effect starting with the next general elections, meaning it does not apply to President Patrice Talon’s current term, which ends in May 2026. The presidential movement claims the revision aims to strengthen institutional stability, transparency, and democratic vitality. However, concerns persist: La Nouvelle Tribune notes that while the reform is framed as a move toward political calm and development, critics argue it may deepen political fractures and discourage opposition participation. The main opposition party, the Démocrates, was excluded from local and presidential elections due to insufficient endorsements, raising suspicions about the process. Aujourd'hui reports that Talon, stepping down after his second term, is reshaping the political landscape in favor of his chosen successor, Romuald Wadagni, who now faces no significant challenger. The Pays, a Burkinabé outlet, questions the timing of the reform, suggesting it is a politically calculated maneuver to entrench Talon’s system, neutralize weakened opposition, and shield the elite from judicial accountability. The extension of mandates to seven years is seen as reducing political pluralism and diminishing electoral frequency, effectively locking in the current power structure. The creation of a Senate, where members are appointed or automatically included—such as former presidents—is viewed as a strategic move to ensure lifelong political privilege. Ledjely from Guinea highlights that the reform, despite initial optimism over Talon’s pledge not to seek a third term, now appears to undermine democratic progress, especially given the exclusion of opposition figures and the continued detention of political prisoners like Reckya Madougou. The overall outcome suggests a democratic victory that may be more illusory than real.\nOriginal language: fr\nPublish date: November 17, 2025 07:36 AM\nSource:[RFI](https://www.rfi.fr/fr/podcasts/revue-de-presse-afrique/20251117-%C3%A0-la-une-le-b%C3%A9nin-r%C3%A9vise-sa-constitution)\n\n**Guinea-Bissau’s presidential poll failed credibility test**\nGuinea-Bissau’s upcoming presidential election on 23 November 2025 has failed a credibility test, according to social scientists analyzing the country’s deepening democratic erosion. The article highlights a regional crisis across Africa, citing fraudulent elections in Cameroon (where 92-year-old Paul Biya won 53.7% amid widespread allegations of fraud), Tanzania (where President Samia Suluhu Hassan claimed 98% of votes in a poll met with unprecedented protests and a crackdown), and Côte d’Ivoire (where President Alassane Ouattara secured a fourth term with nearly 90% of the vote, despite a constitutional two-term limit). These outcomes have fueled public cynicism and weakened democratic norms. In Guinea-Bissau, President Umar Sissoco Embalo has undermined electoral legitimacy through repeated constitutional manipulations: he assumed office in February 2020 despite a pending legal challenge, dissolved parliament in May 2022 and again in December 2023, and delayed legislative elections until late 2024 due to alleged logistical issues. The supreme court, after its chief judge fled citing death threats, declined to rule on the 2020 dispute, leading to Ecowas recognition of Embalo’s government. Embalo initially pledged not to seek re-election but reversed course in March 2025. A mediation team from Ecowas withdrew after threats of expulsion. Most critically, the PAIGC—the country’s oldest and most influential party—was barred from the presidential race after its candidate, Domingos Simoes Pereira, was rejected by the supreme court for late document submission, marking the first time in history the party has been excluded from a presidential election. Guinea-Bissau’s Electoral Democracy Index from V-Dem has declined sharply, even surpassing drops seen after past coups and assassinations. The article argues that Embalo’s tactics—removing viable opponents, manipulating timelines, using the security sector coercively, and weakening judicial independence—mirror regional patterns of hollowing out elections without abolishing them. The 2025 election risks reversing decades of fragile democratic progress, illustrating how performative elections can entrench power while eroding accountability.\nOriginal language: en\nPublish date: November 17, 2025 12:00 AM\nSource:[newsdrum.in](https://www.newsdrum.in/international/guinea-bissaus-presidential-poll-failed-credibility-test-10781223)\n\n**Teams Already Eliminated from the 2026 World Cup Qualifications**\nAs of November 15, 2025, numerous national teams have been officially eliminated from the qualification process for the 2026 FIFA World Cup, which began in September 2023 and will conclude in March 2026. Eliminated teams from Asia include Mongolia, Maldives, Guam, Sri Lanka, Macao, Cambodia, Timor-Leste, Brunei, Bhutan, Laos, India, Afghanistan, Syria, Myanmar, Thailand, Singapore, Malaysia, China, Chinese Taipei (Taiwan), Turkmenistan, Hong Kong, Vietnam, Philippines, Tajikistan, Pakistan, Yemen, Nepal, Lebanon, Bangladesh, North Korea, Bahrain, Kyrgyzstan, Kuwait, Palestine, Indonesia, Oman, and others. In Africa, eliminated nations include Eritrea (which withdrew), Burkina Faso, Sierra Leone, Guinea-Bissau, Ethiopia, Djibouti, Sudan, Togo, Mauritania, South Sudan, Benin, Lesotho, Rwanda, Zimbabwe, Libya, Angola, Mauritius, Eswatini, Niger, Tanzania, Zambia, Congo, Gambia, Kenya, Burundi, Seychelles, Uganda, Mozambique, Guinea, Botswana, Somalia, Namibia, Liberia, Malawi, Equatorial Guinea, São Tomé and Príncipe, Madagascar, Mali, Comoros, Central African Republic, Chad, Gabon, Cameroon, and others. From Europe, teams eliminated include Luxembourg, Slovenia, Greece, Belarus, Azerbaijan, Georgia, Bulgaria, Hungary, Armenia, Finland, Lithuania, Malta, Cyprus, San Marino, Israel, Estonia, Moldova, Kazakhstan, Liechtenstein, Serbia, Latvia, Andorra, Montenegro, Gibraltar, and others, with some disqualified due to the war in Ukraine. In Oceania, eliminated teams are the Cook Islands, Samoa, American Samoa, Tonga, Solomon Islands, Papua New Guinea, Vanuatu, Samoa, Tahiti, Fiji, and others. In CONCACAF, eliminated nations include Turks and Caicos Islands, U.S. Virgin Islands, Cayman Islands, Antigua and Barbuda, Cuba, Grenada, Saint Christopher and Nevis, Bahamas, Aruba, Barbados, Saint Lucia, Guyana, Montserrat, Belize, Dominican Republic, Dominica, British Virgin Islands, Saint Vincent and the Grenadines, Anguilla, Puerto Rico, Guatemala, El Salvador, Trinidad and Tobago, Bermuda, Nicaragua, and others. In CONMEBOL, Chile, Peru, and Venezuela have been eliminated. The list is subject to change as the qualification rounds progress. The article was published on November 15, 2025, by Sopitas.com, and includes a call to support Mexico.\nOriginal language: es\nPublish date: November 15, 2025 09:47 PM\nSource:[sopitas.com](https://www.sopitas.com/deportes/selecciones-eliminadas-mundial-2026-eliminatorias-conmebol-europa-asia-africa-concacaf-oceania/)\n\n**BAMEX 2025 Opens in Bamako: Strong Turkish and Moroccan Participation Debunks Rumors of Siege on Malian Capital**\nThe BAMEX 2025 International Defense and Security Exhibition opened in Bamako, Mali, from November 12 to November 14, 2025, countering widespread rumors of a siege on the capital by terrorist groups such as Jama’at Nasr al-Islam wal Muslimin (JNIM). The event, hosted at the Alioune Blondin Beye Peacekeeping School, aimed to strengthen security and military cooperation in the Sahel region and promote new defense sector partnerships. Prominent Turkish companies including Baykar, Aselsan, Roketsan, and Otokar participated, showcasing advanced technologies such as drones and radar systems, underscoring Ankara’s growing defense influence in Africa through agreements with Mali and other Sahel Alliance (AES) members. The exhibition also attracted participation from the Democratic Republic of Congo, Niger, Burkina Faso, and Russia, which reaffirmed its support for Mali in counterterrorism efforts. Social media and activists highlighted the event as a 'slap' to Algerian and French media narratives predicting Bamako’s collapse, emphasizing that the successful organization of the exhibition proves the capital’s stability and strategic attractiveness for military investment. The 'Akıncı' drone displayed at the exhibition was noted as part of the Turkish-Malian defense agreement and had recently been shot down during operations. BAMEX 2025 is seen as a unique platform for enhancing African security sovereignty and fostering regional cooperation amid growing competition between Turkey, Russia, and China in the African arms market.\nOriginal language: en\nPublish date: November 12, 2025 08:50 PM\nSource:[fesnews.media](https://fesnews.media/313294/2025/11/12/)\n\n**Amid West Africa’s Coups, Faith Leaders Emerge As Pillars Of Stability**\nOver the past decade, more than a dozen military coups have destabilized West Africa and the Sahel, including in Mali (2020), Guinea (2021), Burkina Faso (2022), Niger (2023), and Gabon (2023), with attempted coups in Sierra Leone and Guinea-Bissau. Amid this political chaos, religious leaders—such as Cardinal Philippe Ouédraogo of Burkina Faso, Imam Mahmoud Dicko of Mali, and Islamic leaders in Niger—have emerged as key stabilizing figures. They have consistently advocated for dialogue, restraint, and national unity, using their moral authority to de-escalate tensions and prevent violence. In Burkina Faso, Ouédraogo urged a national conversation after two coups in 2022, while in Mali, Dicko played a dual role as both a protest voice and a mediator during the 2020 uprising. In Niger, Islamic leaders framed resistance to foreign military intervention as a moral defense of sovereignty. In Guinea and Gabon, clergy called for accountability and peace after military takeovers. Though not universally trusted—some are criticized for silence or proximity to power—their influence persists where formal institutions have failed. Their sermons and homilies often carry more public resonance than government statements. Despite challenges, including ongoing jihadist violence displacing millions in Burkina Faso and Mali, faith leaders remain among the last civic anchors in fragile states. Their role may diminish if military regimes consolidate power, but in transitional moments, they could still shape the region’s future governance. The article was published on November 10, 2025, by Religion Unplugged, authored by Joseph Maina, a Kenyan journalist with a BA in journalism and media studies from the University of Nairobi.\nOriginal language: en\nPublish date: November 10, 2025 11:00 AM\nSource:[Religion Unplugged](https://religionunplugged.com/news/west-africas-coups-faith-leaders-emerge-as-pillars-of-stability)\n\n**Nigeria's 2025 Coup Scare: Everything You Need to Know by Anjolaoluwa Ogunpitan**\nOn October 24, 2025, Nigerian President Bola Ahmed Tinubu reshuffled the National Service Chiefs, a move widely perceived as linked to a failed coup attempt by senior military officers. Over forty military personnel, including a brigadier general, a colonel, and several majors, were detained by the Defence Intelligence Agency (DIA) following raids in late October 2025, with the Abuja residence of former Bayelsa State Governor Timipre Sylva raided on October 29, 2025. His brother was arrested during the operation. Sylva, reportedly abroad for a medical check-up in the UK and a conference in Malaysia, is alleged to have fled Nigeria via the creeks to Senegal and then to Argentina, where he is said to have business interests. Investigators reportedly traced ₦46 billion to an account linked to him, funds suspected of financing the coup plot—though these claims remain unconfirmed by the government. While the Defence Headquarters (DHQ) described the operation as a 'routine internal disciplinary investigation,' credible reports from Premium Times and PRNigeria indicate a broader conspiracy involving mid- to senior-level officers planning to neutralize key political figures, including the vice president, Senate president, and speaker of the House of Representatives. This incident follows a regional trend of military coups in West Africa, including in Mali (2020, 2021), Guinea (2021), Burkina Faso (2022), Niger (2023), and Gabon (2023). Nigeria’s history includes multiple coups since independence in 1960, such as the 1966 counter-coup, the 1983 coup that ousted Shehu Shagari, and the 1985 coup that brought Ibrahim Babangida to power. The article argues that the alleged coup reflects deeper institutional issues: low military morale, inadequate welfare, political interference, and growing distrust. It warns that the real threat to democracy lies not in overt military force but in systemic neglect and public despair. The author urges President Tinubu to treat the incident not merely as a criminal matter but as a warning to rebuild trust, improve transparency, and restore military morale—essential acts for national preservation. The piece concludes that democracy must be actively sustained through justice, inclusion, and accountability, especially as West Africa faces democratic decline.\nOriginal language: en\nPublish date: November 01, 2025 07:15 AM\nSource:[Medium.com](https://medium.com/@johnogunpitan17/nigerias-2025-coup-scare-everything-you-need-to-know-by-anjolaoluwa-ogunpitan-3cdcba69c2ba)\n\n**The Jihadist Conundrum in the Sahel**\nThe article analyzes the escalating jihadist insurgency in the Sahel region, particularly in Mali, following the French withdrawal in July 2022 after the Malian military coup led by President Assimi Goita. Since then, Russian Wagner Group and the Africa Corps have replaced French forces, but their military support—though including hardware, training, and access to mineral resources like gold, lithium, and uranium—has failed to contain the rise of Islamist insurgents, particularly Jama'at Nasrat al-Islam wal-Muslimin (JNIM), an Al-Qaeda-linked group. Insurgent attacks surged from 1,900 in 2019 to over 5,500 in 2024, with 3,800 attacks recorded by October 10, 2025, resulting in 76,900 deaths since 2019, 56% of which occurred in Mali and Burkina Faso. The Malian junta’s propaganda of military success has been exposed as a facade, with major attacks on military outposts and increasing control loss in rural areas. The junta’s human rights violations and reliance on foreign military contractors have undermined legitimacy. A new tactic by JNIM in August 2025—targeting fuel imports from Côte d'Ivoire, Senegal, Mauritania, and Guinea—has caused a severe fuel crisis in Bamako, closing schools and universities. Foreign companies, including seven Chinese and three Indian nationals, were kidnapped in July 2025, highlighting the fragility of the economy. The U.S. Embassy has issued an 'immediate departure' advisory due to deteriorating security. The article warns that without urgent counter-insurgency reforms—including professional chain-of-command, village protection, local cooperation, internal purges of corrupt officers, and regional coordination with ECOWAS—the fall of Bamako is imminent. The risk of a state collapse similar to ISIS in Iraq or the Taliban in Afghanistan looms, threatening regional stability across Burkina Faso and Niger. The author concludes that sustainable solutions require national coordination within the Malian military, with foreign support limited to training, intelligence, and airpower, not boots on the ground.\nOriginal language: en\nPublish date: October 30, 2025 06:45 PM\nSource:[Medium.com](https://medium.com/@ahsankenway/the-jihadist-conundrum-in-the-sahel-1d5c5b2b3b17)\n\n**Overthrowing government: Full list of African countries that fell to military rule after coup plot**\nSince August 2020, seven African countries have experienced military takeovers following coup plots, disrupting civilian governments. On 26 July 2023, Niger's military removed President Mohamed Bazoum, installing General Abdourahamane Tiani as leader; ECOWAS responded with plans to deploy a regional force to restore constitutional order, while the junta proposed a maximum three-year transition. Burkina Faso saw two coups in less than a year: President Roch Marc Christian Kaboré was ousted on 24 January 2022, replaced by Lieutenant-Colonel Paul-Henri Sandaogo Damiba, who was himself overthrown on 30 September by Captain Ibrahim Traoré, who now leads a transitional government with elections scheduled for July 2024. Sudan’s democratic transition collapsed on 25 October 2021 when General Abdel Fattah al-Burhane removed civilian leaders; since 15 April 2023, a deadly conflict between Burhane and his former deputy Mohamed Hamdane Daglo has caused at least 5,000 deaths. Guinea’s President Alpha Condé was overthrown on 5 September 2021, with Colonel Mamady Doumbouya assuming power on 1 October, pledging to return to civilian rule by the end of 2024. Mali’s President Ibrahim Boubacar Keïta was ousted on 18 August 2020, leading to a transitional government; on 24 May 2021, the military arrested both the president and prime minister, and Colonel Assimi Goïta became transitional president in June, with elections planned for February 2024. Madagascar was listed among affected countries, but details of a successful military takeover remain unclear. Nigeria, though not listed as having a recent coup, has a history of military rule since independence in 1960; researchers note that the military’s economic policies in the 1980s led to 45% of foreign-exchange earnings being used for debt servicing, resulting in minimal growth, widespread poverty, and long-term instability. The article was published on 20 October 2025.\nOriginal language: en\nPublish date: October 20, 2025 09:20 AM\nSource:[Legit.ng - Nigeria news.](https://www.legit.ng/politics/1679401-full-list-african-countries-fell-military-rule-coup-plot/)\n\n**Niger, Mali and Burkina Faso Announce Exit from the International Criminal Court**\nNiger, Mali and Burkina Faso have announced that they will withdraw from the International Criminal Court (ICC), describing the court as a \"neocolonial instrument of oppression\".  According to the joint statement released by the three military‑governed states, the ICC has proven \"incapable of investigating and prosecuting proven war crimes, crimes against humanity, genocide and aggression\".  The leaders of the three countries, which have close ties to Russia, also said they intend to establish \"local mechanisms for strengthening peace and justice\".  They criticised the ICC for the fact that, out of the 33 cases opened since its founding, all but one involved African states.  The withdrawal will take effect one year after the countries submit a notice to the UN Secretary‑General.  The three West African states, which came to power through coups between 2020 and 2023, joined forces in 2023 to form the Sahel Alliance, later renamed the Confederation of Sahel Countries, and cooperate with the Russian Federation.  Their armies have been accused of committing war crimes against civilians during operations against jihadist groups linked to Al‑Qaeda and the Islamic State.  In March 2023 the ICC issued an arrest warrant for Russian President Vladimir Putin on charges of war crimes, including the illegal deportation of Ukrainian children and the forced relocation of Ukrainians to Russia.  The Ukrainian Foreign Ministry recently condemned the \"illegal visit\" of the ambassadors of Burkina Faso, Mali and Niger to the Russian‑occupied Autonomous Republic of Crimea.\nOriginal language: uk\nPublish date: September 23, 2025 09:28 AM\nSource:[УКРІНФОРМ](https://www.ukrinform.ua/rubric-world/4039447-niger-mali-ta-burkinafaso-ogolosili-pro-vihid-iz-miznarodnogo-kriminalnogo-sudu.html)\n\n**Africa: Francophone Press Review of September 1, 2025**\nThe press review for September 1, 2025 covers a range of African news items. It reports that the African Development Bank (BAD) inaugurated a new president, 'Sidi Ould Tah', who was elected on 29 May with 76.18 % of the vote and becomes the first Mauritanian to hold the post. In Gabon, lieutenant Kelly Ondo‑Obiang was released from the central prison in Libreville after seven years of detention; his release follows an amnesty ordinance issued on 12 August 2025 that pardons all participants in the January 2019 and August 2023 coup attempts. Cameroon’s military court in Yaoundé held a hearing on 1 September concerning the death of radio host Martinez Zogo, who was abducted on 17 January 2023 and found dead five days later. South Africa’s Comic‑Con Africa concluded its sixth edition in Johannesburg, drawing tens of thousands of fans for a four‑day festival of comics, anime, video games and cosplay. In Côte d’Ivoire, a political meeting in Yamoussoukro sold more than 10 000 tickets, marking a first for the country’s political gatherings. Morocco celebrated a historic third CHAN title after a 3‑2 win over Madagascar; striker Oussama Lamlaoui scored twice, including a 40‑meter goal, and finished as the tournament’s top scorer with six goals. Benin’s Romuald Wadagni has been named the presidential candidate for the 2026 election, potentially triggering a cabinet reshuffle. Togo announced a strengthened university partnership with India, aiming to expand scholarship opportunities for students. Mali’s transition, five years after the 18 August 2020 coup, is described as a period of challenge and renewal, with the country regaining sovereignty over nearly 70 % of its territory. Senegal’s sports minister Khady Diène Gaye set a dual objective for new coach Pape Thiaw: qualify the national team for the 2026 World Cup and win the 2025 Africa Cup of Nations in Morocco.\nOriginal language: fr\nPublish date: September 01, 2025 09:39 AM\nSource:[allAfrica.fr](https://fr.allafrica.com/stories/202509010140.html)\n\n**Mali and Burkina Faso Boycott African Defence Summit in Nigeria**\nMali and Burkina Faso, both part of the newly formed Alliance des États du Sahel (AES), withdrew from the African Chiefs of Defence Summit in Abuja, Nigeria, in January, following their exit from the West African Economic and Monetary Union (Cedeao). Only Niger, represented by Colonel Soumana Kalkoye, the defence attaché at the Nigerien embassy in Abuja, attended the summit. The conference, which ran until 27 August, brought senior officers from most African states to 'discuter de stratégies collectives' and to 'trouver des solutions locales aux besoins de l'Afrique en matière de défense', according to the summit programme. Nigerian Chief of Staff Christopher Musa highlighted that security challenges 'ne connaissent pas de frontières' and called for 'une nouvelle architecture de coopération en matière de sécurité, dirigée par l'Afrique', adding that 'La véritable sécurité ne s'obtient pas dans l'isolement'. Relations between Niger and Nigeria had deteriorated after the 2023 coup in Niamey, when the Cedeao imposed sanctions on Niger and threatened a military intervention to restore President Mohamed Bazoum. The tensions eased in 2024 when the two countries signed a security memorandum, but Niger’s withdrawal from the regional military force has hampered cross‑border operations against jihadists around Lake Chad. The juntas in Niger, Mali and Burkina Faso have seen their military cooperation with neighbours such as Benin, which is trying to repel Sahel armed groups, deteriorate.\nOriginal language: fr\nPublish date: August 26, 2025 08:25 AM\nSource:[JeuneAfrique.com](https://www.jeuneafrique.com/1716916/politique/le-mali-et-le-burkina-faso-boycottent-le-sommet-africain-sur-la-defense-organise-au-nigeria/)\n\n**Sahel Crisis: Why Military Regimes in Mali, Niger and Burkina Faso May Fail**\nThe article reports that the military governments in Mali, Burkina Faso and Niger are losing popular support as security deteriorates and the economy falters.  Since the coups in 2020–2021, the armed forces have failed to improve the fragile security situation; instead, Islamist insurgents and other rebels have taken control of more territory.  Within the armies, disagreements over strategy and the transition to a democratic government have surfaced, according to political analyst Beverly Ochieng of Control Risks.  In Mali, a failed coup in August 2024 led to the arrest of dozens of soldiers, including two prominent generals and a French officer accused of mobilising civilians for the French intelligence service; the French foreign ministry dismissed the allegations as \"completely unfounded\".  Ochieng notes that the coup attempt shows the regime’s attempt to pre‑empt internal dissent.  Since the 2021 coup, Mali’s junta has ended the UN mission, expelled France and brought in Russian paramilitaries, while repeatedly facing accusations of serious human‑rights violations from the UN and NGOs.  In August 2024, a protest in the village of Diafarabé over alleged mass killings by the army prompted the dismissal of the local governor, who was later arrested on charges of \"destabilising the state\".  Economic hardship, new taxes and the dissolution of political parties have sparked further protests, which were violently suppressed.  The three countries left ECOWAS in 2023 and formed the Sahel Alliance (AES), which lacks access to a port and relies on neighbouring coastal states, contributing to rising prices and frequent power outages.  In Burkina Faso, the young president Ibrahim Traoré faces criticism within the army because of his low rank and the potential expansion of Islamist influence; in Niger, mutinies have been reported after military defeats against Islamist militias.  Ochieng warns that a future coup in any of the three states is more likely to prolong the status quo than to accelerate a return to democracy, as each new junta will focus on consolidating its own power.\nOriginal language: de\nPublish date: August 23, 2025 03:30 AM\nSource:[Neue Zürcher Zeitung](https://www.nzz.ch/international/militaerregierungen-im-sahel-unter-druck-risse-in-armee-und-bevoelkerung-ld.1898767)\n\n**Africa: Review of Francophone Africa News - July 28, 2025**\nThe Democratic Republic of Congo (DRC) has been hit by an attack on a Catholic church in the north-east of the country by the rebel group ADF, affiliated with the Islamic State. The attack has resulted in at least 43 deaths, according to a new UN report. The ADF has killed thousands of civilians and committed numerous crimes in the north-east of the DRC despite the deployment of the Ugandan army (UPDF) alongside the Congolese armed forces (FARDC). In Cameroon, the rejection of Maurice Kamto's presidential candidacy has sparked controversy. Although his candidacy was not authenticated, audio recordings that have gone viral on the internet suggest that there was a plot to exclude him from the presidential election. In the Central African Republic, President Faustin-Archange Touadéra has announced his candidacy for a third term in the presidential election in December 2025. He is relying on the new constitution adopted in 2023 to extend his rule. In the US, Washington has suspended the issuance of visas to Niger. The reasons for this decision are not specified, but the suspension will remain in place until Washington resolves its 'concerns with the government of Niger'. In Madagascar, the country has failed to make it to the top 50 of the Africa's Business Heroes (ABH) 2025 competition for the first time since 2021. The competition, initiated by Alibaba Philanthropy, has seen a record number of 32,000 applications from 54 African countries. In Mali, former Prime Minister Choguel Maïga is under investigation for the misuse of public funds. In Côte d'Ivoire, a king has warned of the country's political situation ahead of the presidential election in October. In Abidjan, the capital of Côte d'Ivoire, the 27th edition of the Afrobasket women's basketball tournament is taking place, featuring 12 national teams. In Burkina Faso, a Burkinabé activist has died in prison in Abidjan. In the Sudan, the Rapid Support Forces (RSF) have announced the creation of a parallel government in the areas under their control, with Mohamed Hassan Al-Ta'ayshi as the head of the 'government of peace and unity'.\nOriginal language: fr\nPublish date: July 28, 2025 09:30 AM\nSource:[allAfrica.fr](https://fr.allafrica.com/stories/202507280137.html)\n\n**Is Africa Coming Under Mysterious Attacks As Primate Ayodele Foretold?**\nThe article discusses rising political instability across Africa, citing recent military coups in Niger Republic and an attempted coup in Sierra Leone, as well as regional tensions involving the Economic Community of West African States (ECOWAS) and military juntas in Burkina Faso, Guinea Bissau, and Mali. It claims that ECOWAS ordered the Niger junta to restore democratic rule, prompting a warning from other West African military regimes that any forceful intervention would be viewed as war and provoke retaliation. The article frames the situation as a potential continental conflict, suggesting Africa is heading toward internal warfare. It references Primate Elijah Ayodele, a self-proclaimed prophet, who in January 2023 and February 2023 foretold a 'mysterious attack' on Africa, describing it as an unexplainable crisis, widespread insecurity, and a war between African nations. Ayodele also warned that the presence of foreign powers—such as China, Russia, the U.S., the UK, and Israel—could turn Africa into a geopolitical testing ground. The article concludes by posing the question: 'Will it be right to say Africa is coming under a mysterious attack as foretold by Primate Ayodele?' The claims are presented without independent verification, relying solely on the prophet’s statements and current geopolitical developments.\nOriginal language: en\nPublish date: August 02, 2023 09:18 AM\nSource:[topcelebrities.com.ng](https://topcelebrities.com.ng/is-africa-coming-under-mysterious-attacks-as-primate-ayodele-foretold/)\n\n**Niger adds to growing list of countries in the Sahel run by the military**\nThe Associated Press reports that mutinous soldiers in Niger overthrew President Mohamed Bazoum’s democratically elected government, adding Niger to a growing list of military regimes in West Africa’s Sahel. The coup follows a pattern in which soldiers accuse civilian leaders of failing to deliver democratic dividends, promising a new government that is delayed in practice.  Karim Manuel, a West‑and‑Central Africa analyst for the Economist Intelligence Unit, warned that such military takeovers \"increase political instability going forward and make the situation on the ground much more volatile and unpredictable,\" thereby undermining regional stability.  The Sahel region—comprising Senegal, Gambia, Mauritania, Guinea, Mali, Burkina Faso, Niger, Chad, Cameroon and Nigeria—now hosts several military regimes: Mali (2020 coup, 2024 constitution referendum), Burkina Faso (2022 coup, July 2024 election goal), Sudan (2021 coup, ongoing civil conflict), and Chad (2021 coup, 18‑month transition extended).  The article also notes that over 90% of Guineans support a referendum that could allow the junta leader to run for president.  The piece was updated on July 28, 2023 at 21:24 (UTC).\nOriginal language: en\nPublish date: July 28, 2023 09:24 PM\nSource:[apnews.com](https://apnews.com/article/niger-coups-bazoum-sahel-military-democracy-d1614b14baff6571b7d3766c2cbd8ba1)\n\n",
    "date": "2025-11-18T01:11:03.921315",
    "summary": "The panel of forecasting experts broadly agrees that the risk of a successful coup in Africa or Latin America before January 1, 2026, is non-negligible but remains below a 50% threshold, primarily due to the short time window (~6 weeks) and recent developments in both regions. Most experts converge on a probability range between 12% and 34%, with the modal estimate clustering at 18%.\n\nKey shared factors increasing the probability include:\n- The recent high base rate of coups in Africa, especially in the Sahel (Mali, Burkina Faso, Niger), where regime fragility, elite fragmentation, and jihadist insurgencies persist.\n- Ongoing elite discontent and multiple recent, though unsuccessful or foiled, coup attempts (notably in Nigeria and Mali), which suggest ongoing instability beneath the surface.\n- External actors, such as Russia's Africa Corps, which simultaneously bolster current juntas but can create new elite rivalries or resentment.\n- Evidence of eroding regime legitimacy, manipulated elections, and economic crises as further risk factors, particularly in West Africa and Guinea-Bissau.\n\nFactors decreasing probability are:\n- Consolidation and coup-proofing by current military juntas in the Sahel, who have instituted purges, heightened surveillance, and received external (notably Russian and Turkish) military support, making new coups harder in the immediate term.\n- A very short forecast window, which statistically reduces the odds, as coups are rare and require time to coordinate and execute.\n- In Latin America, a much lower base rate for successful coups post-1990s, with civil-military norms, institutional buffers, and recent attempted coups in Bolivia, Peru, and Brazil all failing to unseat incumbents.\n\nScenarios for a 'yes' outcome focus on internal splits within Sahelian military regimes, opportunistic moves by dissatisfied factions amid security or economic crises, or a surprise self-coup in a fragile democracy (like Guinea-Bissau or Benin). The 'no' scenario is more likely, involving ongoing repression, purges, and foreign support deterring or preventing successful coup plotting, combined with relative stability in Latin America.\n\nFinal probabilities across experts are as follows: 12%, 13%, 18% (multiple experts), 20%, 26%, 28% (multiple experts), 33%, and 34%. The consensus centers around 18–20% (“moderate, non-trivial, but still less likely than not”), with slightly higher estimates given by those emphasizing ongoing elite fragmentation and state fragility in the Sahel, and lower estimates by those focusing on recent consolidation and the short time window.",
    "forecasters": [
        "IntelligenceAnalysis (IndicatorsAndWarningsMethod)",
        "IntelligenceAnalysis (PoliticalRiskAssessment)",
        "SecurityStudies (CivilMilitaryRelations)",
        "InternationalRelations (RegionalSecurityComplexTheory)",
        "Political Science (CoupTrapTheory)",
        "Political Science (ComparativeAuthoritarianism)",
        "Political Science (PoliticalInstitutionalism)",
        "Sociology (SocialMovementTheory)",
        "Sociology (EliteTheory)",
        "AreaStudiesAfrica (AfricanStateFragility)",
        "AreaStudiesAfrica (NeoPatrimonialism)",
        "AreaStudiesLatinAmerica (LatinAmericanMilitaryIntervention)",
        "AreaStudiesLatinAmerica (DemocraticBreakdownTheory)"
    ]
}