{
    "deliberation_results": {
        "Employment Relations (ILO Conventions)": {
            "time_to_resolution": "Approximately 3 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in Employment Relations, particularly with experience in ILO conventions and comparative labor law, I can assess the implications of major labor reforms, the typical pace and resistance to such changes, and the institutional, political, and societal factors that affect the likelihood of Brazil implementing a significant ban on the 6x1 schedule within a tight timeframe. My background allows me to contextualize the push for work schedule reforms with reference to global trends, base rates of legislative labor reforms, and the specific constraints of Brazil’s legislative process.",
            "status_quo": "The 6x1 work schedule (six days work, one day rest) is currently legal and prevalent in Brazil for CLT workers. There is growing social and political debate about its abolition, but no law banning it has yet passed.",
            "perspective_derived_factors": [
                {
                    "factor": "Legislative Hurdles and Political Resistance",
                    "effect": "Strongly decreases probability. Multiple news sources and surveys indicate that about 70% of federal deputies oppose the measure. Constitutional amendments require a high threshold for approval, and even ordinary legislation faces significant resistance from business interests and conservative deputies. Legislative inertia and the challenges of coalition-building for major labor reforms are well-documented obstacles in Brazilian politics."
                },
                {
                    "factor": "Executive and Labor Ministry Support",
                    "effect": "Slightly increases probability. President Lula and the Labor Minister have expressed public support for ending the 6x1 schedule and reducing working hours, encouraging mobilization. However, their support has not translated into rapid congressional action and is contingent on ‘street pressure’."
                },
                {
                    "factor": "Popular Mobilization and Social Pressure",
                    "effect": "Slightly increases probability. There is evidence of increasing public mobilization (plebiscites, protests, union events) and historical precedent of ‘ronco das ruas’ (roar of the streets) influencing legislative decisions. However, the most recent analogous event (the archiving of the PEC da Blindagem) was facilitated by nearly unanimous elite consensus, which does not exist for labor reform."
                },
                {
                    "factor": "Global and Regional Labor Trends",
                    "effect": "Slightly increases probability. There is a growing international trend toward shorter workweeks and more worker-friendly labor reforms, which may provide rhetorical momentum but is unlikely to override substantial domestic resistance in the short term."
                },
                {
                    "factor": "Time Constraints and Legislative Calendar",
                    "effect": "Strongly decreases probability. With only about three months left in the year and the holiday recess approaching, there is extremely limited time for a complex reform to progress through committees and floor votes in both chambers—especially given recent statements that the proposal is moving slowly and faces significant opposition."
                },
                {
                    "factor": "Alternative Legislative Vehicles (Bill vs. Constitutional Amendment)",
                    "effect": "Slightly increases probability. There is an ongoing discussion about whether a simple bill (PL) could suffice, which, if consensus emerged, could theoretically pass more quickly. However, no such consensus or urgent executive action is apparent, and ordinary bills still require political agreement."
                },
                {
                    "factor": "Business Community and Economic Arguments",
                    "effect": "Decreases probability. Persistent lobbying from business groups and arguments about cost, competitiveness, and productivity are cited as major reasons for past failures to advance similar reforms. In Brazil, such pressure often stalls or moderates labor reforms."
                }
            ],
            "no_scenario": "Despite growing social mobilization and support from the executive branch, the proposal to ban the 6x1 schedule remains stalled in congressional committees or is voted down due to strong opposition from the majority of deputies, business lobbying, and lack of time to build a legislative consensus before the 2025 holiday recess. No ban is enacted before January 1, 2026, and the 6x1 schedule remains legal for most CLT occupations.",
            "yes_scenario": "A surge in popular mobilization—perhaps from a highly successful plebiscite or mass protests—creates an urgent political crisis that compels congressional leaders to fast-track either a constitutional amendment or a regular law banning the 6x1 schedule. Unexpectedly, opposition softens or fractures, possibly due to high-profile negotiations or concessions to business interests, and the legislation passes both chambers and is enacted before January 1, 2026.",
            "final_reasoning": "Base rates for major labor reforms—especially those that reduce working hours or ban traditional shift patterns—suggest they are rare, incremental, and slow, particularly in middle-income economies with strong employer lobbies and coalition-based politics. While there is a visible increase in public debate and mobilization, the overwhelming evidence from news articles and recent surveys is that the legislative branch (especially the Chamber of Deputies) remains firmly opposed, with 70% of deputies against the ban. The Labor Minister and President are supportive, but both have stressed that only extraordinary mass mobilization could overcome congressional inertia, and no such groundswell is evident at this time. The legislative calendar is another critical constraint: with less than 100 days to go and a major holiday recess approaching, the window for passing complex labor reform is extremely narrow. Finally, most bills and amendments remain in committee stages, and resistance from business and parliamentary leaders persists. The status quo is thus strongly favored, and only an extraordinary, historically rare event (mass uprising, political crisis) could produce a Yes outcome within the timeframe. I estimate the probability at 8%.",
            "final_probability": 8
        },
        "Employment Relations (Industrial Relations Systems)": {
            "time_to_resolution": "About 3 months (until 1 January 2026, current date 28 September 2025)",
            "perspective_relevance": "As an expert in Employment Relations (Industrial Relations Systems), I bring insight into the legislative process around labor law reform, the balance of power between labor unions, employers, and the state, and the historical pace and likelihood of major labor reforms in Brazil and comparable economies. This expertise enables a nuanced assessment of political, institutional, and social factors that affect the probability of a legal ban on 6x1 schedules within the given timeframe.",
            "status_quo": "The 6x1 work schedule (six days working, one off) remains legal for most CLT occupations in Brazil, embedded in the Consolidação das Leis do Trabalho (CLT). There is strong inertia in the system, with only incremental changes to workweek legislation over past decades.",
            "perspective_derived_factors": [
                {
                    "factor": "Legislative Process Complexity and Timing",
                    "effect": "Decreases probability. Constitutional amendments (PECs) require supermajorities and multiple rounds of approval in both legislative houses. Even lower-threshold bills face committee bottlenecks and strong business resistance. With just three months left, the legislative calendar and procedural hurdles make rapid passage extremely unlikely."
                },
                {
                    "factor": "Political Support and Opposition",
                    "effect": "Decreases probability. Despite the support of left-wing parties, President Lula, and the Minister of Labor, there is clear evidence (e.g., Quaest survey) that 70% of deputies currently oppose ending 6x1. Business lobbies and centrist/conservative parties remain firmly against, fearing increased costs and competitiveness losses."
                },
                {
                    "factor": "Popular Mobilization and Union Pressure",
                    "effect": "Increases probability slightly. There is historic precedent for street mobilization influencing Congress (e.g., burial of PEC da Blindagem), and strong union engagement with successful signature/plebiscite campaigns. However, this pressure has not yet reached the scale or urgency seen in prior successful movements, and time is running short."
                },
                {
                    "factor": "International and Comparative Labor Trends",
                    "effect": "Slightly increases probability. Global trends and the success of four-day week pilots provide some legitimacy and momentum to the movement, but legislative processes in Brazil are slower than in more flexible labor markets."
                },
                {
                    "factor": "Status Quo Bias and Path Dependence",
                    "effect": "Strongly decreases probability. Major labor reforms in Brazil typically move slowly, often requiring years of negotiation and gradual implementation (e.g., 2017 labor reform). Path dependence and institutional inertia remain strong."
                },
                {
                    "factor": "Alternative Legislative Vehicles (Bills vs. PEC)",
                    "effect": "Slightly increases probability. There is a push to use ordinary legislation (bills) rather than the more difficult PEC route, which could theoretically lower the threshold for passage. But even bills have not advanced due to opposition in the legislature."
                }
            ],
            "no_scenario": "Despite union mobilization, plebiscite results, and government support, the National Congress fails to pass either a constitutional amendment or regular bill banning 6x1 before 1 January 2026. The proposal continues to face procedural delays, committee bottlenecks, and lacks the necessary majority due to strong business and centrist/conservative opposition. The proposal may advance in 2026 or later, but not within the specified timeframe.",
            "yes_scenario": "A major upsurge in mass mobilization and street protests in October 2025, combined with overwhelming plebiscite results and a shift in public opinion, forces the legislature to prioritize and expedite a bill (not a PEC) banning 6x1. Political calculus shifts dramatically in response to popular pressure, and the government pushes an emergency procedure. The bill passes both houses and is enacted before 1 January 2026.",
            "final_reasoning": "The base rate for major labor law reforms passing in Brazil within a three-month window—especially those facing strong business and legislative resistance—is extremely low. While there is unprecedented mobilization, union support, and government advocacy, the structural obstacles remain formidable: 70% of deputies are still opposed, and the legislative process for both PECs and bills is slow and subject to procedural delays. The plebiscite and past examples of street pressure influencing Congress (the burial of the PEC da Blindagem) do increase the odds slightly, but there is no evidence yet of the seismic shift needed for passage within three months. The most likely scenario is that the debate continues into 2026 and beyond, with incremental rather than radical change. Given all these factors, the probability that Brazil will ban the 6x1 work schedule for most CLT occupations before 1 January 2026 is very low.",
            "final_probability": 7
        },
        "Legislative Affairs (Brazilian Legislative Process)": {
            "time_to_resolution": "Approximately 3 months (until 1 January 2026)",
            "perspective_relevance": "As an expert in the Brazilian legislative process, I understand the procedural intricacies, political alignments, and institutional inertia that govern the passage of major labor reforms. My background allows me to assess the likelihood of rapid constitutional or statutory changes, the impact of public mobilization, and the weight of executive support versus congressional resistance.",
            "status_quo": "The 6x1 work schedule remains legal for most CLT workers, with several legislative proposals to ban it stalled or moving slowly through Congress.",
            "perspective_derived_factors": [
                {
                    "factor": "Congressional Resistance",
                    "effect": "Strongly decreases probability. Multiple sources, including a Quaest survey, indicate roughly 70% of deputies currently oppose ending 6x1, signaling major institutional inertia against rapid change."
                },
                {
                    "factor": "Popular Mobilization",
                    "effect": "Modestly increases probability. Recent history, such as the defeat of the 'PEC da Blindagem,' shows that mass street protests can move Congress when the issue reaches a large-scale, cross-party constituency. However, the current plebiscite on 6x1 has limited reach (tens of thousands of votes rather than millions) and is led by leftist/social movements rather than broad-based coalitions."
                },
                {
                    "factor": "Executive Support",
                    "effect": "Marginally increases probability. President Lula and the Minister of Labor are vocally in favor, but both stress that only heavy external pressure will move Congress. The executive alone cannot push this through without a groundswell."
                },
                {
                    "factor": "Legislative Calendar and Procedural Complexity",
                    "effect": "Strongly decreases probability. With only three months left and a packed end-of-year agenda, passing a constitutional amendment (PEC) or even a regular bill faces high procedural hurdles: committee analysis, public hearings, reports, votes in both chambers, and potential judicial challenges."
                },
                {
                    "factor": "Economic and Business Lobby Resistance",
                    "effect": "Moderately decreases probability. Business groups and a significant number of deputies from pro-business parties argue that banning 6x1 would raise costs and harm competitiveness, especially for SMEs. This entrenched opposition is echoed in legislative debates and media."
                },
                {
                    "factor": "Historical Base Rate for Major Labor Reforms",
                    "effect": "Decreases probability. Major labor reforms in Brazil (e.g., 2017 reform) typically require years of debate and broad consensus, not swift action within months, especially against active business and centrist resistance."
                },
                {
                    "factor": "Multiple Legislative Pathways (PEC vs. Regular Bill)",
                    "effect": "Marginally increases probability. The recent PT bill argues that a statutory change (not a PEC) could suffice, which theoretically lowers the threshold, but in practice the same political obstacles persist and there is little sign of urgency in the Chamber."
                }
            ],
            "no_scenario": "Despite mounting public debate and executive advocacy, the proposal to ban 6x1 remains bogged down in committee, with insufficient votes for passage. Business lobbies and centrist deputies stall or water down the proposal, and the legislative calendar runs out before any bill or PEC can clear both chambers and be signed into law. The 6x1 schedule remains legal for most CLT workers as of 1 January 2026.",
            "yes_scenario": "A dramatic surge in public protests occurs in October/November 2025—similar in scale to the 'Diretas Já' or the anti-PEC da Blindagem mobilization—forcing centrist and swing deputies to support a last-minute bill or constitutional amendment. Congress expedites the legislative process, and a law banning the 6x1 schedule for most CLT workers is enacted and comes into force before the deadline.",
            "final_reasoning": "The base rate for sweeping labor reforms in Brazil is low, especially under time pressure and against strong congressional and business opposition. While the executive is supportive and there is some popular mobilization, the legislative process is slow, and the majority in Congress is currently opposed. The public plebiscite, while symbolically important, has not yet reached a magnitude that historically moves recalcitrant legislatures. The procedural hurdles for a PEC, and even for a statutory bill, are formidable given the timeline. Recent history (e.g., the archiving of the 'PEC da Blindagem' due to massive protests) shows that Congress can move rapidly, but only when faced with overwhelming, broad-based public pressure—something not currently in evidence for the 6x1 issue. In sum, barring an unforeseen and extraordinary surge in public mobilization or a sudden shift in congressional sentiment, the status quo is highly likely to persist through 1 January 2026.",
            "final_probability": 8
        },
        "Labor Law (Comparative Labor Law)": {
            "time_to_resolution": "Approximately 3 months until 1 January 2026.",
            "perspective_relevance": "As an expert in Comparative Labor Law, I can assess the likelihood of legislative labor reforms based on Brazil's legal system, political traditions, historical labor reforms, and the comparative experience of similar measures in other jurisdictions. I can evaluate both the legal procedure (ordinary law vs. constitutional amendment), the political feasibility, and the socio-economic context of labor law reform.",
            "status_quo": "The 6x1 work schedule (six days on, one off) is allowed for most CLT workers in Brazil. Several legislative proposals to change this have been introduced, but none have advanced significantly in Congress.",
            "perspective_derived_factors": [
                {
                    "factor": "Legislative Hurdles (PEC vs. Ordinary Law)",
                    "effect": "Decreases probability. Constitutional amendments (PECs) in Brazil require a 3/5 majority in both houses and three readings, a very high bar. Ordinary laws could suffice, but current initiatives are PECs, which are harder to pass, and even bills face strong resistance."
                },
                {
                    "factor": "Parliamentary Opposition",
                    "effect": "Decreases probability. Multiple sources and a recent Quaest survey indicate that about 70% of federal deputies currently oppose banning the 6x1 schedule. This is a significant structural barrier."
                },
                {
                    "factor": "Government and Union Mobilization",
                    "effect": "Increases probability modestly. The Lula government, the Labor Minister, major unions, and left-wing parties support the reform and are attempting to mobilize public opinion and street protests, which historically have sometimes swayed Congress (e.g., recent burial of the 'PEC da Blindagem')."
                },
                {
                    "factor": "Public Support and Plebiscite",
                    "effect": "Increases probability slightly. Polls show majority public support (57-64%), and a plebiscite is being used to pressure Congress, but turnout is low (10,000 votes in Alagoas) and plebiscites are non-binding."
                },
                {
                    "factor": "Business and Economic Concerns",
                    "effect": "Decreases probability. Business associations and many parliamentarians argue that banning 6x1 would harm competitiveness, increase costs, and damage the economy. This aligns with Brazil's history of slow and cautious labor reform, and strong employer influence in Congress."
                },
                {
                    "factor": "Timing and Political Calendar",
                    "effect": "Decreases probability. The deadline is 3 months away, during which Congress typically has a slow end-of-year calendar. Major reforms are rarely passed quickly unless there is a crisis or overwhelming consensus."
                },
                {
                    "factor": "Comparative and Historical Precedent",
                    "effect": "Decreases probability. Brazil has not enacted major labor reforms this rapidly in recent decades. Most comparative jurisdictions (e.g., Portugal, Germany) moved to shorter workweeks very gradually and with broad tripartite consensus."
                }
            ],
            "no_scenario": "Despite ongoing public mobilization and government advocacy, the PEC or any bill to ban 6x1 fails to obtain the necessary votes in Congress due to entrenched opposition from a majority of deputies, business lobbying, and concerns about economic impact. The issue remains under debate or is shelved until after the 2026 elections.",
            "yes_scenario": "Sustained mass mobilizations and a highly successful plebiscite trigger a wave of public and political pressure, leading to a last-minute compromise bill or urgent executive-sponsored legislation that passes, banning the 6x1 schedule for most CLT workers, possibly with a few carveouts but meeting the resolution criteria.",
            "final_reasoning": "The legislative base rate for major labor reforms in Brazil is low, especially for measures opposed by a large parliamentary majority and business interests. Although there is visible mobilization and high public support, this has not yet translated into the parliamentary votes needed, and the Labor Minister himself admits the reform faces 'great difficulty' in Congress. The timing (three months), the constitutional amendment route, and the lack of an imminent crisis or overwhelming consensus all weigh against rapid passage. While the burial of the 'PEC da Blindagem' demonstrates that public pressure can move Congress, that case involved broad elite and street consensus, while here the business lobby is strongly opposed and opposition among deputies is entrenched. The most plausible path to a Yes is an urgent ordinary law pushed by the government as a compromise, but current efforts are still focused on a PEC. Therefore, while not impossible, the probability that Brazil will ban the 6x1 schedule for most CLT workers before 1 January 2026 is low.",
            "final_probability": 8
        },
        "Labor Law (Brazilian Labor Code CLT)": {
            "time_to_resolution": "Approximately 3 months and 4 days until January 1, 2026.",
            "perspective_relevance": "As an expert in Brazilian Labor Law (CLT), I am equipped to analyze how legislative changes to the 6x1 work schedule would be drafted, debated, and implemented within the CLT framework. I understand the procedural hurdles for both ordinary legislation and constitutional amendments, typical timelines for labor reforms, the influence of union pressure and business lobbies, and the historical inertia of major labor law changes in Brazil.",
            "status_quo": "The 6x1 work schedule (six days of work, one day off) is currently permitted under CLT for most formal (CLT) workers, and has been standard for decades. Multiple legislative proposals to ban or reduce it have been introduced but none has passed either house of Congress.",
            "perspective_derived_factors": [
                {
                    "factor": "Legislative resistance in Congress",
                    "effect": "Strongly decreases probability. Recent surveys and statements from the Minister of Labor indicate that about 70% of federal deputies oppose abolishing the 6x1 schedule. Major labor reforms in Brazil tend to face slow, multi-year processes, especially when business groups lobby against them."
                },
                {
                    "factor": "Popular mobilization and plebiscite",
                    "effect": "Moderately increases probability. Recent street protests, union events, and the plebiscite closing at the end of October 2025 show significant civil society engagement. However, such pressure has only rarely led to rapid passage of ambitious labor reforms without strong legislative alignment."
                },
                {
                    "factor": "Executive branch support",
                    "effect": "Slightly increases probability. President Lula and the Minister of Labor have both expressed support for ending 6x1, but both acknowledge that Congressional action is essential and difficult to obtain without overwhelming pressure."
                },
                {
                    "factor": "Procedural and timing constraints",
                    "effect": "Strongly decreases probability. There are just over three months until the resolution deadline. Constitutional amendments require three-fifths (308 of 513) of the Chamber and Senate approval in two rounds each, a process that even under optimal conditions often takes several months. No text has yet passed committee or gone to plenary vote."
                },
                {
                    "factor": "Alternative legislative paths (ordinary law vs PEC)",
                    "effect": "Slightly increases probability. There is discussion of pursuing an ordinary law route (which requires a simple majority), but even so, current proposals have not advanced beyond committee, and business opposition remains strong."
                },
                {
                    "factor": "Business and economic concerns",
                    "effect": "Moderately decreases probability. Business groups and centrist deputies argue that ending 6x1 would increase labor costs, especially in commerce and agriculture, and risk harming the economy. Their resistance is a major barrier to rapid legislative change."
                },
                {
                    "factor": "Base rate of major CLT reforms",
                    "effect": "Strongly decreases probability. Major changes to Brazil's labor laws (such as 2017's reform) tend to be infrequent, slow, and require broad coalition-building. Abrupt changes are rare."
                }
            ],
            "no_scenario": "Despite strong street mobilization, the plebiscite results, and support from the executive branch, the PEC and ordinary law proposals stall in committee or fail to achieve the required supermajority before the end of 2025. Congressional opposition, especially from business-aligned deputies and senators, remains strong, and time runs out for any broad ban on 6x1 to be enacted for most CLT occupations before January 1, 2026.",
            "yes_scenario": "A mass mobilization in October/November 2025 triggers a sudden political realignment, reminiscent of the defeat of the 'PEC da Blindagem.' Under heavy public pressure, Congress expedites either a Constitutional Amendment or an ordinary law ending the 6x1 schedule for most CLT workers. The legislative process is completed and signed into law before the end of the year, with no more than five exceptions and affecting less than 1% of the workforce.",
            "final_reasoning": "While social and union mobilization is substantial, and there is clear executive support for abolishing 6x1, the legislative reality is that there is overwhelming resistance in Congress (with 70% of deputies opposed), business lobbies are strongly against, and there is very little time for the required multi-stage legislative process. Historically, such major reforms to the CLT require years and broad consensus. While the recent archiving of the 'PEC da Blindagem' under popular pressure shows that street protest can have an effect, it is the exception, not the rule, for deeply divisive labor changes. Unless there is an extraordinary, unprecedented wave of mobilization and rapid legislative action, the status quo is likely to prevail through the deadline.",
            "final_probability": 7
        },
        "Political Science (Public Policy Process)": {
            "time_to_resolution": "Approximately 3 months (until January 1, 2026)",
            "perspective_relevance": "As an expert in the Public Policy Process, I analyze legislative change through the lens of institutional constraints, policymaker incentives, veto points, the importance of public pressure, and the stickiness of the status quo. My perspective brings a rigorous appreciation of how difficult it is to enact major labor reforms, especially constitutional amendments, in Brazil’s multiparty, fragmented legislature—regardless of executive or popular support.",
            "status_quo": "The 6x1 schedule is legal and widely used for CLT workers. Multiple proposals to ban it (via constitutional amendments and bills) have been introduced but none have advanced significantly due to strong legislative resistance, business opposition, and the high bar for constitutional change.",
            "perspective_derived_factors": [
                {
                    "factor": "Legislative Resistance and Veto Points",
                    "effect": "Decreases probability. Multiple sources and recent surveys show that about 70% of deputies oppose ending 6x1, and constitutional amendments require a supermajority in both houses. Brazil’s legislature is notoriously fragmented, and business lobbies are strong, making major labor reforms very difficult to pass quickly."
                },
                {
                    "factor": "Executive and Ministerial Support",
                    "effect": "Slightly increases probability. President Lula and the Minister of Labor have expressed clear support for ending 6x1. However, without strong legislative alignment or greater use of urgency powers, this support on its own is rarely decisive."
                },
                {
                    "factor": "Popular Mobilization and Street Pressure",
                    "effect": "Slightly increases probability. There is precedent for mass mobilization influencing legislative outcomes (e.g., the ‘PEC da Blindagem’ defeat), and there is a currently ongoing plebiscite and street pressure. However, the scale of mobilization so far appears relatively modest, and Congress has shown the capacity to resist or delay even popular demands."
                },
                {
                    "factor": "Base Rates of Major Labor Law Changes in Brazil",
                    "effect": "Strongly decreases probability. Major labor reforms (especially constitutional ones) in Brazil are rare and take years, not months, to pass. Even the 2017 labor reform, which was a pro-business relaxation, took over a year and had strong government push. Pro-worker reforms face greater business resistance and legislative inertia."
                },
                {
                    "factor": "Proliferation of Legislative Vehicles (PECs and Bills)",
                    "effect": "Slightly increases probability. Multiple proposals (PECs and bills) have been introduced, with some procedural progress (e.g., subcommittee hearings), which is a necessary if not sufficient precondition for change. The possibility of passing a regular law instead of a constitutional amendment could lower the bar slightly, but would still face strong opposition."
                },
                {
                    "factor": "Upcoming Elections and Political Calculus",
                    "effect": "Mixed/neutral. Legislators may be hesitant to pass controversial reforms before elections, fearing backlash from employers or uncertainty about public opinion. On the other hand, some may want to appeal to labor or progressive constituencies if the wind shifts."
                }
            ],
            "no_scenario": "Despite ongoing mobilization and government support, legislative inertia, lack of consensus, business opposition, and the high threshold for constitutional amendments prevent any ban from being enacted before January 1, 2026. The bill/PEC gets delayed in committees, fails to reach the floor, or is voted down.",
            "yes_scenario": "A surge in mass mobilization and street pressure, perhaps triggered by significant protests or a successful plebiscite, shifts enough legislative opinion to pass either a constitutional amendment or a regular law banning 6x1 for most CLT workers. The ruling coalition musters enough votes, possibly using urgency procedures, and business opposition is partially neutralized by targeted exceptions or compensation.",
            "final_reasoning": "The base rate for major labor law changes—especially bans on long-standing practices like 6x1 schedules—within a few months is extremely low in Brazil, given legislative structure and history. While there is clear executive and ministerial support, and some organized street pressure, the legislature remains the key veto point. Recent surveys show overwhelming opposition among deputies (about 70%), and multiple news reports cite the need for extraordinary popular mobilization to overcome inertia—mobilization that, while present, does not yet match the scale of past successful movements. Procedural progress (subcommittees, hearings) is necessary but not sufficient, and the track record suggests that such proposals usually take years, not months, to pass. The existence of a PT bill as a fallback (easier to pass than a PEC) slightly raises the probability, but even a regular law faces the same political-economic headwinds. The status quo is sticky and the most likely outcome is that no ban is enacted before the deadline.",
            "final_probability": 8
        },
        "Political Science (Institutionalism)": {
            "time_to_resolution": "Approximately 3 months (until January 1, 2026)",
            "perspective_relevance": "As an institutionalist, I focus on how formal and informal rules, the configuration of veto players, path dependencies, and the interplay of social mobilization and legislative structures constrain or enable major policy change in Brazil. This is especially relevant for labor reforms, which require overcoming significant institutional inertia and navigating a complex, multiparty Congress often resistant to rapid change.",
            "status_quo": "The 6x1 work schedule (six days work, one day off) is legal and entrenched in CLT-regulated employment for most Brazilian workers. Previous attempts to reduce working hours or alter the schedule have repeatedly stalled in Congress due to employer resistance, legislative fragmentation, and high amendment thresholds.",
            "perspective_derived_factors": [
                {
                    "factor": "Legislative structure and veto points",
                    "effect": "Decreases probability. Constitutional amendments require 308 votes in the Chamber and 49 in the Senate, with multiple readings—difficult to secure, especially for labor reforms facing significant opposition (as 70% of deputies reportedly oppose ending 6x1)."
                },
                {
                    "factor": "Government support and agenda-setting",
                    "effect": "Increases probability slightly. President Lula and the Minister of Labor are on record supporting the end of 6x1 and have called for mobilization. However, the executive's agenda-setting power is diluted by Congress's autonomy and multiparty fragmentation."
                },
                {
                    "factor": "Popular mobilization and social pressure",
                    "effect": "Increases probability. Recent street protests and plebiscite campaigns echo past successful mobilizations (e.g., PEC da Blindagem), and organized labor is actively lobbying. However, the numbers involved (e.g., 10,000 votes in plebiscite) are low relative to Brazil's workforce."
                },
                {
                    "factor": "Business and economic resistance",
                    "effect": "Decreases probability. Employer organizations, some unions, and a large bloc of deputies argue that banning 6x1 will increase labor costs and harm competitiveness, especially for small/medium enterprises. This resistance has historically blocked labor reforms."
                },
                {
                    "factor": "Policy path dependency and institutional inertia",
                    "effect": "Decreases probability. The 6x1 schedule is deeply rooted in the CLT and labor market. Path dependencies make rapid change unlikely absent overwhelming consensus or crisis."
                },
                {
                    "factor": "Alternative legislative vehicles",
                    "effect": "Increases probability slightly. There is discussion of passing a regular law (which requires a lower quorum than a PEC) to end 6x1. However, even bills face strong resistance, and none have advanced meaningfully in 2025."
                },
                {
                    "factor": "Election calendar and political incentives",
                    "effect": "Decreases probability. With municipal elections in 2026, deputies may be reluctant to pass potentially controversial labor reforms in late 2025, especially given business opposition and divided public opinion."
                }
            ],
            "no_scenario": "Despite active mobilization, the proposal to ban 6x1 either stalls in committee or fails to reach the required thresholds in plenary votes. Business and centrist/deputy opposition, path dependency in labor law, and the short time remaining prevent passage of either a constitutional amendment or ordinary law before January 1, 2026.",
            "yes_scenario": "A groundswell of public protest and effective union lobbying, possibly combined with a strategic compromise (e.g., carve-outs for SMEs or certain sectors), pushes either a constitutional amendment or a regular law over the finish line in Congress. The executive prioritizes the bill, and enough deputies shift position due to electoral pressure or coalition bargaining to enact a ban before the end of 2025.",
            "final_reasoning": "The decisive institutional factors are: (1) the high legislative threshold for constitutional amendments, (2) clear evidence that 70% of deputies currently oppose ending 6x1, (3) strong business resistance and limited evidence of a major shift in the business-labor balance of power, and (4) the short time frame (three months) in which to achieve passage. While public mobilization has proven influential in other recent cases (PEC da Blindagem), the scale of mobilization here appears modest, and the structural obstacles greater. The presence of government support and multiple legislative vehicles (PEC and bill) do increase chances slightly, but not nearly enough to outweigh the institutional barriers and entrenched opposition. The most likely scenario is legislative inertia, with possible symbolic advances (reports, debates, committee votes), but no enactment into law before the deadline. The probability that the 6x1 schedule will be banned for most CLT workers before January 1, 2026 is therefore low, but not zero.",
            "final_probability": 8
        },
        "Latin American Studies (Brazilian Political Economy)": {
            "time_to_resolution": "Approximately 3 months (until 1 January 2026)",
            "perspective_relevance": "As an expert in Brazilian political economy and labor relations, I can contextualize: (a) the relationship between labor reform and economic cycles; (b) party dynamics and legislative bottlenecks in Brazil; (c) the historical inertia of labor legislation; and (d) the impact of social mobilization on legislative outcomes. I also have a nuanced understanding of how business interests, labor movement strength, and coalition politics interact within Brazil's fragmented Congress.",
            "status_quo": "The 6x1 work schedule (6 days on, 1 day off) remains legal for most CLT workers. Multiple attempts to ban or reduce it (through constitutional amendments or bills) have stalled in Congress, facing high legislative hurdles and business opposition. Inertia is strong.",
            "perspective_derived_factors": [
                {
                    "factor": "Congressional Opposition",
                    "effect": "Strongly decreases probability. Multiple sources, including surveys, show about 70% of deputies are opposed to banning 6x1. Majorities required for constitutional change (PEC) are even higher, and the Chamber has shown little movement despite significant publicity. Even for ordinary law, opposition remains high."
                },
                {
                    "factor": "Business and Employer Resistance",
                    "effect": "Decreases probability. Employer groups and conservative deputies argue banning 6x1 will raise costs, harm competitiveness, and risk layoffs. These interests have historically been effective at blocking or watering down labor reforms in Brazil."
                },
                {
                    "factor": "Popular Mobilization and Public Opinion",
                    "effect": "Slightly increases probability. There is evidence of rising street mobilization (plebiscites, protests, union events) and favorable public opinion (up to 57–64% support, per cited surveys). While such pressure recently led to legislative reversals (as with the PEC da Blindagem), the 6x1 issue is less existential to democracy and more economically contentious, limiting the impact of mobilization."
                },
                {
                    "factor": "Government and Labor Ministry Support",
                    "effect": "Slightly increases probability. President Lula and Labor Minister Marinho vocally support the ban. However, both stress that only massive public pressure could overcome congressional resistance, signaling government support is insufficient on its own."
                },
                {
                    "factor": "Legislative Process and Timelines",
                    "effect": "Decreases probability. Time is short (3 months). Both PECs and ordinary bills require several committee approvals and floor votes. The latest news indicates the main proposals are still in committee or awaiting reports; there is no evidence of imminent floor votes or fast-tracking. The window for passage is rapidly closing."
                },
                {
                    "factor": "Base Rates for Major Labor Reforms",
                    "effect": "Strongly decreases probability. Major labor law changes in Brazil (e.g., the 2017 reform) are infrequent, often take years, and require broad consensus or crisis. Changes that increase labor costs face formidable obstacles, especially outside major economic crises or periods of overwhelming government majority."
                },
                {
                    "factor": "Alternative Legislative Vehicles",
                    "effect": "Slightly increases probability. There is discussion of ordinary bills (which require fewer votes than PECs) and possibly leveraging plebiscite results for political pressure. However, no bill has yet advanced meaningfully."
                }
            ],
            "no_scenario": "Despite continued mobilization and support from the executive, Congress remains deadlocked. Committee reports are delayed or unfavorable, business pressure leads to further watering down or shelving of proposals, and no law or constitutional amendment banning 6x1 passes before 1 January 2026. Possible last-minute negotiations yield only symbolic gestures, like public hearings or promises to revisit the issue after the 2026 elections.",
            "yes_scenario": "A surge in street mobilization—potentially sparked by plebiscite results or a major labor event—shifts the political cost of inaction. Congressional leadership, sensing a political risk, expedites either a bill or a constitutional amendment. The executive leverages all its influence, and enough lawmakers defect or abstain to secure passage. The law is enacted and published before the deadline, officially banning 6x1 for most CLT workers.",
            "final_reasoning": "While political and social momentum for banning the 6x1 schedule has grown, the legislative and economic barriers are formidable. The status quo is deeply entrenched: 70% of deputies oppose the ban, and both major proposals (PEC and ordinary bill) are still at early or mid-stages in the legislative process, with only three months left. Business resistance is strong, and the window for passage is very narrow, especially considering the upcoming 2026 elections, which incentivize caution and avoidance of controversial votes. While the Lula government and labor movement are mobilized, even their leaders admit only extraordinary public pressure could tip the balance, and there is no evidence yet of a decisive groundswell. Historically, major labor reforms that increase costs occur rarely and only with overwhelming political alignment or crisis. Given all this, the base rate for passage of such a ban on a tight timeline is very low. While I recognize a small chance of a last-minute breakthrough (especially if plebiscite turnout is unexpectedly massive), the overwhelming likelihood is that no ban will pass before January 2026.",
            "final_probability": 7
        }
    },
    "deliberation_probability": [
        8,
        7,
        8,
        8,
        7,
        8,
        8,
        7
    ],
    "deliberation_mean_probability": 7.625,
    "deliberation_sd": 0.5175491695067657,
    "deliberation_probability_result": 8,
    "group_results": {
        "employmentRelationsIloConventions": {
            "forecaster_to_engage": "Labor Law (Comparative Labor Law)",
            "response_type": "defense",
            "response": "This forecast demonstrates an acute understanding of both the procedural and political bottlenecks inherent in passing major labor law reform in Brazil, especially within a compressed timeframe. The forecaster rightly emphasizes the difficulty of amending the Constitution or even passing a regular law against entrenched business and legislative opposition, a point supported by Brazilian legislative history and comparative international experience. Their acknowledgment that only an urgent, government-backed ordinary law could change the odds reflects a sophisticated grasp of legislative alternatives, and their caution about the difference between symbolic and substantive progress is well-founded. The argument is further strengthened by the nuanced discussion of how the precedent of the 'PEC da Blindagem' archiving was contextually different due to elite consensus, a crucial factor often overlooked. Overall, this forecast successfully balances the small but non-negligible chance of a shock event with the overwhelming weight of structural inertia, making its low probability both justifiable and compelling."
        },
        "employmentRelationsIndustrialRelationsSystems": {
            "forecaster_to_engage": "Labor Law (Comparative Labor Law)",
            "response_type": "defense",
            "response": "This forecast is particularly strong in its nuanced appreciation of both legislative procedure and political economy. The forecaster accurately notes that, while public and governmental support is present, the critical veto point is Congress, which is currently opposed by a large margin. Their recognition that the burial of the 'PEC da Blindagem' was driven by an exceptional alignment of elite and mass opinion—unlike the more divided coalition around labor reforms—is a well-placed distinction. The analysis also correctly highlights that, even if there is a fallback to an ordinary bill instead of a PEC, the same structural and interest-group obstacles persist. By emphasizing that the timeline is simply too short for such a sweeping change absent a crisis or seismic shift, the forecast is appropriately skeptical without being dismissive of tail risks. This provides a compelling, well-supported rationale for a low probability."
        },
        "legislativeAffairsBrazilianLegislativeProcess": {
            "forecaster_to_engage": "Political Science (Institutionalism)",
            "response_type": "defense",
            "response": "This forecast demonstrates a strong grasp of the decisive role played by institutional barriers in the Brazilian legislative process. The identification of the high threshold for constitutional amendments, entrenched congressional opposition, and the limited scale of current public mobilization is highly pertinent. The forecaster also correctly notes that past rapid changes—such as the defeat of the PEC da Blindagem—required both broad-based street mobilization and elite consensus, neither of which are present in the current 6x1 debate. Their sober assessment that, even with government support and alternative legislative vehicles, the probability of passage remains low is well-founded, given the short timeline and dominance of veto players. By explicitly balancing the structural obstacles with a recognition of nonzero tail risk, this forecast provides a compelling and institutionally literate rationale for a low probability outcome."
        },
        "laborLawComparativeLaborLaw": {
            "forecaster_to_engage": "Labor Law (Brazilian Labor Code CLT)",
            "response_type": "critique",
            "response": "While this forecast rightly emphasizes the formidable legislative resistance and the slow historical pace of CLT reforms, it may somewhat underweight the possibility of a last-minute pivot to an ordinary law (as opposed to a PEC), which has been floated by PT strategists and could, in theory, pass with a lower threshold if there is an unexpected surge in public and executive pressure. Additionally, the argument that the recent archiving of the 'PEC da Blindagem' was an exception is sound, but the forecast could more clearly delineate the necessary scale and nature of mobilization required for labor law reform to follow a similar path. Comparative labor law experience shows that, under acute political pressure, legislatures have occasionally acted with surprising speed, especially when facing electoral incentives or coalition dynamics shifting late in the year. While the assigned probability is justifiably low, a more robust treatment of legislative flexibility and contingency planning could further strengthen the forecast."
        },
        "laborLawBrazilianLaborCodeClt": {
            "forecaster_to_engage": "Employment Relations (Industrial Relations Systems)",
            "response_type": "defense",
            "response": "This forecast is compelling in its use of base rates and its emphasis on the formidable structural obstacles facing major labor law reforms in Brazil. It appropriately notes that, despite heightened union activity and executive advocacy, the legislative process is fundamentally slow and consensus-driven when it comes to divisive labor issues. The argument that even rare, rapid victories like the burial of the 'PEC da Blindagem' required extraordinary and unified popular mobilization is particularly salient; the current 6x1 debate, while highly visible, does not yet demonstrate the overwhelming, cross-factional public pressure necessary to force a legislative breakthrough. The forecast also correctly situates the plebiscite and street mobilizations as factors that marginally increase, but do not fundamentally alter, the underlying legislative inertia and business resistance. This sober and evidence-based assessment justifies the low probability assigned."
        },
        "politicalSciencePublicPolicyProcess": {
            "forecaster_to_engage": "Latin American Studies (Brazilian Political Economy)",
            "response_type": "critique",
            "response": "While this forecast robustly addresses the structural and economic headwinds to rapid labor reform and appropriately recognizes the entrenched status quo and business opposition, it could benefit from a more explicit engagement with the mechanics of the legislative process and the specific institutional veto points that make last-minute breakthroughs exceptionally rare in Brazil. The analysis, while strong on political economy, underemphasizes the procedural hurdles—such as committee bottlenecks and the multi-stage requirements for both PECs and ordinary bills—which often prove decisive even in the face of mounting political or social momentum. Additionally, the forecast might overstate the likelihood of a last-minute breakthrough by focusing on the possibility of a 'massive plebiscite turnout,' without addressing the historical rarity of such events translating into concrete legislative passage within weeks. A more granular assessment of where the proposals stand in the legislative pipeline, and the alignment (or lack thereof) of key party leaders and committee chairs, would provide a firmer foundation for the (already low) probability assigned."
        },
        "politicalScienceInstitutionalism": {
            "forecaster_to_engage": "Employment Relations (ILO Conventions)",
            "response_type": "defense",
            "response": "This forecast excels by grounding its probability estimate in historical base rates for major labor reforms and by detailing the formidable institutional hurdles: legislative deadlines, constitutional amendment thresholds, and entrenched opposition in the Chamber of Deputies. The forecast's attention to the holiday recess and the limited practical impact of the plebiscite (given its modest scale relative to the workforce) demonstrates a nuanced understanding of both institutional timetables and the weight of symbolic versus material mobilization. It also correctly identifies that only a truly extraordinary event—such as a political or social crisis generating overwhelming mass mobilization—could plausibly alter the legislative equilibrium in the short window remaining. The forecast's clarity in distinguishing between necessary and sufficient conditions for a Yes outcome makes its low probability highly defensible."
        },
        "latinAmericanStudiesBrazilianPoliticalEconomy": {
            "forecaster_to_engage": "Political Science (Public Policy Process)",
            "response_type": "critique",
            "response": "This forecast correctly emphasizes legislative inertia and the likelihood that the status quo will persist, but it could benefit from a more explicit discussion of the recent, multipronged legislative strategy emerging in the past month—namely, the PT's pivot toward pursuing an ordinary bill as well as a PEC. While both routes face similar political obstacles, the regular bill route could in theory lower the barrier to passage if there is any late-breaking shift in public or elite sentiment, especially as the plebiscite results are publicized and electoral incentives sharpen. Additionally, the forecast might more directly consider the dynamic interplay between street mobilization and elite recalculation in the run-up to an election year, which, while unlikely to tip the scales, is a non-negligible tail risk that could marginally raise the probability above pure baseline. In sum, while the probability is justifiably low, the forecast could be strengthened by a more granular treatment of legislative tactics and the endgame calculus of key party actors."
        }
    },
    "revision_results": {
        "Employment Relations (ILO Conventions)": {
            "my_phase1_final_probability": 8,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, including the defense of the 'Labor Law (Comparative Labor Law)' forecast, I find no compelling new evidence or argument to justify raising or lowering my initial probability. All forecasters converge around a low single-digit probability, citing the same core impediments: entrenched legislative and business opposition, procedural hurdles, and limited time before the deadline. The group consensus reinforces my initial assessment that, absent an extraordinary and unprecedented political shock, the ban on the 6x1 schedule is extremely unlikely to pass before January 1, 2026. There is no indication of decisive change in the external environment or legislative process since my initial forecast.",
            "revised_probability": 8
        },
        "Employment Relations (Industrial Relations Systems)": {
            "my_phase1_final_probability": 7,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I find my initial assessment well-aligned with the consensus among experts from adjacent fields (labor law, legislative process, political science, and comparative labor systems). All forecasts converge around a 7-8% probability, citing the same critical obstacles: overwhelming congressional opposition (70% of deputies opposed), entrenched business interests, and the extremely short legislative window. The defense of the 'Labor Law (Comparative Labor Law)' forecast further reinforces the argument that only a shock event—unlikely and not yet in evidence—could deliver a Yes outcome within three months. No new information or argument has emerged to justify raising or lowering my probability. Therefore, I maintain my initial probability.",
            "revised_probability": 7
        },
        "Legislative Affairs (Brazilian Legislative Process)": {
            "my_phase1_final_probability": 8,
            "reasoning_for_revised_probability": "After reviewing the other forecasters' arguments and my own, there is strong consensus across multiple domains—comparative labor law, industrial relations, institutionalism, political economy—that the base rate for major labor reform passing in Brazil within a three-month window is extremely low. The group discussion reinforced the importance of entrenched congressional opposition (with about 70% of deputies against), procedural hurdles, and insufficient scale of public mobilization relative to historic cases where rapid change occurred. No new information or perspective emerged that would materially increase the likelihood of passage before the deadline. The consensus supports the initial assessment that only an extraordinary, rapid, and presently unforeseen surge in public or political alignment could shift the outcome. Therefore, there is no compelling reason to revise the initial probability.",
            "revised_probability": 8
        },
        "Labor Law (Comparative Labor Law)": {
            "my_phase1_final_probability": 8,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I remain convinced the probability should remain low, though the arguments highlight the very slim chance of a last-minute legislative pivot to an ordinary law rather than a PEC, especially if public mobilization rapidly intensifies. However, the overwhelming consensus among forecasters from different disciplines is that institutional inertia, parliamentary opposition, and the compressed timeline dominate the scenario. The critique raised about the possibility of a sudden legislative shift is valid, but there is still no evidence of the scale of mobilization or elite alignment required to enable such a move. Therefore, I see no compelling reason to substantially revise my probability. I will, however, slightly increase the probability to 9% to acknowledge the narrow window for an extraordinary event or legislative maneuver, as highlighted in the group deliberation.",
            "revised_probability": 9
        },
        "Labor Law (Brazilian Labor Code CLT)": {
            "my_phase1_final_probability": 7,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I observed broad consensus among experts in institutional analysis, legislative affairs, employment relations, and comparative labor law. All converge on the same key obstacles: overwhelming opposition in Congress (about 70% of deputies), slow legislative processes (especially for a PEC, but also for ordinary bills), strong business resistance, and an absence of the exceptional popular mobilization that recently drove the archiving of the 'PEC da Blindagem.' Notably, several forecasters—particularly those in Comparative Labor Law and Legislative Affairs—emphasized that while a last-minute pivot to a regular law (rather than a PEC) could marginally increase the odds, there is still no sign of the seismic, unified pressure or coalition shifts that would make even this feasible within the remaining timeframe. The only substantive critique of my forecast suggested I might slightly underweight legislative flexibility, but I find this possibility still remote given current signals. Thus, the cumulative evidence still strongly supports a very low probability; if anything, the group deliberation reinforced my initial assessment rather than shifted it.",
            "revised_probability": 7
        },
        "Political Science (Public Policy Process)": {
            "my_phase1_final_probability": 8,
            "reasoning_for_revised_probability": "After reviewing both my initial forecast and the group discussion, I see near-unanimity among domain experts—across labor law, legislative process, and political economy—assigning very low probabilities (7-8%) to passage, with consensus around the formidable legislative and institutional barriers and the insufficient scale of mobilization. Critiques in the group phase highlighted the low but nonzero possibility of a rapid, government-driven pivot to an ordinary law instead of a PEC, should a shock event or late coalition shift occur. However, all forecasters agreed that such scenarios are historically rare and face the same procedural bottlenecks. No new evidence or argument emerged that would significantly increase the odds, and the status quo remains heavily favored by base rates, institutional inertia, and explicit legislative resistance. Therefore, my probability remains unchanged.",
            "revised_probability": 8
        },
        "Political Science (Institutionalism)": {
            "my_phase1_final_probability": 8,
            "reasoning_for_revised_probability": "After reviewing both my initial forecast and the group deliberation, I find that the consensus remains firmly aligned with my original analysis: institutional barriers, legislative inertia, and base rates for major labor law reform in Brazil all strongly disfavor rapid passage. The deliberation highlighted some minor theoretical tail risks (such as a last-minute pivot to an ordinary law), but all forecasters agree these are highly improbable given the entrenched opposition, the legislative calendar, and the insufficient scale of current mobilization. No new evidence or arguments emerged to suggest a meaningful increase or decrease in probability. Therefore, I see no compelling reason to adjust my estimate.",
            "revised_probability": 8
        },
        "Latin American Studies (Brazilian Political Economy)": {
            "my_phase1_final_probability": 7,
            "reasoning_for_revised_probability": "The group deliberation reinforced the extremely low base rate for rapid, major labor reforms in Brazil and the formidable legislative, institutional, and business obstacles to passage within the three-month window. Multiple forecasters highlighted the overwhelming opposition in Congress (70% of deputies), procedural bottlenecks, and the lack of truly extraordinary popular mobilization required to force a breakthrough. However, critiques noted that recent weeks have seen PT strategists pivot toward an ordinary bill pathway as an alternative to the PEC, which—while still facing high hurdles—could in theory be passed with a lower threshold if there were a sudden shift in political or public sentiment. Furthermore, the possibility of some dynamic interplay between electoral incentives, the plebiscite, and late-2025 political calculations was raised as a minor tail risk. While these considerations do not fundamentally alter the overwhelmingly negative outlook, they do marginally increase the plausibility of a last-minute legislative maneuver. Thus, I will slightly raise my forecast to account for these nonzero but still very unlikely scenarios.",
            "revised_probability": 9
        }
    },
    "revision_probability": [
        8,
        7,
        8,
        9,
        7,
        8,
        8,
        9
    ],
    "revision_mean_probability": 8.0,
    "revision_sd": 0.7559289460184544,
    "revision_probability_result": 8,
    "question_details": {
        "id": 38951,
        "title": "Will Brazil ban the 6x1 work schedule before 1 January 2026?",
        "created_at": "2025-08-31T06:17:36.868665Z",
        "open_time": "2025-09-27T13:45:12Z",
        "cp_reveal_time": "2025-09-27T15:15:12Z",
        "spot_scoring_time": "2025-09-27T15:15:12Z",
        "scheduled_resolve_time": "2026-01-01T03:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-09-27T15:15:12Z",
        "actual_close_time": "2025-09-27T15:15:12Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "This question is synced with an identical question on Metaculus. The original question opened on 2024-11-22 02:45:00 and can be found [here](https://www.metaculus.com/questions/29956). This question will resolve to the same value as the synced question. The original question's background info at this time is below. \n\nThere is currently [a lot of talk](https://www.brasildefato.com.br/2024/11/11/why-is-everyone-talking-about-the-6x1-work-schedule-in-brazil ) about banning the 6x1 work schedule (6 working days, 1 off) for registered workers in Brazil. Proponents claim that working 6 days a week is too exhausting and doesn't leave enough time for workers to rest, socialize and run errands. An ambitious constitutional ammendment has recently [been proposed](https://www1.folha.uol.com.br/internacional/en/business/2024/11/proposal-to-reduce-weekly-work-hours-in-brazil-gains-momentum-in-congress.shtml) by two Brazilian congress members that would mandate a 4x3 schedule for all workers and has garnered some support.\n\nPortuguese language sources:\n- https://noticias.uol.com.br/politica/ultimas-noticias/2024/11/12/fim-da-escala-6x1-o-que-muda-se-pec-for-aprovada-no-congresso.htm\n- https://economia.uol.com.br/noticias/redacao/2024/11/12/o-que-e-a-escala-6x1-entenda-o-que-propoe-a-pec-para-reducao-da-jornada.htm\n\n`{\"format\":\"metac_closes_in_period\",\"info\":{\"post_id\":29956,\"question_id\":29790}}`",
        "resolution_criteria": "This question will resolve as **Yes** if the 6x1 work schedule is officialy banned for most CLT occupations in Brazil before 1 January 2026, and will resolve as **No** otherwise.",
        "fine_print": "This question concerns only CLT occupations in Brazil (registered workers), and will resolve to **Yes** even if employers find legal workarounds to keep hiring people in 6x1 work schedules after a ban.\n\nIn Brazil, a CLT worker is someone employed under the rules of the Consolidação das Leis do Trabalho (CLT), or the Consolidation of Labor Laws. This legislation governs employment relations and protects workers' rights in Brazil. Being a CLT worker means you’re formally employed and entitled to a range of rights and protections set out in Brazilian labor laws.\n\n\"Most CLT occupations\" here means that the law lists no more than 5 exceptions to the general rule, affecting in total no more than 1% of the workforce",
        "post_id": 39574,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**Plebiscite on Ending the 6‑Day Work Week to Close by Month’s End**\nThe plebiscite on ending the 6‑day work week (6x1) and granting income‑tax exemption for earners up to R$5 000 is set to close on 30 October 2025, according to the article.  The campaign, led by groups such as the MST, MTST, CUT, CTB, Sinteal, and left‑wing parties PT, PCdoB and PSOL, has been collecting votes and signatures since July, extending the period by a month to pressure the National Congress.  In Alagoas, physical ballot boxes were moved through schools, markets and other public spaces, while online voting codes were also distributed.  Organizers estimate that the plebiscite will exceed 10 000 votes, though the exact total is not yet known.  The campaign’s president, Izael Ribeiro of Sinteal, said the widespread participation “was very large” and that the proposal “has a very positive reaction” (Izael Ribeiro, quoted).  He added that the results will be presented to President Lula next week to push for the reform of the income‑tax table, which is already in Congress under the sponsorship of Senator Renan Calheiros and Deputy Arthur Lira.  The article notes that the plebiscite is a constitutional instrument (Art. 14 of the Constitution, Lei 9.709/98) that allows citizens to be consulted before a law is enacted.  The campaign’s goal is to secure a tax‑justice measure that exempts those earning below R$5 000 while increasing taxes on those earning above R$50 000.  The article reports that the voting will remain open until 30 October, with instructions to use a mobile phone to scan a QR code for online participation.\nOriginal language: pt\nPublish date: September 27, 2025 11:35 AM\nSource:[Tribuna Hoje](https://tribunahoje.com/index.php/noticias/politica/2025/09/27/167474-plebiscito-popular-da-escala-6x1-sera-encerrado-no-final-do-mes)\n\n**Marinho Calls for Public Pressure to End 6×1 Work Schedule**\nBrazilian Labor Minister Luiz Marinho publicly urged citizens to protest and go to the National Congress to push for the Constitutional Amendment (PEC) that would end the 6×1 work schedule, where workers work six days and rest one. He said that without popular pressure the PEC would not advance, noting that the topic \"has great difficulty tramitar no Congresso Nacional\" and that a \"livre, leve, solto\" parliament would only harm workers. Marinho made the remarks on the \"Bom Dia Ministro\" program on the federal government channel. The PEC, introduced by federal deputy Erika Hilton (PSOL‑SP) in February, proposes moving to a 4×3 or 5×2 schedule, arguing that 6×1 \"escravizes workers\" by limiting family time. Despite being filed, the proposal has moved slowly; a survey shows about 70% of deputies disagree with the text.\nOriginal language: pt\nPublish date: September 26, 2025 02:35 PM\nSource:[Jovem Pan – Esportes, entretenimento, notícias e vídeos com credibilidade](https://jovempan.com.br/programas/jornal-da-manha/marinho-defende-pressao-popular-no-congresso-para-fim-da-escala-6x1.html)\n\n**No DR com Demori: TST Minister Delaíde Miranda Discusses the 6x1 Schedule and Labor Reform Impacts**\nOn September 23, 2025, Minister Delaíde Miranda appeared on the TV Brasil program \"DR com Demori\" to discuss new work arrangements, digital platforms, slavery, and the 2025 labor reform. She highlighted her background as a former domestic worker and noted her support for the CLT. Miranda said, 'Eu acompanho muito as deflagrações do Ministério Público do Trabalho nas questões de resgate de trabalho escravo. E entendo que, no fundo, é uma questão de lucro. Por quê? Onde se detecta mais? Nas empresas terceirizadas por grandes multinacionais'. She also argued that ending the 6x1 schedule would create more jobs and allow workers to better qualify, spend time with family and leisure, saying, 'A redução da jornada traria o benefício de criar mais empregos, além de permitir que o trabalhador possa se qualificar melhor, dedicar mais tempo à família e ao lazer. A gente não pode pensar em um trabalhador que viva apenas para o trabalho'. The program aired on TV Brasil and Rádio MEC at 23:00 on September 23, 2025.\nOriginal language: pt\nPublish date: September 26, 2025 04:43 AM\nSource:[ebc.com.br](https://www.ebc.com.br/imprensa/2025/no-dr-com-demori-a-ministra-do-tst-delaide-miranda-analisa-a-escala-6x1-e-impactos-da-reforma-trabalhista)\n\n**Guilherme Derrite to Remain in São Paulo Security Post Until March 2026 at Governor's Request**\nGuilherme Derrite, the current Secretary of Public Security of São Paulo, said on Thursday, 25 September 2025 that he will stay in the post until the end of the disqualification period in March 2026, at the request of Governor Tarcísio de Freitas.  Derrite explained that the Progressistas party had considered an early exit so he could return to the federal Chamber of Deputies and work on the Constitutional Amendment (PEC) 18 on public security.  He added, 'A possibilidade de antecipar minha volta ao Congresso existe por conta dos temas ligados à segurança pública. Mas, a pedido do governador, eu devo permanecer até o final do prazo, em março.'  The PEC 18 seeks to modernise Brazil’s security system by integrating federal, state and municipal forces; Derrite said it has already begun in a special commission and that he has met with the commission’s president, Deputy Aluísio Mendes, and the rapporteur, Mendonça Filho, to discuss its progress.  He also noted that he will continue to focus on structural actions such as vehicle deliveries and expanding the Muralha Paulista program, which is now present in 61 % of the state’s cities.  Derrite plans to run for the Senate in 2026, which requires him to leave the state post by April 2026 and return to the Chamber by March 2026.\nOriginal language: pt\nPublish date: September 26, 2025 01:05 AM\nSource:[Jovem Pan – Esportes, entretenimento, notícias e vídeos com credibilidade](https://jovempan.com.br/noticias/brasil/governador-pediu-para-eu-permanecer-o-maximo-de-tempo-no-governo-afirma-derrite.html)\n\n**Minister of Labor says government supports ending 6x1 schedule and defends 'pressure' on Congress**\nThe Brazilian Minister of Labor, Luiz Marinho, said on September 25, 2025 that ending the 6‑day work schedule (6x1) will only succeed if the National Congress is subjected to 'muita pressão' (heavy pressure). He supports ending 6x1 and cutting the weekly work hour from 44 to 40. Marinho cited the successful street mobilization that led to the archiving of the PEC of blindagem as an example of pressure. In February, Deputy Erika Hilton (PSOL‑SP) introduced a constitutional amendment to reduce the maximum weekly work time to 36 hours over four days. A Quaest survey found that 70 % of federal deputies oppose ending 6x1. Marinho warned that without pressure, the measure will not pass and urged voters to consider candidates’ positions on 6x1 when voting next year.\nOriginal language: pt\nPublish date: September 25, 2025 01:53 PM\nSource:[globo.com](https://g1.globo.com/politica/noticia/2025/09/25/ministro-do-trabalho-diz-que-governo-apoia-fim-da-escala-6x1-e-defende-pressao-sobre-o-congresso.ghtml)\n\n**Plebiscite on Ending the 6‑Day Work Week to Close by Month’s End**\nThe plebiscite on ending the 6‑day work week (6x1) and granting income‑tax exemption for earners up to R$5 000 is set to close on 30 October 2025, according to the article.  The campaign, led by groups such as the MST, MTST, CUT, CTB, Sinteal, and left‑wing parties PT, PCdoB and PSOL, has been collecting votes and signatures since July, extending the period by a month to pressure the National Congress.  In Alagoas, physical ballot boxes were moved through schools, markets and other public spaces, while online voting codes were also distributed.  Organizers estimate that the plebiscite will exceed 10 000 votes, though the exact total is not yet known.  The campaign’s president, Izael Ribeiro of Sinteal, said the widespread participation “was very large” and that the proposal “has a very positive reaction” (Izael Ribeiro, quoted).  He added that the results will be presented to President Lula next week to push for the reform of the income‑tax table, which is already in Congress under the sponsorship of Senator Renan Calheiros and Deputy Arthur Lira.  The article notes that the plebiscite is a constitutional instrument (Art. 14 of the Constitution, Lei 9.709/98) that allows citizens to be consulted before a law is enacted.  The campaign’s goal is to secure a tax‑justice measure that exempts those earning below R$5 000 while increasing taxes on those earning above R$50 000.  The article reports that the voting will remain open until 30 October, with instructions to use a mobile phone to scan a QR code for online participation.\nOriginal language: pt\nPublish date: September 27, 2025 11:35 AM\nSource:[Tribuna Hoje](https://tribunahoje.com/index.php/noticias/politica/2025/09/27/167474-plebiscito-popular-da-escala-6x1-sera-encerrado-no-final-do-mes)\n\n**Proposal to Legally Prevent Delays in ISSEMyM Pension Payments**\nIn the local congress, the MC caucus proposed a bill to prohibit the delay or suspension of pension payments from the Instituto de Seguridad Social del Estado de México y Municipios (ISSEMyM). The proposal would require the pension to be paid within 30 days, the period allowed by current law, and if the payment is not resolved in that time, a provisional payment would be made. If the institution fails to comply, a 5 % compensation on the unpaid amount would be granted. The bill preserves the existing exceptions in the Social Security Law for state and municipal public servants, such as incompatibility of pensions, suspension upon re‑entry to public service, verification or doubt of documents, revocation for acts affecting granted rights, and restitution of improper payments.\n\nThe proponent, Deputy Maricela Beltrán Sánchez (MC), emphasized that the goal is to protect retirees from administrative inefficiency and financial disorder. She noted that while the law allows a maximum of 30 working days to resolve requests, in practice the processes are taking more than a year.\n\nAccording to the proposal, official data show that 59 % of ISSEMyM’s total spending in 2024 was allocated to pensions and retirements. The document also states that \"no obstante, se han documentado inmensos rezagos administrativos y retrasos de meses o incluso años para que los beneficiarios reciban lo que en justicia les corresponde\". The institute faces a severe budget contingency; in 2023 its expenditures totaled 38 846 million pesos, exceeding its revenues of 37 832.98 million pesos, confirming an operating deficit.\n\nThe bill would therefore ensure timely pension payments, provide provisional coverage if delays occur, and impose a penalty for non‑compliance, aiming to safeguard retirees from prolonged administrative delays.\nOriginal language: es\nPublish date: September 26, 2025 05:43 PM\nSource:[Portal Diario](https://diarioportal.com/legislatura/proponen-impedir-por-ley-retraso-en-pago-de-pensiones-del-issemym)\n\n**STF Validates Loss of Mandate if Politician Leaves Party to Create New Party**\nOn September 26 2025, the Supreme Federal Court (STF) confirmed that a politician who leaves a party to create a new one will lose their mandate, a decision that relies on a 30‑day window for new parties to receive parliamentarians without risk of revocation. The ruling was supported by six ministers following rapporteur Luís Roberto Barroso, who argued that the change, enacted by law 13.165/15, aims to reduce party fragmentation and frequent defections. The case was brought by Rede Sustentabilidade, whose party was registered with the Superior Electoral Court (TSE) in September 2015 and would have had a 30‑day period to accept new members under the old rules. Barroso said, 'A migração constante de parlamentares entre partidos esvazia a escolha feita nas urnas e enfraquece o papel dos partidos como expressão de projetos políticos duradouros.' He added, 'Não se pode admitir que lei limite ou exclua os efeitos do direito, quando todos os fatos necessários à sua aquisição já haviam sido completados e sua própria fruição já havia começado.' The ruling preserves the right of parties registered before the law’s entry into force to receive new affiliates within the original 30‑day period, while treating the creation of a new party as a constitutional ground for defiliation.\nOriginal language: pt\nPublish date: September 26, 2025 05:38 PM\nSource:[Migalhas](https://www.migalhas.com.br/quentes/440968/stf-valida-perda-de-mandato-se-politico-deixa-sigla-para-criar-partido)\n\n**Marinho Calls for Public Pressure to End 6×1 Work Schedule**\nBrazilian Labor Minister Luiz Marinho publicly urged citizens to protest and go to the National Congress to push for the Constitutional Amendment (PEC) that would end the 6×1 work schedule, where workers work six days and rest one. He said that without popular pressure the PEC would not advance, noting that the topic \"has great difficulty tramitar no Congresso Nacional\" and that a \"livre, leve, solto\" parliament would only harm workers. Marinho made the remarks on the \"Bom Dia Ministro\" program on the federal government channel. The PEC, introduced by federal deputy Erika Hilton (PSOL‑SP) in February, proposes moving to a 4×3 or 5×2 schedule, arguing that 6×1 \"escravizes workers\" by limiting family time. Despite being filed, the proposal has moved slowly; a survey shows about 70% of deputies disagree with the text.\nOriginal language: pt\nPublish date: September 26, 2025 02:35 PM\nSource:[Jovem Pan – Esportes, entretenimento, notícias e vídeos com credibilidade](https://jovempan.com.br/programas/jornal-da-manha/marinho-defende-pressao-popular-no-congresso-para-fim-da-escala-6x1.html)\n\n**Automatic Pix Debit Required for Unauthorized Banks**\nThe Monetary Council (CMN) and the Central Bank (BC) approved on 25 September 2025 resolutions that make the use of Pix automatic mandatory for interbank debit authorizations when the recipient is a legal entity or an entity not authorized to operate by the BC. Under the new rule, a customer must authorize the debit in the app of their financial institution before the money leaves their account. The BC says the mandatory use of Pix automatic brings greater convenience and control to customers and prevents unauthorized charges. The measures take effect on 13 October 2025, with a deadline of 1 January 2026 for institutions to adjust contracts and authorizations. The BC claims that Pix automatic can increase competition, reduce delinquency, improve operational efficiency and lower collection costs. The rule does not apply when the institution that holds the payer’s account is also the recipient of the funds. The article explains how Pix automatic works for recurring payments and outlines additional security measures the BC is implementing after a series of cyber attacks, such as limiting Pix access for institutions using PSTIs, tightening transaction value limits, and extending the block period for large transfers. The BC says, 'O BC diz que a adoção do Pix automático tem o potencial de aumentar a competição, reduzir a inadimplência, elevar a eficiência de processos operacionais e diminuir os custos dos procedimentos de cobrança.' The new rule does not apply when the institution responsible for the payer’s account is also the recipient of the funds, 'A nova regra não vale quando a instituição responsável pela conta do pagador também for a destinatária dos recursos.' The BC also notes, 'O BC passou a preparar um pacote de medidas visando reforçar a segurança do sistema financeiro nacional após uma sequência de ataques cibernéticos e fechar brechas que permitiram a infiltração do crime organizado na economia.'\nOriginal language: pt\nPublish date: September 26, 2025 01:54 PM\nSource:[Folha de S.Paulo](https://www1.folha.uol.com.br/mercado/2025/09/pix-automatico-sera-obrigatorio-em-debitos-para-instituicoes-nao-autorizadas.shtml)\n\n**No DR com Demori: TST Minister Delaíde Miranda Discusses the 6x1 Schedule and Labor Reform Impacts**\nOn September 23, 2025, Minister Delaíde Miranda appeared on the TV Brasil program \"DR com Demori\" to discuss new work arrangements, digital platforms, slavery, and the 2025 labor reform. She highlighted her background as a former domestic worker and noted her support for the CLT. Miranda said, 'Eu acompanho muito as deflagrações do Ministério Público do Trabalho nas questões de resgate de trabalho escravo. E entendo que, no fundo, é uma questão de lucro. Por quê? Onde se detecta mais? Nas empresas terceirizadas por grandes multinacionais'. She also argued that ending the 6x1 schedule would create more jobs and allow workers to better qualify, spend time with family and leisure, saying, 'A redução da jornada traria o benefício de criar mais empregos, além de permitir que o trabalhador possa se qualificar melhor, dedicar mais tempo à família e ao lazer. A gente não pode pensar em um trabalhador que viva apenas para o trabalho'. The program aired on TV Brasil and Rádio MEC at 23:00 on September 23, 2025.\nOriginal language: pt\nPublish date: September 26, 2025 04:43 AM\nSource:[ebc.com.br](https://www.ebc.com.br/imprensa/2025/no-dr-com-demori-a-ministra-do-tst-delaide-miranda-analisa-a-escala-6x1-e-impactos-da-reforma-trabalhista)\n\n**Guilherme Derrite to Remain in São Paulo Security Post Until March 2026 at Governor's Request**\nGuilherme Derrite, the current Secretary of Public Security of São Paulo, said on Thursday, 25 September 2025 that he will stay in the post until the end of the disqualification period in March 2026, at the request of Governor Tarcísio de Freitas.  Derrite explained that the Progressistas party had considered an early exit so he could return to the federal Chamber of Deputies and work on the Constitutional Amendment (PEC) 18 on public security.  He added, 'A possibilidade de antecipar minha volta ao Congresso existe por conta dos temas ligados à segurança pública. Mas, a pedido do governador, eu devo permanecer até o final do prazo, em março.'  The PEC 18 seeks to modernise Brazil’s security system by integrating federal, state and municipal forces; Derrite said it has already begun in a special commission and that he has met with the commission’s president, Deputy Aluísio Mendes, and the rapporteur, Mendonça Filho, to discuss its progress.  He also noted that he will continue to focus on structural actions such as vehicle deliveries and expanding the Muralha Paulista program, which is now present in 61 % of the state’s cities.  Derrite plans to run for the Senate in 2026, which requires him to leave the state post by April 2026 and return to the Chamber by March 2026.\nOriginal language: pt\nPublish date: September 26, 2025 01:05 AM\nSource:[Jovem Pan – Esportes, entretenimento, notícias e vídeos com credibilidade](https://jovempan.com.br/noticias/brasil/governador-pediu-para-eu-permanecer-o-maximo-de-tempo-no-governo-afirma-derrite.html)\n\n**The Roar of the Streets, the Burial of the Shielding PEC, and January 8**\nThe article reports that the Brazilian Senate has definitively rejected the \"PEC da Blindagem\" (the \"PEC of Shielding\"), a bill that had been approved in the Chamber of Deputies a week earlier. The rejection was unanimous, with the Senate’s Constitution and Justice Committee and President Davi Alcolumbre voting against it. The author frames this decision as evidence that the \"ronco das ruas\" (the roar of the streets) still holds power over the Congress.\n\nThe piece traces the history of the \"ronco das ruas\" from the early 1960s, when President João Goulart relied on popular mobilisations to defend his reforms, through the 1968 \"Passeata dos 100 Mil\" in Rio de Janeiro, where more than 100,000 students, artists, intellectuals and workers protested the military regime. The protest was followed on 13 December 1968 by the decree of AI‑5, which closed Congress, suspended civil liberties and granted absolute power to the executive, ushering in the most brutal phase of the dictatorship.\n\nAfter two decades of silence, the \"ronco das ruas\" re‑emerged during the Diretas Já movement (1983‑1984). Leaders such as Ulysses Guimarães, Leonel Brizola and Tancredo Neves used the popular pressure—\"mais de um milhão\" attended the Praça da Sé rally—to push Congress toward redemocratization, culminating in the 1988 Constitution.\n\nThe article then highlights the 1 January 2023 inauguration of President Lula, where \"centenas de milhares\" of Brazilians gathered in Brasília, a democratic celebration that forced the Bolsonaro‑led coup plotters to postpone their attempt. The failed coup on 8 January 2024 is described as a \"golpe dentro do golpe\" that was thwarted by institutional resistance and international pressure.\n\nFinally, the author notes that on 21 September 2025 the \"ronco das ruas\" again echoed strongly, threatening to halt attempts at amnesty, shielding and façade pacification that would absolve former coup plotters. The narrative concludes that Congress moves not by virtue but by calculation, and the roar of the streets is decisive.\n\nKey metrics cited: 100 000 protesters in 1968; more than 1 million at the Praça da Sé rally; 21 years of dictatorship (1964‑1985); 1 January 2023 inauguration; 8 January 2024 coup attempt; 21 September 2025 protests.\n\nNotable quotes from the article (single‑quoted as requested): 'o ronco das ruas', 'PEC da Bandidagem', 'PEC da Blindagem', 'AI‑5', 'golpe dentro do golpe', 'Diretas Já', 'Constituição Cidadã', 'ronco das ruas', 'Constituição Cidadã', 'ronco das ruas', 'ronco das ruas', 'ronco das ruas'.\nOriginal language: pt\nPublish date: September 25, 2025 11:27 PM\nSource:[Brasil 247](https://www.brasil247.com/blog/o-ronco-das-ruas-o-enterro-da-pec-da-blindagem-e-o-8-de-janeiro)\n\n**Minister of Labor says government supports ending 6x1 schedule and defends 'pressure' on Congress**\nThe Brazilian Minister of Labor, Luiz Marinho, said on September 25, 2025 that ending the 6‑day work schedule (6x1) will only succeed if the National Congress is subjected to 'muita pressão' (heavy pressure). He supports ending 6x1 and cutting the weekly work hour from 44 to 40. Marinho cited the successful street mobilization that led to the archiving of the PEC of blindagem as an example of pressure. In February, Deputy Erika Hilton (PSOL‑SP) introduced a constitutional amendment to reduce the maximum weekly work time to 36 hours over four days. A Quaest survey found that 70 % of federal deputies oppose ending 6x1. Marinho warned that without pressure, the measure will not pass and urged voters to consider candidates’ positions on 6x1 when voting next year.\nOriginal language: pt\nPublish date: September 25, 2025 01:53 PM\nSource:[globo.com](https://g1.globo.com/politica/noticia/2025/09/25/ministro-do-trabalho-diz-que-governo-apoia-fim-da-escala-6x1-e-defende-pressao-sobre-o-congresso.ghtml)\n\n**Minister of Labor Calls for End of 6x1 Schedule and Urges Congress**\nThe Brazilian Minister of Labor and Employment, Luiz Marinho, appeared on the EBC program 'Bom Dia, Ministro' on September 25, 2025, to argue for ending the 6x1 work schedule and reducing the weekly work hours from 44 to 40. He said, 'Eu defendo que reduza para 40 horas semanais, saindo das 44 horas semanais. E defendo que se encontre um jeito de acabar com a escala 6x1', and emphasized that the decision ultimately depends on the National Congress. Marinho urged the public to mobilize and pressure legislators, stating, 'Se tiver uma mobilização dirigida, com massa, com vigor, de rua, é possível que o Congresso Nacional venha atender esse clamor da classe trabalhadora'. He added that a collective agreement would be needed to maintain economic activity, but it would require congressional authorization to ban the 6x1 schedule. The interview was conducted by Fabio Rodrigues-Pozzebom for Agência Brasil.\nOriginal language: pt\nPublish date: September 25, 2025 12:33 PM\nSource:[Home](https://odia.ig.com.br/economia/2025/09/7135035-ministro-do-trabalho-defende-fim-da-escala-6x1-e-pede-pressao-ao-congresso.html)\n\n**Working less and better? 'Few companies experiment with a four‑day week, but when they do, most don't want to go back'**\nThe article discusses the growing interest in reducing working hours worldwide, focusing on Brazil and Portugal. In Brazil, the campaign against the \"escala 6x1\"—a schedule where workers work six days a week and have only one day off—has sparked street protests and prompted congressional debate, as the article states that \"milhares [people] went to the streets in protest and mobilized deputies in Congress.\" In Portugal, the debate centers on creating a healthier work‑life balance by cutting weekly hours and implementing a four‑day work week. The article notes that this issue was part of the Livre party’s electoral platform and had already been on the agenda of the XXIII Constitutional Government led by António Costa in 2023. It also highlights that Portuguese workers often exceed the 40‑hour limit set by Law No. 7/2009 of the Labor Code, with the article explicitly mentioning \"acima das 40 horas permitidas pela Lei nº 7/2009 do Código do Trabalho.\" These points illustrate the broader context of labor reforms and the push for more flexible working arrangements.\nOriginal language: pt\nPublish date: September 09, 2025 04:14 PM\nSource:[Jornal Expresso](https://expresso.pt/revista/fisga/2025-09-09-trabalhar-menos-e-melhor--poucas-empresas-experimentam-a-semana-de-quatro-dias-mas-quando-o-fazem-a-maior-parte-nao-quer-voltar-atras-398d5ec2)\n\n**Life Beyond Work: Ending the 6×1 Schedule Revives Brazil's Historical Struggle**\nThe article discusses the Brazilian proposal to abolish the 6×1 work schedule, a system that has been criticized for overworking employees. According to the International Labour Organization, the average weekly working hours in Brazil in 2023 were 39, lower than India (47), China (46) and Mexico (44), but higher than Germany (34), Australia (32) and Canada (32). The piece cites several stakeholders: deputy Bella Gonçalves (Psol) said, 'A luta pelo fim da escala 6×1 é uma pauta muito importante do mundo do trabalho… talvez seja a primeira vez em muitos anos que uma pauta positiva ganha uma expressão e um debate público que chega praticamente em todas as pessoas'; economist Frederico Melo of Dieese explained that sectors such as agriculture, construction and commerce have the highest 40‑hour‑plus workloads and that the change would not lead to layoffs, calling the business argument a 'falácia'; CUT‑MG president Jairo Nogueira highlighted the intensification of the 6×1 schedule after the 2017 labor reform and noted that countries like Iceland, Belgium and the UK already test four‑day weeks. The article also reports that Dieese’s April bulletin found the 2017 reform spread the 12×36 schedule and promoted intermittent work, which disrupts social life and professional development. Workers such as Lucas Sidrach of the Vida Além do Trabalho movement argue that the current schedule hampers family life and mental health, while deputy Beatriz Cerqueira (PT) posted on social media: 'Sim, existe vida além do trabalho… a luta de classes é a matriz de todas as demais lutas'. The piece lists several legislative proposals in Congress, including a bill led by deputy Erika Hilton (Psol) to reduce the weekly workweek from 44 to 36 hours without pay cuts, and other proposals by senators Weverton Rocha (PDT/MA), Paulo Paim (PT/RS) and Reginaldo Lopes (PT/MG).\nOriginal language: pt\nPublish date: September 04, 2025 04:37 PM\nSource:[Brasil de Fato](https://www.brasildefato.com.br/2025/09/04/vida-alem-do-trabalho-fim-da-escala-6x1-reacende-luta-historica-do-povo-brasileiro/)\n\n**PEC Proposal to End 6×1 Scale Must be Presented within 90 Days**\nThe report on the Proposed Constitutional Amendment (PEC) that proposes the end of the 6×1 scale must be presented within 90 days, according to Deputy Luiz Gastão (PSD-CE), rapporteur of the subcommittee that will analyze the working hours in Brazil. The committee was installed on Tuesday (19) and will be linked to the Labor Committee of the Chamber. The plan includes public hearings to hear from entrepreneurs, workers, university professors, and government representatives before the elaboration of the opinion. The intention is for the text to be later discussed in the Constitutional and Justice Commission (CCJ). 'We will evaluate which sectors still adopt the 6×1 scale and what effects this change would have,' Gastão said. The proposal also provides for the adoption of a 4×3 schedule (four days of work and three days of rest) and the limitation of weekly working hours to 36 hours, without exceeding eight hours a day. Currently, the Constitution allows up to 44 hours a week. According to the work plan disclosed by the parliamentarian, the subcommittee seeks to consolidate a consensual text that guarantees balance between worker protection, business viability, and public account sustainability. The initiative of the PEC came from the Vida Além do Trabalho movement and has popular support from over 3 million signatures. The proposal had been postponed in 2024, when it depended on analysis by the CCJ, then led by the PL. Now, with the protocol effective, it will be up to the collegiate to evaluate the constitutionality of the measure. If it advances, the PEC may profoundly change the organization of working hours in Brazil, reducing formal working hours and expanding rest time for workers.\nOriginal language: pt\nPublish date: August 20, 2025 02:00 PM\nSource:[Jovem Pan – Esportes, entretenimento, notícias e vídeos com credibilidade](https://jovempan.com.br/noticias/economia/relatorio-da-pec-que-propoe-fim-da-escala-6x1-deve-ser-apresentado-em-ate-90-dias.html)\n\n**Reduzir jornada por lei não garante emprego nem qualidade de vida**\nThe debate about the 6x1 shift schedule has gone beyond social media and reached the National Congress. The mobilization, which started spontaneously and gained strength among workers and experts, resulted in the Proposed Amendment to the Constitution (PEC) 8/2025, which proposes to prohibit this model of shift and establish a four-day workweek. However, the discussion about the shift schedule should not be seen as a simple dilemma between maintaining or abolishing the 6x1 schedule. It is necessary to evaluate the possibility of flexibility and negotiation between employers and employees, seeking solutions that respect workers' rights and the need for the labor market to adapt. According to historian data, reducing the work hours does not generate jobs, and in fact, the Brazilian productivity is one of the worst in the world, which would make it difficult for the country to compete externally. The justification that reducing work hours without reducing salaries would boost the Brazilian economy and reduce inequalities is an utopia. The data shows that no reduction in work hours has generated jobs, and the reduction of work hours does not guarantee an increase in quality of life. The approval of the PEC 8/2025 could lead to a wave of judicializations, with relevant impacts on labor law, economy and society.\nOriginal language: pt\nPublish date: August 05, 2025 11:35 AM\nSource:[Gazeta do Povo](https://www.gazetadopovo.com.br/opiniao/artigos/reduzir-jornada-por-lei-nao-garante-emprego-nem-qualidade-de-vida/)\n\n**Redução da jornada e fim da escala 6×1 serão debatidos em evento das centrais sindicais em Porto Alegre**\nThe central unions are promoting an event in Porto Alegre on Monday (4) to discuss the proposal to reduce the working day without cutting salaries and the end of the 6×1 schedule. The activity is part of the national mobilization in support of the Proposal of Constitutional Amendment (PEC) 148/2015, authored by Senator Paulo Paim (PT/RS), which proposes a gradual reduction of the weekly workload from 44 to 36 hours. According to Paim, the measure can generate millions of jobs and improve the quality of life of the working class. A study by the Dieese points out that the change can create around 3 million new jobs immediately. Paim also states that in 19 companies that tested the new model, one of them recorded a growth of almost 15% in revenue and productivity in 2024. 'This measure is fundamental, not only to increase free time and the quality of life of workers, but also to create jobs and promote better living conditions,' Paim explains. The deputy federal Daiana Santos (PCdoB) will also bring her Project of Law nº 67/2025 to the debate, which proposes a reduction of the weekly working day to 40 hours and the end of the 6×1 schedule, with the guarantee of two consecutive days of remunerated rest per week. Santos defends that the reduction of the working day is a social justice and valuation of the working people agenda. She cites the example of developed countries like Belgium, Germany and Norway, which have adopted shorter working hours for years, understanding that rested and healthy workers are also more productive and contribute to economic growth. 'This is exactly the differential of our PL 67/2025, a possible project to be applied in the short term, with responsibility,' she highlights, recalling that the proposal has already received support from the Minister of Labor, Luiz Marinho, who recognized its viability.\nOriginal language: pt\nPublish date: August 01, 2025 07:54 PM\nSource:[Brasil de Fato](https://www.brasildefato.com.br/2025/08/01/reducao-da-jornada-e-fim-da-escala-6x1-serao-debatidos-em-evento-das-centrais-sindicais-em-porto-alegre/)\n\n**Lula Defends Proposal to End 6x1 Work Schedule in Brazil**\nBrazilian President Luiz Inácio Lula da Silva has defended the proposal to end the 6x1 work schedule in Brazil, which has been criticized by some for being too rigid. Lula stated, 'The humanity does not want 6x1 anymore, we need to find a way to have a more flexible work schedule. This was an extraordinary thing in my time, but today's youth does not want this anymore. We will try to present a new way of working in this country, so that we can guarantee more mobility for people.' A survey by the Instituto de Economia da Unicamp found that 37% of workers with a formal contract would benefit directly from the reduction of the work schedule, while 38% of the occupied population, mostly informal workers with a work schedule above 36 hours a week, would be indirectly affected. The proposal to end the 6x1 schedule is supported by 64% of Brazilians, according to a Datafolha survey from December 2024. However, some business entities and trade unions have expressed concerns that the reduction of the work schedule could lead to increased costs for companies, higher prices for products and services, and negative effects on the competitiveness of small and medium-sized enterprises.\nOriginal language: pt\nPublish date: July 11, 2025 08:48 PM\nSource:[Folha de S.Paulo](https://www1.folha.uol.com.br/mercado/2025/07/lula-critica-jornada-6x1-e-diz-que-quer-discutir-assunto-com-empresarios-e-sindicalistas.shtml)\n\n**PT Proposes New Bill to End 6×1 Work Schedule and Reduce Working Hours**\nThe Workers' Party (PT) has submitted a new bill (PL) to the Brazilian Congress, aiming to abolish the 6×1 work schedule and reduce the weekly working hours from 44 to 36 hours without any salary reduction. According to PT members, a quorum of votes for a bill is easier to achieve than the 308 votes required to pass a Constitutional Amendment (PEC). A similar proposal was previously presented by Érika Hilton (PSol-SP) and Reginaldo Lopes (PT-MG), but none of them have advanced in the Chamber of Deputies due to strong resistance from parliamentarians who believe that reducing working hours would harm employers and the economy. The PT's proposal includes the following points: the inclusion of travel time as part of the working hours for jobs with difficult access or no public transportation; flexibility in negotiating time off for small and micro businesses; a maximum of two hours of overtime per day with special protection for pregnant and breastfeeding women; and the possibility of 12-hour shifts followed by 36 hours of rest for security and health professionals, as long as it is negotiated through a collective labor agreement. The PT justifies the measure by citing a survey that found 72% of Brazilians are stressed at work, and that in 2022, over 209,000 people were absent from work due to mental health issues. As stated by the PT, 'the time has come to rethink the way we work and prioritize the well-being of workers.'\nOriginal language: pt\nPublish date: July 03, 2025 04:00 AM\nSource:[A Rede](https://arede.info/cotidiano/581419/bancada-do-pt-propoe-novo-projeto-pelo-fim-da-escala-de-trabalho-61)\n\n**PT Proposes Bill to End 6x1 Work Schedule and Reduce Work Hours**\nThe Workers' Party (PT) has submitted a bill (PL) to the Brazilian Congress, proposing to end the 6x1 work schedule and reduce the weekly work hours from 44 to 36 hours without reducing salaries. According to PT, it is easier to pass a bill with a quorum of votes than a Constitutional Amendment (PEC), which requires 308 votes. A PEC on the same topic was presented by Érika Hilton (PSol-SP) earlier this year, and another proposal by Reginaldo Lopes (PT-MG) also exists. However, no proposal to reduce work hours has advanced in the Chamber of Deputies due to strong resistance from parliamentarians, who believe that reducing work hours would harm employers and the economy. The PT justifies the measure, citing a survey that found 72% of Brazilians are stressed at work, and in 2022, over 209,000 people were absent from work due to mental health issues, according to the text submitted by the PT.\nOriginal language: pt\nPublish date: July 02, 2025 07:28 PM\nSource:[Metrópoles](https://www.metropoles.com/brasil/bancada-do-pt-propoe-novo-projeto-pelo-fim-da-escala-de-trabalho-6x1)\n\n**PT Proposes Bill to Reduce Workweek to 36 Hours and End 6×1 Shift Schedule**\nThe PT (Workers' Party) faction in the Brazilian Chamber of Deputies has presented a bill to reduce the weekly workweek from 44 to 36 hours, without reducing salaries, and to end the 6×1 shift schedule, which requires six consecutive days of work followed by one day of rest. The proposal also includes changes to the calculation of overtime, the definition of intraday breaks, and the treatment of travel time for workers with difficult access to their workplaces or no public transportation. According to the faction's press office, the initiative will be accompanied by a dialogue with the federal government to discuss the possibility of sending a similar bill to Congress in an urgent constitutional manner. The PT faction argues that, from a legal standpoint, it is not necessary to amend the Constitution to modify the 6×1 shift schedule, as the article 7 of the Constitution only establishes a minimum of labor rights, and the 6×1 schedule is established in the Consolidation of Labor Laws (CLT), not in the Constitution. As such, a regular law can modify this regime, as long as it benefits the worker. There are two other initiatives in the works that address the same topic: PEC 221/2019, proposed by Reginaldo Lopes (PT-MG), and PEC 08/2025, proposed by Erika Hilton (PSOL-SP).\nOriginal language: pt\nPublish date: July 02, 2025 06:33 PM\nSource:[Brasil 247](https://www.brasil247.com/brasil/pt-protocola-projeto-para-reduzir-jornada-de-trabalho-para-36-horas-e-acabar-com-escala-6-1-tqu4avnm)\n\n**Goiás Divided: Politicians, Workers, and Businessmen Weigh In on the 6x1 Work Schedule**\nA proposed amendment to the Brazilian Constitution, PEC 8/2025, aims to end the traditional 6x1 work schedule, which requires workers to work six consecutive days and rest only one. The proposal, presented by federal deputy Erika Hilton, seeks to guarantee at least two days of weekly rest to improve the physical and mental health of millions of Brazilians. According to a survey by the Instituto Locomotiva, 57% of the population supports the end of the 6x1 schedule. In Goiás, the debate has also moved to local politics. State deputy Bia de Lima is in favor of the change, emphasizing that more rest time is essential, especially for women who work double shifts with domestic work and family care. On the other hand, state deputy Amauri Ribeiro is against the change, arguing that it may harm the economy. This concern is shared by the Associação Comercial, Industrial e de Serviços do Estado de Goiás (Acieg), which sees the proposal as a risk of increased costs and loss of competitiveness for companies. The Central Única dos Trabalhadores (CUT) defends that a rested worker produces more, gets sick less, and that the change would be positive for health and productivity in general, as said, 'um trabalhador descansado rende mais, adoece menos e que a mudança seria positiva para a saúde e a produtividade no geral'.\nOriginal language: pt\nPublish date: June 30, 2025 09:19 PM\nSource:[Jornal Opção](https://www.jornalopcao.com.br/ultimas-noticias/politicos-trabalhadores-e-empresarios-escala-6x1-divide-opinioes-em-goias-721345/)\n\n",
    "date": "2025-09-28T01:14:00.678098",
    "summary": "All eight experts forecast a low probability that Brazil will officially ban the 6x1 work schedule for most CLT workers before January 1, 2026, with final probability estimates tightly clustered between 7% and 8%. The experts converge on several key reasons: (1) There is overwhelming resistance in the National Congress, with about 70% of deputies opposed to banning the 6x1 work schedule, as evidenced by recent surveys and the stalled progress of both constitutional amendments (PECs) and ordinary bills. (2) Although President Lula, the Labor Minister, unions, and some left-wing parties strongly support the reform, executive and ministerial advocacy is not sufficient without massive street mobilization, which so far lacks the scale required to force rapid congressional action. (3) The legislative calendar is highly constricted, with only three months left before the deadline and a traditionally slow end-of-year session, making expedited passage of a complex labor reform extremely difficult. (4) Business interests and employer lobbies exert strong pressure against the ban, citing economic risks, costs, and competitiveness, which further entrench opposition in Congress. (5) The historical base rate for major labor reforms in Brazil is very low, particularly those that increase worker protections against organized business resistance, and most such reforms have taken years to pass. While all acknowledge the potential for a dramatic, last-minute surge in public mobilization to alter the political calculus (as with the rapid archiving of the PEC da Blindagem amid mass protest), they see little current evidence of such a groundswell emerging for the 6x1 issue, and note that the existing plebiscite and protests are significant but not unprecedented in scale. A 'Yes' outcome is conceivable only in the event of extraordinary and rapid political upheaval. Consequently, all experts judge a 'No' outcome—no ban enacted before January 2026—as strongly favored.",
    "forecasters": [
        "Employment Relations (ILO Conventions)",
        "Employment Relations (Industrial Relations Systems)",
        "Legislative Affairs (Brazilian Legislative Process)",
        "Labor Law (Comparative Labor Law)",
        "Labor Law (Brazilian Labor Code CLT)",
        "Political Science (Public Policy Process)",
        "Political Science (Institutionalism)",
        "Latin American Studies (Brazilian Political Economy)"
    ]
}