{
    "deliberation_results": {
        "Nonprofit Operations (Human Resources Metrics Nonprofit Sector)": {
            "time_to_resolution": "Approximately 2.5 months (resolves at the end of 2025, forecast date is mid-October 2025)",
            "perspective_relevance": "As an expert in Nonprofit Operations and Human Resources Metrics in the nonprofit sector, I provide insight into the operational realities, staffing trends, and growth trajectories typical for small, early-stage nonprofits with a policy or longtermist focus. I can contextualize the likelihood of the Simon Institute for Longterm Governance (SI) expanding its full-time team based on sectoral patterns, funding sources, and the unique challenges such organizations face.",
            "status_quo": "The Simon Institute for Longterm Governance has typically operated with a small team; as of 2024, available public info suggested 2–3 full-time staff, with additional part-time or contract support. The status quo for new, specialized nonprofits—especially those in policy or longtermist work—is to remain lean unless significant funding or project expansion occurs.",
            "perspective_derived_factors": [
                {
                    "factor": "Sector Base Rate for Staffing Growth",
                    "effect": "Decreases probability. Nonprofits in the policy/longtermist space, especially in Europe, often remain at 1–3 FTEs for several years unless they receive significant unrestricted funding or win large grants."
                },
                {
                    "factor": "Recent Funding/Grant Announcements",
                    "effect": "Neutral to slightly increasing, but no recent evidence publicly available suggests a major new grant or expansion."
                },
                {
                    "factor": "Organizational Activity/Visibility",
                    "effect": "Neutral. There is no recent surge in public activity, hiring announcements, or major new projects that would require a swift increase in staff."
                },
                {
                    "factor": "Nonprofit Sector Labor Market Dynamics",
                    "effect": "Slightly decreases probability. The labor market for nonprofits in 2025 is tightening, with organizations cautious about new hires; overhead and FTE growth are often constrained by funder expectations."
                },
                {
                    "factor": "Abandonment Risk",
                    "effect": "Minimally decreases probability. If the project were abandoned, the answer would default to No. However, there is no indication of abandonment, so this is a low-weight negative."
                },
                {
                    "factor": "Resolution Criterium Strictness (35h/week, no volunteers)",
                    "effect": "Decreases probability. Some organizations inflate FTE equivalents by including part-time or volunteer labor, but the resolution criteria here are strict: only genuine full-time, paid (not volunteers) staff count."
                }
            ],
            "no_scenario": "The Simon Institute maintains its current size (2 or fewer FTEs) due to stable but limited funding, a lack of major grants, or a strategic decision to remain small and project-focused. Alternatively, a combination of part-time, project-based, or volunteer staff fill gaps, but the FTE count never exceeds 2. Or, the organization is abandoned or becomes inactive before year-end.",
            "yes_scenario": "The Institute secures a new, large grant or enters a partnership requiring a staff increase, leading to the hire of a third (or more) full-time, paid employee(s) working at least 35 hours per week. This could be driven by new projects, increased operational needs, or scaling up for impact, with clear public evidence (team page, reports, etc.) of more than two FTEs by end of 2025.",
            "final_reasoning": "Given the nonprofit sector's base rates for similarly sized and focused organizations, the lack of recent evidence of expansion, and the strictness of the resolution criteria, the default outcome is that SI will have two or fewer full-time staff at the end of 2025. While last-minute grant wins are possible in this sector, there is no public sign of such developments. The labor market remains cautious, and funder expectations continue to constrain rapid hiring. Unless a significant shift occurs in the next two months—a relatively short time frame—expansion beyond two FTEs is unlikely. The probability is thus weighted strongly toward No, but not at the extreme, as small organizations occasionally do surprise with rapid staff increases late in the year.",
            "final_probability": 18
        },
        "Nonprofit Operations (Funding Diversification Practices)": {
            "time_to_resolution": "Approximately 2.5 months (resolves end of 2025, today is 2025-10-14)",
            "perspective_relevance": "As an expert in Nonprofit Operations with a focus on funding diversification, I bring insight into the employment dynamics of small, grant-funded organizations like the Simon Institute for Longterm Governance (SI). My expertise allows me to assess the structural, financial, and operational tendencies that influence whether such organizations expand, contract, or maintain staff levels based on funding, mission demand, and sectoral trends.",
            "status_quo": "The Simon Institute for Longterm Governance is a small nonprofit, historically operating with a modest staff. As of 2024, it reportedly had 2-3 full-time equivalents (FTEs). In the absence of significant new funding or a major shift in strategy, the status quo would be for SI to remain at or just above/below the 2-FTE threshold, making any change gradual.",
            "perspective_derived_factors": [
                {
                    "factor": "Funding Diversification and Grant Pipeline",
                    "effect": "Nonprofits with multiple, ongoing funding sources are more likely to expand staff. If SI has not succeeded in diversifying or increasing its grant pipeline, hiring is less likely."
                },
                {
                    "factor": "Longtermist Movement Trends",
                    "effect": "The Effective Altruism/longtermism funding ecosystem (Open Phil, FTX fallout, etc.) has experienced some contraction and increased scrutiny post-2022, making new hiring less likely unless SI stands out."
                },
                {
                    "factor": "Organizational Age and Trajectory",
                    "effect": "Newer orgs typically grow in their first years, but growth tapers as they mature without a step-change in mission or funding. SI, founded in 2021, may be plateauing in staff size barring a major development."
                },
                {
                    "factor": "Sectoral Demand for Policy Engagement",
                    "effect": "If there is increased global demand for policy work on longterm governance (e.g., AI, climate), SI might grow. However, there is no public evidence of a surge in SI's prominence or policy contracts."
                },
                {
                    "factor": "Cost Management and Operational Efficiency",
                    "effect": "Small nonprofits often cap staff at 2-3 FTEs to stay lean, using contractors or fellows for flexibility, especially when budget growth is uncertain. Unless SI has a strong reason, rising above 2 FTEs is a notable threshold."
                },
                {
                    "factor": "Absence of Recent Public Announcements",
                    "effect": "No recent news or major announcements about SI expansion, hiring, or large new projects suggests continued modest scale."
                }
            ],
            "no_scenario": "The SI continues operations with 2 or fewer full-time staff, relying on part-time contractors, collaborators, or volunteers. Funding remains flat or grows only enough to sustain current staff, and the organization avoids the risk of overextension amidst uncertain longtermist funding. No new major grants or initiatives are announced. The project is not abandoned, but remains small.",
            "yes_scenario": "The SI secures one or more significant new grants, a major project partnership, or contract work, enabling it to expand to 3+ FTEs. Alternatively, a surge in policy relevance or sectoral demand (e.g., a key global governance initiative) drives hiring. Publicly available information, annual reports, or staff listings confirm over two FTEs by the end of 2025.",
            "final_reasoning": "The base rate for small, new nonprofits remaining at or under 2 FTEs within 4 years of founding is high unless there is clear evidence of new funding or expanded mission. The longtermist funding space is more constrained post-FTX, and there are no public signs of SI's rapid growth or new major projects. Most nonprofit growth is incremental, and the lack of recent news is telling. However, the possibility of a late-year (Q4) grant or partnership cannot be entirely dismissed, and orgs sometimes scale up in response to sectoral trends. Still, weighing status quo, sectoral headwinds, and lack of evidence of expansion, I assess the probability SI will have more than two FTEs at the end of 2025 as below even odds, but not negligible.",
            "final_probability": 27
        },
        "Strategic Management (Scenario Planning)": {
            "time_to_resolution": "Approximately 2.5 months (until December 31, 2025)",
            "perspective_relevance": "As a scenario planning and strategic management expert, I focus on how small organizations evolve, the mechanisms of institutional growth, and the factors that facilitate or hinder organizational scaling in mission-driven nonprofits, especially those in the longtermist or effective altruism (EA) ecosystem. Scenario planning allows for the structured assessment of drivers, base rates, and the interplay of external and internal forces that typically shape the headcount trajectories of small, impact-oriented think tanks.",
            "status_quo": "The Simon Institute for Longterm Governance (SI) is a small, specialized organization operating at the intersection of research, policy, and longtermist advocacy. Historically, most such organizations within the EA/longtermist space have slow staff growth due to funding constraints, mission-specific roles, and the tendency to use contractors or part-time employees. If nothing changes, SI would likely maintain its headcount at or below two full-time employees.",
            "perspective_derived_factors": [
                {
                    "factor": "Base Rate of Similar Organizations",
                    "effect": "Decreases probability. Most new EA-aligned policy orgs plateau at 1-2 FTEs for years due to funding caution, founder-centric work, and a preference for flexible staffing models."
                },
                {
                    "factor": "Funding Environment (2024-2025)",
                    "effect": "Decreases probability. The 2022-2024 EA/longtermist funding environment has been tighter (e.g., FTX collapse, Open Philanthropy shifting priorities). Without a recent major grant or public hiring announcement, expansion is unlikely."
                },
                {
                    "factor": "Strategic Clarity and Niche",
                    "effect": "Neutral to slightly positive. SI's focus on policy engagement with international governance could justify growth if policy windows or partnerships open, but absent concrete evidence, this is a minor positive at best."
                },
                {
                    "factor": "Operational Transparency and Public Reporting",
                    "effect": "Decreases probability. SI's limited recent public updates and hiring signals suggest no rapid scaling. Most orgs with >2 FTEs announce hires or seek visibility for accountability/funding."
                },
                {
                    "factor": "Project Abandonment/Organizational Survival",
                    "effect": "Neutral. There is no evidence of explicit abandonment, so the resolution will likely depend on employee count rather than dissolution."
                },
                {
                    "factor": "Macro Trends in Nonprofit Hiring (2025)",
                    "effect": "Neutral to slightly negative. Global macroeconomic and nonprofit sector data show tepid hiring; smaller orgs remain risk-averse."
                }
            ],
            "no_scenario": "SI maintains two or fewer full-time employees as of December 31, 2025. This could result from deliberate headcount restraint due to funding uncertainty, a project-based model relying on contractors or part-timers, or slow organizational growth typical of small policy nonprofits. There are no public records or announcements of new hires, and their website/team page lists two or fewer FTEs.",
            "yes_scenario": "SI secures a significant new grant in late 2024 or 2025, undertakes a major new project, or enters into a high-profile partnership that necessitates hiring additional permanent staff. Public documentation (reports, website updates, or Metaculus moderator investigation) verifies three or more FTEs by year-end.",
            "final_reasoning": "The base rate for similar organizations is low: most new, specialized EA/longtermist policy orgs do not exceed two FTEs within their first 3-5 years. The absence of public hiring signals, major funding news, or evidence of recent expansion at SI further supports the default scenario of two or fewer FTEs. EA/longtermist funding is relatively constrained, and macro context provides little impetus for sudden hiring sprees. While a positive shock (e.g., major grant) could drive rapid headcount growth, there is no evidence of such an event as of October 2025. Thus, the probability of SI having more than two FTEs at end-2025 is low.",
            "final_probability": 13
        },
        "Strategic Management (Balanced Scorecard)": {
            "time_to_resolution": "Approximately 2.5 months (question presumed to resolve at year-end 2025, today is October 14, 2025)",
            "perspective_relevance": "As an expert in Strategic Management and Balanced Scorecard, I evaluate organizational sustainability, resource allocation, and capacity for growth using multidimensional performance measurement. The Balanced Scorecard approach emphasizes not only financial viability, but also internal processes, learning and growth, and stakeholder engagement, all of which are crucial for small mission-driven organizations like the Simon Institute for Longterm Governance (SI-LG) in determining their ability to maintain or surpass a staff threshold.",
            "status_quo": "As of the last publicly available information (late 2024/early 2025), the SI-LG had two full-time employees, with its workforce fluctuating between 2 and 3 FTEs over recent years. The default scenario is that it remains at or below this level, given the size and historical trend of small, longtermist-focused nonprofits.",
            "perspective_derived_factors": [
                {
                    "factor": "Financial Sustainability",
                    "effect": "Decreases probability. The longtermist philanthropic space has become more selective, and funding for small EA-aligned policy institutions has stagnated or declined after 2022–2023, especially for new or niche organizations. Without evidence of a significant new grant or revenue stream, expansion is unlikely."
                },
                {
                    "factor": "Mission-Driven Talent Retention and Growth",
                    "effect": "Neutral to slightly positive. The SI-LG’s mission aligns with a highly motivated talent pool, but the specialized nature of its work (policy interface, longterm governance) narrows the candidate field, making rapid staff expansion harder."
                },
                {
                    "factor": "Stakeholder and Donor Engagement",
                    "effect": "Decreases probability. There are no recent news articles or press releases indicating major new partnerships, projects, or donor interest in SI-LG in 2025. Balanced Scorecard logic would expect more stakeholder communication if a growth phase were underway."
                },
                {
                    "factor": "Sector Base Rate for Staff Growth",
                    "effect": "Decreases probability. Most comparable small policy think tanks and effective altruism spinoffs do not surpass 2-3 FTEs within 5 years unless they receive a major funding boost or merge with larger institutions."
                },
                {
                    "factor": "Evidence of Project or Program Expansion",
                    "effect": "Neutral. There is no direct evidence of significant programmatic expansion by SI-LG in 2025 that would necessitate additional full-time hires."
                }
            ],
            "no_scenario": "SI-LG maintains current operations with 2 or fewer FTEs, potentially relying on part-time staff, volunteers, or consultants to handle project surges, but does not secure the resources or mandate to add a third full-time employee. Possible factors include flat or declining funding, lack of new large-scale projects, or a strategic decision to remain small and flexible.",
            "yes_scenario": "SI-LG secures a major new grant, launches a significant policy initiative, or partners with a larger institution, necessitating the hiring of at least a third full-time staff member. Alternatively, an uptick in philanthropic giving to longtermist or governance-focused organizations in late 2025 enables team growth.",
            "final_reasoning": "The Balanced Scorecard perspective highlights the importance of multidimensional health—financial, operational, stakeholder, and learning/growth. The current external environment for small nonprofits in the EA/longterm governance niche is challenging, with little evidence of new funding or expansion activity for SI-LG. The base rate for organizations of this type and age is to remain at or below 2 FTEs absent a step-change in resources or mission. The absence of recent public communications, project launches, or funding announcements further supports the continuation of the status quo. Therefore, the probability that SI-LG will have more than two full-time employees at any point in 2025 is relatively low, though not negligible—there is always a chance of a late-year grant or partnership. I estimate the likelihood at 25%.",
            "final_probability": 25
        },
        "Organizational Studies (Organizational Life Cycle Theory)": {
            "time_to_resolution": "Approximately 2.5 months until the end of 2025.",
            "perspective_relevance": "As an expert in Organizational Studies (Organizational Life Cycle Theory), my analysis is grounded in how new non-profit institutions typically progress from inception through growth, stability, and potential decline. This theoretical framework allows me to assess the likelihood that the Simon Institute for Longterm Governance (SI) has achieved the organizational maturity and resource stability necessary to sustain or grow its full-time staff beyond two employees by late 2025. I bring to bear knowledge of typical growth trajectories, resource dependencies, and institutionalization patterns for mission-driven, grant-funded organizations.",
            "status_quo": "At the time of question opening in 2021, SI was a recently launched organization with a small staff and emerging operational structure. Absent major shocks, most new non-profits of this type remain small, with 1–2 full-time staff for several years; only a minority reach the threshold of more than two full-time employees within four years.",
            "perspective_derived_factors": [
                {
                    "factor": "Organizational Life Cycle Progression",
                    "effect": "The probability increases if SI has moved from the 'start-up' to the 'growth' phase, typically marked by increased funding, programmatic expansion, and formalization of roles. However, many similar organizations plateau early and remain lean due to resource constraints."
                },
                {
                    "factor": "Resource Acquisition and Funding Stability",
                    "effect": "Probability increases if SI has secured multi-year grants or diversified funding streams. If funding remains project-based or unstable, hiring additional full-time staff is unlikely, as organizations often prefer flexible, contract, or part-time arrangements."
                },
                {
                    "factor": "Mission-Driven Staffing Patterns",
                    "effect": "Longtermist and policy-oriented organizations often operate with a core of 1–2 full-time staff, supplemented by volunteers, fellows, or part-time contractors to maintain flexibility and minimize overhead. This norm decreases the probability unless SI has a demonstrated need and resourcing for additional FTEs."
                },
                {
                    "factor": "External Indicators and Public Reporting",
                    "effect": "Absence of recent news about SI in the provided articles, and lack of evidence of major new initiatives or expanded institutional partnerships, decreases the probability that significant organizational growth (reflected in staff numbers) has occurred recently."
                },
                {
                    "factor": "Project Abandonment Risk",
                    "effect": "While the question will resolve negatively if the project has clearly been abandoned, there is no evidence of such abandonment. Still, the risk of stagnation and flatlining staff numbers remains a non-trivial base rate for small, young non-profits."
                }
            ],
            "no_scenario": "The Simon Institute for Longterm Governance remains operational but has not experienced significant growth. It retains 1–2 core full-time staff, with additional contributors (if any) working part-time, as fellows, or as volunteers. The organization has not secured new, large-scale funding or launched major projects that necessitate staff expansion, and it continues to operate in a lean, early-stage mode.",
            "yes_scenario": "SI has progressed through the early life cycle phase, landed significant new funding or strategic partnerships, and expanded its programmatic activities, necessitating hiring of a third or more full-time employees. This growth is publicly documented in organizational reports or confirmed by credible sources close to the organization.",
            "final_reasoning": "The most relevant base rate for organizations of SI's type and vintage is that the majority do not expand beyond two full-time staff within their first 4–5 years, especially in the absence of strong indicators of new funding or programmatic expansion. The absence of SI-specific mentions in recent news, or evidence of major initiatives, supports a conservative stance. Organizational Life Cycle Theory suggests that, absent clear signals of growth, the status quo is likely to persist. Mission-driven, grant-dependent think tanks often remain small and flexible unless they make a deliberate leap to institutional maturity, which typically is accompanied by public announcements, new funding, or major projects—none of which are evident here. While the risk of sudden growth or shrinkage cannot be ruled out, the preponderance of evidence and theory supports a negative resolution.",
            "final_probability": 30
        },
        "Organizational Studies (Resource Dependence Theory)": {
            "time_to_resolution": "Approximately 2.5 months (likely resolves by December 31, 2025)",
            "perspective_relevance": "As an expert in Resource Dependence Theory (RDT), I focus on how organizations interact with, secure, and control critical resources—including funding, talent, and legitimacy—in their environment. For a small, mission-driven think tank like the Simon Institute for Longterm Governance (SILG), RDT offers a framework to evaluate their ability to grow or sustain staffing based on access to external support, network ties, legitimacy, and the competitive landscape for resources.",
            "status_quo": "The status quo for small, recently launched policy institutes (especially in the effective altruism/longtermism sphere) is to operate with a skeleton staff, often 1–2 FTE, unless they secure significant new funding or partnerships. Most similar organizations remain at this scale for years, unless a catalytic event or major grant occurs.",
            "perspective_derived_factors": [
                {
                    "factor": "Resource Acquisition (Funding)",
                    "effect": "Increases probability if SILG has secured new, ongoing funding or major grants; decreases probability if dependent on short-term, project-based or donor-volatile funding. Institutes with stable, growing budgets are more likely to hire additional full-time staff."
                },
                {
                    "factor": "Environmental Legitimacy and Network Connections",
                    "effect": "Increases probability if SILG has built strong relationships with funders, governments, or influential longtermist organizations, which can facilitate both legitimacy and referrals for staff and program expansion. Decreases probability if SILG remains isolated or if the longtermist field faces reputational setbacks."
                },
                {
                    "factor": "Mission Fit and Niche Competition",
                    "effect": "Decreases probability if the niche is crowded with similar organizations competing for limited funds and attention, or if their mission overlaps with larger, better-funded entities. Increases probability if SILG has a unique, recognized niche or has demonstrated impact, making it a preferred target for support."
                },
                {
                    "factor": "Organizational Age and Growth Trajectory",
                    "effect": "Neutral to slightly increases probability, as organizations 3–5 years post-launch often face a critical inflection point—either growing past founder-scale or plateauing. Base rates suggest most remain small, but some expand if they pass this threshold with momentum."
                },
                {
                    "factor": "Labor Market and Hiring Environment",
                    "effect": "Slightly decreases probability in 2025 due to a tightening labor market for nonprofits and think tanks, especially in Europe, as competition for talent and rising salary expectations make expansion harder without strong financials."
                },
                {
                    "factor": "Abandonment or Downsizing Risk",
                    "effect": "Decreases probability if there are signs of program wind-down, founder departure, or reduced activity, which is not uncommon in small, grant-dependent organizations."
                }
            ],
            "no_scenario": "SILG continues operating with 1–2 FTEs, possibly supplemented by part-time staff or volunteers, due to flat or declining funding, inability to differentiate itself in a crowded field, or lack of major new grants. No public announcements of organizational wind-down, but also no significant expansion. Alternatively, SILG becomes dormant or is abandoned, leading to a negative resolution.",
            "yes_scenario": "SILG announces or reports >2 FTEs on its website, in annual reports, or in public communications. This expansion is driven by new multi-year funding, a successful grant, or a strategic partnership that enables hiring beyond the founding team. The organization moves from start-up phase into a more established, growing institution.",
            "final_reasoning": "The base rate for small, recently founded think tanks in the longtermist/EA space growing to >2 FTE within 3–4 years is modest—most remain founder-driven with 1–2 staff unless they secure a major funding breakthrough. There is no direct evidence in the provided news of SILG's recent expansion, large grants, or high-profile partnerships. Broader sectoral news points to competitive resource environments, labor market constraints, and no major windfall for similar organizations. No signals suggest abandonment, but neither is there evidence for clear growth. As RDT predicts, absent a shift in resource access, the status quo is likely to persist. Thus, I weight the base rate and status quo heavily, with a moderate allowance for unobserved positive developments given the time elapsed since the last public data. My probability reflects a modest chance that SILG has quietly expanded, but a greater likelihood that they remain at or below 2 FTE.",
            "final_probability": 28
        },
        "Nonprofit Management (Stages of Nonprofit Growth)": {
            "time_to_resolution": "Approximately 2.5 months (until December 31, 2025)",
            "perspective_relevance": "As an expert in Nonprofit Management, particularly with knowledge of the stages of nonprofit growth, I am positioned to assess the likelihood that a relatively young, longtermist policy nonprofit like the Simon Institute for Longterm Governance (SI) will surpass a threshold of more than two full-time employees in 2025. My expertise enables me to analyze organizational lifecycle stages, patterns of staff growth, funding stability, and typical hurdles for early-stage nonprofits.",
            "status_quo": "The organization has between one and two full-time employees, as is typical for small, recently established nonprofits focused on longtermist policy. If nothing changes, it is most likely to remain at this level through 2025.",
            "perspective_derived_factors": [
                {
                    "factor": "Stage of Nonprofit Growth",
                    "effect": "Early-stage nonprofits (especially those with a specialized, intellectual focus) tend to grow staff slowly; they often remain at 1-2 FTE for several years. This decreases the probability of exceeding two FTEs unless a major growth event occurs."
                },
                {
                    "factor": "Funding Environment and Revenue Model",
                    "effect": "Longtermist organizations are typically grant-funded, often from a small pool of effective altruism or philanthropic sources. Unless a major grant is secured or the funding landscape improves dramatically, staff expansion is constrained. This decreases the probability."
                },
                {
                    "factor": "Mission Focus and Niche",
                    "effect": "SI's focus on bridging theory and practice in longtermist policy is intellectually ambitious but not directly revenue-generating. Such organizations often rely on project-based temporary staff or contractors, rather than scaling up FTEs. This decreases the probability."
                },
                {
                    "factor": "Evidence of Activity and Momentum",
                    "effect": "There is no clear evidence in the news or public reports of a major expansion, high-profile new projects, or significant new funding in 2025. In the absence of such indicators, the base rate of FTE growth in similar organizations suggests stasis. This decreases the probability."
                },
                {
                    "factor": "Abandonment Risk",
                    "effect": "The question will resolve negatively if the project is abandoned, but there is no evidence of abandonment. However, if the org is dormant or semi-active with minimal staff, the outcome remains 'No.' This effect is neutral to slightly negative."
                },
                {
                    "factor": "Base Rate of Comparable Orgs",
                    "effect": "Among recently launched, EA-aligned policy orgs, the base rate for surpassing two FTEs within 3-4 years is below 50% unless a strong growth event occurs. This base rate decreases the probability."
                }
            ],
            "no_scenario": "The Simon Institute continues to operate at a modest scale, with 1-2 full-time staff (perhaps an Executive Director and a Program Officer or similar), relying on part-time contractors, volunteers, or fellows for project work. No major new grants are awarded in 2025, and the organization maintains steady but limited activities, consistent with the base rate for small think tanks in the longtermist space.",
            "yes_scenario": "The Simon Institute secures a significant new grant or enters into a major partnership that requires scaling up operations. As a result, the organization hires at least two additional full-time staff by the end of 2025, bringing the total to more than two FTEs. This could result from a strategic pivot, a surge in demand for their expertise, or participation in a large research consortium.",
            "final_reasoning": "Given the time elapsed since the organization's founding, the lack of public evidence for rapid expansion or major new funding, and the typical slow staff growth trajectory for early-stage, grant-funded policy nonprofits, the base rate for surpassing two FTEs by the end of 2025 is low. While it is not impossible—especially if a surprise grant or opportunity has arisen—there are no clear signals to suggest that this has happened. The status quo strongly favors stasis or very gradual growth. Therefore, the probability that the Simon Institute for Longterm Governance will have more than two full-time employees in 2025 is below even odds, but not vanishingly small given the possibility of late-year hiring or an unpublicized grant.",
            "final_probability": 22
        },
        "Nonprofit Management (Nonprofit Capacity Building Models)": {
            "time_to_resolution": "Approximately 2.5 months (until December 31, 2025)",
            "perspective_relevance": "As an expert in Nonprofit Management and Capacity Building, my perspective is uniquely relevant because the question hinges on organizational growth and sustainability factors—particularly the ability of a young, mission-driven nonprofit like the Simon Institute for Longterm Governance (SI) to expand its paid staffing. My expertise allows me to assess the likelihood of SI surpassing two full-time employees in light of sector norms, funding environments, and typical non-profit capacity trajectories.",
            "status_quo": "As of the last widely available data (2024), SI operated with a very small team, likely 1-2 FTEs, often relying on part-time staff, contractors, or volunteers. If nothing substantive changes—no new major grant, no rapid scaling of projects, and no organizational crisis—SI would likely remain at or below two full-time employees by the end of 2025.",
            "perspective_derived_factors": [
                {
                    "factor": "Nonprofit sector base rates for early-stage organizations",
                    "effect": "Decreases probability. Most new nonprofits remain small for several years, rarely exceeding 2-3 FTEs unless they receive significant new funding or experience a major uptick in demand for services. The default trajectory is slow, incremental growth."
                },
                {
                    "factor": "Effective Altruism (EA) and Longtermism funding environment",
                    "effect": "Slightly increases probability. SI is embedded in the EA/Longtermism ecosystem, which has seen substantial grantmaking from Open Philanthropy and others. However, since 2023, funding has become more competitive and cautious, with a higher bar for new grants and organizational expansion. Still, this ecosystem is more likely than average to support rapid growth if SI demonstrates traction."
                },
                {
                    "factor": "Project portfolio and demonstrated impact",
                    "effect": "Neutral to slightly increases probability. If SI has successfully executed projects, published influential outputs, or attracted policy attention, it could justify staff expansion. However, there is no public evidence in the news summaries provided that SI has had a major breakthrough or impact event in 2025."
                },
                {
                    "factor": "Organizational abandonment or retrenchment risk",
                    "effect": "Decreases probability. The resolution criteria specify that if the project is abandoned, the answer will be NO. There is no evidence of abandonment, but if SI faced a major setback or loss of key personnel/funders, the likelihood of staff increase would drop."
                },
                {
                    "factor": "General labor market and macroeconomic trends",
                    "effect": "Slightly decreases probability. The nonprofit labor market in 2025, according to news articles, is showing signs of cooling, with declines in job postings and increased caution in hiring. This environment makes small nonprofits even more hesitant to expand."
                },
                {
                    "factor": "Public reporting and transparency norms",
                    "effect": "Neutral to slightly increases probability. SI operates in a community with strong reporting norms (EA Forum, Metaculus, etc.), so if they had expanded their team beyond two FTEs, it would likely be public knowledge by now. The absence of such reports suggests stability rather than growth."
                }
            ],
            "no_scenario": "SI continues operating as a small, lean nonprofit with 1-2 full-time staff (perhaps supplemented by part-timers, fellows, or contractors), but does not secure new multi-year funding or experience a major project expansion. Alternatively, the organization faces headwinds (funding loss, leadership departure) and maintains or reduces staff, or even becomes inactive/abandoned.",
            "yes_scenario": "SI secures a significant new grant (e.g., from Open Phil, FTX Foundation, etc.) or launches a major new project that requires additional operational or research capacity, prompting the hiring of at least one additional FTE, bringing the total to 3+ FTEs by end-2025.",
            "final_reasoning": "The base rate for early-stage nonprofits, especially in policy/advocacy, is to remain at or below two FTEs for years, absent a major inflection point. While SI operates in a relatively well-resourced segment of the nonprofit sector, this advantage is tempered by a recent shift toward more conservative grantmaking. There is no public evidence (from news, forums, or sector reporting) of SI securing major new funding or launching projects that would require rapid staff expansion in 2025. The general nonprofit hiring climate in 2025 is subdued. Given these factors—the strong pull of the status quo, the lack of expansion signals, and the sector base rates—I assess the probability that SI has more than two full-time employees by the end of 2025 as low but not negligible, since small, well-connected organizations can sometimes surprise. My estimate is 20%.",
            "final_probability": 20
        },
        "European Studies (European Nonprofit Regulatory Landscape)": {
            "time_to_resolution": "Approximately 2.5 months (until end of 2025).",
            "perspective_relevance": "As an expert in European Studies with a focus on the European nonprofit regulatory landscape, I am well-positioned to assess the operational realities, funding environment, and employment trends for small, policy-oriented nonprofits in Europe. I understand the compliance burdens, reporting standards, and typical growth trajectories of organizations like the Simon Institute for Longterm Governance. My expertise enables me to contextualize the Institute's likely headcount developments within broader sectoral, legal, and funding trends in Switzerland and the European nonprofit sector.",
            "status_quo": "The Institute had 2 or fewer full-time employees in previous years. Barring significant growth, most small European think tanks and advocacy nonprofits remain at or below 2 full-time employees due to tight funding, reliance on part-time or project-based staff, and lean operational models.",
            "perspective_derived_factors": [
                {
                    "factor": "European nonprofit funding environment",
                    "effect": "Slightly decreases probability. The funding landscape for small policy nonprofits is challenging, with significant competition for grants and slow growth in unrestricted operational funding, making sustainable scaling to >2 FTEs difficult."
                },
                {
                    "factor": "Swiss regulatory context",
                    "effect": "Neutral to slightly positive. Switzerland is relatively nonprofit-friendly, but requires transparent reporting. No recent regulatory shocks that would force rapid downsizing or closure."
                },
                {
                    "factor": "Recent organizational activity and visibility",
                    "effect": "Neutral. No news in the provided articles suggests a major expansion, new grant, or high-profile project for the Simon Institute in 2025."
                },
                {
                    "factor": "Longtermist/EA funding trends",
                    "effect": "Slightly increases probability. The effective altruism (EA) and longtermism space has seen continued, if slowing, support for governance/policy orgs, but less exuberant grantmaking than in 2021-2022. Some orgs have grown; most remain lean."
                },
                {
                    "factor": "Base rates for similar European nonprofits",
                    "effect": "Decreases probability. Most small European think tanks and advocacy nonprofits remain under 3 full-time staff for years, especially if not in a scaling phase or with major new funding."
                },
                {
                    "factor": "Project abandonment risk",
                    "effect": "Very low. No indications of organizational collapse or abandonment, so resolution will likely depend on actual employment numbers."
                }
            ],
            "no_scenario": "The Simon Institute continues to operate with a core team of 2 or fewer full-time employees, supplementing capacity with part-time staff, contractors, or volunteers, in line with their historical staffing model and common practice in the sector. No major new grants or programs necessitate additional permanent hires in 2025, and the organization remains active but lean.",
            "yes_scenario": "The Institute secures a significant new grant or expands its project portfolio, prompting the hiring of at least one additional full-time staff member. Alternatively, part-time staff are consolidated into >2 FTEs due to organizational restructuring or increased operational demands, resulting in more than two full-time equivalents by the end of 2025.",
            "final_reasoning": "The lack of any recent news about the Simon Institute's major expansion, coupled with the base rate for small European policy nonprofits and the typically slow pace of headcount growth in this sector, suggests the most likely outcome is that the Institute will have 2 or fewer full-time employees at the end of 2025. The EA/longtermist funding environment is stable but not rapidly expanding, and while Swiss law is not a barrier to growth, there is also no regulatory push for expansion. Unless there is hidden information about a recent grant or organizational pivot, the status quo is favored. Given all evidence and base rates, a modest probability is warranted for >2 FTEs, but not an extreme one.",
            "final_probability": 28
        }
    },
    "deliberation_probability": [
        18,
        27,
        13,
        25,
        30,
        28,
        22,
        20,
        28
    ],
    "deliberation_mean_probability": 23.444444444444443,
    "deliberation_sd": 5.614960175974339,
    "deliberation_probability_result": 23,
    "group_results": {
        "nonprofitOperationsHumanResourcesMetricsNonprofitSector": {
            "forecaster_to_engage": "Organizational Studies (Organizational Life Cycle Theory)",
            "response_type": "defense",
            "response": "The Organizational Studies (Organizational Life Cycle Theory) forecast is particularly strong in its application of well-established theory to the specific context of the Simon Institute. The reasoning accurately highlights that, for think tanks and advocacy nonprofits, moving past the initial 'founder-driven' or 'start-up' phase into a more mature, multi-staff organization is not just a function of time, but usually requires an unmistakable trigger such as a major grant, project, or institutional shift. The forecaster astutely notes the absence of public indicators of such a transition—no major funding news, project launches, or visible staff expansion—which is critical in this sector where transparency around growth is the norm. Furthermore, the point that think tanks often remain intentionally lean to maintain flexibility is well-supported by sectoral HR data. Their probability (30%) is perhaps slightly higher than the strict base rate, reflecting a reasonable allowance for unobserved developments. Overall, this forecast's strength lies in its clear linkage between theoretical expectations and the available evidence, making its cautious but not dismissive probability well-justified."
        },
        "nonprofitOperationsFundingDiversificationPractices": {
            "forecaster_to_engage": "Organizational Studies (Organizational Life Cycle Theory)",
            "response_type": "defense",
            "response": "The Organizational Life Cycle Theory forecaster does an exemplary job of grounding their probability in both sector-specific base rates and the theoretical expectations for organizational growth. Their articulation of why most early-stage, grant-dependent think tanks remain small—absent a public, catalytic event—is highly relevant to the Simon Institute's context. They correctly point out that, in this sector, major staff expansion is typically signaled by public announcements or funding news, which are currently lacking. Their reasoning supports the view that, barring hidden developments, the default is stasis, and their moderate probability (30%) prudently leaves room for low-probability surprises. This approach is robust, as it integrates both theory and empirical nonprofit sector realities, making it a compelling and defensible forecast."
        },
        "strategicManagementScenarioPlanning": {
            "forecaster_to_engage": "Strategic Management (Balanced Scorecard)",
            "response_type": "critique",
            "response": "While the Balanced Scorecard approach correctly emphasizes the multidimensional health of the organization, the forecast could be improved by more sharply distinguishing between the presence of multidimensional organizational health and the actual triggers required for staff headcount growth in the nonprofit longtermist think tank context. The forecast acknowledges the challenging external environment and the lack of new funding or expansion activity, but its probability (25%) may be somewhat high given the absence of both public hiring signals and strong financial or operational drivers typical for headcount increases. In scenario planning, we would give status quo persistence even greater weight absent evidence of an inflection point, especially this late in the year. A more granular integration of base rates—specifically, the low historical frequency of small EA/longtermist think tanks surpassing two FTEs within a similar time frame—would suggest a more conservative probability. Thus, while the forecast is thoughtful, it may underweight status quo inertia and overstate the likelihood of unobserved late-year expansion."
        },
        "strategicManagementBalancedScorecard": {
            "forecaster_to_engage": "Nonprofit Management (Nonprofit Capacity Building Models)",
            "response_type": "defense",
            "response": "This forecast is notably strong in integrating both sectoral base rates and the specific, current climate for early-stage nonprofit capacity building. The forecaster correctly notes that, even in relatively well-resourced segments like effective altruism, grantmaking has become more conservative and major inflection points are rare without public evidence. The emphasis on the 'strong pull of the status quo' and the lack of expansion signals aligns well with the Balanced Scorecard perspective's stakeholder and resource dimensions—if those dimensions are not trending positively, staff growth is unlikely. The probability (20%) reflects a rational, base-rate-driven skepticism while acknowledging the possibility of last-minute surprises, which is appropriate given the available evidence. This approach is well-calibrated and defensible."
        },
        "organizationalStudiesOrganizationalLifeCycleTheory": {
            "forecaster_to_engage": "Organizational Studies (Resource Dependence Theory)",
            "response_type": "defense",
            "response": "The Resource Dependence Theory (RDT) forecaster offers a robust analysis grounded in both theory and sector-specific realities. Their reasoning correctly highlights that, for small think tanks operating in the longtermist/EA space, staff expansion beyond two FTEs is fundamentally constrained by access to new resources—typically major grants or partnerships. The recognition that there is no public evidence of such a breakthrough for SI-LG is a key strength, as is the explicit weighting of the status quo and sectoral base rates. RDT's focus on resource inflection points complements life cycle theory by underscoring the necessity of external validation for organizational growth, and their moderate probability (28%) reflects a careful balance between the possibility of hidden developments and the overriding likelihood of stasis. This makes for a well-reasoned and empirically grounded forecast."
        },
        "organizationalStudiesResourceDependenceTheory": {
            "forecaster_to_engage": "European Studies (European Nonprofit Regulatory Landscape)",
            "response_type": "defense",
            "response": "The European Studies forecaster brings valuable regional context, emphasizing that Swiss and broader European regulatory environments neither create barriers nor strong incentives for a small nonprofit to expand staff rapidly. This aligns with Resource Dependence Theory's assertion that resource flows and legitimacy are more decisive than regulatory nudges in driving organizational growth. The forecast's recognition that the absence of recent public news, funding, or expansion announcements is a strong indicator of stasis is well-justified, especially given the typically transparent nature of growth events in the European nonprofit sector. Their probability (28%) is well-calibrated—leaving room for unobserved late-year changes but appropriately reflecting the prevailing base rate of small, stable staff counts. This nuanced approach accurately captures both the regional and sectoral realities affecting SILG."
        },
        "nonprofitManagementStagesOfNonprofitGrowth": {
            "forecaster_to_engage": "Nonprofit Operations (Funding Diversification Practices)",
            "response_type": "defense",
            "response": "This forecast is especially strong in highlighting a critical contextual factor: the contraction in the funding environment for longtermist organizations following events like the FTX collapse. The forecaster correctly notes that, absent clear evidence of new funding or expanded mission, the base rate overwhelmingly favors stasis at or below two FTEs. Their assessment that most nonprofit growth is incremental and that the absence of public signals is telling aligns well with the stages-of-growth framework from nonprofit management. Additionally, the nuanced allowance for a low but nonzero chance of late-year surprises is prudent, given the sometimes volatile nature of philanthropic grantmaking. The probability (27%) is well-calibrated, balancing sectoral headwinds with a rational allowance for unobserved developments, making this a robust and defensible forecast."
        },
        "nonprofitManagementNonprofitCapacityBuildingModels": {
            "forecaster_to_engage": "Nonprofit Operations (Human Resources Metrics Nonprofit Sector)",
            "response_type": "defense",
            "response": "This forecast stands out for its direct application of nonprofit HR base rates and its focus on the empirical realities of staffing among small, policy-oriented nonprofits. By foregrounding the lack of recent expansion evidence and the tightening labor market, the forecaster demonstrates a keen awareness of both sectoral inertia and the specific headwinds facing small organizations like the Simon Institute. Their reasoning appropriately weights the tendency toward incrementalism in nonprofit hiring and the barriers to rapid FTE growth absent a catalytic event. The probability (18%) is slightly more conservative than some peers, which is justified given the short time to resolution and the absence of any public signal of imminent growth. Overall, the argument is well-calibrated, grounded in both data and sectoral norms, and clearly articulated."
        },
        "europeanStudiesEuropeanNonprofitRegulatoryLandscape": {
            "forecaster_to_engage": "Nonprofit Operations (Funding Diversification Practices)",
            "response_type": "defense",
            "response": "This forecast does an excellent job integrating both the macro-level funding climate and the specific dynamics of the longtermist nonprofit sector. The forecaster's emphasis on the contraction in available funding post-FTX and the high base rate of small nonprofits remaining at or under 2 FTEs is well-placed and aligns with European sectoral trends. By acknowledging the possibility of a late-year grant or partnership but downgrading its likelihood in the absence of public evidence, the forecast strikes a realistic balance between sector volatility and the strong pull of the status quo. Their probability (27%) is thus well supported by both historical data and the current funding environment, making this a compelling and nuanced forecast."
        }
    },
    "revision_results": {
        "Nonprofit Operations (Human Resources Metrics Nonprofit Sector)": {
            "my_phase1_final_probability": 18,
            "reasoning_for_revised_probability": "After reviewing the other forecasters' arguments, especially those drawing on Organizational Life Cycle Theory and Resource Dependence Theory, my initial assessment is reinforced. There is a strong consensus that the base rate for an early-stage, specialized nonprofit like the Simon Institute to grow beyond two FTEs is low absent visible expansion triggers. The probabilities submitted by others cluster closely around my original estimate, with most in the 13–30% range, and their justifications further support the weight given to the status quo and the lack of recent expansion signals. No compelling evidence or argument emerged from group deliberation to justify a substantial upward revision. However, to reflect the slight allowance given by several other experts for unobservable late-year developments, I will nudge my probability up modestly.",
            "revised_probability": 20
        },
        "Nonprofit Operations (Funding Diversification Practices)": {
            "my_phase1_final_probability": 27,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, particularly the strong theoretical and empirical support for a low probability of SI exceeding 2 FTEs, I see further validation for my initial assessment. The defense of the Organizational Life Cycle Theory perspective reinforced the sector's tendency to remain lean in the absence of public signals of growth, and the absence of any evidence of expansion remains decisive. Multiple forecasters independently highlighted the lack of recent funding or hiring news as a key indicator, and the base rate for organizations of SI's type and age supports a cautious, below-even-odds estimate. However, the small upward flexibility in estimates by some (e.g., 30%) reflects a prudent allowance for unobservable late-year developments. While my initial estimate (27%) is well-justified and sits comfortably within the cluster of expert consensus, I see no compelling reason to shift it meaningfully. I will make a minor upward adjustment to 28% to reflect the slight consensus tilt toward the upper end of the 20-30% range, but the core reasoning remains unchanged.",
            "revised_probability": 28
        },
        "Strategic Management (Scenario Planning)": {
            "my_phase1_final_probability": 13,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, there is strong convergence among forecasters from various disciplinary perspectives—organizational theory, nonprofit management, and strategic management—on the low likelihood that the Simon Institute has expanded to more than two full-time employees in 2025. The most compelling defenses of the 30% probability (Organizational Life Cycle Theory) emphasize the theoretical requirement for a clear, publicly observable inflection point (e.g., new funding, major project), which remains absent. Critiques of higher probabilities rightly note that even moderately positive surprises are rare at this late stage in the year without public signals. The Balanced Scorecard critique further supports the idea that, this close to year-end, inertia and base rates should be weighted even more heavily. Thus, while the range of 13-30% is defensible, the lower end is better justified by the lack of evidence for growth, strong base rates for stasis, and the sector's tendency toward public transparency around expansion. No new information warrants raising the probability; if anything, consensus and argumentation support its maintenance or even a slight decrease.",
            "revised_probability": 13
        },
        "Strategic Management (Balanced Scorecard)": {
            "my_phase1_final_probability": 25,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, especially the widespread agreement among forecasters from diverse but relevant backgrounds (organizational theory, nonprofit HR, resource dependence, and capacity building) on the strength of the base rate and the lack of public signals for growth, I am inclined to lower my probability slightly. Multiple forecasters independently stress the low likelihood of staff expansion without a public trigger, and the critiques highlight that even a 25% estimate may be optimistic this late in the year. The consensus is that status quo inertia is very strong, and the lack of evidence for a catalytic event (major funding, project, or announcement) makes >2 FTEs increasingly unlikely. While there remains some nonzero chance of a late surprise, the balance of evidence supports a more conservative probability. I therefore revise my probability downward to 20%.",
            "revised_probability": 20
        },
        "Organizational Studies (Organizational Life Cycle Theory)": {
            "my_phase1_final_probability": 30,
            "reasoning_for_revised_probability": "Upon reviewing the group deliberation, I note a strong consensus among forecasters with relevant nonprofit sector and organizational theory expertise: all forecasts cluster between 13% and 30%, with most in the 18–28% range. The arguments consistently emphasize the low base rate for small, grant-dependent think tanks to exceed two FTEs within their first 4–5 years, the lack of public signals of major funding or project expansion, and the sectoral trend toward conservative hiring. No compelling counter-evidence or scenario for unobserved late-year expansion has emerged. If anything, the consensus and sectoral base rate arguments suggest my initial 30% probability may be somewhat high, as more weight should be given to status quo inertia and the absence of positive signals, especially this late in the year. Based on this, I am revising my probability downward to more closely reflect the sectoral base rates and group consensus.",
            "revised_probability": 22
        },
        "Organizational Studies (Resource Dependence Theory)": {
            "my_phase1_final_probability": 28,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, I find that the consensus across diverse expert perspectives is strongly aligned: all forecasts emphasize the high status quo persistence and point to a lack of public signals for staff expansion at SI-LG. The base rates cited by forecasters specializing in nonprofit management, strategic management, and regional studies all reinforce the RDT perspective I originally advanced, and their probabilities are tightly clustered in the 13–30% range, with a modal value near 20–28%. No new arguments or evidence were introduced to suggest a higher likelihood of late-year expansion, and several critiques suggest that even my original probability may be slightly high given the strictness of the resolution criteria and the timing. However, given the possibility of unobserved but plausible late-year developments, I will make only a minor downward adjustment to reflect the strong group consensus toward the lower end of the range.",
            "revised_probability": 24
        },
        "Nonprofit Management (Stages of Nonprofit Growth)": {
            "my_phase1_final_probability": 22,
            "reasoning_for_revised_probability": "After reviewing the group deliberation, my core reasoning is reinforced: all forecasters draw heavily on empirical base rates for small, grant-dependent nonprofits, and there is broad agreement that the absence of public signals of growth (funding, hiring, major projects) is strongly predictive of staffing stasis. Several perspectives—especially those focused on funding diversification, nonprofit HR metrics, and organizational life cycle—reinforce that the default outcome is <=2 FTEs, with only a modest chance of unobserved, late-year expansion. The range of probabilities across experts is narrow (13–30%), centering in the low 20s. The discussion about the funding contraction post-FTX and the cautious nature of current grantmaking further validates my original stance. No compelling argument or evidence emerged to suggest a higher risk of last-minute headcount growth. Thus, I see no reason to adjust my probability.",
            "revised_probability": 22
        },
        "Nonprofit Management (Nonprofit Capacity Building Models)": {
            "my_phase1_final_probability": 20,
            "reasoning_for_revised_probability": "Group deliberation confirmed strong consensus among diverse expert perspectives that the status quo is heavily favored, with nearly all forecasts clustering between 13% and 30% and most between 18% and 28%. The most compelling arguments highlighted the lack of public evidence for expansion, the challenging funding and labor environment, and the high visibility that would likely accompany any staff growth of this magnitude in the sector. No new information or line of reasoning emerged to suggest a higher likelihood than my initial estimate. If anything, the slight tendency of some forecasters to be even more conservative (sub-20%) provides weak justification for a minor downward adjustment, but as my estimate was already at the prudent end of the consensus, I see no need to revise downward. The risk of a late-year surprise remains non-trivial but is well-accounted for in the original forecast.",
            "revised_probability": 20
        },
        "European Studies (European Nonprofit Regulatory Landscape)": {
            "my_phase1_final_probability": 28,
            "reasoning_for_revised_probability": "The group deliberation reinforced my initial assessment, as nearly all forecasters converged around a low probability (13–30%) that SI-LG will surpass two FTEs by the end of 2025. Multiple perspectives, including human resources, funding diversification, and organizational life cycle theory, emphasize the strong sectoral and organizational inertia, the absence of public signals of growth, and the challenging funding climate for longtermist/EA nonprofits. No compelling argument or new evidence emerged to justify raising the probability; if anything, the consistent base-rate emphasis and the short time remaining until resolution suggest that probabilities above 30% may reflect over-generosity in allowing for unobserved changes. My initial probability (28%) is well-aligned with the modal group view, and while arguments could justify shifting slightly lower, the possibility of unpublicized late-year hiring means a modest probability remains appropriate. Therefore, I will maintain my original probability.",
            "revised_probability": 28
        }
    },
    "revision_probability": [
        20,
        28,
        13,
        20,
        22,
        24,
        22,
        20,
        28
    ],
    "revision_mean_probability": 21.88888888888889,
    "revision_sd": 4.594682917363407,
    "revision_probability_result": 22,
    "question_details": {
        "id": 38775,
        "title": "Will the Simon Institute for Longterm Governance have more than two full-time employees in 2025?",
        "created_at": "2025-08-31T05:07:46.773468Z",
        "open_time": "2025-10-05T04:45:14Z",
        "cp_reveal_time": "2025-10-05T06:15:14Z",
        "spot_scoring_time": "2025-10-05T06:15:14Z",
        "scheduled_resolve_time": "2025-12-30T23:00:00Z",
        "actual_resolve_time": null,
        "resolution_set_time": null,
        "scheduled_close_time": "2025-10-05T06:15:14Z",
        "actual_close_time": "2025-10-05T06:15:14Z",
        "type": "binary",
        "options": null,
        "group_variable": "",
        "status": "open",
        "possibilities": null,
        "resolution": null,
        "include_bots_in_aggregates": true,
        "question_weight": 1.0,
        "default_score_type": "spot_peer",
        "default_aggregation_method": "unweighted",
        "label": "",
        "unit": "",
        "open_upper_bound": false,
        "open_lower_bound": false,
        "inbound_outcome_count": null,
        "scaling": {
            "range_min": null,
            "range_max": null,
            "nominal_min": null,
            "nominal_max": null,
            "zero_point": null,
            "open_upper_bound": false,
            "open_lower_bound": false,
            "inbound_outcome_count": null,
            "continuous_range": null
        },
        "group_rank": null,
        "description": "This question is synced with an identical question on Metaculus. The original question opened on 2021-05-11 07:00:00 and can be found [here](https://www.metaculus.com/questions/7099). This question will resolve to the same value as the synced question. The original question's background info at this time is below. \n\nThe [Simon Institute for Longterm Governance](https://www.simoninstitute.ch/) is a [recently launched](https://forum.effectivealtruism.org/posts/eKn7TDxMSSsoHhcap/introducing-the-simon-institute-for-longterm-governance-si) institution with the hope of bridging the gap between theory and practice in longtermist policy-making.\n\n`{\"format\":\"metac_closes_in_period\",\"info\":{\"post_id\":7099,\"question_id\":7099}}`",
        "resolution_criteria": "For the purposes of this question, a full-time equivalent is defined as working 35 hours per week, without including volunteers. Question will be resolved negatively if the project has clearly been abandoned, otherwise, reports by the organization together with best estimates by Metaculus moderators will be used",
        "fine_print": "",
        "post_id": 39398,
        "aggregations": {
            "recency_weighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "unweighted": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "single_aggregation": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            },
            "metaculus_prediction": {
                "history": [],
                "latest": null,
                "score_data": {},
                "movement": null
            }
        },
        "my_forecasts": {
            "history": [],
            "latest": null,
            "score_data": {}
        }
    },
    "news": "Here are the relevant news articles:\n\n**International Cybersecurity Forum Urges Strategies to Close Workforce Gaps and Launches Child Safety Index**\nThe 2025 International Cybersecurity Forum, concluding in Riyadh on October 5, 2025, called for actionable strategies to close the global workforce gap in cybersecurity, emphasizing the empowerment of women and the launch of a 'Child Cyber Safety Index.' Participants stressed the need to fully utilize women's potential to build a resilient cyber environment, increase awareness and knowledge among female students, and develop their skills through specialized mentoring programs. This aligns with the global initiative launched by Saudi Crown Prince Mohammed bin Salman to advance women in cybersecurity, addressing challenges of low participation and growing shortages of female professionals to strengthen global cyber resilience. The final day featured high-level discussions with policymakers and experts from international organizations. Dr. Hanan Al-Ahmadi, Deputy Chair of the Saudi Shura Council, highlighted Saudi Arabia's commitment to supporting women's capabilities in cybersecurity in line with Vision 2030, noting that the nation’s experience offers valuable lessons in global cyber resilience and that the Shura Council plays a key role through its legislative and oversight functions. The forum released a joint report by the International Cybersecurity Forum and Duke University titled 'Bridging the Gaps: Challenges and Barriers to Expanding Women's Workforce in Latin America,' based on field research conducted in 2025 involving female professionals and university students across Latin America. The report found that 64% of respondents perceive women's representation in the field as significantly weak, due to limited early engagement in STEM subjects and lack of guidance. Over 40% of participants expressed low confidence in their technical skills, and more than 53.3% were unaware of cybersecurity career opportunities, underscoring the need for mentorship. Concurrently, the third cohort of the 'Empowering Women in Cyber Leadership' program, launched in February 2025 with the USTTI Institute, brought together female trainees from 39 countries. The 'Child Cyber Safety Index' was also launched in collaboration with the DQ Institute and international partners, serving as a global tool to measure progress in building a safer cyber space for children. The index, based on a comprehensive methodology, assesses multiple dimensions including schools, families, infrastructure, private sector companies, and national policies, aiming to provide actionable insights for decision-makers and promote global cooperation in addressing growing cyber threats to children.\nOriginal language: ar\nPublish date: October 05, 2025 03:10 AM\nSource:[aawsat.com](https://aawsat.com/%D8%A7%D9%84%D8%B9%D8%A7%D9%84%D9%85-%D8%A7%D9%84%D8%B9%D8%B1%D8%A8%D9%8A/%D8%A7%D9%84%D8%AE%D9%84%D9%8A%D8%AC/5193009-%D9%85%D9%86%D8%AA%D8%AF%D9%89-%D8%AF%D9%88%D9%84%D9%8A-%D9%8A%D8%AF%D8%B9%D9%88-%D9%84%D8%A7%D8%B3%D8%AA%D8%B1%D8%A7%D8%AA%D9%8A%D8%AC%D9%8A%D8%A7%D8%AA-%D8%AA%D8%B3%D8%AF-%D9%81%D8%AC%D9%88%D8%A9-%D8%A7%D9%84%D9%88%D8%B8%D8%A7%D8%A6%D9%81-%D9%81%D9%8A-%D8%A7%D9%84%D8%A3%D9%85%D9%86-%D8%A7%D9%84%D8%B3%D9%8A%D8%A8%D8%B1%D8%A7%D9%86%D9%8A)\n\n**Comprender el Estado': A Cycle Strengthening the Link Between Culture and Public Governance in Misiones**\nThe 'Comprender el Estado' (Understanding the State) conversation series, organized by the Instituto de Artes Audiovisuales de Misiones (IAAviM) and the Instituto Misionero de Estudios Superiores (IMES) through the Centro Misionero de Estudios Regionales (CEMER), concluded on October 4, 2025, after five hybrid sessions held between August and September 2025. The initiative aimed to strengthen the cultural and audiovisual sector’s role in public policy-making by providing introductory tools in political science and public management tailored to the provincial context. Participants explored topics including the structure of the state, the policy cycle, data-driven decision-making, and digitalization. According to Mariana Lombardini, IAAviM’s Fomento manager, the series fostered institutional articulation and improved administrative efficiency, enabling cultural institutes to deliver better public services and support modernization and democratization of policies. Silvana González, head of the Provincial Audiovisual Registry, noted the initiative originated from a direct request by the cultural sector during the Audiovisual Public Policies Consultative Forum, emphasizing that understanding state mechanisms enhances territorial influence and leadership in the productive ecosystem. Verónica Jakus, from the Secretaría de Estado de Cultura, praised the blend of theory and practice, facilitated by collaboration between educators and cultural leaders, and highlighted strong online engagement. Veroka Fedeli, a theater producer and IPTI councilor, described the cycle as highly enlightening, providing practical tools for institutional synergy and called for its permanent repetition. The initiative received institutional support from the Secretaría de Estado de Cultura, IPTI, and IPD, with participation from key figures including IAAviM president Sergio Acosta, IPTI president Omar Holz, and IMES rector Mariano Pianovi. The series successfully achieved its goal of bridging the cultural sector with state structures, equipping participants with tools for more efficient management and active participation in public policy construction in Misiones.\nOriginal language: es\nPublish date: October 04, 2025 12:52 PM\nSource:[MisionesOnline](https://misionesonline.net/2025/10/04/comprender-el-estado-2/)\n\n**Doha Forum and partners launch future of International Cooperation Report 2025**\nThe Doha Forum, in partnership with the Stimson Center, the Global Governance Innovation Network, and the Global Institute for Strategic Research at HBKU, launched the Future of International Cooperation Report 2025 (FIC'25) during a UNGA80 side event in New York, co-hosted by the International Peace Institute (IPI). The report, themed 'Justice in Action: Beyond Promises to Progress,' identifies a widening global justice gap driven by inequality, insecurity, exclusion, corruption, and environmental decline, and calls for bold, collective action across governments, international organizations, civil society, and the private sector. It outlines three critical domains—political-judicial, socioeconomic, and environmental—where governance must evolve to safeguard rights, foster inclusive societies, and harness innovation. The report provides practical tools and core principles for reform. HE Mubarak Ajlan al-Kuwari, Executive Director of Doha Forum, emphasized that justice is foundational to sustainable governance and must remain central to global cooperation. Brian Finlay, President and CEO of the Stimson Center, highlighted the report’s role in reimagining equitable institutions. IPI President Zeid Ra’ad al-Hussein affirmed the partnership’s shared commitment to fostering collaboration and trust. A high-level panel discussion titled 'Justice in Action: Beyond Promises to Progress' followed the launch, bringing together policymakers, researchers, and civil society leaders. The findings will inform discussions at Doha Forum 2025, scheduled for 6–7 December in Doha, Qatar, under the same theme.\nOriginal language: en\nPublish date: October 03, 2025 06:59 PM\nSource:[Gulf-Times](https://www.gulf-times.com/article/712019/qatar/doha-forum-and-partners-launch-future-of-international-cooperation-report-2025)\n\n**SA citizens left behind as other countries improve | The Citizen**\nSouth Africa ranked 77th out of 120 countries in the 2025 Chandler Good Government Index (CGGI), a decline from 70th in 2021 and below Rwanda (59th) and Botswana (61st), making it the lowest-ranked country in Africa. The CGGI evaluates governments across seven pillars—leadership, laws and policies, institutions, financial stewardship, marketplace, global reputation, and helping people rise—each weighted equally. South Africa scored particularly poorly in 'Helping People Rise,' ranking 113th out of 120, with the lowest scores in personal safety and employment, and near-bottom rankings in health services and income distribution. Despite this, Dinesh Naidu of the Chandler Institute of Governance notes that South Africa's underlying score improved slightly from 0.453 in 2021 to 0.461 in 2025, and it remains 5th in Africa, behind Mauritius, Botswana, Rwanda, and Morocco. Naidu explains that while absolute performance has not declined, relative standing has weakened because other countries advanced faster. The report emphasizes that strong governance correlates with institutional quality, rule of law, and ethical leadership, and warns that the governance gap is widening: top performers improve consistently, while bottom performers decline. The authors note that 57 countries saw their CGGI scores drop between 2021 and 2025, with only five—UAE, Spain, Vietnam, Mongolia, and China—showing consistent improvement. Africa’s average governance score remains the lowest globally, with improvements in institutional strength but declines in financial stewardship, global reputation, and helping people rise. The report concludes that effective governance is a long-term endeavor, and that capable governments deliver better outcomes for citizens.\nOriginal language: en\nPublish date: October 03, 2025 08:04 AM\nSource:[The Citizen](https://www.citizen.co.za/business/sa-citizens-left-behind-as-other-countries-improve/)\n\n**Administrative Yuan’s Personnel Administration General Headquarters Partners with CTFMI to Strengthen Public Servants’ AI Readiness for Smart Governance**\nThe Administrative Yuan's Personnel Administration General Headquarters (PAGH) partnered with the China Trust Financial Management Institute (CTFMI) to host the 'Public Innovation: Generative AI and Sustainable Development Innovation Application Camp' on September 16, 2025, aiming to enhance public sector employees' understanding of AI applications and strengthen their readiness for intelligent governance. The third annual event, fully coordinated by CTFMI, featured a blend of theoretical and hands-on sessions, incorporating the institution’s expertise in AI applications and financial innovation. Speakers included Minister of the Environmental Protection Administration Peng Chi-ming, Senior Deputy General Manager Jia Jing-guang from China Trust Financial Holdings, and Professor Chen Jin-ji from CTFMI’s Institute of Financial Management. The program included two practical courses: 'AI Domination – Creative Challenge Quest' and 'AI GO! Public Marketing Evolution Practice,' where participants experienced AI tools in content creation, image generation, and video production for policy promotion and administrative efficiency. PAGH Personnel Director Su Jun-rong emphasized the institution’s commitment to cultivating public officials for national governance, highlighting the importance of AI training in digital transformation. CTFMI President Shih Kuang-hsun expressed pride in continuing the collaboration, stating the institute aims to become a key partner in advancing generative AI and sustainable thinking in public governance, helping to nurture more digitally innovative public leaders in Taiwan.\nOriginal language: zh\nPublish date: October 03, 2025 04:38 AM\nSource:[Central News Agency](http://www.cna.com.tw/postwrite/chi/414340)\n\n**International Cybersecurity Forum Urges Strategies to Close Workforce Gaps and Launches Child Safety Index**\nThe 2025 International Cybersecurity Forum, concluding in Riyadh on October 5, 2025, called for actionable strategies to close the global workforce gap in cybersecurity, emphasizing the empowerment of women and the launch of a 'Child Cyber Safety Index.' Participants stressed the need to fully utilize women's potential to build a resilient cyber environment, increase awareness and knowledge among female students, and develop their skills through specialized mentoring programs. This aligns with the global initiative launched by Saudi Crown Prince Mohammed bin Salman to advance women in cybersecurity, addressing challenges of low participation and growing shortages of female professionals to strengthen global cyber resilience. The final day featured high-level discussions with policymakers and experts from international organizations. Dr. Hanan Al-Ahmadi, Deputy Chair of the Saudi Shura Council, highlighted Saudi Arabia's commitment to supporting women's capabilities in cybersecurity in line with Vision 2030, noting that the nation’s experience offers valuable lessons in global cyber resilience and that the Shura Council plays a key role through its legislative and oversight functions. The forum released a joint report by the International Cybersecurity Forum and Duke University titled 'Bridging the Gaps: Challenges and Barriers to Expanding Women's Workforce in Latin America,' based on field research conducted in 2025 involving female professionals and university students across Latin America. The report found that 64% of respondents perceive women's representation in the field as significantly weak, due to limited early engagement in STEM subjects and lack of guidance. Over 40% of participants expressed low confidence in their technical skills, and more than 53.3% were unaware of cybersecurity career opportunities, underscoring the need for mentorship. Concurrently, the third cohort of the 'Empowering Women in Cyber Leadership' program, launched in February 2025 with the USTTI Institute, brought together female trainees from 39 countries. The 'Child Cyber Safety Index' was also launched in collaboration with the DQ Institute and international partners, serving as a global tool to measure progress in building a safer cyber space for children. The index, based on a comprehensive methodology, assesses multiple dimensions including schools, families, infrastructure, private sector companies, and national policies, aiming to provide actionable insights for decision-makers and promote global cooperation in addressing growing cyber threats to children.\nOriginal language: ar\nPublish date: October 05, 2025 03:10 AM\nSource:[aawsat.com](https://aawsat.com/%D8%A7%D9%84%D8%B9%D8%A7%D9%84%D9%85-%D8%A7%D9%84%D8%B9%D8%B1%D8%A8%D9%8A/%D8%A7%D9%84%D8%AE%D9%84%D9%8A%D8%AC/5193009-%D9%85%D9%86%D8%AA%D8%AF%D9%89-%D8%AF%D9%88%D9%84%D9%8A-%D9%8A%D8%AF%D8%B9%D9%88-%D9%84%D8%A7%D8%B3%D8%AA%D8%B1%D8%A7%D8%AA%D9%8A%D8%AC%D9%8A%D8%A7%D8%AA-%D8%AA%D8%B3%D8%AF-%D9%81%D8%AC%D9%88%D8%A9-%D8%A7%D9%84%D9%88%D8%B8%D8%A7%D8%A6%D9%81-%D9%81%D9%8A-%D8%A7%D9%84%D8%A3%D9%85%D9%86-%D8%A7%D9%84%D8%B3%D9%8A%D8%A8%D8%B1%D8%A7%D9%86%D9%8A)\n\n**Doha Institute, SAEA host food security forum on Sudan**\nThe Doha Institute for Graduate Studies, through its School of Economics, Administration, and Public Policy, in collaboration with the Sudanese Agricultural Engineers Association (SAEA) in Qatar, hosted a forum in Doha on October 4, 2025, focused on effective partnerships for achieving food security in Sudan amid ongoing political, economic, and climate crises. The event brought together representatives from the Qatar Fund for Development, Qatar Red Crescent Society, Qatar Charity, Sudan’s Ministry of Agriculture and Forestry, academic experts, and stakeholders in agricultural development. Dr. Abdelwahab El Affendi, President of the Doha Institute, emphasized that agricultural security must not come at the expense of farmers, noting that Sudan—once called the 'breadbasket of the Arab world'—now faces severe food crises due to falling crop prices, inadequate storage and marketing systems, and systemic policy failures. Dr. Ayhab Saad, Dean of the School, highlighted that Sudan’s agricultural sector employs 60% of the workforce but has productivity below 30%, attributing this gap to a lack of specialized economic research, outdated data, and insufficient data collection systems. The forum aimed to establish practical frameworks for collaboration between academic institutions and governmental and charitable organizations to develop sustainable food security solutions. Key topics included the impacts of climate change, internal conflict on agricultural production, declining output, rising poverty and displacement, and the need for integrated policies that combine social, economic, and environmental dimensions. The forum also emphasized the critical role of Qatari and regional institutions in providing financial, technical, and expert support, while advocating for regional and international cooperation to foster knowledge exchange and strategic partnerships to address shared challenges.\nOriginal language: en\nPublish date: October 04, 2025 02:40 PM\nSource:[The Peninsula](http://thepeninsulaqatar.com/article/04/10/2025/doha-institute-saea-host-food-security-forum-on-sudan)\n\n**Qatar Institute Hosts Forum on Food Security in Sudan**\nThe 'Food Security in Sudan' forum launched in Doha on October 4, 2025, organized by the Qatar Institute for Graduate Studies and the Sudanese Agricultural Engineers Association, with participation from Qatari, Sudanese, and regional entities. The forum aims to strengthen partnerships to achieve food security amid political, economic crises, and climate change. Abdul Wahab Al-Afandy, President of the Qatar Institute for Graduate Studies, emphasized the importance of supporting agricultural efforts, highlighting that food crises in Sudan stem more from ineffective government policies than low production, and criticized unfair market and storage practices that harm farmers. He noted that Sudan, once known as the 'basket of the Arab world,' now faces food insecurity due to policy failures, including low harvest prices and inadequate storage and marketing systems. Ayoub Saad, Dean of the College of Economics, Management, and Public Policy, stated that Sudan’s agricultural sector employs about 60% of the workforce but achieves only 30% of its potential, attributing this gap to a lack of specialized economic studies and updated data. He called for investment in agricultural data collection and statistics to enable more effective policy-making. The forum also addresses the impacts of climate change and internal conflicts on agriculture, leading to reduced production, increased poverty, and displacement. It seeks to develop practical frameworks for collaboration between academic and research institutions and governmental and humanitarian organizations to create sustainable solutions. Key discussion topics include formulating effective and sustainable agricultural policies that integrate social and economic dimensions, enhancing local production, protecting natural resources, and leveraging support from Qatari and regional development and humanitarian organizations through expertise, financial, and technical resources. The forum also explores opportunities for regional and international cooperation to build strategic partnerships in addressing shared challenges.\nOriginal language: ar\nPublish date: October 04, 2025 01:48 PM\nSource:[العربي الجديد](https://www.alaraby.co.uk/society/%D9%85%D8%B9%D9%87%D8%AF-%D8%A7%D9%84%D8%AF%D9%88%D8%AD%D8%A9-%D9%84%D9%84%D8%AF%D8%B1%D8%A7%D8%B3%D8%A7%D8%AA-%D8%A7%D9%84%D8%B9%D9%84%D9%8A%D8%A7-%D9%8A%D8%B3%D8%AA%D8%B6%D9%8A%D9%81-%D9%85%D9%86%D8%AA%D8%AF%D9%89-%D8%A7%D9%84%D8%A3%D9%85%D9%86-%D8%A7%D9%84%D8%BA%D8%B0%D8%A7%D8%A6%D9%8A-%D9%81%D9%8A-%D8%A7%D9%84%D8%B3%D9%88%D8%AF%D8%A7%D9%86)\n\n**Comprender el Estado': A Cycle Strengthening the Link Between Culture and Public Governance in Misiones**\nThe 'Comprender el Estado' (Understanding the State) conversation series, organized by the Instituto de Artes Audiovisuales de Misiones (IAAviM) and the Instituto Misionero de Estudios Superiores (IMES) through the Centro Misionero de Estudios Regionales (CEMER), concluded on October 4, 2025, after five hybrid sessions held between August and September 2025. The initiative aimed to strengthen the cultural and audiovisual sector’s role in public policy-making by providing introductory tools in political science and public management tailored to the provincial context. Participants explored topics including the structure of the state, the policy cycle, data-driven decision-making, and digitalization. According to Mariana Lombardini, IAAviM’s Fomento manager, the series fostered institutional articulation and improved administrative efficiency, enabling cultural institutes to deliver better public services and support modernization and democratization of policies. Silvana González, head of the Provincial Audiovisual Registry, noted the initiative originated from a direct request by the cultural sector during the Audiovisual Public Policies Consultative Forum, emphasizing that understanding state mechanisms enhances territorial influence and leadership in the productive ecosystem. Verónica Jakus, from the Secretaría de Estado de Cultura, praised the blend of theory and practice, facilitated by collaboration between educators and cultural leaders, and highlighted strong online engagement. Veroka Fedeli, a theater producer and IPTI councilor, described the cycle as highly enlightening, providing practical tools for institutional synergy and called for its permanent repetition. The initiative received institutional support from the Secretaría de Estado de Cultura, IPTI, and IPD, with participation from key figures including IAAviM president Sergio Acosta, IPTI president Omar Holz, and IMES rector Mariano Pianovi. The series successfully achieved its goal of bridging the cultural sector with state structures, equipping participants with tools for more efficient management and active participation in public policy construction in Misiones.\nOriginal language: es\nPublish date: October 04, 2025 12:52 PM\nSource:[MisionesOnline](https://misionesonline.net/2025/10/04/comprender-el-estado-2/)\n\n**Lankan civil servants conclude special training in India**\nForty senior Sri Lankan civil servants completed a special capacity-building programme at India's National Centre for Good Governance (NCGG) from September 22 to October 3, 2025, under the theme 'Clean Cities, Better Future: Transforming Urban Sri Lanka with Regional Practices.' The programme aligned with Sri Lankan President Anura Kumara Dissanayake's 'Clean Sri Lanka' initiative launched in January 2025 and India's 'Swachhata Hi Seva 2025' campaign under the Swachh Bharat Mission. Participants engaged in expert-led sessions on urban planning, municipal governance, public-private partnerships, solid waste management with a focus on plastic recycling, digital transformation, and urban transport. Field visits were conducted to institutions including the National Institute of Urban Affairs, Mussoorie-Dehradun Development Authority, Integrated Tribal Development Agency, Tehkhand Waste-to-Energy Project, and the Delhi Metro Rail Project, offering firsthand exposure to innovations in municipal governance, urban infrastructure, waste-to-energy solutions, and citizen-focused services. This was the fifth training programme under a Memorandum of Understanding (MoU) signed in December 2024 between NCGG and the Sri Lanka Institute of Development Administration, aimed at training 1,500 Sri Lankan civil servants over five years. With this session, the total number of trained officers reached 201. Based on positive feedback and a request from the Government of Sri Lanka, a sixth programme under the same theme will train another 40 civil servants.\nOriginal language: en\nPublish date: October 04, 2025 09:59 AM\nSource:[Social News XYZ](https://www.socialnews.xyz/2025/10/04/lankan-civil-servants-conclude-special-training-in-india/)\n\n**Doha Forum and partners launch future of International Cooperation Report 2025**\nThe Doha Forum, in partnership with the Stimson Center, the Global Governance Innovation Network, and the Global Institute for Strategic Research at HBKU, launched the Future of International Cooperation Report 2025 (FIC'25) during a UNGA80 side event in New York, co-hosted by the International Peace Institute (IPI). The report, themed 'Justice in Action: Beyond Promises to Progress,' identifies a widening global justice gap driven by inequality, insecurity, exclusion, corruption, and environmental decline, and calls for bold, collective action across governments, international organizations, civil society, and the private sector. It outlines three critical domains—political-judicial, socioeconomic, and environmental—where governance must evolve to safeguard rights, foster inclusive societies, and harness innovation. The report provides practical tools and core principles for reform. HE Mubarak Ajlan al-Kuwari, Executive Director of Doha Forum, emphasized that justice is foundational to sustainable governance and must remain central to global cooperation. Brian Finlay, President and CEO of the Stimson Center, highlighted the report’s role in reimagining equitable institutions. IPI President Zeid Ra’ad al-Hussein affirmed the partnership’s shared commitment to fostering collaboration and trust. A high-level panel discussion titled 'Justice in Action: Beyond Promises to Progress' followed the launch, bringing together policymakers, researchers, and civil society leaders. The findings will inform discussions at Doha Forum 2025, scheduled for 6–7 December in Doha, Qatar, under the same theme.\nOriginal language: en\nPublish date: October 03, 2025 06:59 PM\nSource:[Gulf-Times](https://www.gulf-times.com/article/712019/qatar/doha-forum-and-partners-launch-future-of-international-cooperation-report-2025)\n\n**Experts discuss gaps in Pakistan's AI roadmap**\nExperts at a seminar hosted by the Pakistan Institute of Development Economics (PIDE) emphasized the need to bridge gaps in Pakistan's National Artificial Intelligence Policy to realize its full potential across the economy, governance, and society. The event, titled 'Bridging Gaps in Pakistan's AI Roadmap: Opportunities, Challenges and the Way Forward,' brought together policymakers, academics, entrepreneurs, and industry leaders. Key speakers included Dr. Anil Salman, Chair of the Government of Pakistan's AI Policy Committee, who described the policy as 'bold, ethical and transformative' and projected a 7–12% GDP boost and up to one million jobs by 2030 if fully implemented. Dr. Najibullah, Member Science and Technology at the Planning Commission, highlighted the importance of venture capital and announced the creation of a Rs2 billion Public Venture Capital Fund to address the 'valley of death' in scaling startups, while also calling for engagement with global accelerators. The session was moderated by PIDE Research Economist Wajid Islam.\nOriginal language: en\nPublish date: October 03, 2025 05:11 PM\nSource:[The Express Tribune](https://tribune.com.pk/story/2570484/experts-discuss-gaps-in-pakistans-ai-roadmap)\n\n**Who Needs The BLS: US Added 60,000 Jobs In September, Best Month Of 2025**\nDue to a government shutdown in its third day, the U.S. Bureau of Labor Statistics (BLS) did not release the September 2025 jobs report, leaving markets and the Federal Reserve without critical data. This absence intensified concerns after ADP reported a loss of 32,000 jobs, fueling fears of a labor recession. However, private-sector alternatives provided a more optimistic outlook. The Institute for Supply Management (ISM) reported a modest rebound in manufacturing and service sector jobs, though it does not provide absolute employment numbers. More notably, Revelio Labs' September edition of the Revelio Public Labor Statistics (RPLS) indicated a gain of 60,000 jobs—its best monthly increase of 2025—driven by education, health services, and retail trade, while leisure and hospitality and business services saw declines. Revelio’s regression model estimated the BLS would have reported approximately 38,000 jobs gained, far less negative than ADP’s figure. Chief Economist Lisa Simon stated that while the RPLS gain was slightly above expectations, declines in job postings, salaries, hiring, and attrition signal a slowing labor market. Nevertheless, the data suggests the labor market is not in freefall, supporting the narrative that the Fed is cutting rates into a slowdown, not a recession. RPLS, a freely available dataset built from over 100 million U.S. profiles, offers real-time, scalable labor market insights comparable to BLS data, aiming to close the information gap during official data voids.\nOriginal language: en\nPublish date: October 03, 2025 04:59 PM\nSource:[Zero Hedge](https://www.zerohedge.com/markets/who-needs-bls-us-added-60000-jobs-september-best-month-2025)\n\n**SA citizens left behind as other countries improve | The Citizen**\nSouth Africa ranked 77th out of 120 countries in the 2025 Chandler Good Government Index (CGGI), a decline from 70th in 2021 and below Rwanda (59th) and Botswana (61st), making it the lowest-ranked country in Africa. The CGGI evaluates governments across seven pillars—leadership, laws and policies, institutions, financial stewardship, marketplace, global reputation, and helping people rise—each weighted equally. South Africa scored particularly poorly in 'Helping People Rise,' ranking 113th out of 120, with the lowest scores in personal safety and employment, and near-bottom rankings in health services and income distribution. Despite this, Dinesh Naidu of the Chandler Institute of Governance notes that South Africa's underlying score improved slightly from 0.453 in 2021 to 0.461 in 2025, and it remains 5th in Africa, behind Mauritius, Botswana, Rwanda, and Morocco. Naidu explains that while absolute performance has not declined, relative standing has weakened because other countries advanced faster. The report emphasizes that strong governance correlates with institutional quality, rule of law, and ethical leadership, and warns that the governance gap is widening: top performers improve consistently, while bottom performers decline. The authors note that 57 countries saw their CGGI scores drop between 2021 and 2025, with only five—UAE, Spain, Vietnam, Mongolia, and China—showing consistent improvement. Africa’s average governance score remains the lowest globally, with improvements in institutional strength but declines in financial stewardship, global reputation, and helping people rise. The report concludes that effective governance is a long-term endeavor, and that capable governments deliver better outcomes for citizens.\nOriginal language: en\nPublish date: October 03, 2025 08:04 AM\nSource:[The Citizen](https://www.citizen.co.za/business/sa-citizens-left-behind-as-other-countries-improve/)\n\n**Administrative Yuan’s Personnel Administration General Headquarters Partners with CTFMI to Strengthen Public Servants’ AI Readiness for Smart Governance**\nThe Administrative Yuan's Personnel Administration General Headquarters (PAGH) partnered with the China Trust Financial Management Institute (CTFMI) to host the 'Public Innovation: Generative AI and Sustainable Development Innovation Application Camp' on September 16, 2025, aiming to enhance public sector employees' understanding of AI applications and strengthen their readiness for intelligent governance. The third annual event, fully coordinated by CTFMI, featured a blend of theoretical and hands-on sessions, incorporating the institution’s expertise in AI applications and financial innovation. Speakers included Minister of the Environmental Protection Administration Peng Chi-ming, Senior Deputy General Manager Jia Jing-guang from China Trust Financial Holdings, and Professor Chen Jin-ji from CTFMI’s Institute of Financial Management. The program included two practical courses: 'AI Domination – Creative Challenge Quest' and 'AI GO! Public Marketing Evolution Practice,' where participants experienced AI tools in content creation, image generation, and video production for policy promotion and administrative efficiency. PAGH Personnel Director Su Jun-rong emphasized the institution’s commitment to cultivating public officials for national governance, highlighting the importance of AI training in digital transformation. CTFMI President Shih Kuang-hsun expressed pride in continuing the collaboration, stating the institute aims to become a key partner in advancing generative AI and sustainable thinking in public governance, helping to nurture more digitally innovative public leaders in Taiwan.\nOriginal language: zh\nPublish date: October 03, 2025 04:38 AM\nSource:[Central News Agency](http://www.cna.com.tw/postwrite/chi/414340)\n\n**Employer-Friendly Practices: Bridging Higher Ed Practices and Employer Realities**\nEmployers are increasingly funding postsecondary education to retain and advance staff, yet colleges and employers often clash over differing rhythms, languages, and expectations. The disconnect, described as more than a philosophical divide, stems from operational gaps that leave learners—who juggle work, family, and study—paying the price. One employer noted, 'There is already skepticism among our employees. When we say we'll pay for college and it doesn't go smoothly, they stop believing us.' In 2025, UpSkill America, with Strada Education Foundation support, launched a research initiative to probe the structural, operational, and policy-level barriers that hinder effective employer‑institution partnerships. The study involved in‑depth interviews with over 25 employers—from national brands to regional firms—and four intermediaries representing hundreds of companies, uncovering what employers value and what erodes trust. The authors emphasize that while postsecondary institutions have legitimate safeguards—protecting students, ensuring quality, and preserving academic freedom—operational roadblocks still impede collaboration. This paper is the first in a series; subsequent phases will translate findings into a practical framework, case studies, and tested strategies to help higher‑education leaders meet employer needs without compromising mission, compliance, or integrity.\nOriginal language: en\nPublish date: September 29, 2025 09:00 AM\nSource:[The Aspen Institute](http://www.aspeninstitute.org/publications/employer-friendly-practices-bridging-higher-ed-practices-and-employer-realities/)\n\n**Doha Forum and partners launch Future of International Cooperation Report 2025**\nDoha Forum, together with the Stimson Center, the Global Governance Innovation Network, and the Global Institute for Strategic Research at HBKU, launched the Future of International Cooperation Report 2025 (FIC'25) in New York as a UNGA80 side event. The report, themed ‘Justice in Action: Beyond Promises to Progress,’ highlights a widening global justice gap driven by inequality, insecurity, exclusion, corruption and environmental decline, and calls for bold collective action across governments, international organisations, civil society and the private sector. It identifies three critical domains—political‑judicial, socioeconomic and environmental—where governance must evolve to safeguard rights, foster inclusive societies and harness innovation to overcome entrenched divisions. The report offers practical tools and core principles for reform. Executive Director HE Mubarak Ajlan Al Kuwari said, ‘The 2025 report challenges us to move from commitments to concrete action. Justice—across political, social and environmental domains—is not a peripheral concern but a foundation of sustainable governance.’ Stimson Center President Brian Finlay added, ‘This report offers practical principles to reimagine governance so that institutions serve all people more equitably.’ IPI President Zeid Ra’ad Al Hussein noted, ‘IPI is grateful for its partnership with the Doha Forum on our shared commitment to bringing people together to foster collaboration and trust and to inspire new ideas for how to address the most critical issues of our time.’ The launch included a high‑level panel discussion and will inform Doha Forum 2025 in December, held 6‑7 December in Doha under the same theme.\nOriginal language: en\nPublish date: September 27, 2025 08:08 PM\nSource:[The Peninsula](http://thepeninsulaqatar.com/article/27/09/2025/doha-forum-and-partners-launch-future-of-international-cooperation-report-2025)\n\n**Doha Forum and Partners Launch 'Future of International Cooperation 2025' Report**\nOn September 27, 2025, the Doha Forum, together with the Stevenson Center, the Global Governance Innovation Network and the Hamad Bin Khalifa University Institute for Strategic Studies, released its seventh flagship report, titled 'Future of International Cooperation 2025', at a press conference in New York on the sidelines of the 80th UN General Assembly. The report, subtitled 'Institutionalizing Justice: From Promises to Tangible Reality', highlights the widening global justice gap caused by inequality, insecurity, exclusion, corruption and environmental degradation, and calls for collective action by governments, international organisations, civil society and the private sector. It focuses on three critical domains—political‑judicial, socio‑economic and environmental—and offers practical tools for policymakers and citizens. The launch was accompanied by a high‑level panel discussion titled 'Institutionalizing Justice: From Promises to Tangible Reality', hosted by the Doha Forum, the International Peace Institute and the Stevenson Center. Key speakers included Executive Director Mubarak Ajlan Al‑Kuwari, who said 'The 2025 report urges a shift from commitments to tangible action…justice is not a marginal issue but the foundation of sustainable governance', Stevenson Center CEO Brian Finnley, who said 'The report provides practical principles to re‑imagine governance that serves all people more fairly', and Prince Zaid bin Raed Al‑Hussein of the International Peace Institute, who expressed gratitude for the partnership. The report will also frame discussions at the Doha Forum 2025, scheduled for December 6‑7, 2025, under the same theme. The Doha Forum, a leading global platform, hosted its most recent edition in December 2024 with over 5,000 participants from more than 162 countries and 350 speakers.\nOriginal language: ar\nPublish date: September 27, 2025 07:49 PM\nSource:[جريدة الشرق](https://al-sharq.com/article/27/09/2025/%D9%85%D9%86%D8%AA%D8%AF%D9%89-%D8%A7%D9%84%D8%AF%D9%88%D8%AD%D8%A9-%D9%88%D8%B4%D8%B1%D9%83%D8%A7%D8%A4%D9%87-%D9%8A%D8%B7%D9%84%D9%82%D9%88%D9%86-%D8%AA%D9%82%D8%B1%D9%8A%D8%B1-%D9%85%D8%B3%D8%AA%D9%82%D8%A8%D9%84-%D8%A7%D9%84%D8%AA%D8%B9%D8%A7%D9%88%D9%86-%D8%A7%D9%84%D8%AF%D9%88%D9%84%D9%8A-2025)\n\n**Why Wall Street No Longer Trusts the U.S. Government**\nEl Cronista reports that President Trump has been attacking the U.S. Bureau of Labor Statistics (BLS), citing funding and staff cuts that hamper data collection. Trump fired BLS Commissioner Erika McEntarfer last month and nominated EJ Antoni. Trump intensified the attack after the BLS lowered its wage‑employment estimates for the year to March 2025 by more than 900,000 jobs. White House Press Secretary Karoline Leavitt said the revision highlighted the need for ‘truthful and honest data’ and called the BLS ‘broken’. The Office of the Inspector General of Labor announced an investigation into the BLS’s challenges. Economists such as Derek Tang of LHMeyer, Joe Brusuelas of RSM, Thomas Simons of Jefferies, Adam Michel of the Cato Institute, and Jed Kolko of the Peterson Institute warned that the controversy could increase demand for private‑sector data, widening the gap between those with and without reliable data. Private data providers like ADP, Revelio Labs, and others are gaining prominence, with ADP’s employment report searches tripling recently. However, experts caution that private data’s reliability depends on official benchmarks, and that a total shift away from public statistics is unlikely because legislation ties certain metrics to official data. Omair Sharif of Inflation Insights notes that some metrics, especially inflation measures, cannot be captured by the private sector.\nOriginal language: es\nPublish date: September 12, 2025 08:41 PM\nSource:[El Cronista](https://www.cronista.com/financial-times/por-que-wall-street-ya-no-le-cree-al-gobierno-de-estados-unidos/)\n\n**National Cybersecurity Institute Launches Cybersecurity Weekly Report: \"Seeing Enables Effective Governance\"**\nThe National Cybersecurity Institute (NCIS) held a press conference on September 11 2025 to announce the launch of its Cybersecurity Weekly Report, now in its ninth issue since mid‑July.  Institute Director Lin Ying‑da said the report’s goal is to create a comprehensive cybersecurity governance platform that lets government agencies and critical infrastructure operators \"see the threat landscape and manage it effectively.\"  Lin highlighted that Taiwan experiences roughly 2.4 million network attacks per day, nearly 1 billion annually, yet only about 1,000 incidents are formally reported— a gap of several million times.  He described real‑impact incidents as a \"murder case\" and stressed that \"seeing the process allows interception before the breach is complete.\"  The weekly report aggregates data from incident reports, joint‑defense monitoring, external exposure, and dark‑web intelligence, presenting them on dashboards that trace attack chains from initial intrusion to final impact.  Lin cited a bi‑weekly external exposure analysis showing that public agencies have lower risk than certain key industries, noting that \"long‑term requirements and audits do reduce risk.\"  By year‑end, NCIS plans to release an automated analysis tool to assess compliance and audit gaps, forming a full \"cybersecurity scorecard.\"  Each issue also contains a focus article on recent incidents, attack‑defense drills, and fraud trends.  Lin mentioned a partnership with Meta and LINE that has successfully removed large volumes of scam ads and groups, reducing the visibility of fraud content on social platforms.  He reiterated, \"Seeing enables effective governance; effective governance lets us know whether we are managing well.\"  NCIS Director‑General Cai Fu‑long added that information sharing is the foundation of joint defense, and that the weekly report complements the monthly report to help agencies, industry, and the cybersecurity community quickly grasp threat trends, \"raising public cybersecurity awareness to build a real protective net.\"  Lin concluded that as data accumulates and analysis matures, the weekly report will become the core platform for monitoring national cybersecurity, turning the slogan \"seeing enables effective governance\" into a sustained shift from passive defense to proactive governance.\nOriginal language: zh\nPublish date: September 11, 2025 10:24 PM\nSource:[The Epoch Times](https://www.epochtimes.com/gb/25/9/12/n14592576.htm)\n\n**Experts Question Effectiveness of Government’s Public Institution Management Evaluation Score Adjustment**\nExperts argue that merely increasing the weight of the safety‑management component in the public‑institution management evaluation will not substantially curb major accidents. Kim Cheol, senior research fellow at the Korea Institute for Social Public Research, told Hankyoreh on 26 August that \"공공기관경영평가(이하 경영평가) 개선만으로는 공공기관의 중대재해 감축을 크게 기대하기 어렵다\" and added that even if the safety‑management score is raised, public institutions have little incentive to invest more in safety or staff because other components—financial soundness, operational efficiency—carry higher weight. The Ministry of Economy and Finance announced on 22 August that the safety‑management share in the evaluation, currently 1.5–2 %, would be expanded as part of a major‑accident‑reduction plan. However, experts note that because the efficiency‑management and total personnel‑cost components are weighted more heavily, increasing safety staff could actually lower scores in those areas, reducing the overall incentive. Kim suggested a compliance‑based absolute‑assessment approach, with penalties for non‑compliance, would be more effective, and that a safety‑management governance structure involving on‑site staff and unions is needed. Professor Kang Tae‑seon of Seoul Cyber University and union head Kang Seong‑gyu also called for collaborative development of safety manuals with the private sector and for the Ministry to involve frontline workers in policy design.\nOriginal language: ko\nPublish date: August 26, 2025 12:28 PM\nSource:[한겨레신문](https://www.hani.co.kr/arti/society/labor/1215382.html)\n\n**2025 Global Internet Governance Forum: Paradigm Initiative Drives Grassroots Digital Rights Conversations**\nThe Paradigm Initiative (PIN) will engage with global stakeholders at the 2025 Global Internet Governance Forum (IGF) in Lillestrøm, Norway, to shape policies that uphold a free, open, and inclusive internet. According to Gbenga Sesan, Executive Director of PIN, 'This forum comes at a crucial time when digital governance decisions are shaping the future of billions of individuals.' PIN will participate in strategic sessions, including 'Bridging the Connectivity Gap for Excluded Communities' and 'Protecting the Free Open Internet with Freedom House.' The team will also meet with partners such as Meta, UNESCO, and the Freedom Online Coalition to ensure digital rights are rooted in grassroots realities and global governance is inclusive of marginalised voices. 'At PIN, we believe meaningful digital inclusion requires more than just connectivity; it demands inclusive, progressive, and sustainable policies and frameworks built by considering grassroots stakeholders' realities,' Sesan said.\nOriginal language: en\nPublish date: June 24, 2025 03:27 AM\nSource:[THISDAYLIVE](https://www.thisdaylive.com/2025/06/24/2025-global-internet-governance-forum-paradigm-initiative-drives-grassroots-digital-rights-conversations/)\n\n",
    "date": "2025-10-14T02:14:31.644366",
    "summary": "Across a diverse set of nonprofit, management, strategy, and European regulatory experts, there is a strong consensus that the Simon Institute for Longterm Governance (SI) is unlikely to have more than two full-time employees at the end of 2025. Experts note the historical base rate for small, specialized nonprofits—especially those in the effective altruism/longtermist or European policy space—is to remain lean, typically with 1–2 FTEs for several years unless there is a clear and significant new funding event, grant, or strategic inflection point. Contributing factors include a challenging funding and labor environment post-2022, a lack of recent evidence for major new grants, projects, or hiring spurts, and the strictness of the resolution criteria (excluding volunteers and part-time equivalents). No forecaster found news or reporting of a late-2025 expansion or grant, and the absence of public signals in the EA/longtermist or nonprofit transparency ecosystems further supports this outlook. While late-year surprises or quiet expansions are not impossible, the most likely scenario is continued operation with 1–2 FTEs supplemented by part-time help or contractors. Forecasters' probability estimates for SI surpassing two full-time staff range from 13% to 30%, clustering around 20–28%, with primary uncertainty coming from the chance of an unreported late-year grant or strategic shift. Overall, evidence and sectoral norms point strongly toward a negative resolution.",
    "forecasters": [
        "Nonprofit Operations (Human Resources Metrics Nonprofit Sector)",
        "Nonprofit Operations (Funding Diversification Practices)",
        "Strategic Management (Scenario Planning)",
        "Strategic Management (Balanced Scorecard)",
        "Organizational Studies (Organizational Life Cycle Theory)",
        "Organizational Studies (Resource Dependence Theory)",
        "Nonprofit Management (Stages of Nonprofit Growth)",
        "Nonprofit Management (Nonprofit Capacity Building Models)",
        "European Studies (European Nonprofit Regulatory Landscape)"
    ]
}